{
  "course_name": "Topics in Mathematics with Applications in Finance",
  "course_description": "The purpose of the class is to expose undergraduate and graduate students to the mathematical concepts and techniques used in the financial industry. Mathematics lectures are mixed with lectures illustrating the corresponding application in the financial industry. MIT mathematicians teach the mathematics part while industry professionals give the lectures on applications in finance.",
  "topics": [
    "Business",
    "Finance",
    "Mathematics",
    "Applied Mathematics",
    "Probability and Statistics",
    "Business",
    "Finance",
    "Mathematics",
    "Applied Mathematics",
    "Probability and Statistics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hour / session\n\nPrerequisites\n\n8.01 Single Variable Calculus\n\n18.02 Multivariable Calculus\n\n18.03 Differential Equations\n\n18.05 Introduction to Probability and Statistics\nor\n18.440 Probability and Random Variables\n\n18.06 Linear Algebra\n\nBroad familiarity with linear algebra, statistics, stochastic processes and partial differential equations will be helpful (but not required). Prior knowledge of economics or finance is not required but may be helpful for some lectures.\n\nDescription\n\nThe purpose of the class is to expose undergraduate and graduate students to the mathematical concepts and techniques used in the financial industry. The course will consist of a set of mathematics lectures on topics in Linear Algebra, Probability, Statistics, Stochastic Processes and Numerical Methods. Mathematics lectures will be mixed with lectures illustrating the corresponding application in the financial industry.\n\nMIT mathematicians will teach the mathematics part while industry professionals will give the lectures on applications in finance. We also plan to organize an optional field trip to visit Morgan Stanley offices in New York.\n\nGoals for the Class\n\nBe able to derive price-yield relationship and understand convexity.\n\nBootstrap a yield curve.\n\nCompute standard Value At Risk and understand assumptions behind it.\n\nEstimate volatility of an option.\n\nDerive Black-Scholes equations using risk-neutral arguments.\n\nUnderstand decomposition of matrices in statistics (and probability) point of view, e.g. principle component analysis.\n\nUse statistical techniques and methods in data analysis; understand the advantages and limitations of different methods.\n\nUnderstand basic limiting theorems and assumptions behind them.\n\nUnderstand Ito's lemma and it's applications in financial mathematics.\n\nUnderstand Girsanov's theorem and change of measure.\n\nAssessments\n\nThe class will have problem sets for each math lecture due in two weeks after each math lecture, and a final paper on a math finance topic of student's choice. There will be no exams.\n\nGrading\n\nThe final grade will be 75% based on the homework and 25% on final paper.\n\nAbout the Instructors\n\nDr. Peter Kempthorne is a Lecturer in the MIT Department of Mathematics on financial mathematics and statistics. He is also President of Kempthorne Analytics and formerly was an Associate Professor and Principal Research Scientist at MIT Sloan School of Management with research focus on statistical modeling in finance.\n\nDr. Choongbum Lee is an Instructor in the MIT Department of Mathematics. His interests include Extremal Combinatorics, Ramsey Theory, Random Structures and other related fields.\n\nDr. Vasily Strela is a Research Affiliate in the MIT Department of Mathematics. He is also a Managing Director and the Global Head of Fixed Income Modeling at Morgan Stanley.\n\nDr. Jake Xia is a Research Affiliate in the MIT Department of Mathematics and a Visiting Scholar in the MIT Sloan Business School. He is Managing Director and Chief Risk Officer of Harvard Management Company. Prior to that, he was Managing Director of Morgan Stanley.",
  "files": [
    {
      "category": "Assignment",
      "title": "Problem Set 1: Linear Algebra",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/79abc7077a91900369bbb9823211bba1_MIT18_S096F13_pset1.pdf",
      "content": "18.8096 Problem 8et 1 Fall 2013\nDue date : 9/24/2013\nCollaboration on homework is encouraged, but you should think through the problems yourself\nbefore discussing them with other people. You must write your solution in your own\nwords. Make sure to list all your collaborators.\nPart A\nPart A has problems that straightforwardly follow from the defnition. Use this part as an\nopportunity to get used to the concepts and defnitions.\nProblem A-1. Decide whether the following statements are true or false. No explanation\nneeded.\n(a) The row-rank and column-rank of a matrix is always equal to each other.\n(b) For a m × n matrix A and a n × g matrix B, it is always true that rank(AB) ≤ rank(A).\n(c) There are matrices whose left-inverse and right-inverse are not equal to each other, i.e.,\n∃A, B, C such that BA = I and AC = I.\n(d) A matrix has full-rank if and only if it is invertible.\n(e) All symmetric matrices are invertible.\n(f) A matrix is invertible if all eigenvalues are distinct.\n(g) A matrix is diagonalizable if and only if it is invertible.\nProblem A-2. Compute the row-rank and column-rank of the following matrices.\n⎛\n⎞\n⎛\n⎞\n⎜\n⎟\n⎝\n⎠\n⎜\n⎟\n(a)\n(b) ⎝\n⎠\n1 -1\n0 -2\nProblem A-3. Compute the determinant and inverse of the following matrices.\n\n⎛ -1 -2 3 ⎞\n(a)\n-1\n(b) ⎝ 1\n0 ⎠ .\nProblem A-4. Compute the charactersitc polynomial and fnd the eigenvalues and eigen\nvectors of the following matrix:\n⎛\n⎞\n-3\n⎝\n⎠\n-1 -2\n.\n-1 -3\nProblem A-5. (a) Find an orthonormal basis of the subspace of R5 spanned by v1, v2, and\nv3, where v1 = (1, 0, 1, 0, 1), v2 = (1, 1, 1, 0, 0), and v3 = (0, 0, 1, 1, 1), using Gram-Schmidt\nprocess.\n\n(b) Complete the basis found in (a), into an orthonormal basis of R5 .\n(c) Find the matrix U which transforms the basis found in (b) into the standard basis of R5 .\nProblem A-6. Use the singular-value decomposition to express the following matrices in the\nform A = UΣV T .\n⎛\n⎞\n1 0 1\n(a)\n-1\n(b)\n(c) ⎝ 0 1 0 ⎠\n1 0 1\nPart B\nPart B has more elaborate problems. Many of the problems in Part B cover important topics\nthat we did not have enough time to cover in lecture. Thus understanding the content is as\nimportant as solving the problem. Try to think through the content of the problem while\nsolving it.\nProblem B-1. Decide whether the following statements about a singular value decomposition\nA = UΣV T are true or false. EXPLAIN the reason.\n(a) The number of non-zero diagonal entries of Σ is equal to the rank of A.\n(b) Σ is uniquely determined up to permuting the rows and columns.\n(c) If A is a n × n matrix, then U and V can be chosen so that U = V .\n(d) If A is a symmetric n × n matrix, then U and V can be chosen so that U = V .\nProblem B-2. Prove that the matrices AAT and AT A have the same set of non-zero eigen\nvalues. (Hint: consider the singular value decomposition of A)\nProblem B-3. A matrix A is positive semi-defnite if\nv T Av ≥ 0\nfor all non-zero vectors v. Prove that for all symmetric positive semi-defnite matrices A,\nthere exists an orthonormal matrix U such that\nD = U T AU\nis a diagonal matrix such that all diagonal entries are non-negative.\nProblem B-4. (Linear regression) Suppose that a set of n vectors v1, v2, · · · , vn ∈ Rm and a\nvector w ∈ Rm is given. \\e seek reals x1, x2, · · · , xn that minimizes the following quantity:\nn\nn\nL = ||(\nxivi) - w||.\ni=1\nLet A be an m × n matrix whose i-th column is the vector vi and let x be an n-dimensional\ncolumn vector whose i-th coordinate is xi. Then the above can be re-wrtten as minimizing\nL = ||Axx - w||.\n(a) Show that the problem can be directly solved if A is a diagonal matrix.\n(b) Suppose that the SVD of A is given as A = UΣV T . Then\nAxx - w = UΣV T x - w = UΣV T x - UU T w = U(ΣV T x - U T w).\nUse this equation to explain how the general problem reduces to the special case when A is\na diagonal matrix.\n\n(c) Suppose that we are given n data points (x1, y1), · · · , (xn, yn) in R2 . Our goal is to fnd\na linear equation y = ax + b that 'best fts' the data. Formally, we would like to fnd reals a\nand b that minimizes\nn\nn\n(axi + b - yi)2 .\ni=1\nExplain how this problem is a special case of the problem given above.\n(d) Extend (c) to describe the problem of fnding a quadratic equation y = ax + bx + c that\n'best fts' the data points (x1, y1), . . . , (xn, yn) ∈ R2 as a special case of the problem given\nabove.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Mathematical Applications in Financial Industry\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 2: Probability Theory and Stochastic Process",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/86e64fb3acfdb8aab38af462aaac1ece_MIT18_S096F13_pset2.pdf",
      "content": "18.S096 Problem Set 2 Fall 2013\nDue date : 10/3/2013\nCollaboration on homework is encouraged, but you should think through the problems yourself\nbefore discussing them with other people. You must write your solution in your own\nwords. Make sure to list all your collaborators.\nPart A\nPart A has problems that straightforwardly follow from the denition. Use this part as an\nopportunity to get used to the concepts and denitions.\nProblem A-1. (Exponential distribution) A continuous random variable X is said to have\nan exponential distribution with parameter λ if its probability density function is given by\nfX(x) = λe-λx\n(x ≥0).\n(a) Compute the moment generating function of X.\n(b) Compute the mean and variance of the exponential distribution using the moment gener-\nating function.\n(c) For a xed real t > 0, compute P(X > t).\n(d) Prove the memoryless property:\nP(X > s + t | X > s) = P(X > t)\n∀t, s > 0.\n(e) Let X1, X2, · · · , Xn be i.i.d. exponential random variables with parameter λ. Prove that\nmin{X1, X2, · · · , Xn} has exponential distribution.\n(f) When you enter the bank, you nd that all three tellers are busy serving other customers,\nand there are no other customers in queue. Assume that the service times for you and for\neach of the customers being served are independent identically distributed exponential random\nvariables. What is the probability that you will be the last to leave among the four customers?\nProblem A-2. (Poisson distribution) A discrete random variable X is said to have a Poisson\ndistribution with parameter λ if its probability mass function is given by\nλke-λ\nfX(k) =\nProbability Theory and Stochastic Process\n(k = 0, 1, 2\n.\n!\n· · ·)\nk\n(a) Compute the moment generating function of X.\n(b) Compute the mean and variance of the Poisson distribution using the moment generating\nfunction.\n(c) Prove that the sum of independent Poisson random variables has Poisson distribution.(Hint\n: use the moment generating function)\nProblem A-3. Identify Markov processes.\n(a) Simple random walk.\n(b) The process Xt = |St|, where St is a simple random walk.\n\n(c) X0 = 0 and Xt+1 = Xt + (Yt -1 ) for t ≥0, where Yt are i.i.d. random variables with\nλ\nexponential distribution of parameter λ.\n(d) X0 = 0 and Xt+1 = Xt + ZtZt\n1 · Z0 for t ≥0, where Zt are i.i.d. random variables with\n-\nlog-normal distribution.\n(e) X0 = 0 and Xt+1 = Xt + Wt + Wt-1 + · · · + W0 for t ≥0, where Wt are i.i.d. random\nvariables with normal distribution.\nProblem A-4. (a) Construct an example of a nite Markov chain with non-unique stationary\ndistributions.\n(b) A Markov chain with transition probabilities pij is called doubly stochastic if each row of\nthe transition matrix sums to one, i.e.,\nX\nm\npij = 1,\nj = 1, 2,\ni=1\n· · · , m.\nProve that πj =\n1 gives the stationary distribution of a doubly stochastic process over a\nm\nstate space S of size m.\nPart B\nPart B has more elaborate problems. Many of the problems in Part B cover important topics\nthat we did not have enough time to cover in lecture. Thus understanding the content is as\nimportant as solving the problem. Try to think through the content of the problem while\nsolving it.\nProblem B-1. Let X1, X2, · · · be i.i.d. exponential random variables with parameter λ, and\ndene τ = max{t ≥0 : X1 + · · · + Xt ≤1}. Hence τ measures the number of times an event\nwith `exponential waiting time' occured during an interval of length 1.\n(a) Compute P(τ = 0).\n(b) Compute P(τ = n) using the distribution of Sn = X1 + X2 + · · · + Xn, whose cumulative\ndistribution function is\nn-1 1\nFSn(x) = 1 -\nk\nX\n=0\ne-λx(λx)k\n(x > 0).\nk!\nConclude that τ has Poisson distribution.\nProblem B-2. (a) Verify that the probability density function of the normal distribution\nφ(x) = σ\n√\ne-(x-μ) /(2σ2)\n(\n2π\n-inf< x < inf)\nis indeed a probability density function,\ninf\ninf. (Hint : Compute\ninfφ(x)dx\n-inf\n(b) Compute the expectation and\n\ni.e.\n\nφ(x)dx = 1 and φ(x)\n<\n-inf\n≥0 for all\n-inf< x\nusing polar coordinates)\nvariance of log-normal distribution (Hint : it suces to\ncompute the case when μ = 0. You can use part (a) in order to simply the computation)\nProblem B-3. A family of pdfs or pmfs is called an exponential family with parameter θ (θ\nis a vector) if it can be expressed as\nk\nf(x|θ) = h(x)c(θ)exp\nX\nwi(θ)ti(x)\ni=1\n!\n,\n\nwhere c(θ) ≥0 and w1(θ), · · · , wk(θ) are real-valued functions of θ, and h(x) ≥0 and\nt1(x), · · · , tk(x) are real-valued functions that do not depend on θ.\nProve that log-normal distribtuion, Poisson distribution, and exponential distribution are\nexponential families.\nProblem B-4. It is well believed that investing in the stock market over a long period of\ntime reduces the risk. The following example taken from M. Kritzman, Puzzles of nance,\nChapter 3 (See Kritzman and Rich, Beware of Dogma: the truth about time diversication)\nargues against this idea.\nConsider a theoretical stock whose annual return has log-normal distribution with parameters\nμ and σ for μ = ln(1.1) and σ = ln(1.2). Assume that the return of each year is independent\nto other years. For this theoretical stock, the fraction of wealth lost with 0.1% chance when\ninvested over T years is 40.5%, 58.43%, 61.48%, and 73.92%, for T = 1, 5, 10, 20 respectively.\nThe author then concludes that:\nThese results reveal that if risk is construed as annualized variability, then time\ndiminishes risk. .... However, if the magnitude of potential loss denes risk, then\nit increases with time.\n(a) Compute the fraction of wealth lost with 0.1% chance when invested over T years, as a\nfunction of T (the function may involve the cumulative distribution function of the normal\ndistribution).\n(b) Find the value of T that maximizes the function h(T) computed in (a). Is it true that\nh(T) is an increasing function of time?\n(c) Criticize the argument above, using the computations of steps (a) and (b).\nProblem B-5. A person walks along a straight line and, at each time period, takes a step\nto the right with probability b, and a step to the left with probability 1 -b. The person\nstarts in one of the positions 1, 2, · · · , m, but if he reaches position 0 (or position m + 1), his\nstep is instantly reected back to position 1 (or position m, respectively). Equivalently, we\nmay assume that when the person is in positions 1 or m, he will stay in that position with\ncorresponding probability 1 -b and b, respectively.\n(a) Model this problem as a Markov chain and describe the transition matrix.\n(b) Find the stationary distribution.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Mathematical Applications in Financial Industry\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 3: Regression Analysis",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/61d868106b4de23e5c59c04512954a8b_MIT18_S096F13_pset3.pdf",
      "content": "18.S096 Problem Set 3 Fall 2013\nRegression Analysis\nDue Date: 10/8/2013\nThe Projection('Hat') Matrix and Case Influence/Leverage\nRecall the setup for a linear regression model\ny = Xβ + ε\nwhere y and ε are n-vectors, X is an n×p matrix (of full rank p ≤n)\nand β is the p-vector regression parameter.\nThe Ordinary-Least-Squares (OLS) estimate of the regression param-\neter is:\nˆβ = (XTX)-1XTy\nThe vector of fitted values of the dependent variable is given by:\nyˆ\nˆ\n= Xβ = X(XT X)-1XT y = Hy,\nwhere\nH = X(XTX)-1XT is the n × n \"Hat Matrix\"\nand the vector of residuals is given by:\nεˆ = (In -H)y,\n1 (a) Prove that H is a projection matrix, i.e., H has the following\nproperties:\n- Symmetric: HT = H\n- Idempotent: H × H = H\n1 (b) The ith diagonal element of H, Hi,i is called the leverage of case\ni. Show that\ndyˆi = Hi,i\ndyi\n1 (c) If X has full column rank p,\np\nAverage(Hi,i) = n\nHint: Use the property: tr(AB) = tr(BA) for conformal matrices\nA and B.\n1 (d) Prove that the Hat matrix H is unchanged if we replace the (n×p)\nmatrix X by X′ = XG for any non-singular (p × p) matrix G.\n\n1 (e) Consider the case where X is n × (p + 1) with a constant term\nand pindependent variables defining\n\nthe regression model, i.e.,\nx\n· ·\nX =\n\n1,1\nx1,2\n·\nx1,p\n\nx2,1\nx2,2\n· · ·\nx2,p\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\nxn,1\nxn,2\n· · ·\nxp,n\n\nDefine\n\nG =\nG as follows:\n-x 1\n-x\n·\n\n· ·\n-x p\n\n· · ·\n\n.\n· · ·\n\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n\nwhere x\n\nj =\n\nBy (d), the\nthe original\nP\nn\n· · ·\ni=1 xi,j/n, for j = 1, 2, . . . , p.\nregression model with X′ = XG is equivalent to\nregression model in terms of having the same fitted\nvalues yˆ and residuals ˆε\n- If β = (β0, β1, . . . , βp)T is the regression parameter for X,\nshow that\nβ′ = G-1β is the regression parameter for X′.\nSolve for G-1 and provide explicit formulas for the elements\nof β′.\n- Show that:\n[X′T X′] =\nx\nn\n0T\np\nT\np\nX\n\nX\n\n1,1 -x 1\nx1,2 -x 2\n· · ·\nx1,p -x p\n\nx2,1\nwhere\n-x 1\nx2,2 -x 2\n· · ·\nx2,p -x p\nX =\n.\n.\n.\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\nxn,1 -x 1\nxn,2 -x 2\n· · ·\nxp,n -x p\n\n- Prove the following formula for elements of the projection/hat\n\nmatrix:\nHi,j = 1 + (xi -x )T [X T X]-1(xj\nn\n-x )\nwhere xi = (xi,1, xi,2, . . . xi,p)T is the vector of independent\nvariable values for case i, and x = (x 1, x 2, . . . , x p)T .\nThe leverage of case i, Hi,i, increases with the second term,\nthe squared Mahalanobis distance between xi and the mean\nvector x .\n\nCase Deletion Influence Measures\n2 (a) Sherman-Morrison-Woodbury (S-M-W) Theorem: Suppose that\nA is a p × p symmetric matrix of rank p, and a and b are each\nq × p matrices of rank q < p. Then provided inverses exist\n(A + aT b)-1 = A-1 -A-1aT (Iq + bA-1aT )-1bA-1.\nProve the theorem.\nˆ\n2 (b) Case deletion impact on β: Apply the S-M-W Theorem to show\nthat the least squares estimate of β when the ith case is deleted\nfrom the data is\n(XT X)-1x\nˆ\nˆ\nβ\niεˆi\n(i) = β-\n,\n1-Hi,i\nwhere xT\ni is the ith row of X and εˆi = yi -yˆi = yi -\nˆ\nxT\ni β.\n2 (c) A popular influence measure for a case i is the ith Cook's distance\nCDi =\n\npˆσ2\n\n|ˆy -ˆy(i)|2\nwhere ˆy(i) = X ˆβ(i). Show that\nCDi =\nˆε2\ni\npˆσ2 ·\nHi,i\n(1-Hi,i)2\n2 (d) Case deletion impact on σˆ2 : Let σˆ2\nbe the unbiased estimate\n(i)\nof the residual variance σ2 when case i is deleted from the data.\nShow that:\nσˆ2\n= σˆ2+\n(i)\n\nn-p-1\n\nˆσ2 -\nˆε2\ni\n1-Hi,i\nSequential ANOVA in Normal Linear Regression\n\nModels via the QR Decomposition\nRecall from the lecture notes that the QR-decomposition, X = QR\nis a factorization of the n × p matrix X into Q, an n\nT\n× p column-\northonormal matrix (Q Q = Ip, the p × p identify matrix) times R,\na p × p upper-triangular matrix.\nDenoting the jth column of X and of Q by X[j] and Q[j], respectively,\nwe can write out the QR-decomposition for X, column-wise:\nX[1]\n=\nQ[1]R1,1\nX[2]\n=\nQ[1]R1,2 + Q[2]R2,2\nX[3]\n=\nQ[1]R1,3 + Q[2]R2,3 + Q[3]R3,3\n...\nX[p]\n=\nQ[1]R1,p + Q[2]R2,p + Q[3]R3,p + · · · + Q[p]Rp,p\n\nA common issue arising in a regression analysis with p explanatory\nvariables is whether just the first k (< p) explanatory variables (given\nby the first k columns of X) enter in the regression model. This can\nbe expressed as an hypothesis about the regression parameter β,\nH0: βk+1 = βk+2 = · · · = βp ≡0.\nˆ\nˆ\n3 (a) Consider the estimate β0 =\n\nβI\nwhere\n0p-k\nˆβI\n=\n(XT\nI XI)-1\n\nXT\nI y\nXI\n=\n\nX[1]X[2] · · · X[k]\nˆ\nShow that β0 is the constrained least-squares\n\nestimate of β cor-\nresponding to the hypothesis H0, i.e.,\nˆβ minimizes: SS(β) = (y -Xβ)T\n(y -Xβ)\nsubject to\nˆβj = 0, j = k + 1, k + 2, . . . , p.\n3 (b) Show that the QR-decomposition of XI is XI = QIRI, where QI\nis the matrix of the first k columns of Q and RI is the upper-left\nk × k block of R. Furthermore, verify that:\nˆβI = R-1\nI QT\nI y, and\nyˆI = HIy,\nwhere HI = QIQT\nI , the n × n projection/Hat matrix under the\nnull hypothesis.\n3 (c) From the lecture notes, recall the definition of\nA =\n\nQT\nW T\n\n, where\n- A is an (n × n) orthogonal matrix (i.e. AT = A-1)\n- Q is the column-orthonormal matrix in a Q-R decomposition\nof X\nNote: W can be constructed by continuing the Gram-Schmidt\nOrthonormalization process (which was used to construct Q\nfrom X) with X∗= [ X\nIn ].\nThen, consider\n\nQTy\n\nzQ\n\n(p\nz = Ay =\nW T\n=\n× 1)\ny\nzW\n(n -p) × 1\nProve the following relationships for the unconstrained regression\nmodel:\n\n- yT y\n=\ny2 + y2 + · · · + y2\nn\n=\nz2\n1 + z2\n2 + · · · + z2\nn\n=\nzT z\n- yˆT yˆ\n=\nyˆ2\n1 + yˆ2\n2 + · · · + yˆn\n=\nz2\n1 + z2\n2 +\n·\n+\nT\n· ·\nz2\nk + · · · + z2\np\n- εˆ εˆ\n=\nεˆ1 + εˆ2 + · · · + εˆ2\nn\n=\nz2\np+1 + z2\np+2 + · · · + z2\nn\nProve the following relationships for the constrained regression\nmodel:\n- yT y\n=\ny2\n1 + y2\n2 + · · · + y2\nn\n=\nz2 + z2 + · · · + z2\nn\n=\nzT z\n- yˆT yˆ\n=\n(yˆ )2 + (yˆ )2 + · · · + (yˆ )2\nI\nI\nI 1\nI 2\nI n\n=\nz2\n1 + z2\n2 + · · · + z2\nk\n- εˆT\nˆ\nI εˆI\n=\n(εI)2\nˆ\nˆ\n1 + (εI)2 + · · · + (εI)n\n=\nz2\nk+1 + · · · + z2\np + z2\np+1 + z2\np+2 + · · · + z2\nn\n3 (d) Under the assumption of a normal linear regression model, the\nlecture notes\nz =\n=\ndetail how the distribution\nzQ\n∼N\nz\nn\nW\n\nof z = Ay\nRβ\n, σ2I\nO\nn\nn-p\n\nis\n⇒\nzQ ∼Np[(Rβ), σ2Ip]\nzW ∼N\n(n\nI\n-p)[(O(n-p), σ\n(n-p)]\nand\nzQ and zW are independent.\n- For the unconstrained (and the constrained) model, deduce\nthat:\nSS\n= εˆT εˆ ∼σ2\nERROR\n× χn-p\na Chi-Square r.v. with (n -p) degrees of freedom scaled by\nσ2.\n- For the constrained model under H0, deduce that:\nSSREG(k+1,...,p 1,2,...,k)\n=\nyˆT yˆ\n|\n-yˆT\nI yˆI\n=\nεˆT\nT\nI εˆI -εˆ εˆ\n=\nz2\n+ · · · z2\nk+1\np\n∼\nσ2 × χ2\np-k,\na σ2 multiple of a Chi-Square r.v. with (p -k) degrees of\nfreedom which is independent of SSERROR.\n- Under H0, deduce that the statistic:\n\nˆ\nSS\nF =\nREG(k+1,...,p|1,2,...,k)/(p-k)\nSSERROR/(n-p)\nhas an F distribution with (p-k) degrees of freedom 'for the\nnumerator' and (n -p) degrees of freedom 'for the denomi-\nnator.'\nIt is common practice to summarize in a table the calculations\nof the F-statistics for testing the null hypothesis that the last\n(p -k) components of the regression parameter are zero:\nANOVA Table\nSource\nSum of\nSquares\nDegrees of\nFreedom\nMean\nSquare\nF-Statistic\nRegression on\n'1, 2, . . . , k'\nT\nˆyI ˆyI\nk\n--\nRegression on 'k + 1, . . . , p'\nAdjusting for '1, 2, . . . , k'\nT\nˆyT ˆy -ˆyI ˆyI\n(p-k)\nMS0 =\nT\nˆyT ˆy-ˆy ˆ\nI yI\n(p-k)\nˆF =\nMS0\nMSError\nError\nˆεT ˆε\n(n -p)\nMSError = ˆεT ˆε\n(n-p)\nTotal\nT\ny y\nn\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Mathematical Applications in Financial Industry\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 4: Time Series Analysis",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/64b58a3283830d9448e769a201824bfb_MIT18_S096F13_pset4.pdf",
      "content": "18.S096 Problem Set 4 Fall 2013\nTime Series\nDue Date: 10/15/2013\n1. Covariance Stationary AR(2) Processes\nSuppose the discrete-time stochastic process {Xt} follows a second-\norder auto-regressive process AR(2) :\nXt = φ0 + φ1Xt-1 + φ2Xt-2 + ηt,\nwhere {ηt} is WN(0, σ2), with σ2 > 0, and φ0, φ1, φ2, are the param-\neters of the autoregression.\n(a) If {Xt} is covariance stationary with finite expectation μ = E[Xt]\nshow that\nφ\nμ =\n1-φ1-φ2\n(b) For the autocovariance function\nγ(k) = Cov[Xt, Xt-k],\nshow that\nγ(k) = φ1γ(k -1) + φ2γ(k -2), for k = 1, 2, . . .\n(c) For the autocorrelation function\nρk = corr[Xt, Xt-k],\nshow that\nρk = φ1ρk\n1 + φ2ρk\n2, for k = 1, 2, . . .\n-\n-\n(d) Yule-Walker Equations\nDefine the two linear equations for φ1, φ2 in terms of ρ1, ρ2 given\nby k = 1, 2 in (c):\nρ1\n=\nφ1ρ0 + φ2ρ-1\nρ2\n=\nφ1ρ1 + φ2ρ0\nUsing the facts that ρ0 = 1, and ρk = ρ-k, this gives\nρ1\n=\nφ1\n+\nφ2ρ1\nρ2\n=\nφ1ρ1\n+\nφ2\nwhich is equivalent to:\nρ1\nρ1\nφ1\n=\nρ2\nρ1\nφ2\nSolve for\n\nφ\n\nφ\n\n1 and\n\n2 in terms of ρ1, and ρ2.\n\n(e) Solve for ρ1, and ρ2 in terms of φ1 and φ2.\n(f) Derive complete formulas for ρk, k > 2. Hint: Solve this part by\nreferring to the answer to problem 4(b) below.\n2. Difference equations associated with an AR(p) process.\nAn AR(p) process,\nXt = φ0 + φ1Xt\n1 + φ2X\n+\n-\nt-2\n· · · + φpXt-p + ηt\nwhere {ηt} is WN(0, σ2), with σ2 > 0, and auto-regression parameters\nφ0, . . . , φp, can be written using the polynomial-lag operator\nφ(L) = (I -φ1L -φ2L2 · · · -φpLp)\nas follows:\nφ(L)Xt = ηt.\nConsider the homogeneous difference equations:\nφ(L)g(t) = 0.\nfor a discrete-time function g(t).\nSuch equations arise in AR(p) models when analyzing auto-covariance,\nauto-correlation, and prediction functions.\n(a) If μ = E[Xt], show that\nφ\nμ =\n1-Pp\ni=1 φi\nSo, μ = 0, if and only if φ0 = 0. It is common practice to 'de-\nmean' a time series which has the result of eliminating the au-\ntoregression parameter associated with the mean, i.e., φ0.\n(b) For the auto-covariance function,\nγ(t) = Cov(Xt, X0), t = 0, 1, . . . ,\nprove that\nφ(L)γ(t) = 0, for all t;\n(c) For the auto-correlation function,\nρ(t) = Corr(Xt, X0), t = 0, 1, . . . ,\nprove that\nφ(L)ρ(t) = 0, for all t.\n(d) Suppose that the process is observed up to time t∗, so the val-\nues (x0, x1, . . . , xt∗) are known. Let gt∗(h), for h = 1, 2, . . . , be\nforecasts of the process:\n\ngt∗(h) = E[Xt∗+h | (Xt∗, . . . , X1, X0) = (xt∗, . . . , x1, x0)]\nWith the notation xˆt∗(h) = gt∗(h), for h > 0 and defining xˆt∗(h) =\nxt∗+h, for h ≤0, show that\nxˆt∗(1)\n=\nφ0 + Pp\nPi=1 φixˆt∗(1\ni)\np\n-\nxˆt∗(2)\n=\nφ0 +\ni=1 φixˆt∗(2 -i)\n...\np\nxˆt∗(h)\n=\nφ0 +\ni=1 φixˆt∗(h -i), for any h > 0.\n(e) For the de-meaned process\nforecast function g (t) satisfies\nP\nin (c) (i.e., φ0 = 0), show that the\nt∗\nφ(L)gt∗(t) = 0, for t = 1, 2, . . .\n3. Solutions to Difference Equations Associated with AR(p) Pro-\ncesses\nIn the previous problem, the autocovariance, autocorrelation and fore-\ncast functions satisfy the difference equations:\nφ(L)g(t) = 0, for t = 0, 1, 2, . . .\n(3.1)\n(a) As a possible solution, consider the function:\ng(t) = Ceλt, for some constants C and λ.\nShow that such a function g() is a solution if z = e-λ is a root of\nthe characteristic equation:\nφ(z) = 1 -Pp\ni=1 φizp = 0.\n(b) More generally, consider the function:\ng(t) = CGt, for some constants C and G (this is the\ngeneralization of (a) where G = e-λ is constrained to be real and\npositive).\nShow that such a function g() is a solution if G-1 is a root of the\ncharacteristic equation.\n(c) For an AR(p) process, suppose the p roots of the characteris-\ntic equation zi = (G\n-\ni ) are distinct. Show that for constants\nC1, C2, . . . , Cp, the function\ng(t) = C1Gt\n1 + C2Gt\n2 + · · · + CpGt\np\nsatisfies\nφ(L)g(t) = 0.\n(d) For an AR(p) process, if all roots zi are outside the complex\nunit circle, prove that any solution g() given in (b) is bounded.\n\nSince the autocovariance function is a solution, this condition\nis necessary and sufficient for the autocovariance to be bounded\n(covariance stationary).\n4. Consider an AR(2) process.\n(a) Solve for the 2 roots of the characteristic equation, z1 and z2.\nDetail the conditions under which z1 and z2 are\n- Distinct and real.\n- Coincident and real.\n- Complex and conjugates of each other (i.e., z1 = a + ib and\nz2 =√a-ib, for two real constants a and b, and the imaginary\ni =\n-1.\n(b) Prove that the autocorrelation function satisfies:\nρk = C1Gk\n1 + C2Gk\nwhere G1 = z1\n-1, and G2 = z-1\nUsing equations for two values of k, solve for C1 and C2 when z1\nand z2 are distinct, and show that\nG\nG\n1(1-\n2) Gk\nG\nk =\n1-\n2(1-G2\n1)Gk\nρ\n(G1-G2)(1+G1G2)\n(c) When distinct and real, show that the autocovariance function\ndecreases geometrically/exponentially in magnitude.\n(d) In (c), under what conditions on φ1 does the autocovariance/correlation\nfunction remain positive; and under what conditions does it al-\nternate in sign.\n(e) Optional: When the two roots are complex conjugates, define d\nand f0 so that:\nG1 = dei2πf0, and G2 = de-i2πf0.\nUsing part (b), it can be shown that\nsin(2πf0k+F)\nρk =[sgn(φ1)]k|d|k\nsin(F)\nwhere\n- The damping factor d is\n|d| = √-φ2\n- The frequency f0 is such that\n2πf0 = arccos\n\n|φ1|\n2√-φ2\n\n- The phase F is such that\ntanF =(1+d2\n1-d2)tan(2πf0)\n5. Moving Average Process MA(1)\nSuppose the discrete stochastic process {Xt} follows a MA(1) model:\nXt\n=\nηt + θ1ηt-1\n=\n(1 + θ1L)ηt, t = 1, 2, . . . (η0 = 0)\nwhere {ηt} is WN(0, σ2).\n(a) Derive the auto-correlation function (ACF) of Xt\n(b) For the following two model cases, solve for the first-order auto-\ncorrelation:\n- θ1 = 0.5\n- θ1 = 2.0\n(c) Using the formula for ρ1 = corr(Xt, Xt\n1), in (a), solve for the\n-\nMA process parameter θ1 in terms of ρ1.\nIs the solution unique?\n(d) An MA(1) process is invertible if the process equation can be\ninverted, i.e., the process {Xt} satisfies:\n(1 -θ1L)-1Xt = ηt\nFor each model case in (b), determine whether the process is\ninvertible, and if so, provide an explicit expression for the model\nprocess as an (infinite-order) autoregression.\n6. Autoregressive Moving Average Process: ARMA(1, 1)\nSuppose the discrete stochastic process {Xt} follows a covariance sta-\ntionary ARMA(1,1) model:\nXt -φ1Xt-1\n=\nφ0 + ηt + θ1ηt-1\n(1 -φ1L)Xt\n=\nφ0 + (1 + θ1L)ηt, t = 1, 2, . . . (η0 = 0)\nwhere {η\nt} is WN(0, σ ).\n(a) Prove that\nφ\nμ = E[Xt] =\n1-φ1\n(b) Prove that\nσ2\nσ [1+θ\n= V ar(X ) = γ =\n1+2φ1θ1]= σ2\n(\nX\nt\n1-φ2\n\nθ\n1+\n1+φ1)\n1-φ2\n\n(c) Prove that the auto-correlation function (ACF) of the covariance\nstationary ARMA(1, 1) process is given by the following recur-\nsions:\nθ\nρ1\n=\nφ1+\n1σ2\nγ0\nρk\n=\nφ1ρk\n1, k > 1\n-\n(d) Compare the ACF of the ARMA(1, 1) process to that of the\nAR(1) process with the same parameters φ0, φ1.\nNote that\n- Both decline geometrically/exponentially in magnitude by\nthe factor φ1 from the second time-step on.\n- If φ1 > 0, both processes have an ACF that is always positive.\n- If φ1 < 0, the ACFs alternate in sign from the second time-\nstep on.\nWhat pattern in the ACF function of an ARMA(1, 1) model is\nnot possible with an AR(1) model? Suppose an economic index\ntime series follows such an ARMA(1, 1) process. What behavior\nwould it exhibit?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Mathematical Applications in Financial Industry\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 5: Volatility Modeling",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/2dcc893d045ba13d2904efb2bb5f22cf_MIT18_S096F13_pset5.pdf",
      "content": "18.S096 Problem Set 5 Fall 2013\nVolatility Modeling\nDue Date: 10/29/2013\n1. Sample Estimators of Diffusion Process Volatility and Drift\nLet {Xt} be the price of a financial security that follows a geometric\nBrownian motion process:\ndX(t) = μ dt + σdW(t),\nX(t)\n∗\nwhere\n- σ > 0, is the volatility parameter\n- μ ∈(-inf, inf), is the drift parameter\n∗\n- dX(t) is the infinitesimal increment in price.\n- dW(t) is the increment of a standard Wiener Process, i.e, in-\nfinitesimal increments W(t+dt)-W(t) are i.i.d. Normal random\nvariables with zero mean and variance equal to 'dt'.\nConsider sampling values of the price process over a fixed time period\nt ∈[0, T], at equal time increments h = T/n. Define\nti = i × h, i = 0, 1, . . . , n\nXi = X(ti), i = 0, 1, . . . , n\nYi = log(Xi/Xi\n1), i = 1, 2, . . . , n\n-\nAccept as given that:\nYi are i.i.d. N(μ · h, σ2 · h) random variables,\n(this is proven with the theory of diffusion processes/stochastic differ-\nential equations, with μ = μ\n∗-\nσ2).\n1(a) Prove that the Maximum-Likelihood Estimates: μˆ and σˆ for a\nsample: y1, y2,P\n. . . , yn, are given by\nμˆ = 1\nn\nn\ni=1 Yi\nσˆ2 = 1 Pn\ni=1(Yi -μˆ)2\nn\n1(b) Derive the distribution of μˆ ; give specific formulas for the expec-\ntation and variance of μˆ.\n\n1(c) Derive the distribution of σˆ2 ; give specific formulas for the ex-\npectation and variance of σˆ2.\n1(d) Consider increasing the number of increments n on the fixed time\nperiod [0, T], and let μˆn and σˆ2\nn be the corresponding MLEs of\nthe parameters. Determine the limiting distributions of μˆn and\nσˆ2\nn.\nˆ\n1(e) A sequence of estimators θn for a parameter θ, is weakly consis-\ntent if\nlim Pr(\nn→inf\n|ˆθn -θ|) = 0.\nFor each of μˆn and σˆ2\nn, determine whether the sequence of esti-\nmators is weakly consistent.\n2. Consider the same process as in problem 1, but now, for fixed values\nof μ and σ, consider sampling n values of the price process over a fixed\ntime perioP\nd t\n[0, T], at variable increments hi > 0, i = 1, 2, . . . , n,\nn ∈\nsuch that\ni=1 hi = T. Define\ni\nti =\nj=1 hj, i = 0, 1, . . . , n\nXi =\nP\nX(ti), i = 0, 1, . . . , n\nYi = log(Xi/Xi\n1), i = 1, 2, . . . , n\n-\nAccept as given that:\nYi are i.i.d. N(μ · hi, σ2 · hi) random variables,\n(this is proven with the theory of diffusion processes/stochastic differ-\nential equations).\n2(a) Derive the MLE for μ and its distribution for a fixed set of sam-\npling increments {hi}\nn\n:\ni=1 hi = T.\n2(b) Derive the MLE for σ2\nn\nsampling\nP\nand its distribution for a fixed set of\nincrements {hi} :\ni=1 hi = T.\n2(c) If limited to sampling n + 1\nP\nprice points of {Xt}, (including X0\nand XT ) prove that\n- For estimating σ2, sampling, the ML estimators vary with\nthe increment spacing, but the variance of these estimators\nare all equal, regardless of the increment spacing.\n- For estimating μ, all ML estimators are the same and have\nthe same variance, regardless of the increment spacing.\n\n3. ARCH(1) Model Properties\nLet yt = log(St/St\n1) be the discrete returns of the price of a secu-\n-\nrity/portfolio {St, t = 1, 2, . . .}, and supppose that yt ∼ARCH(1),\ni.e.\nyt = μt + εt,\nwhere μt is the mean return, conditional on Ft-1, the information\navailable up to time (t -1) and\nεt = Ztσt,\nwhere Zt iid with E[Zt] = 0, and var[Zt] = 1, and\nσ2\nt = α0 + α1εt-1.\nAdditionally, suppose that E[Z3\nt ] = 0, and E[Z4\nt ] = κ. (The parameter\nκ is the Kurtosis of the Zt distribution with unit variance; if Zt is\nGaussian/normal, then κ = 3.\nProve that:\n3(a) E[ε2\nt ] = α0/(1 -α1)\n3(b) E[ε3\nt ] = 0\nκα2\n3(c) E[ε4] =\n0(1+α1)\nt\n(1-α )(1-κα2\n1)\n3(d) What constraints on α0, α1 must be made in (c), to maintain\n4-th order stationarity (bounded).\n3(e) The kurtosis of εt is\nκε = E[ε4\nt ]/(E[ε2\nt ])2.\n(The fourth moment is normalized to be scale-free). If the distri-\nbution Zt is Gaussian/normal (i.e., the scaled, conditional error\ndistribution of εt), does the unconditional distribution of εt, have\na higher than that of the Gaussian distribution, ( i.e., heavier\ntails)?\n\n4. Using Daily Open/High/Low/Close Data on the S&P500 Index from\n2006-20012 , annual sample variances were computed of changes in the\nlog index value of the daily Close.\nThe following table gives the annual sample variances, day counts, and\nannualized volatilities\nAnnual Sample Variances of Logarithmic Returns:\ndaily.variance\ndays volatility\n3.981351e-05\n251 0.09996595\n1.018599e-04\n251 0.15989632\n6.677100e-04\n253 0.41101171\n2.950132e-04\n252 0.27265972\n1.294545e-04\n252 0.18061706\n2.164385e-04\n252 0.23354335\n6.459046e-05\n250 0.12707327\nThe differences in the sample variances and volatilities appears quite\nlarge for some years. Are the year-by-year differences significant?\nTo address this question, consider modeling the returns for any given\nyear as a simple random sample from a Gaussian distribution:\n{y1, y2, . . . , y\nn} : yi i.i.d. N(μ, σ ).\nThe table gives values of σˆ2\nP\n, n, and √nσˆ, where\nσˆ2 =\nn\nn-1\ni=1(yi -μˆ)2,\nwith\nμˆ = 1\nn\nPn\ni=1 yi.\n4(a) Under the Gaussian model, given n, μ, σ2, prove that the distri-\nbution of σˆ2 is\nσˆ2 ∼\nσ2\nn-1 × χ2\nn-1.\nthat is, a scaled Chi-square distribution with degrees of freedom\nequal to (n -1), and scale factor equal to\nσ\nn-1\n4(b) Statistical methodology defines confidence intervals for unknown\nparameters by computing a likely interval for the parameter es-\ntimate given the unknown parameter, and then inverting the in-\nterval to correspond to the parameter instead of the estimate.\nFor a 95% confidence interval (two-sided), the development is as\nfollows:\n\n- With 95% probability, the χ2\nn-1 random variable will fall\nwithin the interval from the 0.025 percentile, to the 0.975\npercentile, i.e.,\nPr(q0.025 < χ2\nn\n1 ≤q\n)\n-\n0.975 = 0.975 -0.025 = 0.95\nwhere\nPr(χ2\nn-1 ≤q0.025) = 0.025\nPr(χ2\nn-1 ≤q0.975) = 0.975\n- Replacing the random variable χ2\nn\n1 with (n-1\n2 )σˆ2 gives:\n-\nσ\nPr(q0.025 < (n-1\n2 )σˆ2 ≤q0.975) = 0.95\nσ\nwhich can be inverted to\n(n\n1)\n(n\n1)\nPr(σˆ2\n-\n≤σ2 ≤σˆ2\n-) = 0.95\nq0.975\nq0.025\nThe following table gives the percentiles of the Chi-square distri-\nbutions for degrees of freedom ranging from 249 to 252 (one less\nthan the annual day counts).\ndf\nq0.025\nq0.975 ll.factor ul.factor\n249 207.1856 294.6008 0.8452115\n1.201821\n250 208.0978 295.6886 0.8454840\n1.201358\n251 209.0102 296.7763 0.8457550\n1.200898\n252 209.9227 297.8637 0.8460245\n1.200442\nThe last two columns are\nll.factor =\nn\n1 and ul.factor =\nn\nq0.\n-\nq0.\n-\nwhich when multiplied by the unbiased sample estimate σˆ2, define\nthe confidence interval for σ2.\n- Using data for 2008, compute the two-sided 95% confidence\ninterval for σ2, based on daily log returns.\n- Express\n√\nthe interval in terms of the annualized volatility\n(\n253σ). Does the sample annual volatility for any other\nyear fall in the confidence interval for 2008?\n4(c) The return variance / volatility varies considerably from year to\nyear. To evaluate the statistical significance of the difference in\nvalues for any two years, we can use the F-Distribution. Consider\n2007 and 2008.\nUnder the assumption (i.e., a null hypothesis H0) of Gaussian/normal\ndaily returns and that the variances of the returns are constant/\nthe same for all days in the two years it follows from 4(a) that:\nn\nX = (\n2007-1)\n)σˆ2\n2007 ∼χ2\ndf , where dfX = (n2007\n1)\nσ\nn\n-\nY = (\n2008-1)\nσ2\n)σˆ2\n2008 ∼χ2\ndf , where dfY = (n2008\n-1)\n\nand X and Y are independent random variables. The statistic\nY/df\nS =\nY\nσˆ2\n=\nX/dfX\n(\n2008)\nσˆ2\nhas the F-Distribution with degrees of freedom dfY for the nu-\nmerator and dfX for the denominator. (Verify by looking up the\ndefinition of the F-distribution.)\nUnder the null hypothesis, the numerator and denominator of\nS are estimates of the same return variance. Their ratio varies\nabout 1 due to the independent variation in the numerator and\ndenominator of scaled Chi-squared random variables.\nThe methodology of hypothesis testing in statistics uses the fact\nthat the test statistic has a known distribution under the null\nhypothesis. The null hypothesis is accepted / rejected so long\nas the test statistic is not extreme. We choose a test α-level,\nthe probability of (falsely) rejecting the null hypothesis if true,\nsay α = 0.05. From this, extreme ranges of the test statistic are\ndefined that occur with probability α when the null hypothesis is\ntrue. For α = 0.05, a two -sided alternative is considered using\nq0.025 and q0.975, the percentiles of the F distribution given by:\nPr(FdfY ,dfX < q0.025) = 0.025\nPr(FdfY ,dfX < q0.975) = 0.975\nThe null hypothesis is accepted if\nq0.025 < S < q0.975\nFrom the package R, we provide the percentiles of the F-distribution\nwhen df1 = n2008 -1, and df2 = n2007 -1 :\n> qf(0.025, df1=252, df2=250)\n[1] 0.7804173\n> qf(0.975, df1=252, df2=250)\n[1] 1.281525\nso the null hypothesis is accepted if\nq0.025 = 0.7804 < S < 1.2815 = q0.975\n- Compute the test statistic S = S0 for testing the daily return\nvariance for 2008 is equal to the daily return variance for\n2007.\n- Given the value of the test statistic S0, determine the α-level\nat which the null hypothesis is on the boundary of being just\naccepted/rejected.\n\n(This level is called the P-value of the test statistic. Report-\ning a test statistic's P-value provides evidence concerning\nfor/against the test null hypothesis which can be provided\nwithout having to specify an α-level.)\n- Repeat the previous two questions, for testing the equality\nof the return variance for 2008 to that for 2006. (Note: the\ndegrees of freedom for 2006 are the same as those for 2007 so\nthe same F distribution is applicable)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Mathematical Applications in Financial Industry\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 6: Time Series II and Portfolio Theory",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/9c3945082887de1e03b79092d8f06010_MIT18_S096F13_pset6.pdf",
      "content": "18.S096 Problem Set 6 Fall 2013\nTime Series II and Portfolio Theory\nDue Date: 11/7/2013\nX1,t\n1. Suppose Xt =\nfollows a V AR(1) model where\nX2,t\nX\n=\n\n1,t\n0.3 + .8\n\n· X1,t-1 + ε1,t\nX2,t = 0.2 + .6 · X1,t-1 + .4 · X2,t-1 + ε2,t\nwhere (ε1,t, ε\nT\n,t)\nare i.i.d. N(02, Σ), and\nΣ =\n-1\n-1\n\n.\n1(a) Compute μ = E[Xt].\n1(b) Compute Γ(0) = Cov[Xt].\n1(c) Compute Γ(1) = Cov[Xt, Xt-1]\n1(d) Derive a formula for computing Γ(h) = Cov[Xt, Xt-h], h ≥1.\n2. For {εt} i.i.d. WN(0, σ2), define processes {wt} and {vt} as follows\nwt = 5(1 -.5L)-1εt\nvt = 4(1 -.4L)-1εt\nDefine {xt} : xt = wt -vt.\n2(a) Solve for coefficients θi in the infinite-order moving average pro-\ncess for xt :\nxt = εt + Pinf\ni=1 θtεt\n2(b) Prove that {xt} is an AR(2) process.\n2(c) Solve for φ1 and φ2 in the representation:\nxt = φ1xt-1 + φ2xt-2 + εt\n2(d) Prove that any stationary AR(2) process can be expressed as the\ndifference of two (possibly infinite order) moving average pro-\ncesses on the same innovation process {εt}.\n\n3. Consider a single-period analysis of 2 risky assets with\nReturns:\nR1\nR =\nR2\nMean and Co\n\nvariance\n\nof Returns:\nα1\nΣ1,1\nΣ1,2\nσ2\nρσ1σ2\nE[R] =\n\nα2\n\n, and Cov[R] = Σ =\n\n=\nΣ1,2\nΣ\n2,2\n\nρσ1σ2\nσ2\n\nwhere σ1 =\np\nΣ1,1, σ2 =\np\nΣ2,2 and ρ is the correlation between R1\nand R2.\nA portfolio w = (w\nT\n1, w2)\nidentified by its investment weights in the\nassets, has return:\nRw = w1R1 + w2R2 = wT R.\nAssume that w is fully invested (w1 + w2=1) and that no short sales\nare allowed (w1 ≥0 and w2 ≥0).\n(3a) Prove that V ar(R\nw) ≤max(σ1, σ2\n2) for all portfolios w.\n(3b) Suppose σ1 = σ2, and ρ = 0.\n- Solve for w∗, the portfolio with minimum return variance.\n- Compute V ar(Rw∗).\n(3c) Suppose σ1 = σ2 (no assumptions about ρ)\n- Solve for w∗, the portfolio with minimum return variance.\n- Compute V ar(Rw∗).\n- Graph the variance of the mininum-variance portfolio as a\nfunction of ρ : -1 ≤ρ ≤1.\n\n4. Consider a single-period analysis of m > 2 risky assets with\nReturns:\nR =\n\nR1\n\n...\n\nRm\nand covariance\n\nα\nwith mean\n\n.\nE[R] =\n..\nαm\n,\n\nσ2\nρ\nσ σ\nΣ1,1\n· · ·\nρ\nσ σ\n.\n·\n.\n· ·\n1,2\n1,m\nm\n\nΣ1,m\nσ\n.\n\nσ\n\nρ\n\n2,1σ\n·\nσm\nCov[R] = Σ =\n.\n.\n.\n.\n=\n.\n.\n\n.\n.\n.\n· ·\nρ2,mσ2\n.\n.\n.\n.\n.\n\n.\n.\n.\n.\nΣm,1\n· · ·\nΣm,m\nρm,1σmσ\nρm,2σmσ2\n· · ·\nσ\n\nm\n\nwhere σj =\nΣj,j, j = 1, . . . , m, is the standard deviation of asset j's\n\nreturn, j = 1\np\n, . . . , m\nand ρi,j = Σi,j/\nΣi,iΣj,j is the return correlation between assets i\nand j, for 1 ≤i, j\np\n≤m.\nA portfolio w = (w , w , . . . , w )T\nm\nidentified by its investment weights\nin the assets, has return:\nR\n= Pm\nT\nw\nj=1 wjRj = w R.\nm\nAssume that w is fully invested (\nj=1 wj = 1) and that no short sales\nare allowed (wj ≥0, for all j).\nP\n4(a) Prove that V ar(Rw) ≤max(σ2\n1, σ2\n2, . . . , σ2\nm) for all portfolios w.\n4(b) Suppose σ1 = σ2 = · · · = σm, and ρ = 0.\n- Solve for w∗, the portfolio with minimum return variance.\n- Compute V ar(Rw∗) and express it as a function of m, the\nnumber of assets.\n- What is the limit of V ar(Rw∗) as m →inf.\n4(c) Suppose σ1 = σ2 = · · · = σm and ρi,j ≡ρ for all i = j. The\ncorrelation matrix of the m-vector of returns is said to be an\nequicorrelation matrix because all assets have the same pair-\nwise correlations.\n- For the case of m = 2, there is no constraint on ρ except the\nusual one: -1 ≤ρ ≤1.\nProve generally that ρ\nT\n≥-\n1 .\nm-1\nHint: 1m = (1, . . . , 1)\nis an eigen-vector of the matrix Σ:\nconfirm, compute the eigen-value, and apply constraints for\nΣ to be positive semi-definite.\n\n- Solve for w∗, the portfolio with minimum return variance.\n- Compute V ar(Rw∗).\n- Graph the variance of the mininum-variance portfolio as a\nfunction of ρ : -\nρ\nm-1 ≤\n≤1.\n- What is the limit of V ar(Rw∗) as m →inf?\n- Compare this limit with that in (b) and comment on the abil-\nity to diversify away portfolio variability by adding additional\n(equi-correlated) assets to a portfolio.\n5. Consider a single-period analysis of m risk assets as in problems 3 and\n4.\n5(a) Suppose m = 2, σ1 = σ2, and ρ = Σ1,2/\np\nΣ1,1Σ2,2 = 0.\n- Solve for w∗, the portfolio with minimum return variance.\n- Compute V ar(Rw∗).\n5(b) Suppose m > 2, and Σ = diag(σ2\n1, . . . , σ2\nm), a diagonal matrix\nwith no constraints on the asset vpariances (σ2\nj ) and zero correla-\ntions between assets (ρi,j = Σi,j/\nΣi,jΣi,j ≡0).\n- Solve for w∗, the portfolio with minimum return variance.\n- Compute V ar(Rw∗).\n- Express V ar(Rw∗) as a function of m and σ 2 =\nm\nm\nj=1 σ-2\nj\n5(c) Suppose m > 2, and no constraints on the positive definite\nP\nmatrix\nΣ.\n- Solve for w∗, the portfolio with minimum return variance.\n- Compute V ar(Rw∗).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Mathematical Applications in Financial Industry\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 7: Factor Modeling",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/501ab6f76c47c8f8a3be8d0a73cc670d_MIT18_S096F13_pset7.pdf",
      "content": "18.S096 Problem Set 7 Fall 2013\nFactor Models\nDue Date: 11/14/2013\n1. Consider a bivariate random variable:\nX1\nX =\nwith\n\nX2\nmean and co\n\nvariance:\nα\nΣ\nΣ\n\nσ2\n1,1\n1,2\nρσ1σ2\nE[X] =\n, and Cov[X] = Σ =\n=\nα2\nΣ\np\n1,2\nΣ2,2\nρσ1σ2\nσ2\n\nwhere σ1 =\nΣ1,1, σ2 =\np\nΣ2,2 and ρ is the correlation between X1\nand X2.\nConduct the Principal Components Analysis (PCA) of X:\n1(a) Compute the eigenvalues Σ: λ1 ≥λ2 ≥0.\n1(b) Compute the eigenvectors γ1, γ2:\nΣγi\n=\nλiγi,\ni = 1, 2\nγ′\niγi\n=\n1,\ni = 1, 2\nγ′\n1γ2\n=\n0,\n1(c) Demonstrate that:\nΣ = Pm\ni=1 λiγiγ′\ni\n1(d) Define the Principal Component Variables:\npi = γ′\ni(x -α),\ni = 1, 2.\nProve that\n- E[pi] = 0, i = 1, 2.\n- V ar(pi) = λi, i = 1, 2.\n- Cov(p1, p2) = 0.\n1(e) Are the eigenvectors in 1(b) unique? If so, explain why; if not,\nexplain the relationship between different solutions.\n\n2. Let T : R2 →R2 be an affine transformations of X in 2-dimensional\nspace that preserves distances between points. Then, for some orthog-\nonal (2 × 2) matrix Φ with columns φ1, φ2 (Φ = [φ1 : φ2], Φ-1 = ΦT )\nand some 2-vector μ = (μ1, μ2)T ,\nT(X) = ΦT (X -μ).\nThe transformation T translates the origin to μ and rotates the coordi-\nnate axes by an angle specified by Φ (whose elements are cosines/sines\nof the new coordinate axes relative to the original ones).\n2(a) Let φ1 be the orthonormal two-vector which maximizes V ar(φT\n1 X)\n- Solve for φ1.\n- Show that V ar(φT\n1 X) = λ1 in problem 1(a).\n2(b) Let φ2 be the orthonormal two-vector which minimizes V ar(φT\n2 X)\n- Solve for φ2\n- Show that V ar(φT\n2 X) = λ2 in problem 1(a).\n2(c) Provide an equivalent definition/specification of principal compo-\nnents analysis in terms of affine transformations of variables and\ntheir variances/expectations.\n\n3. Consider the daily yield rate data for constant maturity US Trea-\nsury securities, taken from the Federal Reserve Economic Database\n(FRED); see case study for the lecture on factor modeling. To analyze\nchanges in yields, the daily changes in yield, in basis point units; 1\nbasis point (BP) = 0.01 × 1% were computed for the 9 securities.\nTwo principal components analyses are conducted on the data for\n2001-2005, the first using the sample covariance matrix and the second\nusing the sample correlation matrix. The results are:\nUS Tresaury Yield Data:\n2001-2005\nPrincipal Components Analysis of Yield Changes Covariance Matrix\nSummary:\nImportance of components:\nComp.1\nComp.2\nComp.3\nComp.4\nComp.5\nStandard deviation\n0.1618033 0.05323436 0.02988340 0.01918045 0.013461432\nProportion of Variance 0.8494434 0.09194833 0.02897475 0.01193650 0.005879525\nCumulative Proportion\n0.8494434 0.94139169 0.97036644 0.98230294 0.988182464\nComp.6\nComp.7\nComp.8\nComp.9\nStandard deviation\n0.011196400 0.009568498 0.009009979 0.008131889\nProportion of Variance 0.004067397 0.002970621 0.002633948 0.002145570\nCumulative Proportion\n0.992249861 0.995220482 0.997854430 1.000000000\nLoadings:\nLoadings:\nComp.1 Comp.2 Comp.3 Comp.4 Comp.5 Comp.6 Comp.7 Comp.8 Comp.9\nDGS3MO\n0.109 -0.523\n0.543 -0.541\n0.211\n0.287\nDGS6MO\n0.158 -0.482\n0.251\n0.256 -0.258 -0.734\nDGS1\n0.253 -0.411\n0.669\n0.524 -0.167\nDGS2\n0.390 -0.207 -0.475\n0.453\n0.503\n0.285\n0.181\nDGS3\n0.420\n-0.402 -0.296\n-0.205 -0.555 -0.420 -0.190\nDGS5\n0.421\n0.108\n-0.210 -0.593\n0.184 -0.182\n0.478\n0.345\nDGS7\n0.401\n0.229\n0.148\n-0.217\n0.387\n-0.753\nDGS10\n0.370\n0.284\n0.271\n0.290 -0.619\n0.486\nDGS20\n0.310\n0.362\n0.394\n0.232\n0.529 -0.152 -0.375\n0.347\n\n--------------------------\nPrincipal Components Analysis of Yield Changes Correlation Matrix\nSummary:\nImportance of components:\nComp.1\nComp.2\nComp.3\nComp.4\nComp.5\nStandard deviation\n2.6327753 1.1887500 0.56497709 0.39691846 0.26927753\nProportion of Variance 0.7707849 0.1571400 0.03549501 0.01751896 0.00806317\nCumulative Proportion\n0.7707849 0.9279249 0.96341989 0.98093885 0.98900202\nComp.6\nComp.7\nComp.8\nComp.9\nStandard deviation\n0.207897889 0.148434327 0.13658957 0.122439822\nProportion of Variance 0.004806244 0.002450046 0.00207463 0.001667059\nCumulative Proportion\n0.993808264 0.996258311 0.99833294 1.000000000\nLoadings:\nLoadings:\nComp.1 Comp.2 Comp.3 Comp.4 Comp.5 Comp.6 Comp.7 Comp.8 Comp.9\nDGS3MO -0.208\n0.629\n0.583 -0.410\n0.228\nDGS6MO -0.283\n0.515\n0.490 -0.629\n0.118\nDGS1\n-0.337\n0.270 -0.407\n0.378\n0.664 -0.233\nDGS2\n-0.363\n-0.401 -0.360\n0.471 -0.377\n0.408 -0.216\nDGS3\n-0.366\n-0.272 -0.400 -0.161\n0.135\n0.343 -0.621\n0.284\nDGS5\n-0.367 -0.162\n-0.172 -0.192 -0.528\n0.430\n0.301 -0.468\nDGS7\n-0.361 -0.230\n0.144\n-0.278 -0.221\n0.347\n0.735\nDGS10\n-0.352 -0.266\n0.255\n0.126\n-0.175 -0.599 -0.475 -0.331\nDGS20\n-0.329 -0.334\n0.413\n0.338\n0.195\n0.552\n0.378\n3(a) Compare the loadings (eigen-vectors) of the first principal com-\nponent variable for the two cases. The loadings are all positive\nfor the covariance case and all negative for the correlation case.\nIs the difference in sign meaningful? (Hint: consider the eigen-\nvector/value decomposition of the matrices; does the decomposi-\ntion change if any eigen-vector is multiplied by -1?)\n3(b) The magnitudes of the loadings for the first principal component\nhas a larger range from smallest to largest for the covariance ma-\n\ntrix case compared to the correlation matrix case. The loading\non the least variable yield change (DGS3MO) is higher in mag-\nnitude for the correlation matrix case. Also, the loadings on the\nhighly variable yield changes are lower in magnitude for correla-\ntion matrix case.\nProvide a logical explanation for why the range of magnitudes\nis larger for the covariance case.\n(Recall that the first princi-\npal component variable is the normalized weighted average of\nthe yield-change variables which has the highest variance (the\nnormalized weights have sum-of-squares equal to 1). For the co-\nvariance matrix case, the yield-change variables are the original\nvariables while for the correlation matrix case, these yield-change\nvariables have been scaled to have mean 0 and variance 1.)\n3(c) Provide an interpretion of the first three principal component\nvariables for the correlation matrix case. Compare these to an\ninterpretation of those for the covariance matrix case.\n3(d) If the analysis objective is to model dynamics of the term-structure\nof interest rates across all tenors, argue why the principal com-\nponents analysis of the correlation matrix might be preferred to\nthat of the covariance matrix.\n4. For the correlation-matrix case of the principal components analysis\nin problem 3, an order-3 vector autoregression was fit to the first 3\nprincipal component variables (\"scores\"). The results are as follows:\nVAR Estimation Results:\n=========================\nEndogenous variables: Comp.1, Comp.2, Comp.3\nDeterministic variables: const\nSample size: 1245\nLog Likelihood: -5903.314\nRoots of the characteristic polynomial:\n0.4383 0.4383 0.3602 0.3529 0.3529 0.3364 0.3298 0.3298 0.1959\nCall:\nVAR(y = obj.princomp0.cor$scores[, 1:3], p = 3)\nEstimation results for equation Comp.1:\n\n=======================================\nComp.1 = Comp.1.l1 + Comp.2.l1 + Comp.3.l1 + Comp.1.l2 + Comp.2.l2 + Comp.3.l2 +\nEstimate Std. Error t value Pr(>|t|)\nComp.1.l1\n0.05268\n0.02835\n1.858\n0.0634\nComp.2.l1 -0.13399\n0.06451\n-2.077\n0.0380\nComp.3.l1 -0.13215\n0.13173\n-1.003\n0.3160\nComp.1.l2 -0.05296\n0.02833\n-1.869\n0.0618\nComp.2.l2 -0.05416\n0.06440\n-0.841\n0.4005\nComp.3.l2\n0.18253\n0.13138\n1.389\n0.1650\nComp.1.l3 -0.01690\n0.02820\n-0.599\n0.5490\nComp.2.l3\n0.01300\n0.06335\n0.205\n0.8375\nComp.3.l3\n0.08300\n0.13131\n0.632\n0.5274\nconst\n-0.01140\n0.07379\n-0.154\n0.8772\nResidual standard error: 2.603 on 1235 degrees of freedom\nMultiple R-Squared: 0.01337,\nAdjusted R-squared: 0.006181\nF-statistic:\n1.86 on 9 and 1235 DF,\np-value: 0.05411\nEstimation results for equation Comp.2:\n=======================================\nComp.2 = Comp.1.l1 + Comp.2.l1 + Comp.3.l1 + Comp.1.l2 + Comp.2.l2 + Comp.3.l2 +\nEstimate Std. Error t value Pr(>|t|)\nComp.1.l1 -0.020291\n0.012327\n-1.646\n0.100\nComp.2.l1\n0.138152\n0.028048\n4.926 9.55e-07\nComp.3.l1 -0.083300\n0.057279\n-1.454\n0.146\nComp.1.l2 -0.007222\n0.012320\n-0.586\n0.558\nComp.2.l2\n0.037021\n0.028001\n1.322\n0.186\nComp.3.l2 -0.019483\n0.057123\n-0.341\n0.733\nComp.1.l3 -0.008461\n0.012260\n-0.690\n0.490\nComp.2.l3 -0.040270\n0.027546\n-1.462\n0.144\nComp.3.l3\n0.014819\n0.057093\n0.260\n0.795\nconst\n0.012147\n0.032083\n0.379\n0.705\nResidual standard error: 1.132 on 1235 degrees of freedom\nMultiple R-Squared: 0.0288,\nAdjusted R-squared: 0.02173\n\nF-statistic:\n4.07 on 9 and 1235 DF,\np-value: 3.656e-05\nEstimation results for equation Comp.3:\n=======================================\nComp.3 = Comp.1.l1 + Comp.2.l1 + Comp.3.l1 + Comp.1.l2 + Comp.2.l2 + Comp.3.l2 +\nEstimate Std. Error t value Pr(>|t|)\nComp.1.l1 -0.0029211\n0.0060770\n-0.481\n0.6308\nComp.2.l1 -0.0142645\n0.0138269\n-1.032\n0.3024\nComp.3.l1\n0.0162730\n0.0282366\n0.576\n0.5645\nComp.1.l2 -0.0135254\n0.0060731\n-2.227\n0.0261\nComp.2.l2 -0.0037062\n0.0138035\n-0.268\n0.7884\nComp.3.l2 -0.0522528\n0.0281599\n-1.856\n0.0638\nComp.1.l3 -0.0019415\n0.0060438\n-0.321\n0.7481\nComp.2.l3 -0.0030298\n0.0135795\n-0.223\n0.8235\nComp.3.l3 -0.0711803\n0.0281452\n-2.529\n0.0116\nconst\n0.0001768\n0.0158157\n0.011\n0.9911\nResidual standard error: 0.558 on 1235 degrees of freedom\nMultiple R-Squared: 0.01317,\nAdjusted R-squared: 0.005976\nF-statistic: 1.831 on 9 and 1235 DF,\np-value: 0.05868\nCovariance matrix of residuals:\nComp.1\nComp.2\nComp.3\nComp.1 6.777587\n0.07254\n0.001976\nComp.2 0.072540\n1.28138 -0.013479\nComp.3 0.001976 -0.01348\n0.311395\nCorrelation matrix of residuals:\nComp.1\nComp.2\nComp.3\nComp.1 1.00000\n0.02462\n0.00136\nComp.2 0.02462\n1.00000 -0.02134\nComp.3 0.00136 -0.02134\n1.00000\n\n4(a) Interpret the estimation results for equation Comp.1\n4(b) Interpret the estimation results for equation Comp.2\n4(c) Interpret the estimation results for equation Comp.3\n4(d) For each equation, comment on whether there is evidence of\nmean-reversion or momentum in the model for the principal com-\nponent variable. Explain your reasoning.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Mathematical Applications in Financial Industry\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 8: Stochastic Calculus",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/20348102bc927284425e6d505495eb30_MIT18_S096F13_pset8.pdf",
      "content": "18.S096 Problem Set\nFall 2013\nDue date : 11/21/13\nCollaboration on homework is encouraged, but you should think through the problems yourself\nbefore discussing them with other people. You must write your solution in your own\nwords. Make sure to list all your collaborators.\nPart A\nPart A has problems that straightforwardly follow from the denition. Use this part as an\nopportunity to get used to the concepts and denitions.\nProblem A-1. Identify Martingales.\n(a) Simple random walk\n(b) The process Xt = |St|, where St is a simple random walk.\n(c) X0 = 0 and X\nt+1 = Xt + (Yt -\nStochastic Calculus\n) for t ≥0, where Yt are i.i.d. random variables with\nλ\nexponential distribution of parameter λ.\n(d) X0 = 0 and Xt+1 = Xt + ZtZt\n1 · Z0 for t ≥0, where Zt are i.i.d. random variables with\n-\nlog-normal distribution.\n(1)\n(2)\n(1)\n(2)\n(e) Xt = Bt\nBt\nwhere Bt\nand Bt\nare independent Brownian motions.\nProblem A-2. (a) Let B(t) be a Brownian motion. Compute\nE[B(t) | B(s)]\nand\nV[B(t) | B(s)],\nwhere t > s ≥0 are xed reals.\n(b) Let X(t) be a Brownian motion with drift μ. Compute\nE[X(t) | X(s)]\nand\nV[X(t) | X(s)],\nwhere t > s ≥0 are xed reals.\n(c) For a Brownian motion B and two xed reals t and s satisfying t > s, compute\nE[exp(σ(B(t) -B(s))].\nProblem A-3. Let Xt be a given stochastic process. Identify processes adapted to Xt among\nthe following stochastic processes Yt,.\n(a) Yt = XT\nt for t ≤T, for some xed T.\n-\n(b) Yt = max0≤x≤2t Xs.\n(c) Yt = |{i ∈[0, t] : Xi ≥0}|.\nProblem A-4. Use Ito's formula to compute the dierentials of the following functions (Bt\nis a Brownian motion):\n(a) f(t, Bt) = B3\nt .\n(b) f(t, Bt) = sin Bt.\n\n(c) f(t, Bt) = cos(t3 + B2\nt ).\n(d) f(t, Bt) = eB2\nt .\n(e) f(t, Bt) =\n\nB2\nt dBt.\n(f) f(t, Bt) =\n\nBtdt\n(g) f(t, Xt) = X2\nt , where dXt = μdt + σdBt (μ and σ are constants).\nProblem A-5. Let B(t) be a Brownian motion. Prove that B(t) and B(t)2 are not equivalent\nprobability distributions (two probability distributions P and Q are equivalent if for all sets\nX, P(X) > 0 if and only if Q(X) > 0).\nPart B\nPart B has more elaborate problems. Many of the problems in Part B cover important topics\nthat we did not have enough time to cover in lecture. Thus understanding the content is as\nimportant as solving the problem. Try to think through the content of the problem while\nsolving it.\nProblem B-1. Let Y (t) = (X1(t), X2(t)), where X1(t) and X2(t) are independent random\nBrownian motions (thus Y (t) is a 2-dimensional Brownian motion).\n(i) For a xed value of t, nd the probability density function of Y (t).\n(ii) Let Dρ = {x ∈R2 : |x| < ρ}, and compute P(Y (t) ∈Dρ).\nProblem B-2. Use Ito isometry to caculate EX2\nt , where\nXt =\nˆ t\nBsdBs.\nProblem B-3. (i) Prove the following integration by parts formula for Ito integral:\nˆ t\nt\nh(s)dBs = h(t)Bt\n-\nˆ\nh′(s)Bsds.\n(ii) By using part (i), prove that for each xed T, the random variable\nˆ T\nBsds\nhas normal distribution.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Mathematical Applications in Financial Industry\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 9: Stochastic Differential Equations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/c02bf5203e965227082b82fa1e59afa9_MIT18_S096F13_pset9.pdf",
      "content": "18.S096 Problem Set\nFall 2013\nDue date : 12/5/13 (no need to turn in)\nCollaboration on homework is encouraged, but you should think through the problems yourself\nbefore discussing them with other people. You must write your solution in your own\nwords. Make sure to list all your collaborators.\nPart A\nPart A has problems that straightforwardly follow from the denition. Use this part as an\nopportunity to get used to the concepts and denitions.\nProblem A-1.\nVerify that the given processes solve the given corresponding stochastic\ndierential equations.\n(a) Xt\nt\ndXt =\nXtdt + XtdBt.\n(b) X =\nBt\nt\nsolves\n1+t\ndXt = -\nXtdt +\ndBt.\n1 + t\n1 + t\n(c) Xt = sin Bt solves\ndX = -X dt +\nq\n1 -X2\nt\nt\nt dBt.\nProblem A-2. Let a > 0 and suppose that\n1/3\n2/3\ndXt =\nXt\ndt + X\nt\ndBt.\nShow that\nX = (a1/3\nt\n+\nBt)3\nt\n≥0,\nsolves the SDE given above when the initial condition is given as X0 = a.\nProblem A-3. (Vasicek interest rate model) Prove that\nα\nt\nR(t) = e-βtR(0) +\n(1 -e-βt) + σe-βt\nˆ\neβsdBs\nβ\nsolves the SDE\ndR(t) = (α -βR(t))dt + σdBt.\n= exp(B ) solves\nStochastic Differential Equations\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Mathematical Applications in Financial Industry\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Black-Scholes Formula & Risk neutral valuation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/d19208c017ada04f9261cfb41ab8d702_MIT18_S096F13_lecnote19.pdf",
      "content": "Risk Neutral Pricing\nBlack-Scholes Formula\nLecture 19\nDr. Vasily Strela\n(Morgan Stanley and MIT)\n\nRisk Neutral Valuation: Two-Horse Race Example\n-One horse has 20% chance to win another has 80%\nchance\n-$10000 is put on the first one and $50000 on the second\nIf odds are set 4-1:\n- Bookie may gain $10000 (if first horse wins)\n- Bookie may loose $2500 (if second horse wins)\n- Bookie expects to make 0.2 * (10000) + 0.8 * (-2500) = 0\nIf odds are set 5-1:\n- Bookie will not lose or gain money no matter which\nhorse wins\n\nRisk Neutral Valuation : Introduction\nForward Contract\n-100\n-50\n100 120 140 160 180 200\nF(t,S)\nF(T,S)\nWe are interested in finding prices of various derivatives.\nForward contract pays S-K at time T :\nS(t)=80, K=88.41, T=2 (years)\n\nRisk Neutral Valuation: Introduction\nEuropean Call Option\n-20\n100 120 140 160 180 200\nC(t,S)\nC(T,S)\nEuropean Call option pays max(S-K,0) at time T\nS(t)=80, K=80, T=2 (years)\n\nRisk Neutral Valuation: Introduction\nEuropean Put Option\n-10\n100 120 140 160 180 200\nP(t,S)\nP(T,S)\nEuropean Put option pays max(K-S,0) at time T\nS(t)=80, K=80, T=2 (years)\n\nRisk Neutral Valuation: Introduction\n-\nGiven current price of the stock and assumptions on the\ndynamics of stock price, there is no uncertainty about the\nprice of a derivative\n-\nThe price is defined only by the price of the stock and not\nby the risk preferences of the market participants\n-\nMathematical apparatus allows to compute current price\nof a derivative and its risks, given certain assumptions\nabout the market\n\nRisk Neutral Valuation: Replicating Portfolio\nConsider Forward contract which pays S-K in time dt. One\ncould think that its strike K should be defined by the \"real\nworld\" transition probability p:\np(S1-K)+(1-p)(S2-K)=pS1+(1-p)S2-K\nK0= pS1+(1-p)S2\nIf p=1/2, K0=(S1+S2)/2\n\nRisk Neutral Valuation: Replicating Portfolio\nConsider the following strategy:\n1. Borrow $S0 to buy the stock. Enter Forward\ncontract with strike K0\n2. In time dt deliver stock in exchange for K0 and\nrepay $S0erdt\n-\nIf K\nrdt\n0> S0e\nwe made riskless profit\nrdt\n\n-\nI\nK0\nerdt\nK\nf\n0< S0e\nwe definitely lost money\nS0\nCurrent price of a derivative claim is determined by\ncurrent price of a portfolio which exactly replicates the\npayoff of the derivative at the maturity\n\nRisk Neutral Valuation: One step binomial tree\nSuppose our economy includes stock S, riskless money\nmarket account B with interest rate r and derivative claim f.\nAssume that only two outcomes are possible in time dt:\nS0, B0, f0\nS2, B0erdt, f2\nS1, B0erdt, f1\np\n1-p\n\nRisk Neutral Valuation: One step binomial tree\nf\na\n1 f2\nS1 S2\n,b\nS1f2 S2 f1\n(S1 S2)B0erdt\nf0 erdt S0erdt f1 f2\nS1 S2\nS1 f2 S2 f1\nS1 S2\n\nFor a general derivative claim f, find a and b such that\nf =aS +bB erdt\nf2=aS2+bB0erdt\nThen\nf0=aS0+bB0\nEasy to see that\n\nRisk Neutral Valuation: One step binomial tree\nf0 erdt\nS\nf\n0erdt S2\nS1 S2\nf2\nS1 S0erdt\nS1 S2\n\nOne should notice that\nf0 = e-rdt(f1q + f2(1 - q))\nwhere\nq=(S erdt\n-S2)/(S1-S2), 0<q<1\nMoreover\nS1q+S2(1-q)= erdtS0\n\nRisk Neutral Valuation: Continuous case\nft=e-r(T-t)EQ[fT]\nQ is the risk neutral (martingale) measure under which\nS0=e-rtEQ[St]\n\nBlack-Scholes equation\ndt\nAssume that the stock has log-normal dynamics:\ndS = Sdt + SdW\nWhere dW is normally distributed with mean 0 and standard\ndeviation (i.e. W is a Brownian Motion)\nWe want to find a replicating portfolio such that\ndf = adS + bdB\n\nBlack-Scholes equation\nf\ndf (S,t)\n(dS)2 2S2dt\nt\ndt f\nS\ndS 1\n2 f\nS2\nUse Ito's formula:\n(dS)2\n(analogous to first order Taylor expansion, up to dt term)\n\nBlack-Scholes equation\nf\nt\nf\nS\nS 1\n2 f\nS2 2S2\n\ndt f\nS\nSdW (aS brB)dt aSdW\n2)\n(dS\na f\nS\n, brB f\nt\n2 f\nS2\ndf=adS+bdB\nSubstitute dS, df, dB=rBdt and\nCompare terms\n2S2\n\nBlack-Scholes equation\nf\ndf\nt\ndt f\nS\ndS 1\n2 f\nS2 2S2dt\nf\nt\n2 f\nS2 2S2 f\nS\nrS rf 0\na f\nS\nbB=f-aS is deterministic and as dB=rBdt\nd(f-aS)=r(f-aS)dt\nSubstituting once again\nand\nwe obtain the Black-Scholes equation\nFisher Black, Myron Scholes - paper 1973\nMyron Scholes, Robert Merton - Nobel Prize 1997\n\nBlack-Scholes equation\nu\n\n2u\nx2\n-\nAny tradable derivative satisfies the equation\n-\nThere is no dependence on actual drift\n-\nWe have a hedging strategy (replicating portfolio)\n-\nBy a change of variables Black-Scholes equation\ntransforms into heat equation\n\nBlack-Scholes equation\nC\nt\nC\nt\nS\n\nBoundary and final conditions are determined\nby the pay-off of a specific derivative\nFor European Call\nC(S,T)=max(S-K,0)\n(0, )\n0, ( , )\nFor European Put\nP(S,T)=max(K-S,0)\nP(0,t) Ker(T t), P(,t) 0\n\nBlack-Scholes equation\nN(x)\neu2/2\n\nx\n\ndu\nPt er(Tt) KN(d2)er(Tt)SN(d1)\n\nd1 ln(S / K)(r 2 / 2)(T t)\n\nT t\nCt er(Tt) er(Tt)SN(d1)KN(d2)\n\nFor European Call/Put the equation can be solved analytically\n\nln(S / K)(r 2 / 2)(T t)\nd2\n\nT t\nwhere\n\nBlack-Scholes: Risk Neutral Valuation\nPDF(ST )\nS 2T\nexp (ln(ST / St)(r 2 / 2)(T t))2\n22(T t)\n\nft=e-r(T-t)EQ[fT]\nQ is the risk neutral measure under which\ndS=rSdt+SdW\n\nBlack-Scholes equation\nFor more complicated options or more general\nassumptions numerical methods have to be used:\n-\nFinite difference methods\n-\nTree methods (equivalent to explicit scheme)\n-\nMonte Carlo simulations\n\nBlack-Scholes equation: Conclusions\nModern financial services business makes use of\n-\nPDE\n-\nNumerical methods\n-\nStochastic Calculus\n-\nSimulations\n-\nStatistics\n-\nMuch, much more\n\nRisk Neutral Valuation: Example\nSource: Bloomberg L.P.\n\nRisk Neutral Valuation: Example\nDigital option pays 1 if S>K at time T\nS(t)=80, K=80, T=2 (years)\nDigital Option\n-0.2\n0.2\n0.4\n0.6\n0.8\n1.2\n100 120 140 160 180 200\nD(t,S)\nD(T,S)\n\nDisclosures\nThe information herein has been prepared solely for informational purposes and is not an offer to buy or sell or a solicitation of an offer to buy or sell any security or instrument or to participate\nin any trading strategy. Any such offer would be made only after a prospective participant had completed its own independent investigation of the securities, instruments or transactions and\nreceived all information it required to make its own investment decision, including, where applicable, a review of any offering circular or memorandum describing such security or instrument,\nwhich would contain material information not contained herein and to which prospective participants are referred. No representation or warranty can be given with respect to the accuracy or\ncompleteness of the information herein, or that any future offer of securities, instruments or transactions will conform to the terms hereof. Morgan Stanley and its affiliates disclaim any and all\nliability relating to this information. Morgan Stanley, its affiliates and others associated with it may have positions in, and may effect transactions in, securities and instruments of issuers\nmentioned herein and may also perform or seek to perform investment banking services for the issuers of such securities and instruments.\nThe information herein may contain general, summary discussions of certain tax, regulatory, accounting and/or legal issues relevant to the proposed transaction.\nAny such discussion is\nnecessarily generic and may not be applicable to, or complete for, any particular recipient's specific facts and circumstances. Morgan Stanley is not offering and does not purport to offer tax,\nregulatory, accounting or legal advice and this information should not be relied upon as such. Prior to entering into any proposed transaction, recipients should determine, in consultation with\ntheir own legal, tax, regulatory and accounting advisors, the economic risks and merits, as well as the legal, tax, regulatory and accounting characteristics and consequences, of the transaction.\nNotwithstanding any other express or implied agreement, arrangement, or understanding to the contrary, Morgan Stanley and each recipient hereof are deemed to agree that both Morgan\nStanley and such recipient (and their respective employees, representatives, and other agents) may disclose to any and all persons, without limitation of any kind, the U.S. federal income tax\ntreatment of the securities, instruments or transactions described herein and any fact relating to the structure of the securities, instruments or transactions that may be relevant to understanding\nsuch tax treatment, and all materials of any kind (including opinions or other tax analyses) that are provided to such person relating to such tax treatment and tax structure, except to the extent\nconfidentiality is reasonably necessary to comply with securities laws (including, where applicable, confidentiality regarding the identity of an issuer of securities or its affiliates, agents and\nadvisors).\nThe projections or other estimates in these materials (if any), including estimates of returns or performance, are forward-looking statements based upon certain assumptions and are preliminary\nin nature. Any assumptions used in any such projection or estimate that were provided by a recipient are noted herein. Actual results are difficult to predict and may depend upon events outside\nthe issuer's or Morgan Stanley's control. Actual events may differ from those assumed and changes to any assumptions may have a material impact on any projections or estimates. Other events\nnot taken into account may occur and may significantly affect the analysis. Certain assumptions may have been made for modeling purposes only to simplify the presentation and/or calculation of\nany projections or estimates, and Morgan Stanley does not represent that any such assumptions will reflect actual future events. Accordingly, there can be no assurance that estimated returns or\nprojections will be realized or that actual returns or performance results will not be materially different than those estimated herein. Any such estimated returns and projections should be viewed\nas hypothetical. Recipients should conduct their own analysis, using such assumptions as they deem appropriate, and should fully consider other available information in making a decision\nregarding these securities, instruments or transactions. Past performance is not necessarily indicative of future results. Price and availability are subject to change without notice.\nThe offer or sale of securities, instruments or transactions may be restricted by law. Additionally, transfers of any such securities, instruments or transactions may be limited by law or the terms\nthereof. Unless specifically noted herein, neither Morgan Stanley nor any issuer of securities or instruments has taken or will take any action in any jurisdiction that would permit a public\noffering of securities or instruments, or possession or distribution of any offering material in relation thereto, in any country or jurisdiction where action for such purpose is required. Recipients\nare required to inform themselves of and comply with any legal or contractual restrictions on their purchase, holding, sale, exercise of rights or performance of obligations under any transaction.\nMorgan Stanley does not undertake or have any responsibility to notify you of any changes to the attached information.\nWith respect to any recipient in the U.K., the information herein has been issued by Morgan Stanley & Co. International Limited, regulated by the U.K. Financial Services Authority. THIS\nCOMMUNICATION IS DIRECTED IN THE UK TO THOSE PERSONS WHO ARE MARKET COUNTERPARTIES OR INTERMEDIATE CUSTOMERS (AS DEFINED IN THE UK\nFINANCIAL SERVICES AUTHORITY'S RULES).\nADDITIONAL INFORMATION IS AVAILABLE UPON REQUEST.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Topics in Mathematics with Applications in Finance\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Commodity Models",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/7ba72c0dc888b352d301736029456ee9_MIT18_S096F13_lecnote13.pdf",
      "content": "Commodity Modeling\nAlexander Eydeland\n\nMorgan Stanley\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\nLecture 13\n\nCommodity Modeling\n- The views represented herein are the\nauthor's own views and do not\nnecessarily represent the views of Morgan\nStanley or its affiliates, and are not a\nproduct of Morgan Stanley Research.\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nTrader benefits from low prices\nFirst reported 03/11/2009\nDow Jones & Company Inc\nTrafigura: May Have Best Earnings Ever In\nFiscal 2009\n\n- SINGAPORE -(Dow Jones)- International\ncommodities trading firm Trafigura Beheer B.V.\nis potentially on track to post its best results ever\nin fiscal 2009 on lower oil prices and contango\nmarkets, a company executive said Wednesday.\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nWTI futures contracts: Jan. 15, 2009\n\nSource: Bloomberg\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nTrading in Contango Markets\nFFeb'09 = 35 $/bbl FFeb'10 = 60 $/bbl\n\nStrategy: On Jan. 15, 2009\n- Borrow $35 Buy 1 bbl Store\n- Short Feb'10 futures contract (1 bbl)\n- Lock-in profit: $25 - Interest Payment\n- Interest Payment = $35*r\n- If r = 10%\nInterest Payment = $3.5/bbl Profit = $21.5/bbl\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nSummary: to generate profit\n- Needed asset (storage)\n- Needed strategy:\n- Long Feb'09 contract\n- Short Feb'10 contract\n- Or long Feb-Feb calendar spread\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nWhat if you need to lease storage from Aug to Dec\nHow much will you pay for this lease on Jan 1?\n\n- FAug = 55 $/bbl FDec = 58 $/bbl\n\nSource: Bloomberg\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nThis is what the trader will do\nOn Jan 1\n- Buy Aug/Dec spread:\n- Long Aug futures contract\n- Short Dec futures contract\n- On Aug 1\n- buy 1 bbl for $55/bbl and store it\n- Wait till Dec and then sell 1bbl for $58\n- Lock-in $3/bbl. Can pay for storage up to\n$3/bbl\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nThis is what the quant will do\n- On Jan 1 sell Aug/Dec spread option:\n\n- Exercise date Jul 31\n- Interest rates are ignored for simplicity\n(should not be)\n_\n_\nDec\nAug\nPayout\nat\nexercise\nF\nF\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nWhy is this better?\n- The value of this calendar spread option\n\n- V = 4.4677 $/bbl\nThe value is always greater than the spread because the spread is its intrinsic value\n\nDec\nAug\nV\nF\nN d\nF\nN d\nDiscFactor\n\nlog\n\nT\nd\nd\nT\nT\nF\nF\nd\nAug\nDec\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nThe benefit:\n- Storage bid can be increased to $4.46/bbl increasing the\nlikelihood of winning the deal. We can also keep a\ngreater profit.\n- Is there the risk? What if on Jul 31\nFAug = 65 $/bbl FDec = 80 $/bbl\nand we owe $15/bbl to the option holder\n\n- No worry: We have storage On Jul 31\nBuy Aug crude for 65 $/bbl and simultaneously\nSell Dec crude for 80 $/bbl using Dec futures contract\nLock-in $15 $/bbl to repay option holder\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nIn reality ...\n- Sell portfolio of spread option\n- Satisfy a number of physical constraints\n- Injection rates\n- Withdarawal rates\n- Do not inject more than max capacity\n- Do not withdraw from the empty tank\n- etc\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nStorage optimization\n- Find\n\n- - today's futures prices for contracts\nexpiring at times and\n- - volumes committed today for\ninjection at time , or withdrawal at\n,0\n,0\n,0\n}\n{\nmax\n,\n,\n,\n,\n,\n,\n,\n\nz\ny\nx\nF\nz\nF\ny\nU\nS\nx\nV\nj\ni\nj\ni\ni\nj\nj\nj\ni\ni\nj\ni\nj\ni\nj\ni\nj\ni\nz\ny\nx\n\nj\ni F\nF ,\niT\njT\nj\ni z\ny ,\niT\njT\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nStorage Optimization\n\n- - is the value of the option to inject at\ntime and withdraw at time\n\n- - is the value of the option to withdraw\nat time and inject at later time\n\n- - option volumes sold against the\nstorage today\nj\ni\nU ,\n\n,\nmax\n_\n_\nCost\nF\nF\nexercise\nat\nPayout\nj\ni\n\nj\niS ,\n\n,\nmax\n_\n_\nCost\nF\nF\nexercise\nat\nPayout\ni\nj\n\nj\ni\nj\ni\nv\nx\n,\n, ,\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nConstraints\n- Let's introduce Boolean \"in-the-money at\nexercise\" variables\n,\n,\n1 if option\nexpires in-the-money\n0 otherwise\ni j\nS\ni j\nS\n\n,\n,\n1 if option U\nexpires in-the-money\n0 otherwise\ni j\nU\ni j\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nConstraints\n- Injection constraints\n\n- Withdrawal constraints\n,\n,\n,\n,\n,\n,\n,\n,\n1,\n,\nS\nS\nU\nU\ni j\ni j\ni\ni j\ni\ni j\ni j\ni j\ni\ni\ni\ni j\ni\ni\ni j\nx\nx\nv\nv\ny\nz\nI\ni\nN\n\n,\n,\n,\n,\n,\n,\n,\n,\n1,\n,\nS\nS\nU\nU\ni j\ni j\ni\ni j\ni\ni j\ni j\ni j\ni\ni\ni\ni j\ni\ni\ni j\nx\nx\nv\nv\ny\nz\nW\ni\nN\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nConstraints\n- Maximum capacity constraints\n\n- Minimum capacity constraints\nmin\n,\n,\n,\n,\n1,\n,\nS\nU\nk j\nk j\nk j\nk j\nk\nk\ni\nk i\nj i\nj i\nC\nx\nv\ny\nz\nC\ni\nN\n\nmax\n,\n,\n,\n,\n1,\n,\nS\nU\nk j\nk j\nk j\nk j\nk\nk\ni\nk i\nj i\nj i\nC\nx\nv\ny\nz\nC\ni\nN\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nSolution\n\n- Approximation\n- Monte-Carlo simulation\n- Alternative approach: Stochastic control\n\nRene Carmona & Michael Ludkovski, 2010. \"Valuation of energy\nstorage: an optimal switching approach,\"Quantitative Finance, Taylor\nand Francis Journals, vol. 10(4), pages 359-374.\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nAdditional complications\n- There is no spread option market now: we\ncannot sell spread option directly\n- We must design a strategy of replicating\nselling the spread option\n- Similar to Black-Scholes delta-hedging\nstrategy\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nPower Plant\n- Spark Spread Option\n- Merchant Power Plant\n- Should be run if the market price of power is higher than the cost\nof fuel plus variable operating costs\nNet Profit from this operating strategy is:\n\nOperating a merchant power plant is financially equivalent to owning a\nportfolio of daily options on spreads between electricity and fuel (spark\nspread options)\n\n0,\n_\n_\nmax\nCosts\nVariable\nPrice\nRate\nHeat\nPrice\nFuel\nPower\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nProperties of energy prices\n- Behavior of energy prices is unique\n\nExample 1: Fat Tails of distributions\n\nSource: Eydeland, Wolyniec\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nProperties of energy prices\n\nExample 1: Fat Tails of distributions\n\nSource: Eydeland, Wolyniec\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nProperties of energy prices\n\nDistribution Parameters (A. Werner, Risk Management\nin the Electricity Market, 2003) Annual. Volatility\nAnnual.\nVolatility Skewness\nSkewness Kurtosis Kurtosis Nord Pool\nNord Pool 182%\n182% 1.468\n1.468 26.34\n26.34 NP 6.p.m.\nNP 6.p.m. 238%\n238% 2.079\n2.079 76.82\n76.82 DAX\nDAX 23%\n23% 0.004\n0.004 3.33\n3.33\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nSpecial properties of electricity prices: spikes, high volatility\nSource: Eydeland, Wolyniec\n\nERCOT Prices\n0.00\n50.00\n100.00\n150.00\n200.00\n250.00\n300.00\n350.00\n400.00\n7/24/1998\n12/6/1999\n4/19/2001\n9/1/2002\n1/14/2004\nTrade Date\nPrices ($/MWh)\nSeries1\nERCOT Volatility\n7/24/1998\n12/6/1999\n4/19/2001\n9/1/2002\n1/14/2004\nTrade Date\nSeries1\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nNEPOOL Prices\n0.00\n50.00\n100.00\n150.00\n200.00\n250.00\n300.00\n350.00\n400.00\n450.00\n7/24/1998\n12/6/1999\n4/19/2001\n9/1/2002\n1/14/2004\nTrade Date\nPrices ($/MWh)\nSeries1\nNEPOOL Volatility\n7/24/1998\n12/6/1999\n4/19/2001\n9/1/2002\n1/14/2004\nTrade Date\nSeries1\nSpecial properties of electricity prices\n\nSource: Eydeland, Wolyniec\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nSpecial properties of electricity prices\n\nSource: Eydeland, Wolyniec\nPJM Prices\n0.00\n50.00\n100.00\n150.00\n200.00\n250.00\n300.00\n350.00\n400.00\n450.00\n500.00\n7/24/1998\n12/6/1999\n4/19/2001\n9/1/2002\n1/14/2004\nTrade Date\nPrices ($/MWh)\nSeries1\nPJM Volatility\n7/24/1998\n12/6/1999\n4/19/2001\n9/1/2002\n1/14/2004\nTrade Date\nSeries1\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nBehavior of power prices\n- Mean reversion\n- spikes\n- high kurtosis\n- regime switching\n- lack of data\n- non-stationarity\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nJoint distribution: power/NG\ncorrelation structure\n\nCorrelation between power and gas also has unique structure. If the\nmodel does not capture this structure, it may misprice spread\noptions (tolling contracts, power plants, etc.)\n\nSource: Eydeland, Wolyniec\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nModels\nt\nt\nt\nt\ndS\nS dt\nS dW\n\nlog\nt\nt\nt\nt\ndS\nS\ndt\ndW\nS\n\nt\nt\nt\nt\nt\ndS\nk dt\ndW\nY\ndq\nS\n\nlog\nt\nt\nt\nt\nt\nt\ndS\nk\nS dt\ndW\nY\ndq\nS\n\n- Spot Processes\n- GBM\n\n- GBM with mean reversion\n\n- + jumps\n\n- + jumps and\nmean reversion\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nMore complicated models\n- Models with stochastic convenience yield\n- Models with stochastic volatility\n- Regime switching models\n- Models with multiple jump processes\n- Various term structure models\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nSpot Precesses: Cons\nDifficult to use for power products due to non-storability:\n\n- No no-arbitrage argument\n- How to price forward contracts and options?\n- In the case of storable commodities (NG, CL) we need\nconvenience yield.\n- Calibration is difficult to implement due to overlapping data.\n- Cannot model the correlation structure between forward\ncontracts.\n- Cannot model complex volatility structures.\n- Spot processes without jumps or stochastic volatility generate\nunrealistic power price distributions.\n- Cannot capture complex power/gas correlation structure.\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nA different approach\nHybrid Model: Stack Method\nPrice formation mechanism: Bid stack\n\nGenerator 1.\n\nPrice ($/MWh) 20\n\nVolume (MWh)\n\nGenerator 2.\n\nPrice ($/MWh) 18\n\nVolume (MWh)\n\nSource: Eydeland, Wolyniec\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nHybrid Models: Stack Method\nBid stack:\nPrice ($/MWh)\n18 20 25 30 35 40 50 100\nVolume (MWh) 100 150 200 300 500 600 800 1100\nSource: Eydeland, Wolyniec\nPt=Sbid(Dt)\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nDrivers:\n1. Demand\n\nSource: Eydeland, Wolyniec\n\n2. Fuel Prices\n3. Outages\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nHow to build the bid stack?\n\n1. Fuel + Outages Generation Stack\n\n2. Generation stack Bid Stack\n\nTransformation at step 2 matches market data and\npreserves higher moments of price distribution\n(skewness, kurtosis)\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nFuel Model\nGroup 1\n-\nNatural Gas\n-\n#2 Heating Oil\n-\n#6 Fuel Oil (with different sulfur\nconcentration)\n-\nCoal\n-\nJet Fuel\n-\nDiesel\n-\nMethane\n-\nLiquefied Natural Gas (LNG)\n-\nEtc.\nGroup 2\n-\nNuclear\n-\nHydro\n-\nSolar\n-\nWind\n-\nBiomass\n-\nEtc.\nPrices of Group 1 fuels are modeled using term structure models, matching\nforward prices, option prices and correlation structure\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nOutage Model\nStandard process (e.g., Poisson) utilizing\nEFOR (Equivalent Forced Outage Rate)\n\nAs a result for each time T we have an outage\nvector\n\nT=(T,1, ..., T,L )\nT,i=1 if at time T the unit I is experiencing forced outages\nT,i=0 otherwise\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nDemand\nDemand can be modeled as a function of\ntemperature\n\nTemperature evolution process:\n\ni.\nevolution of the principal modes\n\nii. evolution of the daily perturbations\n( ,\n)\nt\nt\nD\nd t\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nPower Prices\n\nThe constants chosen to match market data\n\n(\n)\n(\n;\n,\n,\n,\n,\n,\n)\nbid\ngen\nT\nT\nT\nT\nT\nT\nT\nT\nT\nP\ns\nD\ns\nD\nT U\nE VOM\nC\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nJustification\nSource: Eydeland, Wolyniec\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nJustification: PJM Prices - actual vs. model\nSource: Eydeland, Wolyniec\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nJustification\nSkewness and kurtosis of PJM price\ndistribution: model vs. empirical data\n\nSkewness\nKurtosis\n\nModel Empirical Model Empirical\n\ndata\ndata\ndata data\nSummer 2000 3.58\n3.17\n\n4.77\n4.89\nSummer 2001 18.13\n14.65\n25.83 26.46\nWinter 2000 .68\n1.32\n2.02\n1.19\nWinter 2001 .18\n1.54\n\n5.48\n1.98\n\nSource: Eydeland, Wolyniec\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nSimulated correlation structure\nSource: Eydeland, Wolyniec\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nvs actual correlation structure\n\nSource: Eydeland, Wolyniec\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nReferences\n- Eydeland, Alexander and Krzysztof Wolyniec,\nEnergy and Power Risk Management: New\nDevelopments in Modeling, Pricing and\nHedging, Wiley, 2002\n\n- Eydeland, Alexander and Helyette Geman.\n\"Fundamentals of Electricity Derivatives.\"\nEnergy Modelling and the Management of\nUncertainty. RISK Books, 1999.\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nDisclosures\nThe information herein has been prepared solely for informational purposes and is not an offer to buy or sell or a solicitation of an offer to buy or sell any security or instrument or to\nparticipate in any trading strategy. Any such offer would be made only after a prospective participant had completed its own independent investigation of the securities, instruments or\ntransactions and received all information it required to make its own investment decision, including, where applicable, a review of any offering circular or memorandum describing such\nsecurity or instrument, which would contain material information not contained herein and to which prospective participants are referred. No representation or warranty can be given with\nrespect to the accuracy or completeness of the information herein, or that any future offer of securities, instruments or transactions will conform to the terms hereof. Morgan Stanley and\nits affiliates disclaim any and all liability relating to this information. Morgan Stanley, its affiliates and others associated with it may have positions in, and may effect transactions in,\nsecurities and instruments of issuers mentioned herein and may also perform or seek to perform investment banking services for the issuers of such securities and instruments.\n\nThe information herein may contain general, summary discussions of certain tax, regulatory, accounting and/or legal issues relevant to the proposed transaction. Any such discussion is\nnecessarily generic and may not be applicable to, or complete for, any particular recipient's specific facts and circumstances. Morgan Stanley is not offering and does not purport to offer\ntax, regulatory, accounting or legal advice and this information should not be relied upon as such. Prior to entering into any proposed transaction, recipients should determine, in\nconsultation with their own legal, tax, regulatory and accounting advisors, the economic risks and merits, as well as the legal, tax, regulatory and accounting characteristics and\nconsequences, of the transaction.\n\nNotwithstanding any other express or implied agreement, arrangement, or understanding to the contrary, Morgan Stanley and each recipient hereof are deemed to agree that both Morgan\nStanley and such recipient (and their respective employees, representatives, and other agents) may disclose to any and all persons, without limitation of any kind, the U.S. federal income\ntax treatment of the securities, instruments or transactions described herein and any fact relating to the structure of the securities, instruments or transactions that may be relevant to\nunderstanding such tax treatment, and all materials of any kind (including opinions or other tax analyses) that are provided to such person relating to such tax treatment and tax structure,\nexcept to the extent confidentiality is reasonably necessary to comply with securities laws (including, where applicable, confidentiality regarding the identity of an issuer of securities or its\naffiliates, agents and advisors).\n\nThe projections or other estimates in these materials (if any), including estimates of returns or performance, are forward-looking statements based upon certain assumptions and are\npreliminary in nature. Any assumptions used in any such projection or estimate that were provided by a recipient are noted herein. Actual results are difficult to predict and may depend\nupon events outside the issuer's or Morgan Stanley's control. Actual events may differ from those assumed and changes to any assumptions may have a material impact on any\nprojections or estimates. Other events not taken into account may occur and may significantly affect the analysis. Certain assumptions may have been made for modeling purposes only\nto simplify the presentation and/or calculation of any projections or estimates, and Morgan Stanley does not represent that any such assumptions will reflect actual future events.\nAccordingly, there can be no assurance that estimated returns or projections will be realized or that actual returns or performance results will not be materially different than those\nestimated herein. Any such estimated returns and projections should be viewed as hypothetical. Recipients should conduct their own analysis, using such assumptions as they deem\nappropriate, and should fully consider other available information in making a decision regarding these securities, instruments or transactions. Past performance is not necessarily\nindicative of future results. Price and availability are subject to change without notice.\nThe offer or sale of securities, instruments or transactions may be restricted by law. Additionally, transfers of any such securities, instruments or transactions may be limited by law or the\nterms thereof. Unless specifically noted herein, neither Morgan Stanley nor any issuer of securities or instruments has taken or will take any action in any jurisdiction that would permit a\npublic offering of securities or instruments, or possession or distribution of any offering material in relation thereto, in any country or jurisdiction where action for such purpose is required.\nRecipients are required to inform themselves of and comply with any legal or contractual restrictions on their purchase, holding, sale, exercise of rights or performance of obligations under\nany transaction. Morgan Stanley does not undertake or have any responsibility to notify you of any changes to the attached information.\n\nWith respect to any recipient in the U.K., the information herein has been issued by Morgan Stanley & Co. International Limited, regulated by the U.K. Financial Services Authority. THIS\nCOMMUNICATION IS DIRECTED IN THE UK TO THOSE PERSONS WHO ARE MARKET COUNTERPARTIES OR INTERMEDIATE CUSTOMERS (AS DEFINED IN THE UK\nFINANCIAL SERVICES AUTHORITY'S RULES).\n\nADDITIONAL INFORMATION IS AVAILABLE UPON REQUEST.\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Topics in Mathematics with Applications in Finance\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Factor Modeling",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/3c8e688538b350a73a8c1cd46056fc5a_MIT18_S096F13_lecnote15.pdf",
      "content": "Factor Models\nFactor Models\nMIT 18.S096\nDr. Kempthorne\nFall 2013\nMIT 18.S096\nLecture 15:\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nOutline\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nLinear Factor Model\nData:\nm assets/instruments/indexes: i = 1, 2, . . . , m\nn time periods: t = 1, 2, . . . , n\nm-variate random vector for each time period:\nxt = (x1,t, x2,t, . . . , xm,t)′\nE.g., returns on m stocks/futures/currencies;\ninterest-rate yields on m US Treasury instruments.\nFactor Model\nxi,t\n=\nαi + β1,if1,t + β2,if2,t + · · · + βk,ifk,t + εi,t\n=\nαi + β′\nift + εi,t\nwhere\nαi: intercept of asset i\nft = (f1,t, f2,t, . . . , fK,t)′: common factor variables at period t (constant over i)\nβi = (β1,i, . . . , βK,i)′: factor loadings of asset i (constant over t)\nεi,t: the specific factor of asset i at period t.\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nLinear Factor Model\nLinear Factor Model: Cross-Sectional Regressions\nxt = α + Bft + εt,\nfor each\nt ∈{1, 2 . . . , T}, where\nα1\nα2\nα =\n.\n(m\n1); B =\n.\n×\nβ′\nε ,\n\n1 t\n\nβ2\n′\n\n.\nαm\n\n..\n\n.\nβ′\n\nm\n=\n\nβi,k\n\nε2,t\n\n(m × K); εt =\n\n.\n1)\n..\nε\n\nm,\n\n(m ×\nt\nα and B are the same for all t.\n{ft} is (K-variate) covariance stationary I(0) with\nE[ft]\n=\nμf\nCov[ft]\n=\nE[(ft -μf )(ft -μf )′] = Ωf\n{εt} is m-variate white noise with:\nE[εt]\n=\n0m\nCov[εt]\n=\nE[εtε′\nt] = Ψ\nCov[εt, εt′]\n=\nE[εtε′ ] = 0\nt′\n∀t = t′\nΨ is the (m × m) diagonal matrix with entries (σ2, σ2, . . . , σ2 ) where\nm\nσ2 = var(ε\ni\ni,t), the variance of the ith asset specific factor.\nThe two processes {ft} and {εt} have null cross-covariances:\nE[(ft -μf )(εt′ -0m)′] =\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nLinear Factor Model\nSummary of Parameters\nα: (m × 1) intercepts for m assets\nB: (m × K) loadings on K common factors for m assets\nμf : (K × 1) mean vector of K common factors\nΩf : (K × K) covariance matrix of K common factors\nΨ = diag(σ2, . . . , σ2\nm): m asset-specific variances\nFeatures of Linear Factor Model\nThe m-variate stochastic process {xt} is a\ncovariance-stationary multivariate time series with\nConditional moments:\nE[xt | ft]\n=\nα + Bft\nCov[xt | ft]\n=\nΨ\nUnconditional moments:\nE[xt]\n=\nμx\n=\nα + Bμf\nCov[xt]\n=\nΣx\n=\nBΩf B′ + Ψ\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nLinear Factor Model\nLinear Factor Model: Time Series Regressions\nxi = 1Tαi + Fβi + εi,\nfor each\n\nasseti ∈{1, 2 .. . , m},\nε\nwhere\nx\n· ·\nf\n\nx =\n\ni,1\nf′\n\n.\n\n..\n\nf\nf\n·\ni\nxi,t\ni =\n.\n\nε\n\ni,t\n\n1,\n..\n\nK,1\n..\n\n2,1\n.\n.\n.\n.\n.\n.\n.\n.\n\n.\n\n.\n\n.\n.\n.\n.\n\nεi,t\n′\n.\n\n=\nft\n.\n..\nT\n\nF\n\n.\n.\n..\nx1,\nεi,T\n\nf′\n\n= f1,t\nf2,t\n· · ·\nfK,t\n\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n.\n\nf1,T\nf2,T\n· · ·\nf\nT\nK,T\n\nαi and βi = (β1,i, . . . , βK,i) are regression parameters.\nεi is the T-vector of regression errors with Cov(εi) = σ2\ni IT\nLinear Factor Model: Multivariate Regression\nX = [x1| · · · |xm], E = [ε1| · · · |εm], B = [β1| · · · |βm],\nX = 1Tα′ + FB + E\n(note that B equals the transpose of cross-sectional B)\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nOutline\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nMacroeconomic Factor Models\nSingle Factor Model of Sharpe (1970)\nxi,t = αi + βiRMt + εi,t i = 1, . . . , m\nt = 1, . . . , T\nwhere\nRMt is the return of the market index in excess of the\nrisk-free rate; the market risk factor.\nxi,t is the return of asset i in excess of the risk-free rate.\nK = 1 and the single factor is f1,t = RMt.\nUnconditional cross-sectional covariance matrix of the assets:\nCov(xt) = Σx = σ2\nMββ′ + Ψ where\nσ2\nM = Var(RMt)\nβ = (β1, . . . , βm)′\nΨ = diag(σ2\n1, . . . , σ2\nm)\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nEstimation of Sharpe's Single Index Model\nSingle Index Model satisfies the Generalized Gauss-Markov\nassumptions so the least-squares estimates (αˆi, βˆi) from the\ntime-series regression for each asset i are best linear unbiased\nestimates (BLUE) and the MLEs under Gaussian assumptions.\nx\nˆ\ni = 1Tαˆi + RMβi + ˆεi\nUnbiased estimators of remaining parameters:\nσˆ2\ni = (ˆε′\niˆεi)/(T -2)\nˆσ2\nM = [PT\nt=1(RMt - RM)2]/(T -1) with RM = (PT\nt=1 RMt)/T\nΨˆ = diag(σˆ2\n1, . . . , σˆ2\nm)\nEstimator of unconditional covariance matrix:\nCov\n\\\n(xt) = Σˆ x = σˆ2 ˆ\nMββˆ′ + Ψˆ\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nMacroeconomic Multifactor Model\nThe common factor variables {ft} are realized values of macro\necononomic variables, such as\nMarket risk\nPrice indices (CPI, PPI, commodities) / Inflation\nIndustrial production (GDP)\nMoney growth\nInterest rates\nHousing starts\nUnemployment\nSee Chen, Ross, Roll (1986). \"Economic Forces and the Stock Market\"\nLinear Factor Model as Time Series Regressions\nxi = 1Tαi + Fβi + εi,\nwhere\nF = [f1, f2, . . . fT]′ is the (T × K) matrix of realized values of\n(K > 0) macroeconomic factors.\nUnconditional cross-sectional covariance matrix of the assets:\nCov(xt) = BΩf B′ + Ψ\nwhere B = (β1, . . . , βm)′ is (m × K)\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nEstimation of Multifactor Model\nMultifactor model satisfies the Generalized Gauss-Markov\nassumptions so the least-squares estimates αˆi and βˆi\n(K × 1)\nfrom the time-series regression for each asset i are best linear\nunbiased estimates (BLUE) and the MLEs under Gaussian\nassumptions.\nx\nβˆ\ni = 1Tαˆi + F\ni + ˆεi\nUnbiased estimators of remaining parameters:\nˆσ2\ni = (ˆε′\niˆεi)/[T -(k + 1)]\nΨˆ = diag(σˆ2\n1, . . . , σˆ2\nm)\nΩˆ f = [PT\nt=1(ft - f)(Pft - f)′]/(T -1)\nwith f\nT\n= (\nt=1 ft)/T\nEstimator of unconditional covariance matrix:\nCov\n\\\n(xt) = Σˆ\n2 ˆ ˆ ˆ\nˆ\nx = σˆ BΩf B\n′\nM\n+ Ψ\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nOutline\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nFundamental Factor Models\nThe common-factor variables {ft} are determined using\nfundamental, asset-specific attributes such as\nSector/industry membership.\nFirm size (market capitalization)\nDividend yield\nStyle (growth/value as measured by price-to-book,\nearnings-to-price, ...)\nEtc.\nBARRA Approach (Barr Rosenberg)\nTreat observable asset-specific attributes as\nfactor betas\nFactor realizations {ft} are unobservable, but\nare estimated.\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nFama-French Approach (Eugene Fama and Kenneth French)\nFor every time period t, apply cross-sectional\nsorts to define factor realizations\nFor a given asset attribute, sort the assets at\nperiod t by that attribute and define quintile\nportfolios based on splitting the assets into 5\nequal-weighted portfolios.\nForm the hedge portfolio which is long the top\nquintile assets and short the bottom quintile\nassets.\nDefine the common factor realizations for period\nt as the period-t returns for the K hedge\nportfolios corresponding to the K fundamental\nasset attributes.\nEstimate the factor loadings on assets using time\nseries regressions, separately for each asset i.\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nBarra Industry Factor Model\nSuppose the m assets (i = 1, 2, . . . , m) separate into K\nindustry groups (k = 1, . . . , K)\nFor each asset i, define the factor loadings (k = 1, . . . K)\nif asset i is in industry group k\nβi,k =\notherwise\nThese loadings are time invariant.\nFor time period t, denote the realization of the K factors as\nft = (f1t, . . . , fKt)′\nThese K-vector realizations are unobserved.\nThe Industry Factor Model is\nXi,t = βi,1f1t + · · · + βi,KfKt + εit, ∀i, t\nwhere\nvar(ε\nit)\n=\nσ ,\ni\n∀i\ncov(εit, fkt)\n=\n0,\n∀i, k, t\ncov(fk′t, fkt)\n=\n[Ωf ]k′,k,\n∀k′, k, t\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nBarra Industry Factor Model\nEstimation of the Factor Realizations\nFor each time period t consider the cross-sectional regression for\nthe factor model:\nxt = Bft + εt\n(α = 0 so it does not appear)\nwith\nxt =\nx1,t\n\nβ1\n′\n\nε1,t\n\nx2,t\n\nβ′\n\nε2,t\n\n.\n\n(m × 1); B =\n.\n=\nβi,k\n(m\nε\n1)\n.\n× K);\nt =\n.\n\n.\n\n(m\n.\n×\n.\n.\nm\n\n.\nx\n,t\nβ′\n\nm\nεm,t\n\nwhere E[εt] = 0m, E[εtε′\nt] = Ψ, and Cov(ft) = Ωf\n\n.\n\nCompute ˆft by least-squares regression of xt on B with regression parameter ft.\nB is (m × K) matrix of indicator variables (same for all t)\nB′B = diag(m1, . . . mK ),\nwhere mk is the count of assets i in industry k, and PK\nk=1 mk = m.\nˆft = (B′B)-1B′xt (vector of industry averages!)\nˆεt = xt -Bˆft\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nBarra Industry Factor Model\nEstimation of Factor Covariance Matrix\nΩˆ f =\nT-1\nPT\nt=1(ˆft - ˆf)(ˆft - ˆf)′\nˆf = 1\nf\nT\nPT\nˆ\nt=1\nt\nEstimation of Residual Covariance Matrix Ψˆ\nΨˆ = diag(σˆ2\n1, . . . , σˆ2\nm)\nwhere\nσˆ2\ni\n=\nT-1\nPT\nt=1[ˆεi,t - ˆεi]2\nˆεi\n=\nT\nT\nP\nt=1 εˆi,t\nEstimation of Industry Factor Model Covariance Matrix\nΣˆ = B′Ωˆ f B + Ψˆ\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nBarra Industry Factor Model\nFurther Details\nInefficiency of least squares estimates due to\nheteroscedasticity in Ψ.\nResolution: apply Generalized Least Squares (GLS) estimating\nΨ in the cross-sectional regressions.\nThe factor realizations can be rescaled to represent factor\nmimicking portfolios\nThe Barra Industry Factor Model can be expressed as a\nseemingly unrelated regression (SUR) model\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nOutline\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nStatistical Factor Models\nThe common-factor variables {ft} are hidden (latent) and their\nstructure is deduced from analysis of the observed returns/data\n{xt}. The primary methods for extraction of factor structure are:\nFactor Analysis\nPrincipal Components Analysis\nBoth methods model the Σ, the covariance matrix of\n{xt, t = 1, . . . , T} by focusing on the sample covariance matrix Σˆ,\ncomputed as follows:\nX = [x1 : · · · xT] (m × T)\nX∗= X · (IT -1\nT 1T1′\nT) ('de-meaned' by row)\nˆΣx = 1 X\nT\n∗(X∗)′\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nFactor Analysis Model\nLinear Factor Model as Cross-Sectional Regression\nxt = α + Bft + εt,\nfor each t ∈{1, 2 . . . , T} ( m equations expressed in vector/matrix form) where\nα and B are the same for all t.\n{ft} is (K-variate) covariance stationary I(0) with E[ft] = μf , Cov[ft] = Ωf\n{εt} is m-variate white noise with E[εt] = 0m and Cov[ε\nt] = Ψ = diag(σ )\ni\nInvariance to Linear Tranforms of ft\nFor any (K × K) invertible matrix H define\nf∗\nt = Hft and B∗= BH-1\nThen the linear factor model holds replacing ft and B\nxt\n=\nα + B∗f∗\nt + εt = α + BH-1Hft + εt\n=\nα + Bft + εt\nand replacing μf and Ωf with\nΩ∗\nf = Cov(f∗\nt ) = Cov(Hft) = HCov(ft)H′ = HΩf H′\nμ∗\nf = Hμf\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nFactor Analysis Model\nStandard Formulation of Factor Analysis Model\nOrthonormal factors: Ωf = IK\nThis is achieved by choosing H = ΓΛ-1\n2 , where\nΩf = ΓΛΓ′ is the spectral/eigen decomposition\nwith orthogonal (K × K) matrix Γ and diagonal matrix\nΛ = diag(λ1, . . . , λK), where λ1 ≥λ2 ≥· · · ≥λK > 0.\nZero-mean factors: μf = 0K\nThis is achieved by adjusting α to incorporate the mean\ncontribution from the factors:\nα∗= α + Bμf\nUnder these assumptions the unconditional covariance matrix is\nCov(xt) = Σx = BB′ + Ψ\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nFactor Analysis Model\nMaximum Likelihood Estimation\nFor the model\nxt = α + Bft + εt\nα and B are vector/matrix constants.\nAll random variables are Normal/Gaussian:\nxt i.i.d. Nm(α, Σx)\nft i.i.d. NK(0KIK)\nεt i.i.d. Nm(0m, Ψ)\nCov(xt) = Σx = BB′ + Ψ\nModel Likelihood\nL(α, Σx)\n=\npQ(x1, . . . , xT | α, Σ)\nT\n=\nQt=1[p(xt | α, Σ)]\nT\n=\nt=1[(2π)-m/2|Σ|-2 exp\n-1(xt\nα) Σ\n1(xt\nα) ]\nT\nTm\n-\n′\n-\nx\n-\n=\n(2π)-\n/2|Σ|-\n\n2 exp\nh\n-1\nPT\nt=1(xt -α)′Σ-1\nx (xt -α)\ni\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nFactor Analysis Model\nLog Likelihood of the Factor Model\nl(α, Σx)\n=\nlog L(α, Σx)\n=\n-TK\n2 log(2π) -K\n2 log(|Σ|)\n-1\nT\nP\nt=1(xt -α)′Σ-1\nx (xt -α)\nMaximum Likelihood Estimates (MLEs)\nThe MLEs of α, B, Ψ are the values which\nMaximize l(α, Σx)\nSubject to: Σx = BB′ + Ψ\nThe MLEs are computed numerically applying the\nExpectation-Maximization (EM) algorithm*\n* Optional Reading: Dempster, Laird, and Rubin (1977), Rubin and Thayer (1983).\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nFactor Analysis Model\nML Specification of the Factor Model\nApply EM algorithm to compute αˆ and Bˆ and Ψˆ .\nEstimate factor realizations {ft}\nApply the cross-sectional regression models for each time\nperiod t:\nxt -αˆ = Bˆft + ˆεt\nSolving for ˆf as the regression parameter estimates of the\nregression of observed xt on the estimated factor loadings\nmatrix. Taking account of the heteroscedasticity in ε, apply\nGLS estimates:\nˆf = [Bˆ ′\nΨˆ -ˆ\nt\nB]-1[Bˆ ′Ψˆ -1(xt -αˆ)]\n(Optional) Consider coordinate rotations of orthonormal\nfactors as alternate interpretations of model.\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nFactor Analysis Model\nFurther Details of ML Specification\nEstimated factor realizations can be rescaled to represent\nfactor mimicking portfolios\nLikelihood Ratio test can be applied to test for the number of\nfactors.\nTest Statistic: LR(K) = 2[l(α , Σ)\n-l(αˆ, Bˆ, Ψ)]\nˆ\nwhere H0: K factors are sufficient to model Σ and\nα and Σ are the MLEs with no factor-model restrictions.\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nOutline\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nPrincipal Components Analysis (PCA)\nAn m-va\nriate random variable:\nx =\nx1\n\n...\n\n, with E[x] = α ∈Rm, and Cov[x] = Σ (m × m)\nxm\nEigenvalues/eigenvectors of Σ:\nλ1 ≥λ2 ≥· · · ≥λm ≥0: m eigenvalues.\nγ1, γ2, . . . , γm: m orthonormal eigenvectors:\nΣγi\n=\nλiγi,\ni = 1, . . . , m\nγ′\niγi\n=\n1,\n∀i\nγ′\niγi\n=\n0,\n′\n∀i = i′\nΣ = Pm\ni=1 λiγiγ′\ni\nPrincipal Component Variables:\npi = γ′\ni(x -α),\ni = 1, . . . , m\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nPrincipal Components Analysis\nPrincipal Components in Vector/Matrix Form\nm-Variate x :\nE[x] = α, Cov[x] = Σ\nΣ = ΓΛΓ′, where\nΛ\n=\ndiag(λ1, λ2, . . . , λm)\nΓ\n=\n[γ1 : γ2 : · · · : γm]\nΓ′Γ\n=\nIm\np\np1\n=\n..\n), m\n.\n\n= Γ′(x -α\n-Variate PC variables\npm\nE[p]\n=\nE[Γ′(x -α)] = Γ′E[(x -E[x])] = 0m\nCov[p]\n=\nCov[Γ′(x -α)] = Γ′Cov[x]Γ\n=\nΓ′ΣΓ = Γ′(ΓλΓ′)Γ = Λ\np is a vector of zero-mean, uncorrelated random variables that\nprovides an orthogonal basis for x.\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nPrincipal Components Analysis\nm-Variate x in Principal Components Form\nx\nx =\n\n..\n\n= α + Γp, where E[p] = 0m, Cov[p] = Λ\n.\nxm\nPartition Γ = [Γ1Γ2] where Γ1 corresponds to the K (< m)\nlargest eigenvalues of Σ.\np\nPartition p =\n\np2\n\nwhere p1 contains the first K elements.\nx = α + Γ1p1 + Γ2p2 = α + Bf + ε\nwhere\nB\n=\nΓ1\n(m × K)\nf\n=\np1\n(K × 1)\nε\n=\nΓ2p2\n(m × 1)\nLike factor model except Cov[ε] = Γ2Λ2Γ′\n2, where Λ2 is diagonal matrix of last\n(m -K) eigenvalues.\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nEmpirical Principal Components Analysis\nThe principal components analysis of\nX = [x1 : · · · xT] (m × T)\nconsists of the following computational steps:\nComponent/row means :\nx = ( 1 )X1\nT\nT\n'De-meaned' matrix:\nX∗= X - x1′\nT\nSample covariance matrix:\nΣˆ x = 1 X\nT\n∗(X∗)′\nEigenvalue/vector decomposition:\nΣˆ x = ΓˆΛˆΓˆ′\nyielding estimates of Γ and Λ.\nSample Principal Components:\nP = [p1 : · · · : pT] = Γˆ′X∗. (m × T)\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nEmpirical Principal Components Analysis\nPCA Using Singular Value Decomposition\nConsider the Singular Value Decomposition (SVD) of the\nde-meaned matrix:\nX∗= VDU′\nwhere\nV: (m × m) orthogonal matrix, VV′ = Im.\nU: (m × T) row-orthonormal matrix, UV′ = Im.\nD: (m × m) diagonal matrix, D = diag(d1, . . . , dm)\nwith d1 ≥d2 ≥· · · ≥0.\nExercise: Show that\nΛˆ = 1\nT D2\nΓˆ = V\nP = Γˆ′X∗= DU′\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nAlternate Definition of PC Variables\nGiven the m-variate x : E[x] = α and Cov[x] = Σ\nDefine the First Principal Component Variable as\np1 = w′x = (w1x1 + w2x2 + · · · + wmxm)\nwhere the coefficients w= (w1, w2, . . . , wm)′ are chosen to\nmaximize: Var(p1)P\n= w′Σxw\nsubject to: |w|2\nm\n=\ni=1 w2\ni = 1.\nDefine the Second Principal Component Variable as\np2 = v′x = (v1x1 + v2x2 + · · · + vmxm)\nwhere the coefficients v= (v1, v2, . . . , vm)′ are chosen to\nmaximize: Var(p2)P= v′Σxv\nm\nsubject to: |v|2 =\ni=1 v2\ni = 1, and v′w = 0.\nEtc., defining up to pm, The coefficient vectors are given by\n[w : v : · · · ] = [γ1 : γ2 : · · · ] = Γ\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nPrincipal Components Analysis\nFurther Details\nPCA provides a decomposition of the Total Variance:\nTotal Variance (x\nm\n)\n=\n=\nP\ni=1 Var(xi) = trace(Σx)\ntrace\nP\n(ΓΛΓ′) = trace(ΛΓ′Γ) = trace(Λ)\nm\n=\nk=1 λk\nm\n=\n=\nP\nk=1 Var(pk)\nTotal Variance (p)\nThe transformation from x to p is a change in coordinate\nsystem which shifts the origin to the mean/expectation\nE[x] = α and rotates the coordinate axes to align with the\nPrincipal Component Variables. Distance in the space is\npreserved (due to orthogonality of the rotation).\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nOutline\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nFactor Analysis Model\nFor {xt, t = 1, . . . , T}, the factor model is:\nxt = α + Bft + εt\nα and B are vector/matrix constants.\nAll random variables are Normal/Gaussian:\nxt i.i.d. Nm(α, Σx)\nft i.i.d. NK(0KIK)\nεt i.i.d. Nm(0m, Ψ)\nCov(xt) = Σx = BB′ + Ψ\nPrincipal Factor Method of Estimation\nTo fit a K-factor model with fixed K < m, define\nX = [x1 : · · · xT] (m × T)\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nPrincipal Factor Method of Estimation\nStep 1: Conduct the computational steps of principal\ncomponents analysis:\nComponent/row means : x = ( 1\nT )X1T\n'De-meaned' matrix: X∗= X - x1′\nT\nSample covariance matrix: ˆΣx = 1\nT X∗(X∗)′\nEigenvalue/vector decomposition: Σˆ x = ΓˆΛˆΓˆ′\nyielding estimates of Γ and Λ.\nStep 2: Specify initial estimates (index s = 0)\nα0 = x\nB0 = ˆΓ(K)(ˆΛ(K))\n2 , where\nΓˆ(K) is submatrix of Γˆ (first K columns)\nΛˆ(K) is submatrix of Λˆ (first K columns)\nΨ 0 = diag(Σˆ x) -diag(B\n0B\n′\n0)\nΣ 0 = B\n0B\n′\n0 + Ψ 0\nMIT 18.S096\nFactor Models\n\nFactor Models\nLinear Factor Model\nMacroeconomic Factor Models\nFundamental Factor Models\nStatistical Factor Models: Factor Analysis\nPrincipal Components Analysis\nStatistical Factor Models: Principal Factor Method\nPrincipal Factor Method of Estimation\nStep 3: Adjust the sample covariance matrix to\nΣˆ ∗\nx = Σˆ x -Ψ 0\nCompute the eigenvalue/vector decomposition:\nΣˆ ∗\nx = Γ Λ Γ ′\nyielding updated estimates of Γ and Λ\nRepeat Step 2 with these new estimates\nobtaining B 1, Ψ 1, Σ 1 = B\n1B\n′\n1 + Ψ 1\nStep 4: Repeat Step 3 generating a sequence of estimates\n(B s, Ψ s, Σ s) s = 1, 2, . . ., until successive changes in\nΨ s are sufficiently negligible.\nStep 5: Use the estimates from the last iteration in Step 4.\nMIT 18.S096\nFactor Models\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Topics in Mathematics with Applications in Finance\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "HJM Model for Interest Rates and Credit",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/e4c52338bad489162192dd0cc44375ab_MIT18_S096F13_lecnote24.pdf",
      "content": "Lecture 24\nHJM Model for Interest Rates and Credit\nDenis Gorokhov\n(Executive Director, Morgan Stanley)\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nDenis Gorokhov\n\nDenis Gorokhov is an Executive Director at Morgan Stanley. During his\n9 years at the firm Mr. Gorokhov worked on pricing exotic derivatives with\nemphasis on credit, counterparty risk, asset-backed securities, inflation, and\nlongevity.\n\nMr. Gorokhov obtained a number of original analytic results for fixed\nincome pricing problems which are implemented in Morgan Stanley risk\nmanagement systems. He created a flexible modeling framework used for\npricing over 400 different types of exotic derivatives including key transactions\nin the recent Morgan Stanley history: TARP transaction with US Treasury,\npurchase of 20% stake in Morgan Stanley by Mitsubishi UFJ Securities, and\ncredit valuation adjustment with monoline insurer MBIA.\n\nPrior to joining Morgan Stanley Mr. Gorokhov worked in the fields of\nsuperconductivity and mesoscopic physics and authored 20 papers in leading\nphysics journals. Mr. Gorokhov holds a Ph.D. degree in theoretical physics from\nETH-Zurich and spent several years as a post-doctoral researcher at Harvard\nand Cornell.\n\nMr. Gorokhov's comments today are his own, and do not necessarily\nrepresent the views of Morgan Stanley or its affiliates, and are not a product of\nMorgan Stanley Research.\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nIntroduction\n-HJM (Heath-Jarrow-Morton) model is a very general framework used for\npricing interest rates and credit derivatives.\n-Big banks trade hundreds, sometimes even thousands, of different types of\nderivatives and need to have a modeling/technological framework which can\nquickly accommodate new payoffs.\n- Compare this problem to that in physics. It is relatively straightforward to\nsolve Schrodinger equation for the hydrogen atom and find energy levels.\nBut what about energy spectra of complicated molecules or crystals?\nPhysicists use advanced computational methods in this case, e.g. LDA (local\ndensity approximation).\n- Similarly, in the world of financial derivatives there is a very general\nframework, Monte Carlo simulation, which in principle can be used for\npricing any financial contract.\n-The HJM model naturally fits into this concept.\n-Before discussing the HJM model it is very important to understand how the\nMonte Carlo method appears in finance. Stock options are the best\nexample.\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nDynamic Hedging\n\n-Dealers are trying to match buy and sell orders from clients. It is not always\npossible and they have to hedge the residual positions.\n-In the example below a dealer sold a call option on a stock, the loss may be\nunlimited. To hedge the exposure the dealer takes a position in an\nunderlying and adjusts it dynamically.\n\nStock price\nPayoff\nPremium\nStrike\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nStock Price Dynamics\nS&P-500 index, 1990 -2012\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nLognormal Stochastic Process\n\n)\n(\n))\n)(\n(\n(ln\nexp\n)\n;\n,\n(\nt\nT\nt\nT\nS\nS\nS\nt\nT\nS\nS\nP\nSdB\nSdt\ndS\nT\nt\nt\nt\nT\nt\n\n-Usually stock dynamics is assumed to be a sum of drift and diffusion and a\nlognormal stochastic process is a good first approximation.\n-For this process one can calculate the probability distribution function\nexactly. This is why the price of the call option in the Black-Scholes model\ncan be calculated analytically.\n-The probability distribution function is Gaussian in the log coordinates.\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nBlack-Scholes Formalism\nrate\ninterest\n\n,0\n\nriskless\n\nis\n\nportfolio\n\n,\n)\n(\n\nchoose\n,\n)\n,\n(\n\n,\n\nr\nrC\nS\nC\nrS\nS\nC\nS\nt\nC\ndt\nS\nC\nr\ndS\ndC\nd\nS\nC\nS\nC\nt\nS\nC\nC\ndt\nS\nC\nS\ndS\nS\nC\ndt\nt\nC\ndC\n\n-Usually derivation of the Black-Scholes equation is based on the result from\nstochastic calculus known as Ito's lemma.\n-Roughly speaking, Ito's lemma says that the derivative of a stochastic\nfunction with respect to time has an additional deterministic term.\n-One can create a portfolio consisting of an option and a position in the\nunderlying (hedge) which is riskless (thanks to Ito's lemma).\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nBlack-Scholes Miracle\n-There are 2 striking facts about the Black-Scholes equation.\n-First, the drift of the stock does not show up in the BS equation. It happens\nbecause we hedge the option with the stock.\n-Second, the risk is eliminated completely, i.e. by holding a certain position\nin underlying we can fully replicate the option. This is closely related to the\ndeterministic second-order term in Ito's lemma. It is worth analyzing it in\ndetail.\n\nrC\nS\nC\nrS\nS\nC\nS\nt\nC\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nIto's Lemma under Microscope\nN\nN-1\n...\ni i-1 i+1\ndt\ndt'\n\n'\n'\n'\n'\n'\n'\n)\n,\n(\n)\n,\n(\n)\n,\n(\n)\n,\n(\n)\n,\n(\n,1\n...\n,\n)\n,\n(\n)\n,\n(\n)1,0\n(\n~\n,\ndt\nS\nS\nC\nS\nS\nt\nS\nS\nC\ndt\nt\nC\nt\nS\nC\nt\nS\nC\ndt\nS\nS\nC\nS\nS\nS\nC\ndt\nt\nC\nt\nS\nC\nt\nS\nC\nN\ni\nS\nS\nS\nC\nS\nS\nS\nC\ndt\nt\nC\nt\nS\nC\nt\nS\nC\nN\ndt\nS\ndt\nS\nS\nS\ni\ni\ni\ni\ni\ni\ni\nN\nN\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\ni\n\n- In the limit N->infinity the sum in the last term of the last equation becomes\ndeterministic and we obtain Ito's lemma!\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nBlack-Scholes Miracle - 2\n-Exercise 1: Prove that\n)1,0\n(\n~\n,\ni\nN\nN\ni\ni\n\nis deterministic in the limit N->infinity.\n- Exercise 2: Look up a \"proof\" of Ito's lemma in Hull's book (J.C. Hull, Options,\nFutures, and Other Derivatives) and find an error (pages 232-233 in 5th edition).\n-We see that complete risk elimination in the Black-Scholes model is due to\nthe existence of 2 different time scales dt and dt'. One can derive the BS\nequation in the limit dt->0, dt'->0, and dt/dt'->infinity.\n-From the business point of view this means that we hedge on a small time\nscale dt' and the profit/loss noise is finite, however as long as the time\ninterval increases to dt the profit/loss noise disappears!\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nSolving Black-Scholes Equation\n\n)\n(\nPayoff\n)\n(\n))\n)(\n(\n(ln\nexp\n)\n(\nexp\n)\n,\n(\n'\n'\n'\n'\nS\nt\nT\nt\nT\nr\nS\nS\nS\ndS\nt\nT\nr\nt\nS\nC\nrC\nS\nC\nrS\nS\nC\nS\nt\nC\n\n-BS equation is similar to the heat equation and can be solved using\nstandard methods.\n-The Green function in the solution above is strikingly similar to the\nprobability distribution function of the lognormal distribution shown above.\n-The 2 expressions differ only by the discount factor as well as the stock drift\nsubstituted by interest rate r.\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nInterpretation: Monte Carlo Simulation Concept\ntime\nStock price\nmaturity\n\n)\n(\n)\n,\n(\n)\n(\nT\nt\nT\nr\nt\nS\nPayoff\nE\ne\nt\nS\nC\nSdB\nrSdt\ndS\n\n-One needs to simulate different stock paths in the risk-neutral world,\ncalculate the average of the payoff, and discount.\n-It turns out that this approach works not just for equity derivatives but can\nbe generalized for interest and credit cases as well.\n-Every security in the risk-neutral world grows on average with the risk free\nrate.\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nInterest Rates Derivatives: Basic Concepts\n13 Not for redistribution\n-Businesses borrow money to finance their activity.\n-As a compensation lenders charge borrowers certain interest.\n-Interest rates fluctuate with time and, similar to the equity case, there exists a\nmarket of derivatives linked to the level of interest rates.\n-Time value of money: $1 to be paid in 1 year form now is worth less than $1\npaid in 2 years form now. For example, if 1- and 2-year interest rates are both\nequal to 5%, then one needs to invest $1/(1+0.05)= $0.95 today to obtain $1\nin 1 year form now and $1/(1+0.05)^2=$0.90 to obtain $1 in 2 years form\nnow.\n-It is very convenient to describe time value of money using discount factors.\n1.0\ndiscount factor\ntime\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nForward Rates\n-It is very convenient to express discount factors using forward rates.\n-Mathematically, the relation between discount factors and forward rates can\nbe expresses as\n\nT\nt\nds\ns\nt\nf\nT\nt\nd\n)\n)\n,\n(\nexp(\n)\n,\n(\nforward\nrate\ntime\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nYield of 10-year US Treasury Note\n-Interest rates are extremely low at present.\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nLibor Rates\n-LIBOR rate is a fundamental rate in the world of interest rate derivatives. This\nrate is used an important benchmark in the world of lenders/borrowers. Very\noften borrow rates are quoted as a spread over LIBOR.\n-Roughly speaking, USD LIBOR (London Interbank Exchange Offer) rate is the\nrate at which well rated banks lend US dollars to each other in London for a\nshort term on unsecured basis.\n-There exist liquid 1M, 3M, 6M, and 12M LIBOR rates in different currencies.\n-LIBOR swap is a fundamental interest rates derivative. The first counterparty\nmakes periodic LIBOR payments, while the second one pays predetermined\nfixed rate. Not for redistribution\ntime\nLIBOR\npayments\nfixed\nStandard USD 3M-LIBOR swap\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nInterest Rate Derivatives\n-Besides standard interest rate swaps there exist numerous types of interest rate\nderivatives. They are used for risk management of interest rate exposure.\n-European swaption: An option to enter a forward starting LIBOR Swap.\ntime\ntoday\nexpiry\n-Libor caps/floors: Essentially put/call options on LIBOR rate in the future.\n-Cancellable swaps: One of the parties has a right to cancel the LIBOR swap.\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nLIBOR Swap Quotes\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nPricing LIBOR Swaps, Discount Curve Cooking\n)\n(t\nCd\nPVfixed\n-The LIBOR swap consists of 2 streams: fixed and floating ones. They can be\npriced if we know the discount factor curve d=d(t).\n-The present value of a fixed payment C paid at time t is given by\n-There is a very neat result: present value of the float leg of a LIBOR swap plus a\nnotional payment at the end is equal to the notional. The PV of the swap\nreceiving fixed, paying float, and maturing at time T is\nN\nT\nNd\nt\ncNd\nT\nPV\ni\ni\n\n)\n(\n)\n(\n)\n(\n-But where from do we know the discount function d(t)? The swap market is very\nliquid and we know swap rates corresponding to different maturities. One can\nreverse engineer curve d(t) so that the observed swap rates are fair rates, i.e.\nfor all swaps PV(T)=0.\n-This procedure is know as discount curve bootstrapping (\"cooking\").\n-Note: Here, we do not take into account OIS discounting.\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nPricing Interest Rate Derivatives\n-In order to price a stock option one needs to know the stock value today as well\nas future stock dynamics.\n-The Monte Carlo simulation framework allows to calculate the price.\n-It turns out that the same framework can be used for pricing interest rate\nderivatives. However, there is a very important distinction: while stock evolution\nis a point-like process, in the interest rate world we interested in dynamics of a\ncurve, i.e. a one-dimensional object. The problem is more complicated.\nSTOCK OPTIONS\nIR OPTIONS\nINITIAL VALUE\nknown\nnot known, curve\nneeds to be cooked\nDYNAMICS\npoint-like object\n0ne-dimensional\nobject\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nClasses of Interest Rates Models\n-\nDynamic interest rates models can be divided into 2 large classes: term structure\nmodels and short rate models.\n-\nThe first class of models (more general) describes the dynamics of the full forward\ncurve, while the second class describes the short term rates only. Here is the list of\nthe most famous short rates models:\ndB\nr\ndt\nr\ndr\ndB\ndt\nr\ndr\ndB\ndt\ndr\nt\nt\nt\nt\nt\nt\nt\nt\nt\nt\nt\n\n)\n(\n)\n(\nHo-Lee model\n\nHull-White model\nCox-Ingersoll-Ross (CIR) model\n- Note that the short rate and forward rates are related via\ntt\nt\nf\nr\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nHJM (Heath-Jarrow-Morton) Framework\nt\ntT\ntT\ntT\ndB\ndt\ndf\n\n-The HJM model shows how to describe the evolution of forward rates. The\nstarting equation is again a sum of drift and diffusion terms. Note that each\nforward rate depends on 2 variables t and T, not just t as in the stock options\ncase\n-Consider the price evolution of a zero coupon bond (it pays $1 at time T). In the\nrisk-neutral world the price of the bond should grow with the risk-free rate on\naverage\ndt\nZ\nds\ndt\nZ\nds\ndB\nZ\nds\nZ\nf\ndt\ne\nds\ndX\ne\nde\nds\ndB\ndt\nds\ndt\nf\nds\ndf\ndt\nf\ndX\nX\nds\nf\nZ\ntT\nT\nt\nts\ntT\nT\nt\nts\nt\ntT\nT\nt\nts\ntT\ntt\nX\nT\nt\nts\nt\nX\nX\nt\nT\nt\nts\nT\nt\nts\ntt\nT\nt\nts\ntt\nt\nt\nT\nt\nts\ntT\nt\nt\nt\n)\n(\n)\n(\ndZ\n:\nlemma\ns\nIto'\n)\n(\n)\n(\n)\nexp(\n)\nexp(\ntT\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nHJM Framework - 2\n-On the previous slide we have shown that\ndt\nZ\nds\ndt\nZ\nds\ndB\nZ\nds\nZ\nf\ndZ\ntT\nT\nt\nts\ntT\nT\nt\nts\nt\ntT\nT\nt\nts\ntT\ntt\ntT\n)\n(\n)\n(\n\n-First of all, the forward rate f(t,t) is equal to the short rate r(t). Second, in\norder for the bond price to grow on average with the risk-free rate, the sum\nof the last 2 terms in the equation above should be equal to zero, i.e.\nds\nT\nt\nts\ntT\ntT\n\n-This equation allows to simulate interest rates and price interest rates\nderivatives in a Monte Carlo simulation.\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nHJM Model Summary: How to Price IR Derivatives\nt\ntT\nT\nt\nts\ntT\ntT\ndB\ndt\nds\ndf\n\n-Take IR swap quotes and bootstrap the discount curve.\n-Obtain forward rates from the discount curve. This is the starting point of the\nsimulation.\n-Specify the volatility of forward rates.\n-If the volatility is known, the drift can be calculated.\n-Start the simulation, stop at maturity, and price the derivative value by\naveraging and discounting, similar to the stock option case.\n-IR volatility can be calibrated from the swaptions market.\ninitial curve f(0,T)\nsimulated curves at maturity\n\n)\n(\nt\nPayoff\ne\nE\nPV\nt\nssds\nf\nt\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nCredit Derivatives: a Quick Introduction\n-When a borrower issues debt, there is a chance that money will not be returned.\n-This type of risk is known as credit risk and needs to be taken into account.\n-The higher the default risk for a particular issuer, the higher interest rate is\ncharged by the borrowers.\n-The interest rate can vary a lot among different issuers. For example, for 10-year\ndebt, the US government pays 1.7%/year (essentially, default-free rate), Morgan\nStanley pays around 5%/year, while the effective yield of bonds issued by\nGreece is in the range 25-30%.\n-There exists a large credit derivatives market. The most important instrument is\ncredit default swap.\n\ndefault swap\nbuyer\ndefault swap\nseller\nperiodic/upfront payments\npayment upon default\n-In the event of default of a reference entity, seller pays the loss on a bond.\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nSurvival Probabilities and Hazard Rates\nR\nc\np\np\nR\nN\nc\nN\np\nR\ncN\n\nprob.\n\nsurvival\n\nrecovery,\n\nnotional,\n\ncoupon,\nupfront\n)\n)(\n1(\n-It is very convenient to describe credit derivatives in terms of implied survival\nprobabilities. Let us illustrate this using a credit default swap example.\n-Assume that credit default swap protects against default on a bond with notional\nN and recovery R. Assume for simplicity that interest rate is zero.\n-It is very convenient to parameterize survival probabilities with hazard rates.\nSimilar to the IR case on can write\n\nT\nt\nds\ns\nt\nh\nT\nt\np\n)\n)\n,\n(\nexp(\n)\n,\n(\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nPricing Credit Derivatives\n-Remember that in the IR case one could price all derivatives using discount curve\nd(t) whose meaning is the value of $1 paid at time t form now.\n-In the world of credit derivatives there is a notion of risky discount factors, i.e.\nthe value of $1 paid in the future subject to a possible default of a reference\nentity.\n-Similar to the IR case one can \"cook\" survival probabilities from CDS market.\n-The present value of a CDS paying a loss on a bond can be written as follows\ncoupon\n\nrunning\n\na\n,\n)\n(\n)\n1(\n)\n(\n)\n(\n\ni\ni\ni\ni\ni\ni\ni\nd\np\np\nN\nR\nt\np\nt\naNd\nPV\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nDynamic Hazard Rate Model\n-In the case of credit default swaps pricing is relatively simple.\n-There are credit-linked instruments depending not only on survival probabilities\nbut also on their volatility, e.g. callable bonds.\n- Correct modeling of interest rate and credit dynamics allows to make optimal\ncall decisions.\n-Here is an example:\n\n$14MM\n7years\n*\n$100MM\n*\n2%\n\nare\n\nsavings\n\nrefinance,\n\nto\ndecided\ncompany\n\nthe\n\n3.0%\n\nspread\n\neffective\n\n5.00%\n\nspread\n\neffective\n\n1.50%\n\nspread\ncredit\n\n3.00%\n\nspread\ncredit\n1.50%\n\nrate\n\nfree\nrisk\n\n2.00%\n\nrate\n\nfree\nrisk\nchanges\nmarket\n\n3y the\nin\n\nbond\n\n$100MM\n10y\na\nissues\n\nX\nn\ncorporatio\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nModeling Dynamics of Hazard Rates\n\nme\ndefault ti\n),\nexp(\n}\n{\n\nds\nh\nf\nZ\ndB\ndt\ndh\ndB\ndt\ndf\nT\nt\nts\nts\nt\ntT\nh\nt\nh\ntT\nh\ntT\ntT\nt\ntT\ntT\ntT\n-Similar to the IR case we assume that dynamics of forward hazard rates can be\ndescribed by a sun of drift and diffusion terms.\n-In order to describe dynamics of hazard rates it is very convenient to consider\nprice evolution of a zero coupon bond with no recovery.\n1.0\n0.0\nmaturity\ntime\nprice\ndefault\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nDrift Condition for Hazard Rates\n-Exercise 3: Derive a drfit expression for the credit HJM model.\n-Hint: Consider dynamics of a zero coupon bond and average over the default\nevent. The resulting drift in this case should be equal to the risk-free rate. This\nleads to a condition for the drift of forward hazard rates.\n-If there are no correlations between IR and hazard rates, the drift is given by the\nequation similar to the IR case.\nt\nh\ntT\nT\nt\nh\ntT\nh\ntT\ntT\ndB\nds\ndh\n\n-In summary, we have shown how to price exotic derivatives using Monte Carlo\nsimulations. One needs to write stochastic differential equations with the correct\ndrift (to make sure all assets grow with risk-free rate on average), simulate\nequity/IR/credit paths, and (in the European option case) average/discount\npayoff\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nExample: Structured Notes\n-Investors are looking for attractive yields on their capital.\n-Nowadays investing into Treasury bonds is not very attractive. The 10 year bond\ngenerates just 1.7% per year. After taxes the investor is left with just 1.1%\nreturn which is well below current inflation rate (1.5-2%).\n-Investors can increase their return by buying corporate bonds and, hence,\nbearing credit risk. In this case one can easily generate a 5-6% nominal return\nbefore taxes (Morgan Stanley case). But can we go even higher than that\nwithout bearing too much credit risk?\n-Structured note is a bond issued by institutions whose coupon can be very\nexotic. Here is a typical example.\n880)\n\nindex\n\n-\nP\n&\n(S\n\n&\n&\n\nrate)\n\nswap\nyear\n- 2\n\nrate\n\nswap\nyear\n-\n(30\n\ncondition\ndays\n\nof\nnumber\n\ntotal\nsatisifed/\n\nis\nconditon\n\ndays\n\nof\nnumber\n*\n%\n\ncoupon\nnote\n\nstructured\n\n$100MM\nyear\n\na\nissues\n\nX\nn\ncorporatio\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nStructured Notes: Coupon Enhancement\n-The bond holder bears tail risk: The historical probability of events is low but the\nmarket implied probability of them is significant, so that the investor can obtain\na coupon enhancement.\n-What will the institution who sold the bond do? First, the note is priced using a\nMonte Carlo simulation which was described in the presentation. Next, deltas\nwith respect to equity, rates, and credit will be calculated and the note will be\nhedged accordingly.\n-For the described structured note the breakdown of the condition implies a very\nsevere recession.\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n30y swap rate - 2y swap rate\n-During the last decade the 30y-2y difference was negative only for a few days on\nFeb 2006 but the market implies that for the next decade it will be the case for\nnearly 80% of days.\n-Similarly, S&P-500 was above 880 for 94% of days, however the implied\nfrequency is only about 75% for the next decay.\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nDisclosures\nThe information herein has been prepared solely for informational purposes and is not an offer to buy or sell or a solicitation of an offer to buy or sell any security or instrument or to participate\nin any trading strategy. Any such offer would be made only after a prospective participant had completed its own independent investigation of the securities, instruments or transactions and\nreceived all information it required to make its own investment decision, including, where applicable, a review of any offering circular or memorandum describing such security or instrument,\nwhich would contain material information not contained herein and to which prospective participants are referred. No representation or warranty can be given with respect to the accuracy or\ncompleteness of the information herein, or that any future offer of securities, instruments or transactions will conform to the terms hereof. Morgan Stanley and its affiliates disclaim any and all\nliability relating to this information. Morgan Stanley, its affiliates and others associated with it may have positions in, and may effect transactions in, securities and instruments of issuers\nmentioned herein and may also perform or seek to perform investment banking services for the issuers of such securities and instruments.\n\nThe information herein may contain general, summary discussions of certain tax, regulatory, accounting and/or legal issues relevant to the proposed transaction. Any such discussion is\nnecessarily generic and may not be applicable to, or complete for, any particular recipient's specific facts and circumstances. Morgan Stanley is not offering and does not purport to offer tax,\nregulatory, accounting or legal advice and this information should not be relied upon as such. Prior to entering into any proposed transaction, recipients should determine, in consultation with\ntheir own legal, tax, regulatory and accounting advisors, the economic risks and merits, as well as the legal, tax, regulatory and accounting characteristics and consequences, of the transaction.\n\nNotwithstanding any other express or implied agreement, arrangement, or understanding to the contrary, Morgan Stanley and each recipient hereof are deemed to agree that both Morgan\nStanley and such recipient (and their respective employees, representatives, and other agents) may disclose to any and all persons, without limitation of any kind, the U.S. federal income tax\ntreatment of the securities, instruments or transactions described herein and any fact relating to the structure of the securities, instruments or transactions that may be relevant to understanding\nsuch tax treatment, and all materials of any kind (including opinions or other tax analyses) that are provided to such person relating to such tax treatment and tax structure, except to the extent\nconfidentiality is reasonably necessary to comply with securities laws (including, where applicable, confidentiality regarding the identity of an issuer of securities or its affiliates, agents and\nadvisors).\n\nThe projections or other estimates in these materials (if any), including estimates of returns or performance, are forward-looking statements based upon certain assumptions and are preliminary\nin nature. Any assumptions used in any such projection or estimate that were provided by a recipient are noted herein. Actual results are difficult to predict and may depend upon events outside\nthe issuer's or Morgan Stanley's control. Actual events may differ from those assumed and changes to any assumptions may have a material impact on any projections or estimates. Other events\nnot taken into account may occur and may significantly affect the analysis. Certain assumptions may have been made for modeling purposes only to simplify the presentation and/or calculation of\nany projections or estimates, and Morgan Stanley does not represent that any such assumptions will reflect actual future events. Accordingly, there can be no assurance that estimated returns or\nprojections will be realized or that actual returns or performance results will not be materially different than those estimated herein. Any such estimated returns and projections should be viewed\nas hypothetical. Recipients should conduct their own analysis, using such assumptions as they deem appropriate, and should fully consider other available information in making a decision\nregarding these securities, instruments or transactions. Past performance is not necessarily indicative of future results. Price and availability are subject to change without notice.\nThe offer or sale of securities, instruments or transactions may be restricted by law. Additionally, transfers of any such securities, instruments or transactions may be limited by law or the terms\nthereof. Unless specifically noted herein, neither Morgan Stanley nor any issuer of securities or instruments has taken or will take any action in any jurisdiction that would permit a public\noffering of securities or instruments, or possession or distribution of any offering material in relation thereto, in any country or jurisdiction where action for such purpose is required. Recipients\nare required to inform themselves of and comply with any legal or contractual restrictions on their purchase, holding, sale, exercise of rights or performance of obligations under any transaction.\nMorgan Stanley does not undertake or have any responsibility to notify you of any changes to the attached information.\n\nWith respect to any recipient in the U.K., the information herein has been issued by Morgan Stanley & Co. International Limited, regulated by the U.K. Financial Services Authority. THIS\nCOMMUNICATION IS DIRECTED IN THE UK TO THOSE PERSONS WHO ARE MARKET COUNTERPARTIES OR INTERMEDIATE CUSTOMERS (AS DEFINED IN THE UK\nFINANCIAL SERVICES AUTHORITY'S RULES).\n\nADDITIONAL INFORMATION IS AVAILABLE UPON REQUEST.\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Topics in Mathematics with Applications in Finance\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Introduction & Financial Terms and Concepts",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/10802d98a8af7ca93a024eac0cb0dded_MIT18_S096F13_lecnote1.pdf",
      "content": "18.S096: Topics in Mathematics with\nApplications in Finance\n\nInstructors: Dr. Peter J Kempthorne, Dr. Choongbum Lee,\nDr. Vasily Strela, Dr. Jake Xia\n\n18.S096: Key Facts\n-\nThe purpose of the class is to expose undergraduate and graduate students to\nthe mathematical concepts and techniques used in the financial industry.\n-\nMathematics lectures will be mixed with lectures illustrating the corresponding\napplication in the financial industry.\n-\nMIT mathematicians will teach the mathematics part while industry\nprofessionals will give the lectures on applications in finance.\n-\nWe plan to organize an optional field trip to visit Morgan Stanley offices in New\nYork on October 15.\n-\nPrerequisites: 18.01, 18.02, 18.03 (or approval of instructor), 18.05 or 18.440,\n18.06\n-\nPrior knowledge of economics or finance is not required but may be helpful for\nsome lectures.\n-\nThe class will have problem sets for each math lecture (due in 2 weeks after\nassignment) and a final paper on a math finance topic of student's choice.\n-\nThere will be no exams. The final grade will be 75% based on the homework\nand 25% on final paper.\n\nHow are Financial Products\nTraded?\n\nIntroduction of basic knowledge of financial\nmarkets and quantitative analysis\n\nJake Xia\nMIT Course 18.S096\nSeptember 5, 2013\nThe views represented herein are the author's own views and do not necessarily\nrepresent the views of his past and current employers.\n\nThe Story of\nPi,\nAlpha,\nBeta,\nDelta,\nGamma,\nTheta,\n\nand\n\nVega\n\nMarkets, Exchanges, OTC, Regions\n\nMoney, Currencies\n\nStocks, Equity Indices, IPOs,\nPrimary/Secondary\n\nLoans, Bonds, Credit Products\n\nCommodity\n\nReal Estate, Mortgages, ABS\n\nDerivatives, Structured Products\n\nBanks: deposits, commercial lending\n\nInvestment Banks:\n\nFixed Income\n\nEquity\n\nIBD, Corporate Finance\n\nAsset Management\n\nWealth Management\n\nZero-sum game?\n\nInvestors--have money, need return\n\nBorrowers--need money, have risks\n\nTrade between lender and borrower is\nstill the main driving force.\n\nMarket Participants:\n\nDealers, Market Makers, Brokers\n\nIndividuals, Retail Investors\n\nMutual Funds, Insurance Companies, Pension\nFunds, Asset Managers, SWFs\n\nHedge Funds (various strategies), PE\n\nGovernments, Policy Makers\n\nCorporate Hedgers, Liability Management\n\nTrader Types:\n\n1. Hedger\n\n2. Market Maker, bid and offer\n\n3. Proprietary Trader\nFund Portfolio Manager\nbeta and alpha, linear regression of\ntwo time series: return of assets a\nand b:\nR(a) = a + b * R(b)\n\nHedging Trade Examples:\n\nBond issuer hedge interest rate exposures,\nhedge of payables.\n\nExample: 10yr Samurai bonds issued in JPY by\nAustralia corporates. Fixed rate difference of 4.5% -\n1% = 3.5%. Need receive JPY and pay AUD to hedge.\nFX, swaps and cross-currency basis.\n\nCorporates/producers hedge revenue.\nCurrency hedge of future receivables\n\nImporter and exporter hedge FX\n\nDeal contingent hedges\n\nMarket Making Examples:\n\nSimple product bid/offer, price\ntransparency, liquidity\n\nInventory of risks, manage a dealer\nbook, balancing Greeks: delta,\ngamma, theta, vega, tail risks\n\nValue at Risk (VaR), Capital, Balance\nSheet, Risk Weight Assets\n\nProprietary Trading Examples:\n\nDirectional, long, short,\n\nArbitrage\n\nValue, Relative Value\n\nSystematic, momentum, statistical\narbitrage\n\nFundamental Analysis. Global Macro\n\nSpecial situations, distressed\n\nFinancial Mathematics:\n\n1.\nPricing Models:\n\nrelative value, arbitrage-free.\n\n2. Risk Management:\n\nhuman risk aversion, greed/fear.\n\n3. Trading Strategies:\n\n\"Holy Grail\" strategy, perpetual motion\nmachine, Robo-Trader.\n\nRisk aversion:\n\nChoice A: 80% chance to lose $500, 20%\nchance to win $500.\nChoice B: 100% chance to lose $280.\n\nWhich choice?\n\nNow\n\nChoice A: 80% chance to win $500, 20%\nchance to lose $500.\nChoice B: 100% chance to win $280.\n\nWhich Choice?\n\nControl factor. Marginal utility.\n\nDo people always learn from their\nexperiences?\n\nLong market cycle and short memory\nHistorical extrapolation.\nDeterministic vs statistic.\nEfficient Market Theory and behavioral\nfinance.\nOver-simplification.\n\nHome work assignment (optional):\n\nMake your own financial glossary (the\nterminology you don't understand) by\nsearching the web or reading the\nmaterials on the course website.\n\nProject 1 - Noisy Delta\n- Monte Carlo pricing\n- Delta computation with centered difference\n- Question: What is the optimal shift size?\n\nCourtesy of Dusan Milijancevic\n\nProject 1 - Noisy Delta\n- For the solution we minimize the standard\nerror\n)\n(ˆ x\nf\n)\n(x\nsd\n)\n|\n)\n(ˆ\n)\n(ˆ\n)\n('\n(|\n\n+\n\nx\nf\nx\nf\nx\nf\nE\n|)\n(\n|\n)\n(\nx\nd\nx\nsd\nc\nopt\n\n+\n\nCourtesy of Dusan Milijancevic\n\nProject 1 - Noisy Delta\n$\n,\nbp\nd\nbp\nc\n\nCourtesy of Dusan Milijancevic\n\nProject 2 - Kalman Filter\n-\nFive brokers quote swap points for USDRUB forward contract at different times\n-\nThe aim of the project is to study if Kalman filter can improve accuracy of quotes\nCourtesy of Dusan Milijancevic\n\nProject 2 - Kalman Filter\nCourtesy of Dusan Milijancevic\n\nDisclosures\nThe information herein has been prepared solely for informational purposes and is not an offer to buy or sell or a solicitation of an offer to buy or sell any security or instrument or to participate\nin any trading strategy. Any such offer would be made only after a prospective participant had completed its own independent investigation of the securities, instruments or transactions and\nreceived all information it required to make its own investment decision, including, where applicable, a review of any offering circular or memorandum describing such security or instrument,\nwhich would contain material information not contained herein and to which prospective participants are referred. No representation or warranty can be given with respect to the accuracy or\ncompleteness of the information herein, or that any future offer of securities, instruments or transactions will conform to the terms hereof. Morgan Stanley and its affiliates disclaim any and all\nliability relating to this information. Morgan Stanley, its affiliates and others associated with it may have positions in, and may effect transactions in, securities and instruments of issuers\nmentioned herein and may also perform or seek to perform investment banking services for the issuers of such securities and instruments.\n\nThe information herein may contain general, summary discussions of certain tax, regulatory, accounting and/or legal issues relevant to the proposed transaction. Any such discussion is\nnecessarily generic and may not be applicable to, or complete for, any particular recipient's specific facts and circumstances. Morgan Stanley is not offering and does not purport to offer tax,\nregulatory, accounting or legal advice and this information should not be relied upon as such. Prior to entering into any proposed transaction, recipients should determine, in consultation with\ntheir own legal, tax, regulatory and accounting advisors, the economic risks and merits, as well as the legal, tax, regulatory and accounting characteristics and consequences, of the transaction.\n\nNotwithstanding any other express or implied agreement, arrangement, or understanding to the contrary, Morgan Stanley and each recipient hereof are deemed to agree that both Morgan\nStanley and such recipient (and their respective employees, representatives, and other agents) may disclose to any and all persons, without limitation of any kind, the U.S. federal income tax\ntreatment of the securities, instruments or transactions described herein and any fact relating to the structure of the securities, instruments or transactions that may be relevant to understanding\nsuch tax treatment, and all materials of any kind (including opinions or other tax analyses) that are provided to such person relating to such tax treatment and tax structure, except to the extent\nconfidentiality is reasonably necessary to comply with securities laws (including, where applicable, confidentiality regarding the identity of an issuer of securities or its affiliates, agents and\nadvisors).\n\nThe projections or other estimates in these materials (if any), including estimates of returns or performance, are forward-looking statements based upon certain assumptions and are preliminary\nin nature. Any assumptions used in any such projection or estimate that were provided by a recipient are noted herein. Actual results are difficult to predict and may depend upon events outside\nthe issuer's or Morgan Stanley's control. Actual events may differ from those assumed and changes to any assumptions may have a material impact on any projections or estimates. Other events\nnot taken into account may occur and may significantly affect the analysis. Certain assumptions may have been made for modeling purposes only to simplify the presentation and/or calculation of\nany projections or estimates, and Morgan Stanley does not represent that any such assumptions will reflect actual future events. Accordingly, there can be no assurance that estimated returns or\nprojections will be realized or that actual returns or performance results will not be materially different than those estimated herein. Any such estimated returns and projections should be viewed\nas hypothetical. Recipients should conduct their own analysis, using such assumptions as they deem appropriate, and should fully consider other available information in making a decision\nregarding these securities, instruments or transactions. Past performance is not necessarily indicative of future results. Price and availability are subject to change without notice.\nThe offer or sale of securities, instruments or transactions may be restricted by law. Additionally, transfers of any such securities, instruments or transactions may be limited by law or the terms\nthereof. Unless specifically noted herein, neither Morgan Stanley nor any issuer of securities or instruments has taken or will take any action in any jurisdiction that would permit a public\noffering of securities or instruments, or possession or distribution of any offering material in relation thereto, in any country or jurisdiction where action for such purpose is required. Recipients\nare required to inform themselves of and comply with any legal or contractual restrictions on their purchase, holding, sale, exercise of rights or performance of obligations under any transaction.\nMorgan Stanley does not undertake or have any responsibility to notify you of any changes to the attached information.\n\nWith respect to any recipient in the U.K., the information herein has been issued by Morgan Stanley & Co. International Limited, regulated by the U.K. Financial Services Authority. THIS\nCOMMUNICATION IS DIRECTED IN THE UK TO THOSE PERSONS WHO ARE MARKET COUNTERPARTIES OR INTERMEDIATE CUSTOMERS (AS DEFINED IN THE UK\nFINANCIAL SERVICES AUTHORITY'S RULES).\n\nADDITIONAL INFORMATION IS AVAILABLE UPON REQUEST.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Topics in Mathematics with Applications in Finance\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Introduction to Counterparty Credit Risk Conclusions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/6a88ece1d51780a6a719cc620abc7c2f_MIT18_S096F13_lecnote26.pdf",
      "content": "Please see additional important information and qualifications at the end of this material.\nYi Tang, Managing Director,\nHead of Cross Asset Modeling Group, Morgan Stanley\n\nDecember 10, 2013\n\nFor MIT Course:\nTopics in Mathematics with Applications in Finance by Vasily Strela and Jake Xia\nIntroduction to Counterparty Credit\nRisk\n\n- Enterprise-Level Derivatives Modeling\n\nDISCLAIMER - THIS IS SALES AND TRADING COMMENTARY PREPARED FOR INSTITUTIONAL INVESTORS; it is NOT a research report; tax, legal, financial, or\naccounting advice; or an official confirm. The views of the author may differ from others at MS (including MS Research). MS may engage in conflicting activities -- including\nprincipal trading before or after sending these views -- market making, lending, and the provision of investment banking or other services related to instruments/issuers mentioned.\nNo investment decision should be made in reliance on this material, which is condensed and incomplete; does not include all risk factors or other matters that may be material;\ndoes not take into account your investment objectives, financial conditions, or needs; and IS NOT A PERSONAL RECOMMENDATION OR INVESTMENT ADVICE or a basis\nto consider MS to be a fiduciary or municipal or other type of advisor. It constitutes an invitation to consider entering into derivatives transactions under CFTC Rules 1.71 and\n23.605 (where applicable) but is not a binding offer to buy or sell any financial instrument or enter into any transaction. It is based upon sources believed to be reliable (but no\nrepresentation of accuracy or completeness is made) and is likely to change without notice. Any price levels are indicative only and not intended for use by third parties. Subject to\nadditional terms at http://www.morganstanley.com/disclaimers.\nLecture 26:\n\nOverview of Counterparty Credit Risk\n-\nIn OTC (Over The Counter) derivatives\n-\nCounterparty (CP) credit risk - Our counterparty (CP) will not pay us the full\namount it owes us if it defaults (bankruptcy, failure to pay, ...)\n- Default risk\n- MTM risk due to the likelihood of CP future default, CP credit spread\nwidening\n-\nSimilar to (corporate) bonds (in terms of economics)\n-\nExcept that the credit risk in bonds is issuer risk\n\n-\nCredit Valuation Adjustment (CVA)\n-\nPrice of counterparty (CP) credit risk, mainly MTM risk due to the likelihood of\nCP future default\n-\nAn adjustment to the price/MTM from a CP-default-free model/broker quote\n-\nTypically no need of CVA for bonds (and some other products)\n-\nAlso a part of the Basel 3 Credit Capital (CVA add-on)\n-\nIn general, cannot be priced with trade-level derivatives models\n- Prevailing derivatives models\n- Due to non-linear portfolio effect\n-\nOne of the applications of enterprise-level derivatives models\n- Model non-linear risks/effects/metrics in a derivatives portfolio\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n-\nYou have an OTC derivatives trade (e.g., an IR swap) (or a portfolio of\ntrades)\n-\nWith no collateral\n-\nWe know nothing about counterparty credit risk (or credit valuation\nadjustment, CVA)\n\n-\nTrade PV was zero on day 1 (excluding CVA)\n-\nTrade PV became $100MM later on (excluding CVA)\n-\nThen, your counterparty (unexpectedly) defaults with 50% recovery\n-\nYou get paid $50MM cash (= $100MM x 50%)\n\n-\nHave you made $50MM or lost $50MM over the life of the trade in your\ntrading operation, or are you flat?\n\nExamples and Questions\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n-\nThis is where CVA (Credit Valuation Adjustment) comes in\n-\nPrice of counterparty credit risk\n-\nMake whole on counterparty default loss\n- If hedged with CVA Desk (by buying credit protection on CP)\n\n-\nCVA (back of the envelope) approximation\n-\nCVA (on receivables, charge to counterparty):\n- MPE * CP CDS Par Spread * Duration\n-\nMPE: Mean Positive Exposure\n\n-\nMore accurate formula for MPE CVA\n\nT: Final maturity of CP portfolio\nt: The CP (first) default time\nVt-: CP portfolio value, Ct-: CP posted collateral, both as of time t-\nRt: CP recovery as of time t\n\nCVA (Credit Valuation Adjustment)\n\n-\n-\n-\n\n-\n-\n\nt\nt\nt\nt\nt\n\nR\nC\nV\nE\nCVA\nT\nQ\nMPE\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n-\nNonlinear portfolio effects in CVA (requiring enterprise-level modeling)\n-\nOffsetting trades\n\n-\nAsymmetry of one's net receivables (or assets) and one's net\npayables (or liabilities) given counterparty default\n- Option-like payoff\n\n-\nA counterparty (in one netting group) typically trades many\nderivatives instruments cross assets (such as IR, FX, credit, equity,\ncommodities, and mortgages)\n- Option on a basket of (cross asset) derivatives trades\n\n-\nIdeally, all trade-level models (and martingale targets) should be\naccessible or called by the enterprise-level model in run-time, among\nothers\n\nCVA (Credit Valuation Adjustment)\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n-\n(Potential refinements needed)\n\n-\nAsset/MPE CVA (for receivables w.r.t. CP default) (cost)\n\n-\nLiability/MNE CVA (for payables w.r.t. self default) (benefit)\n(Model scenario)\n\n-\nMPE/MNE: Mean Positive/Negative Exposure\n\n-\nFirst to default?\n\n-\n-\n-\n\n-\n-\n\nt\nt\nt\nt\nt\n\nR\nC\nV\nE\nCVA\nT\nQ\nMPE\n\n-\n-\n-\n\n-\n-\n-\n\nt\nt\nt\nt\nt\n\nR\nC\nV\nE\nCVA\nT\nQ\nMNE\nCVA (Credit Valuation Adjustment)\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n-\nYou have a derivatives trade (e.g., an IR swap) (or a portfolio of trades)\n-\nWith no collateral\n\n-\nTrade PV was zero on day 1\n-\nTrade PV became +$100MM later on\n-\nThe market risk and counterparty credit risk are properly hedged\n-\nDo you have any other risks?\n\n-\n(Cashflow) Liquidity/funding risk\n-\nNeed funding for uncollateralized derivatives receivables\n-\nCash outflow in futures or collateralized hedges\n-\nContingent funding risk\n-\nFunding benefit from uncollateralized derivatives payables\n\n-\nOther risks\n-\nUnexpected/tail risks, (equity) capital\n\nExamples and Questions\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n-\nSelling put options or put spreads\n-\nSelling put options on a stock versus buying the stock outright\n- On stocks with or without dividend?\n-\nWarren Buffett/Berkshire sold long dated puts on four leading stock indices\nin U.S., U.K., Europe, and Japan\n- Collated about $4Bn premium without posting collateral\n- Page 16 in http://www.berkshirehathaway.com/letters/2012ltr.pdf\n- Stock indices:\n- S&P 500, FTSE 100, Euro Stoxx 50, Nikkei 225\n- Non-linear portfolio risks to dealers (requiring enterprise-level modeling)\n- CVA, wrong-way risk\n- Liquidity/funding, wrong-way risk\n- Risk management of CVA, Liquidity/funding - Laying off such risks\n- Credit-linked note, intermediation\n- Tranched portfolio credit protection\nExamples and Questions\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n-\nFrom the perspective of Warren Buffett/Berkshire\n- Selling insurance on the equity market\n- Day one cash inflow (low cost funding)\n- No cash outflow until trade maturity\n- Warren Buffett/Berkshire explored the feasibility of posting collateral\n\n-\nWho is making (or will make) money and who is losing (or will lose) money?\n- Where does the value come from?\nExamples and Questions\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nCVA Conundrum\n-\nYou trade with counterparty A\n-\nYou buy credit protection on A from counterparty B\n-\nYou buy credit protection on B from counterparty C\n-\nYou buy credit protection on C from counterparty D\n-\n. . .\n\n-\nIt becomes an infinite series\n\n-\nWhat is the impact on CVA pricing?\n- Arbitrage pricing in terms of replication using hedge\ninstruments\n\n-\nWhat strategies can you apply to handle this efficiently in\npractice?\n- You buy credit protection on A from counterparty B\nfully collateralized\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nOverview of Enterprise-Level Derivatives Modeling\n-\nTrade-level derivatives models\n-\nModel each trade independently (PV and Greeks)\n-\nThe PV and Greeks of a portfolio is the linear aggregation of those of each trade\nin the portfolio\n-\nFocus of prevailing derivatives modeling\n-\nMore modeling efforts needed to understand the complete picture of the\neconomics and risks of OTC derivatives business\n\n-\nEnterprise-level derivatives models\n-\nModel non-linear risks/effects/metrics in a portfolio\n- Such risks/effects/metrics of a portfolio are NOT a linear aggregation of\nthose of each trade in the portfolio\n- CVA, funding, RWA/capital, liquidity are examples.\n- Model all trades and market/risk factors of a portfolio consistently (with\nproper joint distributions of the underlying market/risk factors)\n- Leveraging the trade-level models\n- Feedback to trade-level models - Cancellable swap facing a CP close to\ndefault\n-\nSignificant requirements in modeling, infrastructure, and data\n- Martingale testing, remsampling, interpolation, and modeling\n- Not studied enough in terms of systematic approaches\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n- Martingale measures for\n\n- Forward price\n\n- Forward LIBOR and swap rate\n\n- Forward FX rate\n\n- Forward CDS par coupon\n\n- Do not consider collateral discounting explicitly\nExamples of Martingales and Martingale Measures\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n-\nRisk neutral measure Q\n- Numeraire (t)\n- Yt /t) is a Q-martingale, Yt is the price of a traded asset with no intermediate\ncashflows (Harrison and Pliska martingale no-arbitrage)\n\n-\nForward arbitrage-free measure (as of T) PT\n- Numeraire P(t,T)\n- Yt /P(t,T) is a PT -martingale,\n\n-\nForward price FY(t,T) = Yt /P(t,T) is a PT -martingale.\n\n-\nHarrison, J. M. and S. R. Pliska (1981), \"Martingales and Stochastic Integrals in the\nTheory of Continuous Trading,\" Stochastic Processes and their Applications, 11, 215-\n260.\nExamples of Martingales and Martingale Measures\n\n,\n,\n,\n\ns\nt\nT\nY\nE\nT\ns\nP\nY\ns\nt\nT\nT\nt\nP\nY\nE\nT\ns\nP\nY\nT\nT\ns\ns\nt\nT\ns\ns\n\nexp\nt\ns\ns\nt\nt\nr u du\nY\ns\nE\nY\nt\nt\ns\n\nQ\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n- Forward LIBOR Li(t)\n\n- Annuity arbitrage-free measure\n\n- Forward swap rate (for accrual period from )\nExamples of Martingales and Martingale Measures\n\n,\n,\n,\n,\n,\n: Numeraire:\n,\ni N\nN i\nN\nS\nS\nA\ni N\nj\nj\nj i\nA\nS\ni N\ns\ni N\nj\nA\nt\nP t T\nY s\nA\ns\nE\nY t\nA\nt\ns\nt\nT\n-\n\nP\n\ni\ni\ni\ni\ni\nT\nt\nT\nt\nP\nT\nt\nP\nt\nL\n\n,\n/\n,\n\nis a\n-martingale.\ni\ni\nT\nL t\n\nP\n\ni\ni\nT\ns\ni\nT\nt\ns\nt\nL\nE\ns\nL\ni\n\nS\ni\nN\ni\nS\nN\nS\ni\nN\ni\nT\nt\nt\nA\nT\nt\nP\nT\nt\nP\nt\nS\n\n-\n\n,\n,\n,\n,\nS\nN\nS\ni\nT\nT\n\nto\n\n,\n,\nis a\n-martingale\ni N\nS\ni N\nA\ni\nS\nt\nt\nT\n\nP\n\nS\nj\nN\ni\nA\ns\nN\ni\nT\nt\ns\nt\nS\nE\ns\nS\ni\nN\n\n,\n,\n,\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n-\nLet denote the time t spot FX exchange rate in terms of the value or\nprice of one unit of foreign currency in terms of domestic currency.\n-\nFurthermore, let and denote the time t price of a domestic and\nforeign (default-free) zero-coupon bond paying one unit of domestic and\nforeign currency with maturity T, respectively.\n\n-\nFX forward rate\n\n-\nDomestic forward measure with numeraire of\n\nExamples of Martingales and Martingale Measures\n\nFX\nS\nt\n\n,\nD\nP\nt T\n\n,\nF\nP\nt T\n\n,\n,\n,\nF\nFX\nFX\nD\nS\nt P\nt T\nF\nt T\nt\nT\nP\nt T\n\n,\n,\n,\nT D\nFX\ns\nFX\nF\ns T\nE\nF\nt T\ns\nt\nT\n\nD\nT,\nP\n\n,\nD\nP\nt T\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nTypically, the model is solved in one measure, the martingale representations are under\nvarious martingale measures. Thus, changes of measures are needed.\nChange of measure = change of numeraire.\nLet Xt, N1(t)>0, N2(t)>0 be the arbitrage prices of simple traded assets (with at most one\ncash flow at maturity).\nXt is measure invariant, and\n\nLet YT = XT/N1(T), then\n\nParticularly,\n\nT\nt\nT\nN\nX\nE\nt\nN\nT\nN\nX\nE\nt\nN\nX\nT\nN\nt\nT\nN\nt\nt\n\nis a\n-martingale and\nis a\n-martingale, thus\nt\nN\nt\nN\nX\nN t\nX\nN\nt\nP\nP\n\nT\nt\nt\nN\nt\nN\nT\nN\nT\nN\nY\nE\nY\nE\nT\nN\nt\nT\nN\nt\n\ni\ni\ni\ni\ni\nT\nT\nt\ni\ni\ni\ni\nT\nT\nt\nT\nT\nt\nT\nT\nt\nt\nL\nT\nL\nY\nE\nT\nt\nP\nT\nt\nP\nT\nT\nP\nT\nT\nP\nY\nE\nY\nE\ni\ni\ni\n\n,\n,\n,\n,\nChange of Probability Measure\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nMartingales and Martingale Measures for Credit Derivatives\n-\nWhat about credit derivatives?\n-\nSurvival probability measure and credit spread market model\n-\nSchonbucher, P. J. (2003), \"A Note on Survival Measures and the Pricing of\nOptions on Credit Default Swaps,\" downloadable from\nhttp://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.14.1824&rep=\nrep1&type=pdf\n-\nSince is the time t value of the premium leg of the\nCDS for the jth credit name where is the default time of the jth credit name)\nwhich is a traded asset, thus we have the following martingale relationship\n\n,\n,\n,\n,\nj\nj\ni\ni\nj\ni\ni\nt\nS\nt T T\nA\nt T T\nt\n\nj\nt\n\n,\n,\n,\n,\n,\n,\n,\n,\nj\nj\nj\ni\ni\nj\ni\ni\nt\nj\ni\ni\nj\ni\ni\nT\nt\ni\ni\nS\nt T T\nA\nt T T\nt\nS\nT T T\nA\nT T T\nE\nT\nt\nT\nT\nT\nt\nt\n\nQ\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n-\nWhat is the martingale measure for CDS par coupon ?\n-\nStarting point of martingale modeling factory\n-\nNext steps are martingale representation and change of probability\nmeasure\n\n-\nSurvival annuity probability measure (Schonbucher, 2003)\n\n, ,\nj\ni\ni\nS\nt T T\n\n,\n,\n0,\n,\nj\nA\nj\ni\ni\nt\nj\ni\ni\nt\nd\nA\nt T T\nd\nt A\nT T\nt\nt\n\nP\nQ\n\n,\n,\n,\n,\nj\nA\nj\ni\ni\nt\nj\ni\ni\ni\ni\nS\nt T T\nE\nS\nT T T\nt\nT\nT\nT\n\nMartingales and Martingale Measures for Credit Derivatives\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n-\nBeneficial for both trade-level and enterprise-level models\n-\nMartingale testing: Testing against known martingale relationships\n-\nMartingale remsampling: (Linear, log-linear) Transformation of\nsimulated variables so that they exactly match given martingale\nrelationships in numerical implementation (while keeping given\nvariance metric unchanged)\n- Quadratic resampling\n\n-\nMartingale testing interpolation: Guarantees the martingale\nrelationships on the interpolated variables\n\nMartingale Testing, Remsampling, and Interpolation\n\n,\n,\ns\nM s T\nE\nM t T\ns\nt\n\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\nM s T\nM s T\nM t T\nM t T\nM s T\nM s T\nM s T\nM s T\nM t T\nM s T\nM s T\n-\n\n-\n-\n\n-\n\n(\n)\n(\n)\nStd X\nX\nX\nE X\nE X\nStd X\n\n-\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n-\nThe LIBOR Market Model\n\nwhere is a 1-dimensional -Brownian motion for Li(t).\n-\nChange to the same measure for numerical implementation\n\nwhere is a 1-dimensional -Brownian motion for Li(t)\nsatisfying\n\n-\nThis is the LIBOR market model in a general form (full dimensional\nmodel) with as many factors as there are number of LIBORs to be\nmodelled. The correlations among all LIBORs are inputs to the model.\nExample of Martingale Modelling\n\ni\nL\nT\nt\ni\ni\ni\nT\nt\ndW\nt\nt\nL\nt\ndL\ni\ni\n\n,\n\ni\ni\nL\nT\nt\nW\n,\n\niT\nP\n\ni\nL\nT\nt\ni\nN\ni\nj\nj\ni\nj\nj\nj\nj\nj\ni\ni\ni\nT\nt\ndW\ndt\nt\nL\nd\nt\nL\nd\nt\nL\nt\nL\nt\nL\nt\ndL\ni\nN\n\n-\n\n-\n\nln\n,\nln\nCorr\n,\n\ni\nN L\nT\nt\nW\n,\nN\nT\nP\n\nt\nL\nd\nt\nL\nd\ndW\ndW\nj\ni\nL\nT\nt\nL\nT\nt\nj\nN\ni\nN\nln\n,\nln\nCorr\n,\nCorr\n,\n,\n\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n-\nNormally, we (dealer/investment bank) need to charge our\ncounterparty CVA due to its likelihood of default.\n\n-\nHow to structure a trade whereby we can actually pay our\ncounterparty due to its likelihood of default?\n\n-\nHint: The trade has a positive PV to us and is roughly an increasing\nfunction of the counterparty default probability\n\nExamples and Questions\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n-\nCounterparty gives up benefit upon its default\n\n-\nExtinguisher or zero-recovery swap\n- Knocks out at zero value if counterparty or either party defaults\n\n-\nWe have more future payables to our counterparty than receivables\n\nExamples and Questions\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n-\nExtinguisher on a liability management swap of an emerging market\nsovereign (or other) entity for a bond issuance denominated in\nforeign/stronger currency\n\n-\nThe emerging market sovereign entity issues a bond denominated in\nUSD, but would like to fund with its local currency. So it enters a\ncross currency swap with a dealer/investment bank to receive USD\nand pay its local currency.\n-\nThe dealer has expected future payables on such swap.\n-\nDue to FX forward (or interest rate differential), FX and credit\ncorrelation, FX jump upon default.\n-\nExtinguisher on such a swap creates an expected benefit to the\ndealer due to the default risk of the emerging market sovereign\nentity.\n-\nExtinguisher: The swap knocks out at zero value if the emerging\nmarket sovereign entity or either party defaults.\nExamples and Questions\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\n-\nWhere does the value come from?\n-\nCan you buy credit protection on an entity from the entity itself?\n\n-\nThe dealer has bought credit protection on the sovereign entity from\nthe sovereign entity itself\n-\nThe dealer can sell such protection to a third party\n\n-\nThe sovereign entity has sold default protection on itself\n-\nReduced default recovery for other creditors\n\n-\nWhy would the emerging market sovereign entity default knowing\nthat it would lose its receivables in the swap upon default?\n\n-\nDefault event needs to reference the underlying bond\n\n-\nThere are potential legal and franchise risks\n\nExamples and Questions\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nBigger Picture -\nHigh Level Financial/Economic Objectives of a Financial Institution\n-\nRevenue Generation, Income Generation\n\n-\nRisk Management\n-\nMarket Risk, (Counterparty) Credit Risk/CVA (Credit Valuation Adjustment)\n-\nNon-Market Risk\n-\n(Cashflow) Liquidity/Funding (Cost), (Regulatory) Capital\n\n-\nEnhancing Return on Capital/Equity\n-\nCapital/RWA (Risk Weighted Asset) Management/Optimization\n\n-\nMore ?\n\n-\nNon-linear portfolio effects/risks (requiring enterprise-level models)\n-\n(Counterparty) Credit Risk/CVA, (Cashflow) Liquidity/Funding (Cost),\nRWA, (Regulatory) Capital, Others\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nSelected References\n-\nJamshidian, F. (1997), \"LIBOR, and Swap Market Models, and Measures,\" Finance Stochastic., 1,\n291-328.\n-\nHarrison, J. M. and D. M. Kreps (1979), \"Martingales and Arbitrage in Multiperiod Securities\nMarkets,\" Journal of Economic Theory, 20, 381-408.\n-\nHarrison, J. M. and S. R. Pliska (1981), \"Martingales and Stochastic Integrals in the Theory of\nContinuous Trading,\" Stochastic Processes and their Applications, 11, 215-260.\n-\nSchonbucher, P. J. (2003), \"A Note on Survival Measures and the Pricing of Options on Credit\nDefault Swaps,\" downloadable from http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.14.1824\n&rep=rep1&type=pdf\n-\nTang, Yi and Bin Li (2007), \"Quantitative Analysis, Derivatives Modeling, And Trading Strategies In\nThe Presence Of Counterparty Credit Risk For Fixed-Income Markets,\" World Scientific,\nhttp://papers.ssrn.com/sol3/papers.cfm?abstract_id=1477288\n-\nTang, Yi and Andrew Williams (2010), \"Ch. 9 Funding Benefit and Funding Cost\" in \"Counterparty\nCredit Risk\" Ed. Eduardo Canabarro, Risk Books, http://riskbooks.com/counterparty-credit-risk\n-\nZhu, Steven H. and Pykhtin, Michael, \"A Guide to Modeling Counterparty Credit Risk.\" GARP\nRisk Review, July/August 2007. Available at SSRN: http://ssrn.com/abstract=1032522\nDeveloped for educational use at MIT and for publication through MIT OpenCourseware.\nNo investment decisions should be made in reliance on this material.\n\nPlease see additional important information and qualifications at the end of this material.\nDisclaimer\nThe information in this material was prepared by sales, trading, or other non-research personnel of Morgan Stanley for institutional investors. This is not a research report, and unless otherwise indicated, the\nviews herein (if any) are the author's and may differ from those of our Research Department or others in the Firm. This material is not independent of the interests of our trading and other activities,\nwhich may conflict with your interests. We may deal in any of the markets, issuers, or instruments mentioned herein before or after providing this information, as principal, market maker, or liquidity\nprovider and may also seek to advise issuers or other market participants.\nWhere you provide us with information relating to an order, inquiry, or potential transaction, we may use that information to facilitate execution and in managing our market making and hedging activities.\nThis material does not provide investment advice or offer tax, regulatory, accounting, or legal advice. By submitting this document to you, Morgan Stanley is not your fiduciary, municipal, or any other type of\nadvisor.\nThis material is not based on a consideration of any individual client circumstances and thus should not be considered a recommendation to any recipient or group of recipients. This material is an invitation to\nconsider entering into derivatives transactions under CFTC Rules 1.71 and 23.605 (where applicable) but is not a binding offer to buy or sell any instrument or enter into any transaction.\nUnless otherwise specifically indicated, all information in these materials with respect to any third party entity not affiliated with Morgan Stanley has been provided by, and is the sole responsibility of, such\nthird party and has not been independently verified by Morgan Stanley, our affiliates or any other independent third party. We make no express or implied representation or warranty with respect to\nthe accuracy or completeness of this material, nor will we undertake to provide updated information or notify recipients when information contained herein becomes stale.\nAny prices contained herein are indicative only and should not be relied upon for valuation or for any use with third parties.\nAll financial information is taken from company disclosures and presentations (including 10Q, 10K and 8K filings and other public announcements), unless otherwise noted. Any securities referred to in this\nmaterial may not have been registered under the U.S. Securities Act of 1933, as amended and, if not, may not be offered or sold absent an exemption therefrom. In relation to any member state of\nthe European Economic Area, a prospectus may not have been published pursuant to measures implementing the Prospectus Directive (2003/71/EC) and any securities referred to herein may not\nbe offered in circumstances that would require such publication. Recipients are required to comply with any legal or contractual restrictions on their purchase, holding, sale, exercise of rights, or\nperformance of obligations under any instrument or otherwise applicable to any transaction. In addition, a secondary market may not exist for certain of the instruments referenced herein.\nThe value of and income from investments may vary because of, among other things, changes in interest rates, foreign exchange rates, default rates, prepayment rates, securities, prices of instruments or\nsecurities, market indexes, operational, or financial conditions of companies or other factors. There may be time limitations on the exercise of options or other rights in instruments (or related\nderivatives) transactions. Past performance is not necessarily a guide to future performance. Estimates of future performance are based on assumptions that may not be realized. Actual events\nmay differ from those assumed, and changes to any assumptions may have a material impact on any projections or estimates. Other events not taken into account may occur and may significantly\naffect any projections or estimates. Certain assumptions may have been made for modeling purposes only to simplify the presentation or calculation of any projections or estimates, and Morgan\nStanley does not represent that any such assumptions will reflect actual future events or that all assumptions have been considered or stated. Accordingly, there can be no assurance that any\nhypothetical estimated returns or projections will be realized or that actual returns or performance results will not materially differ. Some of the information contained in this document may be\naggregated data of transactions executed by Morgan Stanley that has been compiled so as not to identify the underlying transactions of any particular customer.\nThis information is not intended to be provided to and may not be used by any person or entity in any jurisdiction where the provision or use thereof would be contrary to applicable laws, rules, or regulations.\nThis communication is directed to and meant for sophisticated investors, including specifically, institutional investors in the U.S and those persons who are eligible counterparties or professional clients in the\nEuropean Economic Area. It must not be re-distributed to or relied upon by retail clients.\nThis information is being disseminated in Hong Kong by Morgan Stanley Asia Limited and is intended for professional investors (as defined in the Securities and Futures Ordinance) and is not directed at the\npublic of Hong Kong. This information is being disseminated in Singapore by Morgan Stanley Asia (Singapore) Pte. This information has not been registered as a prospectus with the Monetary\nAuthority of Singapore. Accordingly, this information and any other document or material in connection with the offer or sale, or invitation for subscription or purchase, of this security may not be\ncirculated or distributed, nor may this security be offered or sold, or be made the subject of an invitation for subscription or purchase, whether directly or indirectly, to persons in Singapore other\nthan (i) to an institutional investor under Section 274 of the Securities and Futures Act, Chapter 289 of Singapore (the \"SFA\"), (ii) to a relevant person pursuant to Section 275(1) of the SFA, or any\nperson pursuant to Section 275(1A) of the SFA, and in accordance with the conditions, specified in Section 275 of the SFA or (iii) otherwise pursuant to, and in accordance with the conditions of,\nany other applicable provision of the SFA. Any offering of this security in Singapore would be through Morgan Stanley Asia (Singapore) Pte, an entity regulated by the Monetary Authority of\nSingapore.\nThis information is being disseminated in Japan by Morgan Stanley MUFG Securities Co., Ltd. Any securities referred to herein may not have been and/or will not be registered under the Financial\nInstruments Exchange Law of Japan (Law No. 25 of 1948, as amended, hereinafter referred to as the \"Financial Instruments Exchange Law of Japan\"). Such securities may not be offered, sold, or\ntransferred, directly or indirectly, to or for the benefit of any resident of Japan unless pursuant to an exemption from the registration requirements of and otherwise in compliance with the Financial\nInstruments Exchange Law and other relevant laws and regulations of Japan. As used in this paragraph, \"resident of Japan\" means any person resident in Japan, including any corporation or other\nentity organized or engaged in business under the laws of Japan. If you reside in Japan, please contact Morgan Stanley MUFG Securities for further details at +613-5424-5000.\nThis information is distributed in Australia by Morgan Stanley Australia Limited A.B.N. 67 003 734 576, holder of Australian financial services license No. 233742, which accepts responsibility for its contents,\nand arranges for it to be provided to potential clients. In Australia, this report, and any access to it, is intended only for \"wholesale clients\" within the meaning of the Australian Corporations Act.\nFor additional information, research reports, and important disclosures see https://secure.ms.com/servlet/cls. The trademarks and service marks contained herein are the property of their respective owners.\nThird-party data providers make no warranties or representations of any kind relating to the accuracy, completeness, or timeliness of the data they provide and shall not have liability for any\ndamages of any kind relating to such data.\nThis material may not be redistributed without the prior written consent of Morgan Stanley.\n(c) 2013 Morgan Stanley\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Topics in Mathematics with Applications in Finance\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Itō calculus",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/ef2c66c8079ba656210ad1fd4a5e2fa8_MIT18_S096F13_lecnote18.pdf",
      "content": "1. Ito's calculus\nIn the previous lecture, we have observed that a sample Brownian path is\nnowhere differentiable with probability 1. In other words, the differentiation\ndBt\ndt\ndoes not exist. However, while studying Brownain motions, or when using\nBrownian motion as a model, the situation of estimating the difference of a\nfunction of the type\nf(Bt)\nover an infinitesimal time difference occurs quite frequently (suppose that\nf is a smooth function). To be more precise, we are considering a function\nf(t, Bt) which depends only on the second variable. Hence there exists an\nimplicit dependence on time since the Brownian motion depends on time.\nIf the differentiation dBt\ndt existed, then we can easily do this by using chain\nrule:\ndf =\ndBt\ndt · f′(Bt)\n\ndt.\nWe already know that the formula above makes no sense.\nOne possible way to work around this problem is to try to describe the\ndifference df in terms of the difference dBt. In this case, the equation above\nbecomes\n(1.1)\ndf = f′(Bt)dBt.\nOur new formula at least makes sense, since there is no need to refer to the\ndifferentiation dBt\ndt which does not exist. The only problem is that it does\nnot quite work. Consider the Taylor expansion of f to obtain\nf(x + ∆x) -f(x) = (∆x) · f′(x) + (∆x)2\nf′′(x) + (∆x)3\nf′′′(x) + · · · .\nTo deduce Equation (1.1) from this formula, we must be able to say that\nthe significant term is the first term (∆x) · f′(x) and all other terms are of\nsmaller order of magnitude. Is this true for x = Bt? For x = Bt, we have\n∆f = (∆Bt) · f′(Bt) + (∆Bt)2\nf′′(x) + (∆Bt)3\nLecture 18 : Ito Calculus\nf′′′(x) +\n· · · .\nNow consider the term (∆Bt)2. Since Bt is a Brownian motion, we know\nthat E[(∆B\nt) ] = ∆t. Since a difference in Bt is necessarily accompanied by\na difference in t, we see that the second term is no longer negligable. The\ntheory of Ito calculus essentially tells us that we can make the substitution\n\n(∆Bt)2 = ∆t, and the remaining terms are negligable. Hence the equation\nabove becomes\n∆t\n∆f = (∆Bt) · f′(Bt) +\nf′′(x) +\n· · · ,\nwhich in terms of infinitesimals becomes\n(1.2)\ndf(Bt) = f′(Bt)dBt +\nf′′(Bt)dt.\nThis equation known as the Ito's lemma is the main equation of Ito's cal-\nculus.\nMore generally, consider a smooth function f(t, x) which depends on two\nvariables, and suppose that we are interested in the differential of f(t, Bt).\nIn classical calculus, we will get\n∂f\ndf = ∂t dt + ∂f\n∂xdx,\nbut in Ito calculus, we will have\ndf(t, Bt) = ∂f\n∂t dt + ∂f\n∂xdBt + 1\n∂2f\n∂x2 (dBt)2\n=\n∂f\n∂t + 1\n∂2f\n∂x2\n\ndt + ∂f\n∂xdBt.\nTheorem 1.1. (Ito's lemma) Let f(t, x) be a smooth function of two vari-\nables, and let Xt be a stochastic process satisfying dXt = μtdt + σtdBt for a\nBrownian motion Bt. Then\ndf(t, Xt) =\n∂f\n∂t + μt\n∂f\n∂x + 1\n2σ2\nt\n∂2f\n∂x2\n\ndt + ∂f\n∂xdBt.\nProof. We have\ndf(t, Xt) = ∂f\n∂t dt + ∂f\n∂xdXt + 1\n∂2f\n∂x2 (dXt)2\n=\n∂f\n∂t + μt\n∂f\n∂x + 1\n2σ2\nt\n∂2f\n∂x2\n\ndt + σt\n∂f\nLecture 18\ndBt + ..dtdBT + ..(dt)2.\n∂x\nWe can ignore the terms dtdBt and (dt)2.\n□\nDefinition 1.2. We define integration as an inverse of differentiation, i.e.,\nF(t, Bt) =\nˆ\nf(t, Bt)dBt +\nˆ\ng(t, Bt)dt,\nif and only if\ndF = f(t, Bt)dBt + g(t, Bt)dt.\nExample 1.3. (i) The stochastic process Xt = μt + σBt is known as the\nBrownian motion with drift μ and variance σ. For this process, we have\ndXt = μdt + σdBt.\n\n(ii) Consider the function f(x) = 1\n2x2. We see that\ndf(Bt) = BtdBt + 1dt.\nEquiavlently,\n2B2\nT =\nˆ T\nBtdBt +\nˆ T\n2dt =\nˆ T\nBtdBt + T\n2 .\nThis implies that\nˆ T\nBtdBt = 1\n2B2\nT -T\n2 .\nNote how this 'violates' the fundamental theorem of calculus.\n(iii) Let f(t, x) = exp(μt + σx). Then\ndf(t, Bt) = (μ + 1\n2σ2)f(t, Bt)dt + σf(t, Bt)dBt.\nWe can now answer the question of finding the stochastic process Xt(t, Bt)\nsuch that\ndXt = σXt · dBt.\nTo do this we can just set μ = -1\n2σ2 in the function above, i.e., Xt(t, Bt) =\nexp(-1\n2σ2t + σBt).\n(iv) Let f(t, x) = t2 + x2, and Xt = μt + σBt. Then\ndf(t, Xt) = 2tdt + 2XtdXt + (dXt)2\n= 2tdt + 2(μdt + σdBt) + σ2dt\n= (2t + 2μ + σ2)dt + 2σdBt.\nWe discussed an elegant way to work around the fact that Bt is not\ndifferentiable to understand the difference of a function of a Brownian motion\nover a small period of time. For the remainder of this class, we will study\nthe properties of Ito calculus by addressing the following type of questions:\n(1) Given g(t, Bt) =\n\na dBt +\n\nb dt for some functions a and b, is there\na simple way to describe the variance of g?\n(2) Given g(t, Bt) as above, when is g a martingale?\n(3) Suppose that b = 0. Then when is g(t, Bt) normally distributed at\ntime t?\nRemark. The theory of calculus can be extended to cover Brownian motions\nin several different ways which are all 'correct' (in other words, there can\nbe several different versions of Ito's calculus). For example, there exists a\ntheory of calculus where\ndf = f′(Bt)dBt -1\nLecture 18\nf′′(Bt)dt.\n\nLecture 18\nHowever, Ito integral is the most natural one in the context of how the time\nvariable fits into the theory, because the fact that we cannot see the future\nis the basis of the whole theory. We will further study this in next section.\n2. Properties of Ito calculus\nFirst theorem can be seen as an extension of the fact that the sum of\nindependent normal random variables is a random variable.\nTheorem. Let B(t) be a Brownian motion, and let ∆(t) be a nonrandom\nfunction of time. Suppose that a stochastic process I(t) satisfies\ndI = ∆(s)dBs\ni.e.\nI(t) =\nˆ\n∆(s)dBs.\nwhere I(0) = 0. Then for each t ≥0, the random variable I(t) is normally\ndistributed.\nWhat happens when we allow ∆(t) to be a random function of time?\nHere is an interesting and natrual class of random varialbes ∆(t) that we\nconsider.\nDefinition 2.1. Let Xt be a stochastic process. A process ∆t is called an\nadapted process (with respect to Xt) if for all t ≥0, the random variable ∆t\ndepends only on Xs for s ≤t.\nExample 2.2. Let Xt be a stochastic process.\n(i) The process ∆(t) = Xt is an adapted process.\n(ii) The process ∆(t) = min{Xt, c} is an adapted process (where c is a\nconstant).\n(iii) The process ∆(t) = max0\nt\nT Xt is not an adapted process.\n≤≤\n(iv) If τ is a stopping time, then Xτ is an adapted process.\nFor example, suppose that we model the price of a stock using a stochastic\nprocess, and are trying to find a strategy which has positive expected return.\nConsider a simple strategy where at each time t, we either buy or sell one\nstock, hence ∆t = 1 or -1.\nOur strategy only makes sense if ∆t is an\nadapted process, since otherwise it contradicts the fact that we cannot see\nthe future.\nOur second theorem asserts that for a Brownian motion Bt, the Ito inte-\ngral of an adapted process with respect to Bt is also a martingale.\nTheorem 2.3. Let Bt be a Brownian motion. Then for all adapted processes\ng(t, Bt), the integral\nˆ\ng(t, Bt) dBs\nis a martingale, as long as g is a 'reasonable function'. Formally, if g ∈L2,\ni.e.,\nˆ ˆ t\ng2(t, Bt)dtdBt <\ninf.\n\nExample 2.4. The process Bt itself is an adapted process. Recall that\nˆ t\nBsdBs = 1\n2B2\nt -t\n2,\nand E[B2\nt ] = t. Hence\nE[\nˆ t\nBsdBs] = 0.\nMore generally,\nE[\nˆ t2\nt1\nBsdBs | Ft1] = E[\n2B2\nt2 -t2\n\n| F1] -\n2B2\nt1 -t1\n\n= 1\n2(t2 -t1) + 1\n2B2\nt1 -t2\n2 -1\n2B2\nt1 + t1\nLecture 18\n= 0.\nThis confirms the theorem above for ∆(t) = Bt.\nHere is another useful fact about the Ito integral of an adapted process\nknown as Ito isometry. It can be used to compute the variance of the Ito\nintegral.\nTheorem 2.5. (Ito isometry) Let Bt be a Brownian motion. Then for all\nadapted processes ∆(t), we have\n\"ˆ t\n2#\nˆ t\nE\n∆(s)dBs\n= E\n∆(s)2ds\n\n.\nExample 2.6. Let ∆(t) = 1. Then the left hand side of the theorem above\nis\nE\n\"ˆ t\n∆(s)dBs\n2#\n= E[B2\nt ] = t,\nand the right hand side of the above is\nE\nˆ t\n∆(s)2ds\n\n= E[t] = t.\nt\nNote that\n\n∆(s)dBs = 0 by Theorem 2.1 given above. Hence Ito isom-\netry tell us how to compute the variance of this integral .\n3. Change of measure\nFollowing is a quote from [3].\nCan a stochastic process with drift also be viewed as a pro-\ncess without drift?\nThis modestly paradoxical question is\nno mere curiosity. It has many important consequences, the\nmost immediate of which is the discovery that almost any\nquestion about Brownian motion with drift may be rephrased\nas a parallel question about standard Brownian motion.\n\nRecall that a stochastic process is a probability distribution over a set of\npaths. A change of measure of a stochastic process is a method of shifting\nthe probability distribution into another probability distribution. In this\nsection, we fix a final time T and suppose that all paths are defined over the\ntime 0 ≤t ≤T. Also, we take a more abstract view of defining stochastic\nprocesses in terms of an underlying space Ω. Hence a stochastic process X is\na function X : Ω→[0, T]inffor ω ∈Ω, where P is a probability distribution\nover Ωand describes the probability distribution of paths through X-1, i.e.\nP(A) = P(X-1(A)) for all set of paths A ⊂[0, T]inf. We denote a particular\nrealization of a stochastic process as Xω.\nLet Z be a positive random variable satisfying\n\nZ(ω) dX(ω) = 1. Then\nwe can define a new stochastic process X whose probability distribution is\ngiven by\nP(A) =\nˆ\nA\nZ(ω) dX(ω),\nfor all sets A. Since Z is positive, we see that\n(3.1)\nP(A) > 0 ⇔ P(A) > 0\n∀A.\nHence the set of paths 'observed' under the probability measures P and P\nare the same.\nDefinition 3.1. We say that two probability distributions P and P are\nequivalent if (3.1) holds.\nWhen changing measures, we fix a set Ωof possible paths, and change\na probability distribution P over Ω, and make it into another equivalent\n(property 3.1) probability distribution over Ω. Thus the underlying space\nis the same but we only change our point of view.\nThis is not true for\ngeneral transformations. For example, consider the square of a path. The\nprobability distribution of the square of a Brownian motion B(t)2 is not\nequivalent to the probability distribution of B(t).\nThe function Z is known as the Radon-Nikod ym derivative of P with\nrespect to P, and is denoted as\nZ = d P\nLecture 18\n.\ndP\nChanging measures is of theoretical importance since it provides a tool\nto understand the relation between two different but equivalent stochastic\nprocesses. It is also of practical importance, since converting one probability\ndistribution into another can reveal hidden insights. For example, in finance,\nwe can convert a non-martingale stochastic process into a martingale by\nchanging measure, and this gives a method of pricing financial derivatives.\nWe now come back to the original question that we posted: 'Can a sto-\nchastic process with drift also be viewed as a process without drift?'. We\nnow see that this is the same question as asking whether the two stochastic\n\nprocesses are equivalent. Our first theorem asserts that this indeed is the\ncase for Brownian motions.\nTheorem 3.2. (Girsanov's theorem, simple version) Let (Ω, P) be a prob-\nability space, and let X : Ω→[0, T]infbe a stochastic process which is a\nBrownian motion with drift μ under the probability distribution inudced by\n(Ω, P). Consider the probability distribution P over Ωdefined as\nd P\ndP(ω) = e-μω(T)-μ2T/2.\nThen X is a Brownian motion with no drift under the probability distribution\ninduced by (Ω, P).\nFollowing is a more general version of the theorem above.\nTheorem 3.3. (Girsanov's theorem) Let (Ω, P) be a probability space, and\nlet X : Ω→[0, T]infbe a stochastic process which is a Brownian motion with\nno drift under the probability distribution induced by (Ω, P). Let ∆(t) be a\nbounded adapted process, and consider the probability distribution P over Ω\ndefined as\nd P\ndP(ω) = e-\nT\n0 ∆(u)dω-1\nLecture 18\nT ∆(u) du\n.\nThen the stochastic process defined as\nt\nYω(t) = Xω(t) +\nˆ\n∆(u)du,\n\nis a Brownian motion under the probability distribution induced by (Ω, P).\n4. Remarks\nWe avoided all technalities in this lecture note. Formalizaing the theory\nof Ito calculus requires a solid background in measure theory.\nReferences\n[1] P. Wilmott, S. Howison, J. Dewynne, The mathematics of financial derivatives\n[2] S. Shreve, Stochastic calculus for finance II: continuous-time models\n[3] M. Steele, Stochastic calculus and financial applications\n[4] Failure\nof\npathwise\nintegration\nfor\nFV\nprocesses,\nhttp://almostsure.wordpress.com/2010/06/02/failure-of-pathwise-integration-for-\nfv-processes/\n[5] R. Karandikar, On pathwise stochastic integration, Stochastic Process. Appl. 57\n(1995), p. 11-18.\n[6] M. Nutz, Pathwise construction of stochastic integrals\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Topics in Mathematics with Applications in Finance\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Linear Algebra",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/bf77e900565f6487e3f46ba38dcc6dd6_MIT18_S096F13_lecnote2.pdf",
      "content": "Lecture 2: Linear Algebra\n1. MATRICES, EIGENVALUES AND EIGENVECTORS\nA matrix can be defned as a collection of numbers arranged in a certain way. A\nmatrix can also be viewed as an operator (a linear transformation) from Rn to Rn;\nbut what does a linear transformation defned by a data set mean?\nFor example, consider a 10 × 10 matrix whose rows are indexed by companies\nand columns are indexed by dates. The (i, j)-entry of the matrix is the price of\nthe stock of the i-th company on date j. This is a matrix defned by some real-life\ndata. Can we give a meaning to the transformation defned by this matrix?\n\\e begin by reviewing eigenvalues and eigenvectors of a matrix. \\e use the\nnotation < v, w > for inner product of vectors. It can also be written in matrix\nmultiplication form as < v, w >= vT · w (a vector is to be understood as a column\nmatrix).\nDefnition 1. Let A be an n ×n matrix of real entries. If a non-zero vector v ∈ Rn\nand a complex number λ satisfes\nAv = λv,\nthen v is called an eigenvector of A and λ is an eigenvalue of A.\nDoes a matrix always have eigenvalues and eigenvectors? To answer this ques\ntion, note that a real number λ is an eigenvalue of A if and only if\n(A - λI)v = 0,\nfor some vector v. Hence it follows that det(A - λI) = 0. Note that if one considers\nλ as a variable, then det(A - λI) becomes a polynomial of degree n. Therefore we\ncan conclude that there are at least 1 and at most n distinct (complex) eigenvalues\nof an n × n matrix.\nNote that the matrix A applied to its eigenvector acts as if it is a scalar mul\ntiplication. Thus eigenvectors are 'the important' directions of a matrix, when\nconsidered as an operator.\nDefnition 2. A matrix A is diagonalizable if there exists an invertible matrix P\nand a diagonal matrix D such that\nA = P -1DP.\nRecall that the conjugation operation by an invertible matrix A is equivalent\nto a change of basis of the underlying space. Hence a matrix is diagonalizable if\nthere exists a basis for which A becomes a diagonal matrix. Hence a matrix A is a\ndiagonalizable matrix if there exists a basis on which A acts as a scaling operator.\n\nLECTURE 2\n2. EIGENVALUES AND EIGENVECTORS OF SYMMETRIC MATRICS\nA matrix A is symmetric if A = AT . The eigenvalues and eigenvectors of sym\nmetric matrices will be of particular interest to us, since we will encouter many\nsuch matrices throughout the course. The following proposition establishes some\nproperties of eigenvalues and eigenvectors of symmetric matrices.\nProposition 3. Let A be a real symmetric matrix. Then the following holds.\n(i) All eigenvalues are real.\n(ii) A is orthonormally diagonalizable (i.e., there exists an orthonormal matrix\nU such that A = U -1DU).\nProof. (i) Let λ be an eigenvalue and v be an eigenvector such that Av = λv.\nConsider\nT\nv T Av = v · (λv) = λ ||v|| .\nSince A = A\nT , we also have\nT\nT A\nv T Av = v\nv = (λv T ) · v = λ ||v|| .\nTherefore, λ = λ, and thus λ is real.\n(ii) Let λ1 be an eigenvalue of A and v1 be a corresponding eigenvector (recall\nthat all n × n matrices have at least one eigenvalue). Let\nW1 = {w : < w, v1 >= 0}\nbe the set of vectors orthogonal to v1. Note that W1 forms a subspace of Rn . For\na vector w ∈ W1, we have\n< Aw, v1 >=< w, Av1 >= λ < w, v1 >= 0,\nand therefore W1 is a vector space of dimension n - 1 that is closed under the\ntransformation A.\nLet B' be an orthonormal basis of the vector space W1, and note that B =\n{v1} ∪B' forms an orthonormal basis of Rn . Let U be the vector whose columns\nare the vectors in the basis {v1} ∪B, where v1 is the frst column. Then the\nobservation above shows that\nλ1\nUAU -1 =\n,\nA1\nwhere A1 is a symmetric (n - 1) × (n - 1) matrix. By repeating the process, we\nobtain a orthonormal diagonalization of A.\nD\nThe largest eigenvalue of a symmetric matrix also has the following property.\nTheorem 4. If A is symmetric, then max||v||=1 |Av| = maxλ |λ|, where the second\nmaximum is taken over all eigenvalues of the matrix.\n3. SINGULAR VALUE DECOMPOSITION\nFor a diagonalizable matrix A, we refer to D = UAU -1 as the eigenvalue de\ncomposition of A. \\e saw that symmetric matrices are diagonalizable. Can we do\nsomething similar for general n × n matrices? \\hat about m × n matrices? Sin\ngular value decomposition is a generalization of the eigenvalue decomposition that\nacheives this goal. It is a tool which allows one to understand a matrix through a\ndiagonal matrix.\n\nLECTURE 2\nTheorem 5. Every m × n matrix Amn can be expressed as\nT\nAmn = UmmΣmnVnn\nfor a m × m orthonormal matrix Umm , a a diagonal m × n matrix Σmn, and a\nn × n orthonormal matrix Vnn.\nBefore proving the theroem, let us frst compare it to the diagonalization (eigen\nvalue decomposition) A = UDU T of a matrix.\nBoth decompositions provide a method of understanding a matrix through a\ndiagonal matrix. Eigenvalue decomposition of a matrix is much more powerful and\nit gives a basis to which the matrix acts like scalar multiplication. On the other\nhand, singular value decomposition gives a basis of Rn and a basis of Rm, where\nthe action of the matrix on the frst basis can be understood through a scalar\nmultiplication of the second basis.\nProof. Suppose that A has rank r ≤ min{m, n}. Note that AT · A also has rank\nr. Let σ1\n2 , · · · , σr\n2 be the non-zero eigenvalues of AT · A, and let vi be orthonor\nmal eigenvectors (where vi is the eigenvector corresponding to σi for 1 ≤ i ≤ r).\nComplete the collection v1, v2, · · · , vr into an orthonormal basis by adding vectors\nvr+1, · · · , vn.\nFor 1 ≤ i ≤ r, let ui = Avi . Note that for distinct i, j we have,\nσi\nu T\ni · uj =\n1 v T\nj AT Avi =\n1 v T\nj · (σivi) = 0,\nσiσj\nσiσj\nsince vj and vi are orthogonal. Therefore, u1, · · · , ur is an orthogonal set of vec\ntors. Complete this collection as a set of orthonormal basis by adding vectors\nur+1, · · · , um and let σi = 0 for all r + 1 ≤ i ≤ m. Let U = [u1 u2 · · · um] and\nV = [v1 v2 · · · vn] and note that\nU T AV = U T · [σ1u1 σ2u2 · · · σmum] = [σ1e1 σ2e2 · · · σmem] = Σ,\nis a diagonal matrix. Hence\nA = UΣV T ,\nand we found our matrices U and V as claimed.\nD\nDefnition 6. The (positive) square roots of the eigenvalues of AT A is called the\nsingular values of A. It is customary to denote the singular values in decreasing\norder of magnitude σ1 ≥ σ2 ≥ · · · ≥ σm. Note that these are the diagonal entries\nof the matrix Σmn, in the decomposition given above.\nExercise 7. Prove that the singular values can also be obtained by considering the\nmatrix AAT .\nRecall the example given in the introduction where we consider a matrix whose\nrows are indexed by stocks and columns by dates. Is it more sensible to consider a\neigenvalue decomposition or a singular value decomposition?\n\\e mostly will use matrices with m ≤ n. In this case, we can further simplify\nthe decomposition as follows.\nCorollary 8. (Reduced SVD) Let m ≤ n. Then every m × n matrix Amn can be\nexpressed as\nV T\nAmn = UmmΣmm\nnm\n\nLECTURE 2\nfor a m × m orthogonal matrix Umm , a diagonal m × m matrix Σmm, and a n × m\nmatrix Vnm whose columns are orthogonal.\nProof. If m ≤ n, then in the diagonal matrix Σmn, for j > m, the j-th column of\nΣmn is a all-zero vector. Hence even if we remove the (m + 1)-th column to the\nn-th column of Σmn, and remove the (m + 1)-th column to the n-th column of Vnn,\nthe outcome of\nV T\nΣmn\nnm\ndoes not change. Hence we obtain a decomposition as claimed.\nD\nExercise 9. Are the matrices U and V uniquely determined?\nExample 10. Consider the matrix\nA =\n-2\n.\n\\e see that\n⎡\n⎤\n⎡\n⎤\nT\nAA =\n-2\n· ⎣2\n-2\n⎦ = ⎣ 12\n-2\n-2 ⎦ .\nThe eigenvalues of this matrix are 0, 9, 25, and the singular values are 5, 3. \\e can\nalso use AT A, which is a 2 × 2 matrix, to obtain the singular values.\nTo obtain the singular value decoposition, we need to fnd the eigenvectors of\nAAT . To fnd the eigenvector corresponding to the eigenvalue 25, note that\n⎡\n⎤\n-12\nAAT - 25I = ⎣ 12\n-12\n-2 ⎦ .\n-2\n-13\nThe matrix above can be row-reduced to give the matrix\n⎡\n⎤\n1 -1\n⎣ 0\n0 ⎦ ,\nand therefore (1, 1, 0) is an eigenvector corresponding to 25. By normalizing this\nvector, we can take v1 = ( √1 , √1 , 0) as the eigenvector. Similarly, we can also\n√1\n√1\n√4\nfnd a unit eigenvector v2 = (\n, -\n,\n) of 9. (There is no need to fnd the\neigenvector corresponding to 0 when fnding the simplifed form of SVD).\nIn the proof of the singular value decomposition, the matrix U consisted of the\nAvi\nvectors ui =\n. Therefore,\nσi\n√\n√\n1/ 2\n1/ 2\nu1 =\n√\nu2 =\n√\n.\n1/ 2\n-1/ 2\nHence,\nU = [u1 u2]\nand V = [v1 v2] ,\nand\n√\n√\n√\n√\n1/ 2\n1/ 2\n1/\n1/ 2\nA = UΣV T =\n√\n√\n·\n·\n√\n√\n√\n.\n1/ 2 -1/ 2\n1/ 18 -1/ 18 4/ 18\n\nLECTURE 2\n4. THE PERRON-FROBENIUS THEOREM\nTheorem 11. (PerronFrobenius) If A is an n × n matrix whose entries are all\npositive (greater than zero), then\n1. There is a positive real eigenvalue λ0 such that all other eigenvalues satisfy\n|λ| < λ0,\n2. there is a positive eigenvector corresponding to λ0, and\n3. λ0 is an eigenvalue of multiplicity 1.\nProof. \\e only give the sketch of the proof for symmetric matrices.\nNote that symmetric matrices have real eigenvalues. Let λ+ be the largest eigen\nvalue and λ- be the smallest eigenvalue. If λ+ > |λ-|, then Property 1 follows.\nSuppose not (thus |λ-| ≥ λ+). Then by Theorem 2 above, it follows that the\neigenvector v of λ- maximizes the quantity\n||Av||\n||v||\nover all non-zero vectors. The vector v has real entries. \\ithout loss of generality\nassume that v · (1, 1, · · · , 1) ≥ 0. Since A has positive entries, whenever we switch\nthe sign of a negative entry of v, we obtain a vector of the same norm as v having\nlarger value of ||Av||. This contradicts the fact that |λ-| ≥ λ+. Therefore, we must\nhave λ+ > |λ-|.\nA similar argument shows that all entries of an eigenvector w corresponding to\nλ+ needs to be non-negative. Moreover, since A has positive entries, the only way\nw can have a zero entry is if w is the all-zero vector. Hence we have Property 2.\nFinally, to see Property 3, suppose that there are two linearly independent unit\neigenvectors w1 and w2 both corresponding to λ+. Since w1 =\nw2 and w1, w2 are\nboth unit vectors, we see that w1 -w2 must have both positive and negative entries.\nMoreover, w1 - w2 is also an eigenvector corresponding to λ+. This is impossible\nby the argument above saying that all entries of an eigenvector corresponding to\nλ+ must have the same sign.\nD\nPerron-Frobenius theorem holds for a more general class of matrices (see, e.g.,\n\\ikipedia).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Topics in Mathematics with Applications in Finance\n\nFall 2013\n.\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms"
    },
    {
      "category": "Resource",
      "title": "Portfolio Management",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/d36136adb6ab4d3d841df5e31824bf81_MIT18_S096F13_lecnote16.pdf",
      "content": "Portfolio Management\n18.S096 Lecture 16\nDr. Jake Xia\nOutline\n1. Introduction of Portfolio Construction\n2. Portfolio Theory --- Illustrated in special\ncases\n3. Risk Parity Portfolio\n4. Limitations\n5. What we learned today\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Topics in Mathematics with Applications in Finance\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Portfolio Theory",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-s096-topics-in-mathematics-with-applications-in-finance-fall-2013/bba02164ba6642f7d516df35347aec01_MIT18_S096F13_lecnote14.pdf",
      "content": "Portfolio Theory\nPortfolio Theory\nMIT 18.S096\nDr. Kempthorne\nFall 2013\nMIT 18.S096\nPortfolio Theory\nLecture 14:\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nOutline\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nMarkowitz Mean-Variance Analysis (MVA)\nSingle-Period Analyisis\nm risky assets: i = 1, 2, . . . , m\nSingle-Period Returns: m-variate random vector\nR = [R1, R2, . . . , Rm]′\nMean and Variance/Covariance of Returns:\nα1\n\nΣ1,1\n· · ·\nΣ1,m\n.\nE[R] = α =\n.\n.\n.\n.\n, Cov[R] = Σ =\nm\n\n.\n.\n.\n.\n.\n.\n.\n\nα\nΣm,1\n· · ·\nΣm,m\n\nPortfolio: m-vector of weights indicating the fraction of\nportfolio wealth held in eachP\nasset\nw\nm\n= (w1, . . . , wm) :\ni=1 wi = 1.\n= w\nm\nPortfolio Return: Rw\n′R =\ni=1 wiRi a r.v. with\nαw\n=\nE[Rw]\n=\nP\nw′α\nσ2\nw\n=\nvar[Rw]\n=\nw′Σw\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nMarkowitz Mean Variance Analysis\nEvaluate different portfolios w using the mean-variance pair of the\nportfolio: (αw, σ2\nw) with preferences for\nHigher expected returns αw\nLower variance varw\nProblem I: Risk Minimization: For a given choice of target mean\nreturn α0, choose the portfolio w to\nMinimize:\n1w\n′Σw\nSubject to:\nw′α = α0\nw′1m = 1\nSolution: Apply the method of Lagrange multipliers to the convex\noptimization (minimization) problem subject to linear constraints:\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nRisk Minimization Problem\nDefine the Lagrangian\nL(w, λ1, λ2) = 1w\n′Σw+λ1(α0-w′α)+λ2(1-w′1m)\nDerive the first-order conditions\n∂L\n=\n∂w\nm\n=\nΣw -λ1α -λ21m\n∂L\n∂λ1\n=\n=\nα0 -w′α\n∂L\n=\n=\n∂λ2\n-w′1m\nSolve for w in terms of λ1, λ2:\nw0 = λ1Σ-1α + λ2Σ-11m\nSolve for λ1, λ2 by substituting for w:\nα\n=\nw′ α\n=\nλ (α′Σ-1α)\n+\nλ (α′Σ-1\n1m)\n=\nw′ 1\n=\nλ (α′Σ-1\nm\n1m)\n+\nλ2(1′\nmΣ-1m)\nα\na\nb\nλ\n=⇒\n=\nwith\nb\nc\nλ2\na = (α′Σ-1\nα\n\n), b =\n\n(α\n\nλ\na\nb\n′Σ-1m), and c = (1′\nmΣ-1m)\n-1\nα\naα\nb\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nRisk Minimization Problem\nVariance of Optimal Portfolio with Return α0\nWith the given values of λ1 and λ2, the solution portfolio\nw0 = λ1Σ-1α + λ2Σ-11m\nhas minimum variance equal to\nσ2\n=\nw′\n0Σw0\n=\nλ2\n1(α′Σ\n-1α) + 2λ1λ2(α′Σ-1\n\n1m) + λ2(1′\nmΣ-1\n1m)\nλ1\n′\na\nb\nλ1\n=\nλ2\nSubstituting\n=\nα\nλ1\nλ2\n′\n\na\n\nb c\nλ2\na\nb\n-\nα0\n\ngives\nσ2\n0 =\n\nb\nc\nb\nb\nc\n-1 α0\n\n=\nac-b2\ncα2\n0 -2bα0 + a\n\nOptimal portfolio has variance σ2\n0: parabolic in the mean\nreturn α0.\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nEquivalent Optimization Problems\nProblem II: Expected Return Maximization: For a given choice\nof target return variance σ2\n0, choose the portfolio w to\nMaximize:\nE(Rw) = w′α\nSubject to:\nw′Σw = σ2\nw′1m = 1\nProblem III: Risk Aversion Optimization: Let λ ≥0 denote the\nArrow-Pratt risk aversion index gauging the trade-ffbetween risk\nand return. Choose the portfolio w to\nMaximize:\n\nE(Rw) -1\n2λvar(Rw)\n\n= w′α -1\n2λw′Σw\nSubject to:\nw′1m = 1\nN.B\nProblems I,II, and III solved by equivalent Lagrangians\nEfficient Frontier:{(α0, σ2) = (E(Rw\n0), var(Rw0))|w0 optimal}\nEfficient Frontier: traces of α0 (I), σ2 (II), or λ (III)\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nOutline\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nMean-Variance Optimization with Risk-Free Asset\nRisk-Free Asset: In addition to the risky assets (i = 1, . . . , m)\nassume there is a risk-free asset (i = 0) for which\nR0 ≡r0, i.e., E(R0) = r0, and var(R0) = 0.\nPortfolio With Investment in Risk-Free Asset\nSuppose the investor can invest in the m risky investment as\nwell as in the risk-free asset.\nw′1\nm\nm = P\ni=1 wi is invested in risky assets and\n1 -w1m is invested in the risk-free asset.\nIf borrowing allowed, (1 -w1m) can be negative.\nPortfolio: Rw = w′R + (1 -w′1m)R0, where\nR = (R1, . . . , Rm), has expected return and variance:\nαw\n=\nw′α + (1 -w′1m)r0\nσ2\nw\n=\nw′Σw\nNote: R0 has zero variance and is uncorrelated with R\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nMean-Variance Optimization with Risk-Free Asset\nProblem I': Risk Minimization with Risk-Free Asset\nFor a given choice of target mean return α0, choose the portfolio\nw to\nMinimize:\n1w\n′Σw\nSubject to:\nw′α + (1 -w′1m)r0 = α0\nSolution: Apply the method of Lagrange multipliers to the convex\noptimization (minimization):\nDefine the Lagrangian\nL(w, λ1) = 1\n2w′Σw + λ1[(α0 -r0) -w′(α -1mr0)]\nDerive the first-order conditions\n∂L\n∂w\n=\n0m\n=\nΣw -λ1[α -1mr0]\n∂L\n=\n=\n(α0\n∂λ1\n-r0) -w′(α -1mr0)\nSolve for w in terms of λ1: w0 = λ1Σ-1[α -1mr0]\nand λ1 = (α0 -r0)/[(α -1mr0)′Σ-1(α -1mr0)]\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nMean-Variance Optimization with Risk-Free Asset\nAvailable Assets for Investment:\nRisky Assets (i = 1, . . . , m) with returns: R = (R1, . . . , Rm)\nwith\nE[R] = α and Cov[R] = Σ\nRisk-Free Asset with return R0 : R0 ≡r0, a constant.\nOptimal Portfolio P: Target Return = α0\nInvests in risky assets according to fractional weights vector:\nw0 = λ1Σ-1[α -1mr0], where\n(α\n)\nλ1 = λ1 P) =\n0-r\n(\n(α-1mr0)′Σ-1(α-1mr0)\nInvests in the risk-free asset with weight (1 -w′\n01m)\nPortfolio return: RP = w′\n0R + (1 -w′\n01m)r0\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nMean-Variance Optimization with Risk-Free Asset\nPortfolio return: RP = w′\n0R + (1 -w′\n01m)r0\nPortfolio variance:\nVar(RP)\n=\nVar(w′\n0R + (1 -w′\n01m)r0) = Var(w′\n0R)\n=\nw′\n0Σw0 = (α0 -r0)2/[(α -1mr0)′Σ-1(α -1mr0)]\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nMarket Portfolio M\nThe fully-invested optimal portfolio with\nwM : w′\nM1m = 1.\nI.e.\nwM = λ1Σ-1[α-1mr0], where\nλ1 = λ1(M) = 1′\nΣ-1\nm\n[α -1mr0]\n-\nMarket Portfolio Return: RM = w′\nMR + 0 · R0\n(α′Σ-1[\n=\nα 1\nE(RM)\n=\nE(w′\nMR) = w′\nMα\n-mr0])\n(1′\nmΣ-1[α-1mr0])\n=\nr0+[α-1mr0]′Σ-1[α-1mr0])\n(1′\nmΣ-1[α-1mr0])\nVar(RM)\n=\nw′\nMΣwM\n(E(R\n=\nM)-r0)2\n[α\n1 r ]′Σ-1[α\n1 r ])\n=\n-m 0\n-m 0\n[(α-1mr0)′Σ-(α-1mr0)]\n(1′\nmΣ-1[α-1mr0])2\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nTobin's Separation Theorem: Every optimal portfolio invests in\na combination of the risk-free asset and the Market Portfolio.\nLet P be the optimal portfolio for target expected return α0 with\nrisky-investment weights wP, as specified above.\nP invests in the same risky assets as the Market Portfolio and\nin the same proportions! The only difference is the total\nweight, wM = w′\nP1m:\nλ\n)\nw\n=\n1(P\nM\nλ1(M)\n=\n(α0-r0)/[(α-1mr0)Σ-1(α-1mr0)]\n(1′\nmΣ-1[α-1mr0])\n-1\n=\n(α0 -r0)\n(1′\nmΣ-1[α-1mr0])\n[(α-1mr0)Σ-1(α-1mr0)]\n=\n(α0 -r0)/(E(RM) -r0)\nRP = (1 -wM)r0 + wMRM\nσ2\nP = var(RP) = var(wMRM) = w2\nMVar(RM) = w2\nMσ2\nM.\nE(RP) = r0 + wM(E(RM) -r0)\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nMean Variance Optimization with Risk-Free Asset\nCapital Market Line (CML): The efficient frontier of optimal\nportfolios as represented on the (σP, μP)-plane of return\nexpectation (μP) vs standard-deviation (σP) for all portfolios.\nCML\n=\n{(σP, E(RP)) : P optimal with wM = w′\nP1m > 0}\n=\n{(σP, μP) = (σP, r0 + wM(μM -r0)), wM ≥0}\nRisk Premium/Market Price of Risk\nE(RP)\n=\nr0 +\nwM[E(RM) -r0]\nσP\n=\nr0+\nh\n[\nσM\n\nE(RM) -r0]\nE(RM)\n=\nr0 + σP\n-r0\nσM\ni\nh\nE(RM)-r0\nσM\ni\nis the 'Market Price of Risk'\nPortfolio P's expected return increases linearly with risk (σP).\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nMean Variance Optimization\nKey Papers\nMarkowitz, H. (1952), \"Portfolio Selection\", Journal of\nFinance, 7 (1): 77-91.\nTobin, J. (1958) \" Liquidity Preference as a Behavior Towards\nRisk,\", Review of Economic Studies, 67: 65-86.\nSharpe, W.F. (1964), \"Capital Asset Prices: A Theory of\nMarket Equilibrium Under Conditions of Risk,\" Journal of\nFinance, 19: 425-442.\nLintner, J. (1965), \"The Valuation of Risk Assets and the\nSelection of Risky Investments in Stock Portfolios and Capital\nBudgets,\" Review of Economics and Statistics, 47: 13-37.\nFama, E.F. (1970), \"Efficient Capital Markets: A Review of\nTheory and Empirical Work,\" Journal of Finance,\" 25:\n383-417.\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nOutline\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nVon Neumann-Morgenstern Utility Theory\nRational portfolio choice must apply preferences based on\nExpected Utility\nThe optimal portfolio solves the\nExpected Utility Maximization Problem\nInvestor: Initial wealth W0\nAction: Portfolio choice P (investment weights-vector wP)\nOutcome: Wealth after one period W = W0[1 + RP].\nUtility Function: u(W ) : [0, inf) -→R\nQuantitative measure of outcome value to investor.\nExpected Utility: E[u(W )] = E[u(W0[1 + Rp])]\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nUtility Theory\nUtility Functions\nBasic properties:\nu′(W ) > 0: increasing (always)\nu′′(W ) < 0: decreasing marginal utility (typically)\nDefnitions of risk aversion:\nAbsolute Risk Aversion: λA(W ) = -u′′(W )\nu′(W )\n′′\nRelative Risk Aversion: λR(W ) = -Wu (W )\nu′(W )\nIf u(W ) is smooth (bounded derivatives of sufficient order),\nu(W )\n≈\nu(w∗) + u′(w∗)(W -w∗) + 1u\n′′(w )(W\n∗\n-w )2 +\n∗\n· · ·\n=\n(constants) + u′(w )[W\n∗\n-1λ\nA(w )(W\n∗\n-w )2] +\n∗\n· · ·\nTaking expectations\nE[u(W )] ∝E[W -1\n2λ(W -w∗)2] ≈E[W ] -1λVar[W ]\n(setting w = E[W ])\n∗\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nUtility Functions\nLinear Utility:\nu(W ) = a + bW ,\nb > 0\nQuadratic Utility:\nu(W ) = W -1λW 2,\nλ > 0,\n( and W < λ-1)\nExponential Utility:\nu(W ) = 1 -e-λW , λ > 0\nConstant Absolute Risk Aversion (CARA)\nPower Utility:\nu(W ) = W (1-λ),\n0 < λ < 1\nConstant Relative Risk Aversion (CRRA)\nLogarithmic Utility:\nu(W ) = ln(W )\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nOutline\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nPortfolio Optimization Constraints\nLong Only:\nw : wj ≥0, ∀j\nHolding Constraints:\nLi ≤wi ≤Ui\nwhere U = (U1, . . . , Um) and L = (L1, . . . , Lm) are upper and\nlower bounds for the m holdings.\nTurnover Constraints:\n∆w = (∆w1, . . . , ∆wm)\nThe change vector of portfolio holdings satisfies\n|P∆wj\nm | ≤Ui, for individual asset limits U\ni=1 |∆wj| ≤U , for portfolio limit U\n∗\n∗\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nPortfolio Optimization Constraints\nBenchmark Exposure Constraints:\nwB the fractional weights of a Benchmark portfolio\nRB = wBR, return of Benchmark portfolio\n(e.g., S&P 500 Index,PNASDAQ 100, Russell 1000/2000)\n|w -wB|\nm\n=\ni=1 |[w -wB]i| < UB\nTracking Error Constraints:\nFor a given Benchmark portfolio B with fractional weights wB,\ncompute the variance of the Tracking Error\nTEP\n=\n(RP -RB) = [w -wB]R\nvar(TEP)\n=\nvar([w -wB]R)\n=\n[w -wB]′Cov(R)[w -wB]\n=\n[w -wB]′Σ[w -wB]\nApply the constraint:\nvar(TEP) = [w -wB]′Σ[w -wB] ≤σ 2\nTE.\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nPortfolio Optimization Constraints\nRisk Factor Constraints:\nFor Factor Model\nK\nRi,t = αi + P\nk=1 βi,kfj,t + εi,t\nConstrain Exposure to Factor k\n| Pm\ni=1 βi,kwi| < Uk,\nNeutralize exposure to all risk factors:\n| Pm\ni=1 βi,kwi| = 0, k = 1, . . . , K\nOther constraints:\nMinimum Transaction Size\nMinimum Holding Size\nInteger Constraints\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nGeneral Linear and Quadratic Constraints\nFor\nw : target portfolio\nx = w -w0 : transactions given current portfolio w0\nwB : benchmark portfolio\nLinear Constraints: Specify m-column matrices Aw, Ax, AB\nand m-vectors uw, ux, uB and constrain\nAww\n≤\nuw\nAxx\n≤\nux\nAB(w -wB)\n≤\nuB\nQuadratic Constraints: Specify m × m-matrices Qw, Qx, QB\nand m-vectors qw, qx, qB and constrain\nw′Qww\n≤\nqw\nx′Qxx\n≤\nqx\n(w -wB)′QB(w -wB)\n≤\nqB\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nOutline\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nEstimating Return Expectations and Covariance\nSample Means and Covariance\nMotivation\nLeast squares estimates\nUnbiased estimates\nMaximum likelihood estimates under certain Gaussian\nassumptions\nIssues:\nChoice of estimation period\nImpact of estimation error (!!)\nAlternatives\nApply exponential moving averages\nApply dynamic factor models\nConduct optimization with alternative simple models\nSingle-Index Factor Model (Sharpe)\nConstant correlation model\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nOutline\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nAlternative Risk Measures\nWhen specifying a portfolio P by wP, such that\nRP = w′\nPR, with asset returns R ∼(α, Σ).\nconsider optimization problems replacing the portfolio variance\nwith alternatives\nMean Absolute Deviation:\nMAD(RP)\n=\nE (|wP\n′(Rp -α)|)\n=\nE (|\nm\ni=1 wi(Ri -αi)|)\nLinear programming with linear/quadratic constraints\nSemi-Variance:\nSemiVar(Rp)\n=\nE\n\nmin(Rp -E[Rp], 0)2\nDown-side variance (probability-weighted)\n\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nAlternative Risk Measures\nValue-at-Risk(VAR): RiskMetrics methodology developed by JP\nMorgan. VaR is the magnitude of the percentile loss which\noccurs rarely, i.e., with probability ε (= 0.05, 0.01, or 0.001)\nVaR1\nε(R )\n-\np = min{r : Pr(Rp ≤-r) ≤ε}\nTracking and reporting of risk exposures in trading portfolios\nVaR is not convex, or sub-additive, i.e,\nVaR(RP1 + RP2) ≤VaR(RP1) + VaR(RP2)\nmay not hold (VaR does not improve with diversification).\nConditional Value-at-Risk (CVar): Expected shortfall, expected tail\nloss, tail VaR given by\nCVaR1-ε(Rp) = E [-RP | -RP ≥VaR1-ε(Rp)]\nSee Rockafellar and Uryasev (2000) for optimization of CVaR\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nAlternative Risk Measures\nCoherent Risk Measures\nA risk measure s(·) for portfolio return\ndistributions is coherent if it has the following properties:\nMonotonicity: If RP ≤RP′, w.p.1, then s(RP) ≥s(RP′)\nSubadditivity: s(RP + RP′) ≤s(RP) + s(RP′)\nPositive homogeneity: s(cRP) = cs(RP) for any real c > 0\nTranslational invariance: s(RP + a) ≤s(RP) -a, for any real a.\nN.B.\nVar(Rp) is not coherent ( not monotonic)\nVAR is not coherent (not subadditive)\nCVaR is coherent.\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nRisk Measures with Skewness/Kurtosis\nConsider the Taylor Series expansion of the u(W ) about\nw = E(W ), where W = W0(1 + RP) is the wealth after one\n∗\nperiod when initial wealth W0 is invested in portfolio P.\nu(W )\n=\nu(w ) + u′(w )(W\n∗\n∗\n-w ) + 1\n∗\n2u′′(w∗)(W -w∗)2\n+ 1\n3!u(3)(w∗)(W -w∗)3 + 1 u(4)(w )(W\nw )4\n4!\n∗\n-\n∗\n+O[(W -w ) ]\n∗\nTaking expectations\nE[u(W )]\n=\nu(w ) + 0 + 1\n∗\n2u′′(w∗)var(W )\n+ 1\n3!u(3)(w∗)Skew(W ) + 1 u(4)(w )Kurtosis(W )\n4!\n∗\n+O[(W -w )5]\n∗\nPortfolio Optimization with Higher Moments\nMax: E(RP) -λ1Var(RP) + λ2Skew(RP) -λ3Kurtosis(RP)\nSubject to: w′1m = 1, where RP = w′RP\nMIT 18.S096\nPortfolio Theory\n\nPortfolio Theory\nMarkowitz Mean-Variance Optimization\nMean-Variance Optimization with Risk-Free Asset\nVon Neumann-Morgenstern Utility Theory\nPortfolio Optimization Constraints\nEstimating Return Expectations and Covariance\nAlternative Risk Measures\nPortfolio Optimization with Higher Moments\nNotes:\nHigher positive Skew is preferred.\nLower even moments may be preferred (less dispersion)\nEstimation of Skew and Kurtosis complex: outlier sensitivity;\nrequires large sample sizes.\nOptimization approaches\nMulti-objective optimization methods.\nPolynomial Goal Programming (PGP).\nMIT 18.S096\nPortfolio Theory\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.S096 Topics in Mathematics with Applications in Finance\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}