{
  "course_name": "Topics in Computational and Systems Biology",
  "course_description": "This is a seminar based on research literature. Papers covered are selected to illustrate important problems and approaches in the field of computational and systems biology, and provide students a framework from which to evaluate new developments.\nThe MIT Initiative in Computational and Systems Biology (CSBi) is a campus-wide research and education program that links biology, engineering, and computer science in a multidisciplinary approach to the systematic analysis and modeling of complex biological phenomena. This course is one of a series of core subjects offered through the CSB Ph.D. program, for students with an interest in interdisciplinary training and research in the area of computational and systems biology.",
  "topics": [
    "Engineering",
    "Biological Engineering",
    "Computational Biology",
    "Science",
    "Biology",
    "Computation and Systems Biology",
    "Engineering",
    "Biological Engineering",
    "Computational Biology",
    "Science",
    "Biology",
    "Computation and Systems Biology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nPrerequisites\n\nFirst-year\nCSB Ph.D. student\nor permission of instructor.\n\nCourse Description\n\nTopics in Computational and Systems Biology is a seminar based on research literature. Papers covered are selected to illustrate important problems and approaches in the field of computational and systems biology, and provide students a framework from which to evaluate new developments. The course is intended for first-year Computational and Systems Biology (CSB) Ph.D. students.\n\nTextbooks\n\nAssigned readings will be from the primary literature. However, the following texts may be useful as references.\n\nZvelebil, Marketa, and Jeremy O. Baum.\nUnderstanding Bioinformatics\n. New York, NY: Garland Science, 2007. ISBN: 9780815340249.\n\n(Note: this text is highly recommended for 7.91 also)\n\nAlon, Uri.\nAn Introduction to Systems Biology: Design Principles of Biological Circuits\n. Boca Raton, FL: Chapman & Hall, 2006. ISBN: 9781584886426. (A newer book that's worth a look -- systems biology from a physicist's perspective.)\n\nWatson, J. D., T. A. Baker, S. P. Bell, A. Gann, M. Levine, and R. Losick.\nMolecular Biology of the Gene\n. 6th ed. Cold Spring Harbor, NY: Cold Spring Harbor Laboratory Press, 2007. ISBN: 9780805395921. (An updated version of the classic text.)\n\nAlberts, B., A. Johnson, J. Lewis, M. Raff, K. Roberts, and P. Walter.\nMolecular Biology of the Cell\n. 5th ed. New York, NY: Garland Science, 2008. ISBN: 9780815341055. (Another classic text.)\n\nBerg, J. M., J. L. Tymoczko, and L. Stryer.\nBiochemistry\n. 6th ed. New York, NY: W.H. Freeman, 2007. ISBN: 9780716787242. (Yet another classic.)\n\nBranden, C., and J. Tooze.\nIntroduction to Protein Structure\n. 2nd ed. New York, NY: Garland Pub., 1999. ISBN: 9780815323051. (A gentle but authoritative introduction to the topic.)\n\nFormat\n\nAll class sessions will consist of discussions of research literature in computational and systems biology. Discussions will be led by course staff or jointly led by a designated student discussion leader and the staff. From time to time, there will be guest faculty discussion leaders. The papers have been chosen to represent important concepts, approaches, and ways of thinking in a wide range of subject areas within computational and systems biology, broadly defined, as well as a few papers outside of the field which have influenced the field.\n\nOne of the themes of this course is tracing the origins of different approaches to problems in computational and systems biology deriving from fields such as computer science, statistics, evolutionary biology, biochemistry, genetics, physics, and various branches of engineering. Another theme that will be explored is the relationship between technology (including both high-throughput experimental methods and computational/analytical methods) and discovery.\n\nHomework and Grading\n\nThe largest component of students' time will be spent reading, re-reading, thinking about and discussing the papers. Students are responsible for understanding the essential ideas, results, and methods used in each paper in as much depth as possible, which may require reading the supplementary information or background reference material. Students are encouraged to discuss the papers with other students in the course before class at the regularly scheduled time (and/or other times), to deepen their understanding.\n\nShort (1-2 page) written assignments will be due for the course sessions noted in the calendar below. These assignments will usually, but not always, relate to the papers being discussed that week, and are intended to encourage critical thinking about the papers and to provide practice in scientific writing.\n\nGrades will be assigned based on:\n\nParticipation in class discussions\n\nLeadership of class discussions of assigned papers\n\nHomework assignments\n\nAttendance, which is required at all class sessions\n\nCalendar\n\nWEEK #\n\nTOPIC AND INSTRUCTOR\n\nKEY DATES\n\nCourse organization/introduction (Burge)\n\nGenomics and protein function (Burge)\n\nFunction of nucleic acid binding factors (Burge)\n\nWritten assignment 1 due\n\nGene expression & medicine (Student-led)\n\nWritten assignment 2 due\n\nEvolutionary dynamics (Guest instructor: Jeff Gore, Biophysics, Systems Biology)\n\nProofreading in biology (Student-led)\n\nWritten assignment 3 due\n\nSequencing & translation (Guest instructor: Wendy Gilbert, Biology)\n\nNetwork motifs in biology (Student-led)\n\nWritten assignment 4 due\n\nPathway modeling (Guest instructor: Bruce Tidor, Biological Engineering and Computer Science)\n\nVariability between cells (Student-led)\n\nSynthetic biology (Student-led)\n\nMetagenomics (Burge)\n\nSignal transduction (Guest instructor: Forest White, Biological Engineering)",
  "files": [
    {
      "category": "Resource",
      "title": "Notes on Reading Papers and Leading a Discussion about a Paper",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-89j-topics-in-computational-and-systems-biology-fall-2010/8e4e93c0f2a448dcc457437902a553ea_MIT7_89JF10_Notes_on_Read.pdf",
      "content": "Notes on Reading Papers and Leading a Discussion about a Paper\nFor CSB.100/7.89\n1) Goals\n- What were the goals of the study?\n- What are/were the big questions in the field that this study addressed?\n2) Hypothesis\n- What specific hypothesis/es did the study test?\n- What assumptions are these hypotheses based on?\n3) System/Methods\n- What specific system(s) and methods were chosen? Why?\n- What were the pros and cons of these choices?\n4) Results\n- What were the main results?\n- Why are these results interesting/important?\n- How do these results relate to what was known previously?\n- Are there notable weaknesses in the results?\n5) Interpretation\n- How were the results interpreted?\n- Are there other ways the results might be interpreted?\n- Do the authors propose a new model or theory? Is it testable?\n- How generally applicable is the model or theory?\n6) General\n- Are there clear next steps to follow up this paper?\n- Why is the paper interesting/important? (or why not?)\n- Does the approach/way of thinking of the authors derive from a recognizable\nacademic tradition(s)? Which?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n7.89J / CSB.100J Topics in Computational and Systems Biology\nFall 2010\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Statistics and Probability Primer for Computational Biologists",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-89j-topics-in-computational-and-systems-biology-fall-2010/94e4f291339c748a7516257c457a0ce7_MIT7_89JF10_statsprimer.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n7.89J / CSB.100J Topics in Computational and Systems Biology\nFall 2010\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}