{
  "course_name": "Topics in Brain and Cognitive Sciences Human Ethology",
  "course_description": "Survey and special topics designed for students in Brain and Cognitive Sciences. Emphasizes ethological studies of natural behavior patterns and their analysis in laboratory work, with contributions from field biology (mammology, primatology), sociobiology, and comparative psychology. Stresses human behavior but also includes major contributions from studies of other animals.",
  "topics": [
    "Science",
    "Cognitive Science",
    "Social Science",
    "Psychology",
    "Science",
    "Cognitive Science",
    "Social Science",
    "Psychology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nRequired Readings\n\nPaper: The final paper constitutes the majority of the grade for this course. All of the readings and interactions in this class are intended to help students focus their understanding of human ethology, and how it fits with their paper topics.\n\nOverview of the Class: Session 1\n\nBelow is an outline for the first session. Please do the following:\n\nReview the book list: How many of these authors/books have you read/seen/heard of? Which books which you own or have read would you add?\n\nReview the topics list. We will not have time to deal with all of these topics; how we use our time will depend on both students' and instructor's interest. Additional or alternative suggestions are welcome.\n\nRead the outline below, for discussion in the first two sessions.\n\nA. How have we learned of Animals and their Behavior?\n\nPets.\n\nFolklore. (Examples from students? The medieval beastiaries. Examples from R. Hendrikson,\nMore Cunning Than Man: A Social History of Rats and Men\n, Dorset Press, N.Y., 1983.)\n\nHuman oriented studies and practices: mostly uses of animals. (Economics and meat industry; sports; hunting; some religions.)\n\nCf. sciences: mostly uses as well! (Biology; comparative psychology; pharmacology; toxicology; neuroscience)\n\nHumane society; \"Animal rights\" movement: human oriented in a different way. Anthropomorphism recognition and feelings (\"anthropomentism\", \"anthropaffectism\"). Regard for apparent (subjectively assessed) consciousness, in humans and other animals.\n\nContrasting attitudes in different religions. The extremes of Judaism/Christianity, and Jainism. (Other examples?)\n\nArguably better: basic science approach - both descriptive and experimental, and with the perspective of evolution.\n\nB. Topics List (Handout):\n\nRationale.\n\nLevels of treatment? (Ask re backgrounds.)\n\nTime needed!\n\nSpecial topics seminar level vs. undergraduate survey level.\n\nC. Readings:\n\nList of books for selected readings (handout): Note relative importance.\n\nAmount? approx. 10-20 pp/hr x 9 hr = 90-180 pp/wk.\n\nApproach: Read for key concepts and their illustration in actual examples. (I pay for animal stories!)\n\n(Story: How we paid M. Murphy for hamster genes.)\n\nAssignment for next session: Selections from K. Lorenz,\nThe Foundations of Ethology\n, pp. 1-12, 28-32, 46-64, (72-89), 89-93, (93-99), 100-103, 107-152. Cf. his stories (extra credit):\nKing Solomon's Ring, The Year of the Greylag Goose.\nCf. N. Tinbergen's Curious Naturalists.\n\nD. Session Plan:\n\nLecture/discussion of key concepts in readings (required).\n\nStudent presentations of papers or small topic areas. (Today: you tell me what you already know about animals, and how you learned it.)\n\nE. Requirements:\n\nThe readings and short presentations.\n\nProject paper and presentation at end of term. (Discuss your chosen topic with G. S.)\n\nFor session 1: Read the story: \"Four hours in the life of a Syrian hamster\", with commentary.\n\nF. Approaches to the study of animal behavior:\n\nFocus on the Individual Organism\n\n\"Comparative Psychology\" in America: The real focus was/is on man.\n\nNotes on non-biological comparisons, \"homologies\", \"phylogenetic scale\".\n\n\"Ethology\"; some people now prefer \"behavioral ecology\".\n\nDefinition by K. Lorenz: see\nThe Foundations of Ethology\n, p. 1, 3, 65, 101.\n\nWhitman and Heinroth.\n\nStories from Lorenz: p. 100, 107.\n\nCf. Charles Darwin\n\nIllustrations from his book.\n\n\"Human ethology\" of Eibl-Eibesfeldt (see K. L., pp. 10-11).\n\nThe \"body language\" craze.\n\n\"Neuroethology\"- an approach that goes two ways:\n\nEthology informs brain & behavior studies.\n\nBrain manipulation effects -> new info. on behavioral organization.\n\nExamples: multiple kinds of aggression; evidence of primitive vs. advanced behavioral elements (spinal/brainstem vs. forebrain localization).\n\nFocus on Societies\n\n\"Sociobiology\": E. O. Wilson's definition and diagram: See\nSociobiology, The Abridged Edition\n, pp. 3-5.\n\nCf. human sociology. Notes from E. O. Wilson,\nIbid\n., p. 4.\n\nFocus on Habitat and the Species it Supports, and Interactions (\"Balance\")\n\n\"Ecology\": E.g., Tropical rainforest (see\nTropical Nature\n, by A. Forsyth and K. Miyata ), Tropical savannah, etc.\n\nThe problem of breadth: Knowing too little about everything. Hence, people often think of ecology as focused on conservation. But there are good examples of ecology as a science that includes animal behavior: See Bourliere's book.\n\nWhen the behavior of animals becomes critical: \"Upsetting the balance of nature.\" Examples: African elephants and the acacia trees. Man's hunting, pollution effects, pleasures that encourage poaching. \"Killer\" bees. etc.\n\nFocus on Single Species or Groups of Species in a Broad Way that Includes Ecology and Behavior.\n\n\"Mammology\". Note Bourliere's books, one older, one recent. Note contents; examples.\n\n\"Primatology\", \"cetology\", \"entymology\", etc.\n\nThe amateur \"naturalists\": The disciplined hobbyist's contributions. (Cf. astronomy.) Details, when amassed, have been important in the development of ideas about behavioral evolution.\n\nSee Lorenz's comments about the contributions of amateur ornithologists - bird watchers - to early ethology. Also, Jim Corbett's stories (\nJungle Lore\n, Oxford Univ. Press, 1953): Examples from the life of a hunter who cared about animals.",
  "files": []
}