{
  "course_name": "Topics in Performance Studies: Comedy Across Media",
  "course_description": "This multidisciplinary lecture / workshop engages students in a variety of approaches to the study and practice of performance as an area of aesthetic and social interaction. Special attention is paid to the use of diverse media in performance. Interdisciplinary approaches to study encourage students to seek out material histories of performance and practice.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Performance Arts",
    "Theater",
    "Humanities",
    "Literature",
    "Comedy",
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Performance Arts",
    "Theater",
    "Humanities",
    "Literature",
    "Comedy"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminar: 1 session / week, 3 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nIn this practice-based course, we will take a laboratory approach to the production of comedy across a multitude of media platforms. Texts exploring various theories of comedy will be read alongside histories of comedic artists, tropes and aesthetics. Each week we will look at, listen to, watch and analyze examples of these, asking not only what makes them funny (or not), but also how these artists employ the media in which they work to comedic effect. These media may include live performance, drawings, diagrams, sculpture, broadcast and recorded sound, photographs, music, film, video and digital media, among others.\n\nThe primary objective of this course, however, will be the creation of our own comedic artworks and the establishment of a discourse surrounding them informed by the above. Each week students will produce and present their own self-directed and collaborative artworks, exercises, field recordings, texts and performances in a generous and supportive environment. At the end of the semester, each student will submit a portfolio of their work along with a personal statement articulating the theory and approach they developed over the course of the semester, referencing the readings, screenings and discussion we engaged in.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation and Incidental Assignments\n\nNOTE: This is a laboratory class that will require full and generous participation from all students. This means arriving on time with readings completed and with questions to discuss; participating in discussions, engaging in class exercises and collaborating productively with fellow students both in and outside of class.\n\n30%\n\nProject 1\n\n20%\n\nProject 2\n\n20%\n\nProject 3\n\n20%\n\nPortfolio\n\n10%\n\nFor detailed information on the activities, see the\nAssignments\nsection.\n\nCalendar\n\nWEEK #\n\nTOPICS\n\nUnit I: What Is Comedy?\n\nStations of the Fool - Laughter in History\n\nLaughing Now...\n\nDoing Comedy...\n\nUnit II: The Elements of Comedy\n\nJokes\n\nWriting Funny\n\nPantomime and Physical Comedy\n\nScreening\n\n\"\nCharlie Chaplin - A Night In The Show (1915)\n.\" YouTube.\n\n\"\nCharlie Chaplin The Pawn Shop (1916)\n.\" YouTube.\n\n\"\nCharlie Chaplin Easy Street (1917)\n.\" YouTube.\n\n\"\nBuster Keaton The Playhouse (1921)\n.\" YouTube.\n\n\"\nJerry Lewis - The Errand Boy (1961) Pantomime\n.\" YouTube.\n\n\"\nLiza Minnelli Tries to Turn Off a Lamp - SNL\n.\" YouTube.\n\n\"\nJulie Atlas Muz / King Tut's Wah Wah Hut Live @ Whitney Museum 2015\n.\" YouTube.\n\n\"\nMatt Foley: Van Down By The River - SNL\n.\" YouTube.\n\n\"\nZach Galifianakis on physical comedy\n.\" YouTube.\n\n\"\nThe Big Baby Makes the Sale - SNL\n.\" YouTube.\n\n\"\nSpartan Cheerleaders at a Chess Tournament - SNL\n.\" YouTube.\n\nAnarchistic Comedy, Dada and Other Nonsense\n\nScreening\n\nMonkey Business\n. Directed by Norman Z. McLeod. Black and White, 77 min. 1931.\n\n\"\nMonty Python's flying circus - Interview and salesman\n.\" YouTube.\n\n\"\nConfuse-A-Cat ~ Monty Python's Flying Circus\n.\" YouTube.\n\n\"\nMonty Python - How Not to Be Seen (Original version)\n.\" YouTube.\n\n\"\nReggie Watts disorients you in the most entertaining way\n.\" YouTube.\n\n\"\nReggie Watts: Fuck Shit Stack\n.\" YouTube.\n\nStand Up Comedy\n\nConcrete Comedy\n\nGuest lecturer:\nMichael Portnoy\n\n\"Real\" Performance: The Case of Andy Kaufman\n\nInterventionists Comedy\n\nCounterfactual Comedy\n\n12 (optional)\n\nMockumentary\n\nNote: This unit is optional and may be done in concert with, or in place of, Week 12's unit on counterfactual comedy\n\nThe Podcast\n\nPresentations of portfolios",
  "files": []
}