{
  "course_name": "Topics in South Asian Literature and Culture",
  "course_description": "This subject aims to provide an overview of contemporary texts in regional languages in South Asian Literature and Cinema. We will cover major authors and film makers, writing from Bangladesh, India, Nepal, Pakistan and Sri Lanka. Within India, we will look at authors and directors working in different regional languages and as we examine their different socio-cultural, political and historical contexts we will attempt to understand what it means to study them under the all-unifying category of “South Asian Literature and Culture”. Some of the major issues we shall explore include caste, gender, globalization and social change. We will end with exploring some of the newer, younger writers and directors and try to analyze some of the thematic and formal shifts in their work. Authors include Ashapurna Devi, Manto, Vijayan, Premchand, Mohanty, and Nasreen and film makers will include Adoor Gopalakrishnan, Satyajit Ray, Shyam Benegal, Aparna Sen and Rituporno Ghosh.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "Asian Studies",
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "Asian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nThis section features descriptions for the three major papers of the course.\n\nFirst Paper\n\nThe aim of this paper is to develop a thesis and to argue for it with reference to theoretical and case study materials from our readings.\n\nYou are required to meet with the writing tutor about your paper before completing it. Please make an appointment to meet with her next week or the following by emailing her at least 48 hours before you wish to meet. In addition, feel free to see me to discuss your ideas!\n\n7-8 double-spaced pages, regular font (this is 12 pt Times) (roughly 2,000 words). Do not exceed 8 pages. These are argumentative papers - develop your own thesis and argue it by marshalling evidence from our readings and class discussions. Be sure to engage the arguments of and quote at least three of our authors.\n\nDue in Lec #9\n\nChoose one of the following topics:\n\nGender and Nature: Write an essay about gender and nature, keeping in mind that just as our ideas about gender are culturally shaped and varied, so too are our ideas about nature (you can discuss scientific and religious theories about human nature and the natural world more generally). Organize your essay around a discussion of how particular gender ideologies have been naturalized - explained and legitimated through appeals to a biological and/or divine nature - and with what effects (see especially Hubbard, Fausto-Sterling, Kapsalis, Ehrenreich and English, the 2 readings on infant care, Eugenides).\n\nGender Acquisition: Individuals learn gender - to identify as a girl or boy/ woman or man, and to be able to act in gender appropriate ways. But children (and adults) do not always conform to these lessons completely, or consistently. Drawing from our readings (Hubbard, Eugenides, Collier, etc.), although one example may come from your own observations of a society, discuss four (4) examples that illustrate different modes of gender acquisition - through socialization (emulating adult or media examples; elicitation, or being treated in gendered ways; education) and ritual (e.g., rites of passage). Evaluate each particular example in terms of how it's supposed to work (and what it's meant to convey about gender), and how it seems actually to work (or not) in practice. What means of gender acquisition seems to you to be most powerful? Why?\n\nGender and Labor: Write an essay discussing how gender relations are, in part, formed, reproduced, and contested in labor relations. Possible theses to develop could begin with - but are not restricted to - the following foci: a contrast between how gender and labor are organized in agrarian versus wage labor societies; a discussion of gaps between ideologies and social realities (lived experiences) of gender and labor in either agrarian or wage labor societies; how gender and labor relations have also been informed by - and reproduced - ideologies about race historically. Your arguments should engage the arguments and data of at least three authors (e.g., Collier Ehrenreich and English, Rapp, Nakano Glenn, Romero, Freeman, Weston, McDowell).\n\nSecond Paper\n\nSample Student Paper (\nPDF\n) (Courtesy of Aayesha Siddiqui. Used with permission.)\n\nThe aim of this second paper is critically to engage an issue of current social concern and controversy in the U.S. With reference to both theoretical and ethnographic case study materials from our readings, drawing from US and other cultural settings.\n\nFirst Draft Due in Lec #17\n\nPlease consider meeting with the writing tutor about your paper at the rough draft stage - once you've completed much of this draft! - and/or when planning your revisions after receiving my comments on your draft.\n\nPapers are to be 7-8 double-spaced pages (roughly 2,000 words). Do not exceed 8 pages. These are argumentative papers - develop your own thesis and argue it by marshalling evidence from our readings, films, class discussions, media articles. Be sure to engage the arguments of at least three of our authors. All papers should speak to intersections of gender, sex, sexuality.\n\nChoose an area of contemporary cultural, legal, political and/or ethical concern or debate:\n\nSex assignment surgery on infants with ambiguous genitalia or other medical/social. Issue concerning gender and intersexuality or hermaphrodism. See Eugenides, Chase, Nanda, Fausto-Sterling.\n\nOrigin stories/explanatory theories of same-sex sexual desire/practice. Critically discuss the search for \"universal\" causes (both essentialist and constructivist) and/or the significance of personal origin stories for the \"sexual lifeways\" of individuals. e.g., you could compare vestidas and mayates in working class urban Mexico (Prieur) with gays, lesbians, bisexuals within a segment of US society (see Stein, Katz, Berube, Rich), or focus on one cultural setting.\n\nUnderstanding transgender/transsexualism (see Heyes, etc.) does this challenge or reinforce sex/gender dualisms? you might want to consider this comparatively, alongside intersex (Chase, Fausto-Sterling, Eugenides) or androgyny.\n\nGay marriage and/or parenting. See Katz, Rich, Stein, Lewin, Yanagisako, Collier and Rosaldo, etc.\n\nGender and the body - body work and gender performance; the body as resource for gender - is this a predominantly feminine preoccupation? does it work similarly or differently for femininity and masculinity? why? see Counihan, Gremillion, Prieur, Heyes, etc.\n\nWrite a paper identifying specific concerns related to one of these topics, analyzing the cultural, historical, and political-economic elements that make this a social issue (its \"problematization,\" to use Foucault's term; see Prieur pp. 126-27). To do so, draw on recent news stories, popular magazine articles, op-ed pieces, legal decisions as well as case studies presented in our readings. You will want to describe briefly the key arguments or positions on the issue, but the majority of your paper will be devoted to your interpretation and analysis of it. This means you will want to address the following sorts of questions: WHY this has become an issue of social concern now, at this historical moment, and why are the particular terms of debate as they are? What is at stake here symbolically, materially, and institutionally in these debates or negotiations about gender and sexuality; that is, what are the real and/or perceived repercussions for individuals and for a society? Conclude your essay with a brief discussion of what your analysis leads you to advocate - this could be a specific legal or political action, a line of scholarly inquiry, an education policy, etc.\n\nThird Paper\n\nFor this paper, I encourage you to write a paper concerning the subjective, personal experience of having a gendered sense of self, identity, embodiment. This doesn't have to be your personal experience, per se, but I'd like you to explore how and why people respond in their everyday lives to the kinds of cultural scripts we've been tracing. The specific topic is open. Write a paper that you want to write.\n\nYou could write about sexual violence, birth control (as private matter and/or subject of state interest), sex ed, pregnancy and ultrasound, the abortion debate and ethics of abortion in the US as compared with Greece, ideologies and realities of \"the family\" - any of the topics we've recently addressed. Or you could propose a topic we haven't touched on directly: an anthropological analysis of contemporary dating, for instance. In the past, students have interviewed their own mothers or peers about their experiences (e.g., teenage motherhood, parenting a child with disabilities, sex ed, etc.).\n\nPaper Proposal Due in Lec #22\n\nSubmit a topic, thesis statement (what you plan to argue) and outline of what you plan to cover. If possible, an introductory paragraph would be nice to get. Also list the articles you plan to use. You must make use of class materials, quoting and engaging the arguments of at least Three authors we've read. Authors addressing 'experience' include Abu-Lughod, Counihan, Stein, Heyes, di Leonardo, Landsman, Layne, Petchesky, etc. Proposals can be emailed to me or submitted in hard copy.\n\nPlease consider meeting with the writing tutor. And do come talk with me, before or after class, or by appointment.\n\nPapers are to be 7-8 double-spaced pages (roughly 2,000 words). Do not exceed 8 pages.\n\nIf you're stuck coming up with a topic and approach, please see or email me! I can also suggest relevant outside readings.\n\nFinal Paper Due in Lec #25 - our last class. This is a fixed due date (late papers will be docked).\n\nCourse Overview\n\nThis class is for students at all levels. Whereas those who have had no prior experience of South Asian literature and cinema will get an exposure to a new world-view, those who have already been exposed to it will find and articulate new ways of approaching and interpreting the material. Class taught in English, all readings are English translations of the original texts. All films are subtitled in English.\n\nThis is a \"communication-intensive\" subject; we will pay special attention to honing the students' oral and written communication skills, through a strong emphasis on class discussion, oral presentations and guided written work. Students will be required to write three 7-8 page papers: they will write each paper, which will be evaluated, corrected and commented upon carefully, and they will have a week to prepare a revised version before submitting it to the instructor. The class will also be regrouped into units that will take turns at leading discussions.\n\nCourse Requirements\n\nYou are expected to attend all classes, as class discussion is crucial. Any unexcused absence will automatically lower your grade.\n\nThe class will be divided into small groups. Each group will be responsible for \"teaching\" one class: that is to say, they will (with the help of the instructor, if needed) choose topics to present to the class and lead the discussions. The group will meet to discuss a teaching plan, and prepare \"thought questions\" on the assigned reading and visual material the course will cover. This will count as your \"oral presentation\" and will be graded by the instructor.\n\nYou will be required to write three papers of 7-8 pages each. The days when they are due are marked clearly on the syllabus. The essays will be corrected, discussed with you and handed back quickly and you will have a week from then to hand in your final version. Unless arranged with the instructor ahead of time, late submissions will be penalized with a lowered grade. In addition, you will write a couple of paragraphs every week in response to the film you have seen or the text you have read and you will email it to your instructor before coming to class. These will be your first reactions to the text, and the writing can be relatively informal. These \"responses\" will not be graded; these are aimed to assist you in organizing your thoughts for the class discussion to follow.\n\nYou will be expected to come to class fully prepared to discuss that week's material: that is, you will have read the day's assigned text, and/or seen the assigned visual material, before coming to class. Assignments are posted very clearly in the calendar. Any change in the syllabus during the course of the semester will be duly announced in class. If you are absent that day it is your responsibility to make sure you are aware of what you need to prepare.\n\nAll readings and selections from anthologies, newspapers and magazines will be photocopied and supplied by the instructor to the class. You will be expected to pay for all the photocopying expenses.\n\nMost of the films for this course will be shown outside class.\n\nThe dates and venue for these screenings will be announced on the first day of class. Short excerpts from other visual and audio material will be presented in class.\n\nPlease Note: Essays submitted late without prior permission from the instructor will be penalized by\none full letter grade\n. Acceptance of late papers will remain subject to instructor's discretion. Always keep a printed copy of your essay.\n\nIf at any point, you should feel the need for further discussion to clarify any issue, the instructor will meet with you outside class.\n\nGrading\n\nActivities\n\nPercentages\n\nAttendance, Punctuality, and Class participation\n\n20%\n\nClass Discussion and Oral Presentation\n\n40%\n\nPapers\n\n40%\n\nCalendar\n\nLec #\n\nTOPICS\n\nKey Dates\n\nIntroduction: Why South Asia?\n\nI. Diversity and Difference: Stories from Bangladesh, India, Nepal, Pakistan and Sri Lanka\n\nStories from Bangladesh, Nepal and Pakistan\n\nStories from Sri Lanka\n\nII. Politics and History: A Tale of Turmoil\n\nStories from Pakistan\n\nStories from India\n\nPaper I due\n\nStories from Sri Lanka (cont.)\n\nStories from India (cont.)\n\nRevised paper I due\n\nIII. Gender and Society: Margins and Center\n\nStories from Bengali and India\n\nPaper II due\n\nStories from India (cont.)\n\nStories from Bangladesh\n\nRevised paper II due\n\nStories from Bengali and India (cont.)\n\nIV. Transition and Social Change: Past, Present and Future\n\nStories from Bengali and India (cont.)\n\nPaper III due\n\nStories from India and Pakistan\n\nStories from Bengali and India (cont.)\n\nRevised paper III due",
  "files": [
    {
      "category": "Resource",
      "title": "Memoir on Cooking",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-041-topics-in-south-asian-literature-and-culture-fall-2004/e642244737c2bca654a56172007a662b_MIT21G_041F04_paper.pdf",
      "content": "10/30/2004\n21G.041 Memoir\nProfessor Banerjee\n\n\"I cooked all night, i cooked all day,\ndriving the cold hungry blues away\nmmmm-mm, i got em on the run\n-Po' Girl, \"Cold Hungry Blues\"\n\n\"Mummy, how do you make halvah?\"\n\n\"Halvah? Ok... Start by soaking the raisins, then melt some butter in a pan.\nYou'll want equal amounts of butter, sooji, and sugar...Kyoon?,\" came my Mother's\nresponse, muffled by her signal-starved cell phone. She had to know exactly why I did\nanything. Even in college, I talked to my mother on the phone almost daily. I had\nwatched her create the sweet, tasty halvah numerous times. Raisins became plump as\nwater diffused into them, and the butter melted easily at my Mother's skilled fingertips,\nreleasing an enticingly rich aroma.\n\n\"Then start frying the sooji slowly,\" Mom continued. I imagined how the soft,\nsandy-looking grain fell from her hands into the butter, spreading tiny particles into the\nair as it fell. With a few quick strokes and just the right amount of time, she transformed\nthe ordinary sooji, like many other things, into something amazing. I remember watching\nit change from fine white sand to an appetizing culinary delight.\n\n\"When it turns brown, add the sugar water,\" she finished, and I noted this final\ndirection in a blue notebook in which I had recently started to collect recipes.\n\n\"One cup water and one cup sugar, right?\" I too had made halvah numerous\ntimes. The one time I tried to teach it, however, my halvah resembled a well-garnished\nversion of southern style grits caking into an iceberg in a small lake of butter.\n\n\"How brown does it have to be?\" I asked, remembering my embarrassing past\n\nmishap. Serving something like runny sweet grits to girls raised on steaks and leafy\nsalads would not bode well for their undecided opinions of Indian cuisine - the food had\nto be just right. I was determined to move away from my amateur dark, pungent, over-\nspiced creations to my mother's lighter, more seasoned cooking with its delicately\nbalanced spices and distinct flavors.\n\n\"Ok, then I just let it boil down and it's done?\"\n\"Right.\"\n\"How about baingan ka bhartha? Usme kounse masale dalte hain?\" I needed a\nreminder of which spices to add to my mother's favorite eggplant dish. Without either of\nus noticing, our conversation switched to Hindi. Somehow, neither my mother nor I can\neasily recall the esoteric names of spices in English.\n\n\"Mirchi, dhania, aur namak. Nothing else,\" she answered, switching between\nlanguages effortlessly. \"Why do you want to make all this?\" she asked.\n\n\"Just for fun.\"\n\n\"No, really, why are you asking?\"\nThe truth was that I planned to cook a full Indian dinner for fifty, a dinner party\ndebut of sorts. I avoided telling her because she would object to me struggling through\nthe labor of a fifty-person meal. Or perhaps it was guilt: many of my Indian peers, even\nin college, would eat primarily their mothers' cooking either by receiving dry ice lined\nshipments of home-cooked food in the mail, or bringing back a large full cooler each visit\nhome.\n\n\"Do you ever wish that I had done that for you?\" she would ask, at which I would\nalways reply with pride, \"no, of course not; you taught me how to cook. Now I can have\nfresh home-style food whenever I want. Getting food from home is for spoiled Indian\n\nboys anyway,\" I half-joked, hoping to make her laugh. My mother and I frequently joked\nabout Indian mothers' tendency to spoil their sons; we accuse both my grandmothers of\ndoing this.\n\n***\nUsing my Mother's advice and notes from my recipe notebook, I plan my cooking. I\nenvision fifty people eating and enjoying food from a buffet table full of spicy, colorful,\nauthentic Indian dishes that I will create. I eagerly descend the carpeted flights of stairs\nfrom my room to the kitchen. The ten gargantuan gas burners greet me, along with a\nrather intimidating set of giant-sized pots and pans that I can barely lift when full. The\nkitchen has a lingering warmth from frequent, careful use, and remnants of conversation\nfloating in and out. The almost sterilely clean restaurant-sized kitchen seems industrial\nbut feels simultaneously cozy.\nKnowing I have only three hours to cook, I put on music and quickly set to work.\nI soak raisins, rice, lentils, onions, tomatoes and cucumbers, put water on the stove to\nboil, and warm olive oil in the bottom of a large cauldron for daal. To cook the six\ndifferent dishes in time, I stagger them as my mother would.\nAs I peacefully settle into the rhythm of chopping, first onions and ginger, then\ntomatoes, my mind wanders back to my mother's kitchen, which she designed herself. It\nhas an island stove and a granite counter with wooden barstools across from it so my\nsister and I could keep her company while she cooked. I remember spending many hours\non those stools studying, listening, talking, and watching while she enchanted simple\nvegetables, beans, and grains to become delicious sabzis, daals and rotis, perfect every\n\ntime. I would ask, \"how can you come home from running a company and still cook\nevery night?\" And she simply replied, \"it's relaxing,\" as a roti seemed to step off the\ntava, inflating at her slightest touch. Such a dramatically bloated roti happens only with\nprecise combination of the right pressure, temperature and time. I would call them\n\"balloons\" as a child. At that point, I did not understand how a task requiring so much\nprecision and skill could be \"relaxing\".\n\nBy now, the water is boiling vigorously and I can smell the warm olive oil. After\nsubmerging a bushel of potatoes in the boiling water, now calmer, I add one tiny jeera\nseed to test the warmth of the oil the way my mother taught me. I stand on my toes to\npeer over the side of the tall pot and see the oil bubble and jeera seed dance, indicating\nthat the oil is hot enough. I add two more tablespoons jeera, ten times more than what my\nMother uses to make daal for my family. When I was just learning to cook bhindi, she\nwould instruct me, \"now add garam masala.\" I would take a heaping spoonful of the\npungent brown powder using a small metal spoon from inside her matching tin spice box.\nI would hold it up for her approval. \"Add about half of that more,\" she would assess by\nmerely looking at it. She never measured. She always knew exactly what to add, and this\nability still eludes me.\n\nThe daal simmers, bubbling gently as I finish peeling the potatoes. I broiled five large\neggplant in the oven (my mother's own shortcut) the previous day. They are an\nunappetizing thick, seedy, brownish-green mush. I add the eggplant mush to already\nfrying onions, garlic, ginger, tomatoes and coriander to make the exquisite bhartha. With\nthe lentil daal and bhartha noisily gurgling and sloshing about in their army-sized pots,\n\nthe kitchen fills with a thick, comforting aroma of Indian spices, completing my\nnostalgia. My college recreation of my mother's kitchen is immensely satisfying, and\neven comforting. I am reminded of home by Po' Girl's song Cold Hungry Blues ( \"I\ncooked all night, and I cooked all day\") and marvel at the balance Mom was able to\ncreate. She ran a successful company by day, and was a loving, doting mother by night.\n\nFinishing my cooking, I bring out the thick, brown lentil daal, still simmering bhartha,\nand the lightly fried yellow potato sabzi along with accompaniments: fragrant yellow rice\nadorned with cashews, and tangy cucumber raita. Finally, I present the halva. Rather\nthan a curdled mass of wheat, it turned out thick, rich, and full of almonds and raisins.\nStanding back, I see the buffet table from my imagination come to life: large, steaming\nquantities of flavorful food recreate the culinary delight of home, only that the amounts\nare multiplied many times.\nMy housemates and a couple of Indian friends I've invited over (to judge the\nauthenticity) eagerly enter, curious from the aromas that have drifted from the kitchen.\nThey gingerly nibble the unfamiliar food at first, but their second and third helpings get\nlarger and larger. They comment, \"wow, I'm not afraid of Indian food anymore,\" or,\nmore encouragingly \"I'm really full and it's all your fault!\" Perhaps the best was \"I'd\nconsider being vegetarian if the food was always like this,\" from an otherwise\ncarnivorous housemate. Joining them, I arranged rice, daal, and raita in my plate and sat\ndown at the table. I took a spoonful of rice, covered it in daal and added a hint of raita in\njust the right proportions like my mother does. Although it tastes likes home, familiar and\ncomforting, I know I have a lot to learn.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.041 Topics in South Asian Literature and Culture\nFall 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Mozail",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-041-topics-in-south-asian-literature-and-culture-fall-2004/730faff8408980460c9063f29949e7e7_MIT21G_041F04_biswal.pdf",
      "content": "November 24, 2004\nPunyashloka Biswal\nMozail\nThis composition is based on Saadat Hasan Manto's Mozail, and is struc\ntured as an epistolary short story. I have not attempted to remain com\npletely faithful to the original: facts have been modified, and the plot has\nchanged in some ways. I have tried, however, to keep the essense of the\ncharacters.\n21 January 1947\nDearest Mozail,\nI hope you are well, and are having a great time with your friends\nin Deolali. I've heard there will be some Congressled protest meetings\nthere on Wednesday, and I would advise you not to attend. It's for your\nown safety, you know.\nWords cannot begin to describe how I have missed you this weekend.\nYou are like a ray of light in my life, and when you are away, everything\nseems empty, pointless, meaningless. Believe me when I say that you are\nmy first love. I am 'upto my knees' in it, and when I look into your eyes,\nI feel that I could drown and not regret it.\nI wonder if you remember the first time we met? The occasion is still\nfresh in my mind--it was exactly six months ago. I was moving furniture\ninto my apartment when you arrived from downstairs in your adorable\nwooden sandals, stumbled and bumped into me. From the first touch of\nyour body, I was a goner.\nWhich train do you plan to take on Friday? I'll meet you at the station,\nand then we can go catch a movie. Write to me!\nYours (and only yours),\nTarlochan Singh\n21G.041\n\n26 January 1947\nTarloch Darling,\nSometimes I wonder if you're really insane or just pretending. You\nneed to stop worrying about me! I have every intention of going to\nPt Nehru's speech, and I assure you that I will be just fine. What kind of a\nfearless Sardar are you anyway, if you don't even dare to go to a political\nmeeting?\nAnyhow, I've spent a wonderful week here. Just yesterday, I met up\nwith one of my old flames (Michael D'Souza--I think I've mentioned him\nbefore), and I must say we had a ball. Michael is so funny at times! I think\nour names sound so wellmatched too: \"Michael and Mozail D'Souza\";\ndon't you agree? Unfortunately he's also completely broke, so I suppose\nthere's no potential there. Therefore fear not, I shall come back into your\narms in a few days.\nI think I'll take the 5:30 back from Deolali on Friday. I'm not too sure\nabout the movie though.\nHope you're keeping well,\nMozail Rosen\n2 February 1947\nMozail,\nWhy do you delight in torturing me thus? I waited for you all evening\nat Dadar, and you never showed up. I can barely sleep at night now,\nimagining where you must be and the things you must be doing. I love\nyou so much; can't you return even an iota of that?\nI'm fed up with hearing stories of your old lovers. If you like Michael\nso much, why don't you go and live with him? Sometimes I wonder if\nperhaps I am the one at fault. When I think about the purity and sanctity\nof the women from my village, my homeland, I wonder if I am being\npunished for loving someone like you. May the Gurus guide me!\n\nStill, for better or for worse, I am stuck with you. Write to me soon,\nand let us meet some time this week.\nTruly,\nTarlochan Singh\n5 February 1947\nDearest Mozail,\nThis is too much--now you won't even respond to my letters any\nmore! Please don't take everything I write so seriously, darling. You\nknow that I still love you from the bottom of my heart, and I'd do anything\nfor you. I know that you say these painful things to test my love, not\nbecause it pleases you to see me suffer. Do write to me, and put me out\nof my misery.\nYours,\nTarlochan Singh\n10 February 1947\nMy Darling Sikh,\nWhen will you ever understand me? I suppose I should give up even\ntrying to put some sense into that giant stuffed turban of yours that I love\nso much.\nI didn't show up on Friday because the protest march went on for\nanother day, so I had to take the Sunday train instead. And I'm hale and\nhearty, just as promised. I wasn't trying to punish you by not writing\nback, it's just that I was really tired from Deolali and in no mood to write\nor go out.\nHow about taking the local up to Mulund this Sunday? I've heard\nthere's a new play by Tilak productions showing there. It's so funny that\nI'm introducing you to Indian theater and art, when you keep calling me\na foreigner.\n\nSee you soon,\nMozi\n15 February 1947\nDearest Mozail,\nI read in the newspaper today that yesterday was Valentine's Day, a\nday to celebrate love and lovers. In the west, lovers exchange gifts and\npromises on February 14, to commemorate the sacrifice of St Valentine\nwho died for helping lovers in mediaeval times. Isn't that such a romantic\nstory? It is said that couples who are together on this day and pray to\nGod will remain together forever. I think it's very appropriate that we\nwent out yesterday--now I see that our union must be blessed.\nYou too must pray to your God that our love stays strong. I don't like\nthe way you constantly ridicule my religion. I think you should respect\nmy Sikhism, just like I respect your Jewish faith. I know you don't believe\nin these spiritual things very much, but my experience from life tells me\nthat faith helps at times when it counts. You'll thank me for this advice\none day.\nSat Naam Vahe Guru,\nTarlochan\n19 February 1947\nTarlochan Singhji,\nWhoever stuffed your head with all these religious ideas? Was it your\nparents? I don't understand how you can possibly argue that faith is\neverything. Just look around you, or read the news. In Europe, Hitler\nis butchering Jews, wiping out millions in his concentration camps. And\neven here, at home, I feel that evil things are brewing. Jinnah and the\nHindu Mahasabha are rabblerousing in the north, inflaming Hindus\n\nand Muslims against each other where they have lived in harmony for\nhundreds of years. Your Mahatma Gandhi's passive resistance is no good\nwhen our own people fall on each other like hungry wolves. And here\nyou are, singing sweet lullabies about Valentine's day! Shame on you.\nI'll tell you what, Tarloch. You keep asking me to marry you, to\n'become one with you.' Well, I'll grant your wish. I was serious when I\nsaid today that you would look dishy if you were to cut off your beard.\nIf you forswear Sikhism, I will marry you!\nLove and kisses,\nMozail\n22 February 1947\nMozail,\nCould you come to see me some time today? I'm not feeling very well,\nand I have something to show you.\nTarlochan\n24 February 1947\nMozail,\nSo, what did you think? Now that I've given you your pound of flesh\nand cut off my beard, it's time for you to keep your end of the bargain.\nI'll be waiting for you outside your office at 5:00pm, near the usual taxi\nstand. Don't forget to dress nicely; this is a solemn occasion!\nYours impatiently,\nTarlochan Singh\n4 March 1947\nYou heartless bitch!\n\nHow could you lead me on and play with me like this? I made a fool\nof myself, standing outside your office in Fort in my best suitpant, while\nyou were off gallivanting with that bastard Michael from Deolali! Fuck\nyou, and fuck all your heathen kind! We need more Hitlers to save the\nworld from women like you.\nI hope you have a miserable life, and that I never have to see you\nagain. I am going to be a good Sikh and atone for the sin of loving you.\nPerhaps the Gurus shall forgive me some day. Goodbye.\nTarlochan Singh\n∼ postscript ∼\n7 March 1947\nDear Diary,\nWhere shall I find solace? I, loved, hated, desired, misunderstood--\nI, Mozail. Tarlochan loved me for my swelling breasts and my ready\nhumor, and I him for his simple mind. We got along so wonderfully\nfor the first few months. Why do men always want control? I tried to\ngive him everything I could, but I knew he wasn't ready for me yet. We\nwouldn't have been happy together, I know--that was how it ended the\nlast time.\nIt's nightmarish, the way life repeats itself. And I have to wonder each\ntime, is it my fault? Did I go too far when I told him I would marry him?\nAnd I meant it too. If he had left his faith, I would have stayed with him.\nBut cutting off a beard does not unmake thirty years of being a Sikh. He\nwas still the same man, only handsomer.\nI see the cycle beginning again, with Michael this time, and I fear the\nend. He laughs and jokes, he approves the 'women's lib' movement, but\nso what? Still, I see the old, familiar streaks. Will I ever find a man who\ncan fulfill me? I can dream. . .\nMozail\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.041 Topics in South Asian Literature and Culture\nFall 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "The Art of Invisibility in Kiran Desai’s Hullabaloo in the Guava Orchard",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-041-topics-in-south-asian-literature-and-culture-fall-2004/8490e3e04ea39b027823a111e94d147e_MIT21G_041F04_ramya.pdf",
      "content": "Ramya Rajagopalan\n21G.041 10/4/03\n\nThe Art of Invisibility in Kiran Desai's Hullabaloo in the Guava Orchard\n\nThe fringes of society are rich with the impressions left by marginalized\nindividuals, who inhabit a reality that operates on principles vastly different from the\nmores and norms that any cohesive society must establish. Such fringe elements tend to\nbe largely \"invisible\" to the mainstream. Strictly, invisibility implies a paucity of overt\nvisual cues to suggest presence. But for those on society's periphery, it also bespeaks a\nvoluntary reticence, a reluctance to furnish the oral and aural stimuli that reveal one's\ntrue self, and the accompanying failure on the part of contemporaries to recognize the\nstill waters that run deeper. In Hullabaloo in the Guava Orchard, Kiran Desai contrasts\ntwo very different types of invisibility, that of the protagonist Sampath, and his mother\nKulfi, in the eyes and ears of the other characters in the novel, and to some extent of the\nreader. The internal observers, namely the other inhabitants of Shahkot, are caricatured,\noften as a homogeneous group, by Desai, and it is only in this light that they allow a\nconsideration of the theme of the unseen and unperceived. Though the reader is allowed a\nslightly more privileged vantage point, occasionally eavesdropping on the stream of\nconsciousness of Sampath and Kulfi, Desai's breezy style preserves their enigmatic aura\nfor both the internal and external audiences.\nKulfi and Sampath are social outcasts; their absorbing preoccupations with idle\ndaydreams and the desire to nurture these fantasies in peace clearly place them outside\nthe folds of Shahkotian society, steeped as it is in the ancient beliefs and superstitions of\nthe subcontinent while caught in the encroachment of post-colonial modes of thought,\nand necessarily suffused with the thirst for gossip of any self-respecting community.\nBoth Kulfi and Sampath are oblivious of these markers of the society within which they\n\nRamya Rajagopalan\n21G.041 10/4/03\n\nare physically embedded; they are in fact too wrapped up in their own thoughts, on an\nentirely different mental plane. This marginalization from the community, while largely\nself-imposed, also necessitates a kind of lone-star persona, one whose quest for silence\ncontrasts sharply with the requisite din of town life. And living as they do outside the\nsphere of\nmeans of s\n\nKu\nis borne al\nlaw. Duri\npersona in\n\neveryday life, their unique dialogue with reality, which constitutes for them a\nurvival, becomes akin to artistic genius.\nlfi's isolation from society is established at the outset; her blooming pregnancy\none, in rooms cut off from the worried whispers of her husband and mother-in-\nng her pregnancy, we are introduced to the eccentricity which surrounds her\nthe eyes of the townspeople:\n'Oh dear, what is going to become of this woman?' said Lakshmiji, the\nRaipurs, the Bengali teacher, and all of the others when they looked out of\ntheir windows, when they gossiped at the tea stall or sat in each other's\nhouses eating peanuts together. 'There was always something odd about\nher,' they said. (Desai, 5)\n\nIn fact, by the time her son arrives, we get the sense that she has already diminished in\nimportance to the main story line, hardly registering on the radar of her family, an\ninvisible sha\ncharacter tha\nencounter w\ndow flitting across the page. It is in this status of relegated secondary\nt she appears to us and to her contemporaries, for the remainder of our\nith her.\nSampath, on the other hand, is ostensibly much more engaged with the people\naround him, even while he is likened to a \"vegetable\" (Desai, 26), a lazy dreamer lacking\nthe common sense that would undoubtedly lift him up from the bottom rung of the social\nladder. His innocent cross-dressing and stripping antics at the wedding reception solidify\nin the minds of both townspeople and reader the strangeness of his way of thinking. It is\n\nRamya Rajagopalan\n21G.041 10/4/03\n\nvery telling that he is not at all ashamed of the scene he makes of himself, yet when he\ntries to conform to \"normal\" codes of conduct, echoing to his superior the crisp yet\nproperly obsequious reply sternly advised by his father, he not only feels ridiculous but is\nself-conscious for the first and only time in the novel:\n...he chirped, 'Yes, sir. I will see to it right now, sir.' But once he began,\nthe latter half of his sentence - the 'right now, sir' - amazed and shocked\nby the preceding words, grew shaky and trailed up thinly into the high\nceiling of the room...They all turned to stare at him in surprise. Never\nhad they heard him attempt such a sentence. It was most uncharacteristic.\nRealizing himself how odd he had sounded, his face burning, Sampath\nturned and scuttled off to his desk in the dark depths at the back of the post\noffice. (Desai, 32-33)\n\nHis efforts to sequester himself from the questions, the demands, the noise, of his\nfamily and the town are thwarted; in his own words he is \"found out and turned away\nfrom every refuge\" he seeks (Desai, 44). And then a guava explodes in his hands, and he\nis transformed:\nSampath felt his body fill with a cool greenness, his heart swell with a\nmysterious wild sweetness. He felt an awake clear sap flowing through\nhim, something quite unlike human blood...He could have sworn a\nstrange force had entered him, that something new was circulating within\nhim. (Desai, 46-47)\n\nAt this point, Sampath becomes well and truly exiled beyond the reach of societal\nconfines, both physical and those founded on expectations; his escape to the guava tree in\nthe Orchard is merely a token enactment of his journey to a new state of mind. He has\ndetermined to seek and find freedom, far from the madding crowd.\nThis freedom is, in one sense, a keen longing for spatial sequestration. In fact,\nfrom this point on, both Sampath and Kulfi hover on the fringes of the novel, above and\nbelow the din, respectively. Sampath has a definite association with the sky, and the\nheavens. It is in the midst of a prodigious raining of gifts from the skies that he enters the\n\nRamya Rajagopalan\n21G.041 10/4/03\n\nearthly realm, after all - both the monsoon torrents and the Red Cross relief package are\nharbingers of his birth. But in other ways his head is very much in the clouds, in a space\nbetween earth and the heavens that presses us with its yearning to be as skybound as\npossible. The irritating sleep-sounds of his family cause him to run to the roof; the\nclamor generated by their harping causes him to flee to the crown of a tree, overlooking\nthe ensuing hullabaloo below. And at the end, he disappears as a guava over the crest of\na high hilltop, borne by the monkeys:\n\"Still the monkeys traveled. Higher and higher. Like a gust of wind that\ncomes out of nowhere, rustles through the trees, and melts into nothing,\nlike a ghost...the monkeys climbed on. Up into the wilderness, up to the\nshoulder of the highest mountain. Here the trees at the very summit\nwavered for a moment, bowed their heads as if in farewell - and then they\nwere gone.\" (Desai, 208-209)\n\nKulfi is, in sharp contrast, very earthy. She is never the center of attention, like\nSampath is, and partly because of this she seems to lurk below the plot, connected to the\nmurmurings underfoot, of plants, animals, seasons. Ear and nose to the ground, on a\ntreasure-hunt for the ingredients that bring to life her enchanting culinary concoctions,\nshe represents ancient knowledge, and the lost art of sensing the world, rather than\npedagogically apprehending it. Hers is the earth-mother role, guardian of its bounty,\nand her easy transition from a trapped muttering eccentric to a frenzied, driven, brilliant\nchef gives us the sense that she is heavy with the weight of a memory not her own but the\naccumulated wisdom of all human consciousness that has preceded her.\n\nBeing outside of society initiates the exile of Sampath and Kulfi from the noise\nthat defines it, and this in turn reflects their symbolic invisibility to the other characters.\nThe disjunct between the textual space that Kulfi and Sampath occupy and that occupied\nby the townspeople in the novel is mirrored in the conflict that Desai poses between noise\n\nRamya Rajagopalan\n21G.041 10/4/03\n\nand silence. This tension permeates the novel, and she uses the marginalization and\ninvisibility of both characters as a vehicle for its expression. Kulfi, in all ways more\ndisconnected from the life of norms embodied by the town, is more extreme in her avidity\nfor silence, though it is actually solitude that she seeks. For example, during her starved\nand difficult pregnancy, she turns not to her mother-in-law or her husband, but rather to\nthe walls that cage her, drawing out her frustration, her dreams, making the bars of her\nprison serve the role of canvas. Yet she also welcomes the majestic and thunderous\nsounds of the storm that herald the imminent fruition of her painful gestation, suggesting\nthat there may be an aural hierarchy, in which the sounds of nature do not intrude on\nsilence and solitude, but those of human companionship do. Thus with Kulfi (and later\nwith Sampath as well), Desai confounds the distinction between solitude and silence,\nsilence being the necessary absence of verbal communication. This physical, oral and\naural isolation is only heightened in the orchard, where Kulfi bustles about on her own\nterms, marching to her own drummer: \"Here, in the orchard, the hold of other people on\nKulfi and her awareness of them retreated even further and, like Sampath, she discovered\nthe relief of space\" (Desai, 78). She preferentially keeps to herself throughout the novel;\neven the reader rarely encounters any vocalized expression of her thoughts, and when\nthey do appear, they are uncensored outpourings of her mind's voice, and exclusively on\nthe topic of alimentation.\nSampath, on the other hand, shuns noise, but until the end he cannot manage to\nfind and retain the silence he craves. Rather than the easy calm that Kulfi is able to carve\nout of her surroundings, we see Sampath unsuccessfully fleeing the sounds of society,\nwhich he finds demanding and invasive, slicing through him coldly like his father's litany\n\nRamya Rajagopalan\n21G.041 10/4/03\n\nof verbal abuse. He, unlike Kulfi, is forced to make compromises to navigate the\ndichotomy of intrusive noise and exquisite silence; to find peace, he must first disturb it.\nFreedom is his ultimate goal, and that freedom constitutes a kind of anti-being, a stillness\nthat is at one with nature and in harmony with the warm murmurs in its depths. But noise\nis the medium of communication for the rest of the world, those living on the inside of\nreality, for whom the airwaves must vibrate coherently. Thus it is that when Sampath-as-\nwise-sage, in an act of desperation to secure peace and quiet, alters the frequencies of the\nairwaves with old homilies in a new context, the sonar of the townspeople kicks in,\nproclaims it as holy, and begs for more. And thus it is that while all Sampath craved in\nthe Orchard was silence, he has found himself more noise then he ever bargained for, and\nin fact exacerbated the very din that he desperately tried to escape.\nYet even when he is seemingly the center of attention, he is still fringe-bound, a\nnovelty to be gawked at. He is drawn into the fold more than Kulfi, but it registers as a\nhollow facade even at the height of his popularity. Importantly, it is his very silence that\nties Sampath's hands, consigning him to sagehood, for, while desperation drives him to\ninitiate the fateful recitation of forgotten secrets and maxims, he never once verbalizes his\ndesire for the devotees to leave him alone. So in what may be the greatest irony in the\nnovel, he is, in essence, still invisible as the revered Tree/Monkey Baba. Even as they\nflock to his feet, no one takes note of his silent pleas, for such a study would make it\nquite evident that what he really wants is to be left alone.\nIn the Orchard, we see the isolation, the air of invisibility associated with Kulfi\nand Sampath, flower and bloom into what becomes a kind of artistic genius, like magic to\nthe townspeople, yet their own means of survival. Both Kulfi and Sampath are, in a\n\nRamya Rajagopalan\n21G.041 10/4/03\n\nsense, traders in the commodity of the unseen. Kulfi buys her life's purpose with the\npreparation of lavish meals exclusively for Sampath, made with ingredients hidden and\nmysterious to the rest of the world:\n\"She cooked only for Sampath...for his was the only judgment Kulfi\ntrusted. Almost all day she worked, trying this and that, producing, even\nin these early days of apprenticeship to her imagination, meals of such\nflavor and rarity that others could merely guess at what they were missing\nby the smells that rose from her pots...\" (Desai, 79)\n\nSampath's fling with guruhood is founded, if desperately, on drawing the curtain\non secret lives that are kept out of the public eye, buying him his stay in the Orchard.\nThe mystique and curiosity these activities generate, by their unfamiliarity to the\ntownspeople, naturally elevates them to an art form, the artistry taking on epic, even\napocryphal, proportions.\nBoth characters engage with their reality in highly artistic ways. Kulfi does so\nvibrantly, Sampath more weakly, as if his claim to artistry is genetically diluted. When\nDesai draws the curtains back so that the reader can peek into Sampath's mind, we feel\nwe are entering a different realm. We tiptoe in to leave behind the alternately persistent,\nprodding, and angry voices of Mr. Chawla, the mob, and government officials, and things\nseem to come to a standstill. It is like we have entered a portal to an ante-chamber cut off\nfrom the din of the outside world, so very concrete is the transition from the noisy,\ncrowded reality of the devotees surrounding him to the limpid, dreamy, underwater\nstillness of his own mental processes:\nHe looked at the tree that was such a good home....Here, sitting not too\nhigh and not too low, he had seen the world in absolute clarity for the first\ntime, the days emerging as if purified from nights of a clean and brilliant\nblackness. The sunlight coming in through the leaves at daybreak, shifting\nand flickering, breathing its fire-breath upon the bark, falling now and\n\nRamya Rajagopalan\n21G.041 10/4/03\n\nthen upon Sampath, whom it treated as if he were not the solid being that\nhe was, scattering him like water...He felt weightless here, rocked by this\nlambent light, lapped by the swell of flower and grass, of leaves as rich as\nfruit, being warmed to their different scents. (Desai, 142).\n\nDaydreaming, however, is his moonlighting, and deeply personal, occupation. He is\nhardly a gnani or an intellectual, yet for all intents and purposes, to the townspeople he is\nthe sculptor of their minds and futures, their magic eight ball, obliquely (and unwittingly)\noffering them advice, because that is what they seek and crave. In fact, Desai gives us\nmuch cause to ponder the disjoint between what people actually hear and what they want\nto hear. Sampath offers them nothing more then he is pressed to do, or is capable of - his\nutterings are like an uncontrollable tape recorder going off of its own volition, spewing\nforth the homilies he is surprised to learn he has, against his best lack of effort,\nassimilated since childhood. Unintentionally, he has found a new voice for an old kind of\nart. Sampath's apprehensions of the beauties around him, and the wisdom he dispenses\nwhich paints the local vernacular and determines the trajectories of lives, render him an\nartist of the mind, of sorts, but a passive and unwitting one.\nIn sharp contrast, Kulfi's creative genius of is active and driven. It lies in her\nmarvelous talent for works of art that have a corporeal incarnation, using the walls of her\nhome as her mural and canvas, transforming and bringing together the arcane wild\ningredients splayed across the Orchard hillsides into elaborate pulsing dishes. She is a\nmaterial artist, and her language is gustatory, comprising the tastes, smells and feel of her\nintoxicating ingredients.\n\nIf the protagonists are largely invisible to the rest of Shahkot, they are only\nslightly more fleshed out for the reader. Desai carefully reveals what amount to quick,\n\nRamya Rajagopalan\n21G.041 10/4/03\n\nhazy mental snapshots, that the reader might be drawn into the worlds of Sampath and\nKulfi while keeping one foot planted firmly in the Shahkotian mindset. The\nestablishment of this healthy distance is essential to preserving not only our\nunderstanding of the intrinsic gulf separating the two, but also our respect for the enigma\nthat mother and son constitute together.\nKulfi and Sampath inhabit a state of being that is inaccessible and\nincomprehensible to the townspeople. One can argue that their status as outcasts renders\nthem freer to explore such \"higher\" planes, but it is perhaps more likely that the draw\nsilence has for them exploits an innate magnetic attraction for solitude, enhanced by their\nevident \"eccentricity\" and consequent societal marginalization. Kulfi is able to sculpt a\nniche for herself in the wilderness bordering the Orchard, one in which she can enjoy\nboth solitude and self-realization as a brilliant chef. Sampath, on the other hand,\nstruggles; he flounders in a nebulous, precarious compromise between that which he is\nescaping from and that which he is aching towards. Both flit like shadows across the\nawareness of the rest of the characters, present in the background but for the most part\nactively masking their true selves, perhaps because they realize they can never conform,\nand thus will never be understood. Neither family, nor acquaintances, nor devotees\nconsider making a sincere attempt to penetrate the protective barrier that both Sampath\nand Kulfi impose between themselves and society. Thus their invisibility to the rest of\nShahkot, and the resulting enigmatic personae they acquire, is rendered from both sides,\nhighlighting the tensions between noise and silence, society and seclusion.\nKulfi's genius does not become cause for reverence, yet Sampath's \"gift\" for\ninscrutable wisdom does. Within the theme of noise and silence, it becomes evident that\n\nRamya Rajagopalan\n21G.041 10/4/03\n\nKulfi can never be the center of attention, for she is already too invisible, too far beyond\nthe grasp of the crowd; her culinary activities engage no one but Sampath. On the other\nhand, when first confronted in the tree by the mob, Sampath cowers into the corner that\ninitiates his meteoric rise to holiness, blurting out their epistolary secrets. And again we\nfind evidence of the critical role that noise, particularly the spoken word, or shruti (that\nwhich is heard) plays, not only in the novel but in Indian religious life in general.\nSampath is listened to, and the aural footprints he leaves render his invisibility that much\nharder to attain, until his grand finale, his disappearing act, the magician's final trick.\nSampath's dream-like life represents a journey deep within oneself, to the expanse of\nemptiness, reminiscent of the Buddhist ideal of nirvana - the being of nothingness.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.041 Topics in South Asian Literature and Culture\nFall 2004\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}