{
  "course_name": "Topics in Indian Popular Culture: Spectacle, Masala, and Genre",
  "course_description": "This course aims to provide an overview of Indian popular culture over the last two decades, through a variety of material such as popular fiction, music, television and Bombay cinema. The class will explore major themes and their representations in relation to current social and political issues. In particular, students will examine the elements of the formulaic “masala movie”, music and melodrama, the ideas of nostalgia and incumbent change in youth culture, as well as shifting questions of gender and sexuality in popular fiction. During the course, students will look at some journalistic writing, advertising clips and political cartoons to understand the relation between the popular culture and the social imagery of a nation. This course is taught in English.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "Asian Studies",
    "Fine Arts",
    "Media Studies",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "Asian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Overview\n\nThis subject aims to provide an overview of Indian popular culture over the last two decades, through a variety of material such as film, advertising, and pulp fiction. This term we shall focus on the evolution of Hindi cinema from the old formula of melodrama to some of the new paradigms in Bollywood and its influence on other forms of popular culture. We discuss the role of the changing socio-political milieu and changing audience and analyze some of the new genre films and reconstructed \"masala\" melodramatic films. Films shown include\nDil Chahta Hai\n,\nParineeta\n,\nRang De Basanti\n,\nCorporate\n,\nKrrish\nand\nOmkara\nand fiction includes works by Shobha De and Khushwant Singh.\n\nThis class is for students at all levels. Whereas those who have had no prior experience of Indian popular culture will get an exposure to a new world-view, those who have already been exposed to it will find and articulate new ways of approaching and interpreting the culture. Class is taught in English, all texts in English, all visual material shown, would be subtitled in English.\n\nThis is a \"communication-intensive\" subject; we will pay special attention to honing the students' oral and written communication skills, through a strong emphasis on class discussion, oral presentations and guided written work. Students will be required to write three 7-8 page papers: they will write each paper, which will be evaluated, corrected and commented upon carefully, and they will have a week to prepare a revised version before submitting it to the instructor. The class will also be regrouped into units that will take turns at leading discussions.\n\nCourse Requirements\n\nYou are expected to attend all classes, as class discussion is crucial. Any unexcused absence will automatically lower your grade.\n\nThe class will be divided into small groups. Each group will be responsible for \"teaching\" one class: that is to say, they will (with the help of the instructor, if needed) choose topics to present to the class and lead the discussions. The group will meet to discuss a teaching plan, and prepare \"thought questions\" on the assigned reading and visual material the course will cover. This will count as your \"oral presentation\" and will be graded by the instructor.\n\nYou will be required to write three papers of 7-8 pages each. The days when they are due are marked clearly on the calendar. The essays will be corrected, discussed with you and handed back quickly and you will have a week from then to hand in your final version. Unless arranged with the instructor ahead of time, late submissions will be penalized with a lowered grade. In addition, you will write a couple of paragraphs every week in response to the film you have seen or the text you have read and you will email it to your instructor\nbefore\ncoming to class. These will be your first reactions to the text, and the writing can be relatively informal. These \"responses\" will not be graded; these are aimed to assist you in organizing your thoughts for the class discussion to follow.\n\nYou will be expected to come to class fully prepared to discuss that week's material: that is, you will have read the day's assigned text, and/or seen the assigned visual material\nbefore\ncoming to class. Assignments are posted very clearly in the syllabus. Any change in the syllabus during the course of the semester will be duly announced in class. If you are absent that day, it is your responsibility to make sure you are aware of what you need to prepare.\n\nAll readings and selections from cartoons, newspapers and magazines and other visual material will be photocopied and supplied by the instructor to the class. You will be expected to pay for all the photocopying expenses.\n\nThe films for this course will be available at the LLARC. Short excerpts from other visual and audio material will be presented in class.\n\nPlease note: Essays submitted late without prior permission from the instructor will be penalized by\none full letter grade\n. Acceptance of late papers will remain subject to instructor's discretion. Always keep a printed copy of your essay.\n\nIf at any point, you should feel the need for further discussion to clarify any issue, the instructor will meet with you outside class.\n\nGrading\n\nThe final grade will be determined using the following percentages:\n\nACTIVITIES\n\nPERCENTAGES\n\nAttendance and Punctuality\n\n20%\n\nClass Discussion and Oral Presentation\n\n40%\n\nPapers\n\n40%\n\nCalendar\n\nWEEK #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nSpectacle, Masala, and Genre in the context of Bollywood\n\nModule 1\n\nNeo-modern Narratives\n\nNeo-modern Narratives (cont.)\n\nNeo-modern Narratives (cont.)\n\nPaper 1 due\n\nModule 2\n\nReconstructing History\n\nReconstructing History (cont.)\n\nRevised version of paper 1 due\n\nModule 3\n\nAppropriating Literary texts\n\nShakespeare\n\nPaper 2 due\n\nFlaubert\n\nModule 4\n\nEngaging with Hollywood\n\nRevised version of paper 2 due\n\nEngaging with Hollywood (cont.)\n\nEngaging with Hollywood (cont.)\n\nPaper 3 due\n\nConclusion: Next Decade?\n\nRevised version of paper 3 due",
  "files": [
    {
      "category": "Resource",
      "title": "Christine",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-011-topics-in-indian-popular-culture-spectacle-masala-and-genre-fall-2006/f20068c0f98805182e8877313331775e_MIT21G_011F06_christine.pdf",
      "content": "Courtesy of Miriam Huntley. Used with permission.\n\nMiriam Huntley\n21G.011\nChristine\n\nI'll be quite frank with you- no reason not to be. I am a criminal. There's no way\naround it, and no matter how much I try to convince myself that what I do is not really a\ncrime, the truth remains the truth. What do I do? I seduce men and then steal from them.\nEnd of story. There's nothing complicated about it, nothing fancy. It's just a simple con-\njob.\n\nI think that most people, when they hear of criminals like myself, want to know\nthe reason behind their actions. Are these criminals just truly evil people, all the way\ndown to their core? Or perhaps they have a set of extenuating circumstances that forced\nthem into this way of life? As for myself, I can provide neither as an excuse as the \"why\"\nbehind my actions, and I can't in all honesty say that I have particularly good reasons for\nending up the way I have. But I'll give you the story of how I fell into this way of life\nanyway, because, even though it will not provide justification, it may give you a better\nfeel for why I live my life the way I do.\n\nI began my life in Poland, and lived there for the first twenty years of my life. I\nwent to a mediocre university there, and, for lack of any better ideas, decided to pursue a\ndegree in accounting. After I graduated, I was quite reluctant to begin looking for a job.\nI knew that with a job would come complete boredom and a rather unexciting lifestyle,\nand I found I had no desire to begin such a life if I could help it.\n\nSo there I was, bumbling around, not knowing what to do, when the idea came to\nme that I should go see India. Why I thought of India in particular, I still don't\nunderstand even now, as I knew close to nothing about the country at the time. But,\n\nCourtesy of Miriam Huntley. Used with permission.\n\nwell...why not? Who wouldn't want to see India? It seemed like such an exotic, perhaps\neven mystical, place to me at the time, and I could already imagine the great adventures I\nwould have there. Well, this idea took root in my head, and soon enough I just got up\nand did it. Bought the tickets, got together some backpacking gear, packed everything I\nneeded- and that was it. Off to India I went.\n\nI traveled around India for close to three and a half months, seeing all the\nwonderful sights there were to see. I saw the Taj Mahal, experienced the wonderful city\nof Dehli, learned of the rich culture of the people; I also saw the uglier parts of India, the\nsqualor and impoverishment the poor were living in. I really grew to love the country in\nthose few months, to feel as if it had become a part of me, and to relate to it deeply.\n\nAs my trip was coming to an end, I decided to go and visit the state of Goa: Goa,\nthe beautiful, Goa, the magical. Goa is a tourist magnet for a good reason. Its beautiful\nbeaches, its carefree atmosphere, its laid back way of life...what more could a visitor ask\nfor? Oh, what fruits of pleasure I tasted in Goa during my two week visit! I spent two\nweeks there, enjoying myself thoroughly. During the day I would be at the beach, lazing\naround or playing volleyball, football, and other games with other young tourists I had\nmet. During the night, we went to parties wilder than any I had ever been to before.\nThere were parties on the beach, parties in the club, parties with trance music, parties\nwith wonderful dancing...and I went to them all. I look back now in wonderment at the\nhappy-go-lucky way of life I lived then, loving every moment with not a worry in sight.\n\nBut then...there always has to be that one event that shatters the peace, and so it\ncame. I received a phone call at the hostel I was staying at in Anjuna; on the other end of\nthe line was a voice I had never heard before, asking politely \"Excuse me, am I speaking\n\nCourtesy of Miriam Huntley. Used with permission.\n\nwith Christine Kowalski?\" I said yes, he was. Then he went on to say, in words I can't\nexactly remember, that he was a distant relative of mine, that my mother had passed away\nwhile I was gone, and could I please return to Poland to take care of the funeral matters.\nI was absolutely stunned, and couldn't speak. At some point I dropped the phone, and\njust sat on my bed, frozen. I was totally lost.\n\nMy mother and I had become distant in the past few years; harsh words had been\nexchanged, and we both had decided to cool it from each other for a while. But I still\nloved her, and I was all she had ever had. My father died while I was too young to even\nremember him, and my mother never remarried or had any other children besides myself.\nAnd now, without me ever having made up with her, she had gone and passed away, and\nleft me utterly alone.\n\nI knew I had to return to Poland, that that was the \"right\" thing to do. But I didn't\nwant to. My mother always hated funerals, and had told me, before we had stopped\nspeaking, that I should just not bother with hers. \"Christine, I don't give a damn what\nyou do with my body after I die. Just have me cremated or something,\" she would say,\nbefore I asked her to stop discussing her own death. Sitting on my bed, I was unsure of\nwhat to do.\n\nSomehow, instead of sorting out all the feelings inside of me, I instead left the\nhostel, found some friends, and just got really, really drunk. I don't remember what I did\nthat night, or the next day, or the next. The drinking seemed to help things, as I didn't\nthink about my dead mother too much when I couldn't, well, think at all. This went on\nfor two days, but I always had the feeling that something was chasing me, that it was\nalways on the verge of catching up to me.\n\nCourtesy of Miriam Huntley. Used with permission.\n\nThe second night after I had heard the news, I somehow managed to stay sober for\na few hours and remember what had happened. I phoned back the relative (Stevn was his\nname, I believe) and informed him that I would not be coming back to Poland, that he\nshould just cremate my mother's body and be done with it. I then asked tentatively about\na will. He said he had looked into the matter, and had found that the little assets my\nmother had had, including the house, would be taken for extraordinary debts she had run\nup in he past five years. Almost as an afterthought, the man added, \"There's nothing for\nyou here.\" I turned this saying over and over in my head. \"There's nothing left for me in\nPoland,\" I thought. Nothing. I had no reason to return. I would stay in India, at least for\na bit.\n\nAnd that is how I ended up staying in Goa. At first I continued to drink heavily,\nand there was not a single party that I did not attend. I remained in this sort of drunken\nstupor for two weeks, never giving much thought to what the next day would bring. I\nwas shocked back to my senses, though, when I realized that my money had run low. I\nknew I couldn't continue this lifestyle indefinitely, that I needed some source of income.\nI began discussing this problem with a friend I had made, one of the Goan locals named\nAmalesh. Amalesh worked part time in a grocery store, but he also was in desperate need\nof more money, and we began wildly brainstorming ways to accomplish this. We saw\nimmediately that the best thing to do would be to jump into the tourist industry. Both\nEuropeans and Indians came to Goa to vacation, and many of them wealthy enough to\nspend money on just about anything. Try as we might, though, we couldn't come up with\nany new way of milking this profitable industry.\n\nCourtesy of Miriam Huntley. Used with permission.\n\nBut we could not shake off the thought that the wealth around us was just ours for\nthe taking, if we just knew how. This led us to start talking, only half seriously, about\nhow one would go about stealing from the tourists. We realized that Goa brings out the\nromantic side in everyone, and tourists who were single were always lonely and ready at\na moment's notice to take up with the first charming person they met. We then\ndeveloped a plan: we could scout out the tourists, find one that was rich but romantically\nunattached. If they were male, I would step in, female, Amalesh would be the actor.\nWhat would happen next was just natural; everyone has heard stories of \"that beautiful\ngirl I met on vacation and never saw again\" from wistful travelers returned. All Amalesh\nor I had to do was become that romance everyone dreams of having on vacation. Then,\nwhen we were held in their trust, it would be easy to steal their money, perhaps while\nthey were sleeping, and disappear until the victim left Goa.\n\nAmalesh and I talked and talked about it, went over little details to make sure\nnothing could go wrong, and, just like that, everything sort of fell into place. Amalesh\nhad been the first to try it, and when I saw how easily he had acquired almost twenty\nthousand rupees, I was hooked. Since then, we have been living this plan of ours. Two\nothers joined our group as well, and the four of us now bring together enough money to\nlive rather nicely. During the winter we play the European crowd, while during summer\nwe prey upon the Indians who came to vacation during that time. As long as there are\ntourists, though, we are working, and we are all very good at what we did. Of course, we\ntake precautions: we moved around a bit from city to city, and we are always careful to\nexecute the theft the night before the victim planned on leaving Goa. But our racket\nreaps up quite a good amount for us.\n\nCourtesy of Miriam Huntley. Used with permission.\n\nDo I enjoy what I do? I guess it seems like a pretty exciting way of life- all I need\nto do to make some money is have fun and party with people I'll never see again. And it\nis fun, it is thrilling. But somehow, I can never quite fully enjoy myself. I've never\nclimbed out of the slump of depression I've been in since my mother died; from that day\non, I've been troubled and brooding on the inside. Though to all outward appearances I\nenjoy Goa just as much as I did when I first came here, the pleasures here seem tainted to\nme, and I cannot shake off this vague feeling of bitterness inside of me. But I keep going\nanyway, because I have to. I cannot mope over something for too long, I cannot stay in\nonce place for too long, I cannot stop working for too long...\"Keep moving\", something\ninside me whispers. So I do; I move from one job to the next, steal from one man and\nthen the next, move from one city to the next...always moving.\n\nAnd that's it. That is how I have been living for the past three years...nothing\ncomplicated, nothing fancy, just a one-two job. Its not something I would have dreamed\nup for myself when I was kid, but, well, honestly, it's a hell of a lot better than sitting at a\ndesk and looking over budgets I don't give a damn about. And maybe it's a bit immoral,\nbut, well, I just try not to think about it. When I do think about it too much, I just head to\nthe local Catholic church, and then I can feel relieved that at least I'm starting out \"pure\"\nagain.\n\nBesides, I can't really feel too bad about stealing from some of these tourists.\nThey are the sheek, the young, and the rich, who have pampered their entire life and\ndon't know the meaning of hardship. What is ten thousand rupees to them? A day's\nworth of fun? They hardly miss the money, and if it weren't for the fact that they were\ninsulted by it, they would forget immediately that we had stole from them at all.\n\nCourtesy of Miriam Huntley. Used with permission.\n\nTake for instance these three young men who came to Goa last month, Akash,\nSameer, and Sid. I had not scouted them out as possible targets beforehand, but by\nchance I happened to get to know Sameer and, through him, his friends. All three of\nthese men were upper-class Indians, young and cosmopolitan, whittling away their time\nin Goa. They had grown up with every possible luxury, and were content to continue\nliving off their parents and leading immature lives with no direction for as long as they\ncould. How could I feel bad about stealing a just a little of the wealth they could never\nappreciate?\n\nConning Sameer was perhaps one of the easiest jobs I have had. He was a sweet\nman, just out of a relationship with a domineering bitch (the way I understood it), and\nwas taken aback that there were other women out there who were easygoing and just out\nto have some fun. I told him I was from Switzerland, as with my blonde hair and sun\nkissed skin he would have no reason to doubt me. Sameer, like all other Indians, was\ntaken by this. Switzerland (and maybe Sweden and the Netherlands as well) has this\ncrazy allure for Indians, who view it as something close to an idyllic paradise. Saying\nthat I'm from Poland just never has the same ring to it. And, after a few hours with\nSameer, spinning a few more lies, the rest fell into place rather naturally.. Sameer was\ninfatuated by me; the poor guy actually thought he loved me! Usually the men I pick out\nare just out to have a good time during their vacation, but Sameer was so innocently\nromantic that he became captivated by me. As for me, I actually rather liked Sameer,\nthough he was really a juvenile fool, and enjoyed the time I spent with him. I'm not sorry\nthat we stole from him, though, as it was money he neither needed nor appreciated.\n\nCourtesy of Miriam Huntley. Used with permission.\n\nWith Sameer, and others like him, I was lucky to enjoy his personality while I\nspent time with him. Oftentimes in my \"job\", as I often refer to it as, I get stuck with\nmen so conceited and egocentric that I usually get the theft over with as soon as possible,\nso I can be rid of their company. Just three weeks ago, for instance, I had decided to con\nthis wealthy businessman named Pradnesh who had being hanging around the beach.\nAfter the first hour I spent with him, I wanted to quit. Pradnesh talked endlessly about\nhow great he was, about his incredible achievements, about his faultless body ... blah\nblah blah. I don't think I got a word in edgewise. If it hadn't been for the fact that\nAmalesh and I had decided we really needed the money at the time, I would have moved\non to someone else rather than endure the pompous bore. But no matter who the man is\nthat I am dealing with, whether it be Sameer's type or Pradnesh's type, he is always rich,\nalways pampered, always someone who can afford to afford to lose a bit of his wealth.\n\nAnd so it goes. Whoever the man, whatever the case, my role is the same. I lie a\nlittle bit, have some fun while I'm at it, and then make my living. I'm really no different\nthan all the others here who are in the tourist business. Everyone here rips off the tourists\nin some way or another, and the way Amalesh and I do it is just in a more, well,\nunconventional way. So we're con-men...so what? So we steal for a living...what about\nit? Everyone has to make good for themselves. I'm sure one day I'll move on from this,\nperhaps to something more reputable. But for now, I am living and experiencing every\nday. I have a life full of excitement, danger, and fun that forces me to be continually on\nthe move and keeps me from dwelling on my state of depression I've been hiding for the\npast three years. And this is the way I think I'll keep it, at least for now.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.011 Topics in Indian Popular Culture: Spectacle, Masala, and Genre\nFall 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Mangal Pande—Doctor Scene",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-011-topics-in-indian-popular-culture-spectacle-masala-and-genre-fall-2006/ffaad0123f1c50384f50d70a2bff8c62_MIT21G_011F06_mangal.pdf",
      "content": "Courtesy of Miriam Huntley. Used with permission.\nMiriam Huntley\n21G.011\n\nMangal Pande- Doctor Scene\n\nThe prostitutes are lined up to get checked by the doctor. The room is grey and\nlarge. All of the women are wearing lenghas, and Hera's lengha is bright pink and gold\nand of a more lively nature the dresses of the other women. Hera wears heavy makeup\naround her eyes, and her long hair is tied in a braid behind her, similar to the hairstyle of\nmost of the other women. She is also wearing a lot of jewelry, with a nose ring, earrings,\nand a tight necklace.\n\nThe doctor is sitting on a chair, and there is small raised platform directly in front\nof him. He is wearing a white shirt with suspenders, and dark pants. He has a glove on\nhis left hand and an uninterested look on his face.\n\n\"Next\", the doctor says, and Hera steps up the platform. As she moves the\njingling of her jewelry is heard. She looks back at all the other women watching, and\nhesitates. \"Quick, lift it up. You wouldn't be here if you were the shy sort,\" the doctor\nsays with a smile, and all the other women laugh at this remark.\n\nSuddenly there are shouts at the door of \"Here comes the hero!\" and \"Mangal!\nMangal!\", and seven soldiers enter, including Mangal Pande who is being carried in. All\nseven are wearing their British East India Trading Company army uniforms, and the six\nwho accompany Mangal appear to be in a great mood. They bring Mangal to a bench\nwhich is near the girls waiting in line.\n\nMangal himself looks unkempt. His hair is not tied back but disheveled, and his\nface has blood streaks across it, which he tends to with a sponge. His uniform is torn and\n\nCourtesy of Miriam Huntley. Used with permission.\ndirty all over, with blood marks everywhere. There is a big blood spot on his left arm\nwhere the uniform has almost been completely torn off.\n\n\"Come on doc! Quit peeping up skirts all day and treat a hero for once!\" one of\nthe soldiers cries out laughingly to the doctor. Everyone erupts into laughter, except for\nMangal. Mangal is seen wiping off blood from his face\n\n\"A hero?\" asks one of the girls. She takes a step towards Mangal and\nimmediately recognizes him. \"Oh, he is the one who saved Hera from that Captain\nHewson!\"\n\n\"Come, Hera, and have a good look at your hero!\" answers another one of the\nwomen, Shanti, while gesturing towards Hera (who is has already stepped off the\nplatform). Hera does not move, but looks at Mangal tending to his injuries. \"Well,\"\nShanti continues with a wry smile, \"if you give him up, then he's free game for the rest of\nus!\" She now turns towards Mangal and walks towards him, but approaches him from\nbehind as he is sitting facing away from the women. Shanti flings an arm over one of\nMangal's shoulders from behind and says, \" Come, hero, let me take care of you! I can do\nmore wonders for you in one night than the greatest doctor in the world can do for you in\nyears!\" Laughter erupts from both the other soldiers and the prostitutes, except for Hera.\n\nAnother one of the women crowds in close to Mangal and begins caressing his\nhair, though he tries to shy away. \"No fair, why should you have him?\" she asks, and\npouts. \"I think he would like me better. Isn't that right, brave man?\" As she says this,\nthree other women come close to Mangal and begin clamoring for his attention.\n\nCourtesy of Miriam Huntley. Used with permission.\n\n\"If you ask me,\" the doctor says good naturedly, \"it would take a real hero of a\nman just to handle all you girls bickering over him!\" Everyone laughs. One of the\nsoldiers says,\n\n\"Well, Mangal, it looks like we have left you in good hands!\" He sweeps his\nhand towards the prostitutes. \"One of you fix him up soon so he can come back to us\nhealthy and roaring like a lion again!\" With that, the men leave, two with arms around\neach other's shoulders, all in happy spirits.\n\nThe women still crowd around Mangal, but he has not responded to them yet. He\nis still tending to his wounds on his face.\n\n\"What do you say, hero? Why don't you tell us which one of us you like better?\"\nasks Shanti.\n\n\"Yes, what do you say, hero\" echoes another one of the women next to Mangal.\n\nSuddenly Mangal puts down the sponge and says harshly,\n\n\"Shut up! Go sell your bodies to the Whites!\"\nThere is a short pause of about one and a half seconds before the women begin giggling\nand crowd even closer to Mangal. He pushes them away with his left hand, but then\nbrings the hand back quickly and winces slightly when he realizes it is hurt. Suddenly\nHera takes a firm step toward Mangal from where she is standing. She looks directly at\nMangal and says,\n\n\"We just sell our bodies. You soldiers sell your souls.\" Hera then tosses her\nbraid defiantly, and the jingle of her jewelry is heard. She places a hand on her hip, and\ncontinues to look straight at Mangal.\n\nCourtesy of Miriam Huntley. Used with permission.\n\nImmediately the women become silent, the laughter and smiles gone. All eyes\nturn to Magnal to see his response. One of the women keeps her eyes on Mangal but\nturns her head slightly towards Hera's direction to whisper \"Hera! You have gone too\nfar!\" in a disapproving tone that also sounds like a warning. However, she, too, is\nlooking at Mangal and wondering how he will respond.\n\nMangal's face is set in a frown, but is more determined that upset. He looks right\nback at Hera for a moment, and then begins to stand up. He finds himself having trouble\ndoing so due to his injuries, and the doctor rushes to his side to aid him. \"Forget it,\nMangal. She didn't mean it,\" the doctor says, though with uncertainty. As he says it he\nglances at Hera, still standing strong and defiant. Hera's face and body posture have not\nchanged.\n\nMangal is now standing, never having taken his eyes off of Hera. The doctor is\nstanding to his right, a little behind him, while all the women are to his left, still looking\nat him. Mangal's stance is very rigid; both feet are together, his arms are at his sides,\nand, except for the fact that he holds his left arm up a little bit because of an apparent\ninjury, he looks as if he is in the formal soldier stance.\n\nAfter what seems like an agonizing silence of about five seconds, Mangal finally\nsays, in a clear and strong voice,\n\n\" Fighting for the Company is an honor I never even dreamed of as a child,\" he\nsays. He then speaks a little more loudly, asking \"Do you know where I would be if I\ndid not work as a soldier for the company? Do you?\"\n\nCourtesy of Miriam Huntley. Used with permission.\n\nThe women look a little scared, but Hera only shifts her facial expression a little\nbit with the raise of the eyebrows and a tilt of the chin, to indicate that she is listening.\nThe doctor looks uneasily from Mangal to Hera and back to Mangal again.\n\n\"I'll tell you,\" Mangal continues, still loudly, with eyebrows furrowed and face\nfull of emotion. \"I would be back in my village, working in a clothing factory, from\ndawn to sunset, every day. I would be working side by side with my father, with my\nthree brothers; all of us would be slaving away, and yet still we would barely be able to\nmake enough to live by. I would be living in that miserable way for the rest of my life-\nFOR THE REST OF MY LIFE\", he now shouts, with a thrust of his good right arm. As\nhe shouts, the doctor is startled and jumps a little, and then looks alarmed, while the\nwomen have slightly shocked looks on their faces. Mangal then says, still shouting but\nless so than before, \"With no way out, with no alternative, forced upon a path with no\nchoice but to continue.\"\n\nHera has pursed her lips, still looking determined to get her point across. Mangal\npauses momentarily; he tries to control his passion by taking a deep breath and closing\nhis eyes momentarily. He then continues his speech, this time in a calm and tempered\nmanner.\n\n\"When I was offered the opportunity to join the army, my family was overjoyed.\nThey put all their hopes in me, hopes that I could achieve what they could not, and\nperhaps make for myself a better life than they would ever find. And you know what? I\ndid. Being a soldier for the Company has not only brought me respect but also a\nlivelihood I can be proud of. And I can even send some of the money the Company\n\nCourtesy of Miriam Huntley. Used with permission.\npays me back to my family, so that my father, who is already aging and tired, no longer\nhas to work.\"\n\n\"Now tell me,\" Mangal says, softly and with none of the earlier harshness. He\nbelieves that he has won the argument, and speaks as if he knows that Hera will have to\nagree with him, will have to admit that she was wrong in her accusations. \"Is that still\nselling my soul?\"\n\nThe doctor looks relieved that Mangal's shouting has stopped, and that the\nargument seems to be over. The women have concerned looks on their faces, and nod\nlooks of encouragement to Mangal. But Mangal only looks at Hera, Hera looks down for\na moment, and then looks back up at Mangal with a sad smile.\n\n\"Last night you decided to rescue me from Captain Hewson.,\" Hera begins,\nspeaking just as softly as Mangal had. \"And look at you now- he almost killed you. Can\nyou tell me you are still proud to work for a Company made up of men like him? Men\nwho will take what they want when they want, without any regard to who they are\nhurting?\"\n\n\"Hewson is a dog, \" Mangal replies with a look of pure disgust on his face, \"but\nthe men of the Company are not. Take Captain Gordon- he is a man of honor, of dignity.\nI would trust him with everything I have, with my life!\" He looks at her to see if she will\ncontest this, and when she doesn't, continues, \"Just because there is one man like\nHewson does not mean that all of the British are dogs like him.\"\n\nHera laughs ruefully. \"And who is Gordon?\" she asks, flinging her arms up.\n\"You know better than I that he is nothing in the eyes of the Company, that he can barely\nhold his own among the whites. And he may be a good man, but would you really say\n\nCourtesy of Miriam Huntley. Used with permission.\nthat for the rest of them? Why do you think they are here, why do you think they do what\nthey do? They all want the same things: power and wealth, and they use our land in order\nto achieve these goals. No, Mangal, you know very well that most men are not like\nCaptain Gordon.\"\n\nMangal shakes his head, and says defiantly,\n\n\"I am a proud soldier of the British East India Trading Company!\" He is\nimpassioned, and says fervently, \"The Company brings order to this area, and keeps\npeople from fighting one another. If we as soldiers were not here, can you imagine what\nchaos this place would erupt into? Any Indian with the smallest bit of power would be\nscrabbling to become a king, and as every faction fought the other, the people would\nsuffer in their wake. There would be wars, and it would be the common man who would\npay the price. How can you deny such a fact?\" He looks at Hera, expecting her to agree.\n\n\"They bring order to the area?\" Hera asks, raising her eyebrows. \"Tell me,\" she\nsays. \"Just this week the Company ordered your brigade to kill half a village. We all\nheard about it. AND YOU DID- you killed your own people . If you think-\"\n\nMangal cuts her off, and he is full of emotion again.\n\n\"I was doing my duty! I am a soldier, and I do my duty!\" he shouts.\n\n\"And what if there is another soldier doing his duty in your village back home?\nWhat of your family then?\" Hera asks. \"If the Company can kill innocent people here,\"\nshe gestures with two hands to the ground nearby her, \"then the company can do it there\ntoo,\" now gesturing far away, \"or anywhere, because there are always soldiers like you\nwilling to do your 'duty'\". She is mocking in this last sentence.\n\nMangal looks crestfallen and worried.\n\nCourtesy of Miriam Huntley. Used with permission.\n\nThe doctor suddenly makes a small cough and says,\n\n\"See now Mangal, aren't you glad you saved this one?\" waving a hand to Hera\nand smiling a little, trying to relive the tension. He then gives a forced laugh, and looks\naround hoping the others in the room to join in with him, but everyone is silent. Upon\nseeing that he is unsuccessful, the doctor clears his throat and then says, \"Well, um, girls,\nI think its about time you all left,\" and as he is saying it the women are nodding and on\ntheir way out, with backwards glances at Hera and Mangal, who have not moved. Some\nshake their heads as they leave, and phrases of \"That Hera\", and \"Too strong blooded for\nher own good\" are heard as they go through the door.\n\nThe doctor now looks as if he is trying to figure out how to resolve the conflict;\nhis eyebrows are furrowed, he has his mouth set in a slight, worried frown, and he looks\nback and forth between Mangal and Hera. He looks like he is about to say something,\nbut then Mangal suddenly raises his head and says to Hera,\n\n\"Without the Company, I would be nothing.\" He says it almost in a pleading\nmanner, as if he needs her to agree with him, needs her to tell him that what he has done\nis Ok. But Hera is relentless.\n\n\"No, Mangal, no,\" she replies. \"You have it wrong.\" She steps forward, and they\nare now two feet away from each other. \"Without you, the Company is nothing.\" She\nwaits for the words to sink in, and then continues, \"Without you, without all of those who\nchoose to fight for the English against their own people, the Company would be nothing.\"\nHera now raises her voice, and tosses her braid. \"Where do you think the Company\nderives its strength from? Who provides them with the ability to rule our nation? It is\nyou, and all the other sepoys like you.\"\n\nCourtesy of Miriam Huntley. Used with permission.\n\nMangal meets Hera's eyes and then suddenly looks down to the ground. His\nshoulders are now slumped and his previously rigid posture has all but disappeared.\n\n\"With you and the rest of the sepoys, the Company can rule us forever. We will\nnever even have the chance to find out if we can rule ourselves, because you, Mangal,\nyou,\" she says with emphasis, \"stop us.\"\n\nHera looks expectantly at Mangal, but Mangal Pande looks broken. He does not\nlook up from the floor, and does not respond. Hera sadly shakes her head, gives a sight,\nand continues,\n\n\"So yes, Mangal. In answer to your question-yes. You are selling your soul.\"\nShe stares at Mangal for a few seconds, and then turns and walks in a dignified manner\nout the door.\n\nMangal stares after Hera as she leaves, face grim and with the look of defeat on it.\nEven after she is gone he continues staring at the door.\n\nFinally, the doctor, who has been innocuously staying out of the way of the\nargument, gives a small cough. \"Eh, heh heh...\" he says. \"I think her words are worse\nthan the injuries Hewson gave you!\" he says jokingly. Mangal doesn't respond, but is\nstill staring at the door. Then he slams the wall with his right hand, with what seems like\nall his might, causing a loud noise. The doctor jumps a little and gives off a small\nsqueak. The doctor then mutters to himself \"My nerves. With all the trouble you're\nstarting, soon I'm going to have to see a doctor about my nerves.\"\n\nThe doctor sighs, and walks over to Mangal. As he walks he says, \"All right,\nMangal, all right. Let me at least tend to the wounds I can take care of.\"\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.011 Topics in Indian Popular Culture: Spectacle, Masala, and Genre\nFall 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Villains",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-011-topics-in-indian-popular-culture-spectacle-masala-and-genre-fall-2006/94b527212aed11f24e3e4521ba612713_MIT21G_011F06_villains.pdf",
      "content": "Courtesy of Miriam Huntley. Used with permission.\nMiriam Huntley\n21G.011\n10/11/06\nVillains\nA Comparison of the Antagonists of Omkara and Othello\n\nThe film Omkara, in its adaptation of Shakespeare's Othello, remains true to the\nmajor story line of the play while also changing many aspects to create differences\nbetween the two. One of the ways in which Omkara departs from Othello is through\ndeliberately taking Iago, the evil character in Othello, and transforming him into the more\nhuman, and less villainous, character of Langda.\n\nLangda, in Omkara, is the parallel character of Iago in Othello, and, as far as the\ngeneral plot is concerned, the film creates a close analogy between the two characters.\nLangda is the antagonist of the story, the cause of the tragedy which is the culmination of\nthe film, just as Iago is in Othello. The story is the same: Langda is angered by Omkara's\nchoice of Kesu over himself for general, just as Iago is angered by Othello's choice of\nCassio over himself for lieutenant. Both the characters of Langda and Iago use lies and\ninsinuations, along with the help of a secondary character (either Raju or Roderigo), to\nbring the respective main characters, Omkara or Othello, to maddening suspicion against\ntheir loved ones. Scene for scene, Langda's actions match up well with Iago's, and the\nadaptation, as a whole, is very true to the original.\n\nHowever, there are many small departures Omkara makes from Othello, as any\nsuch adaptation will have. One of the themes of these departures can be seen in the\nfilm's depiction of the antagonist, Langda. Though the actions of Langda match up well\nwith those taken by Iago in Othello, there are still noticeable differences between the two;\nthese differences combine in order to make the antagonist Langda less of a villain than\n\nCourtesy of Miriam Huntley. Used with permission.\nhis counterpart, Iago, in Othello. The film achieves this in two ways. One is by creating\ncertain scenes which allow the audience to sympathize with Langda or at least understand\nhis viewpoint. Another is by removing or muting many of the aspects which show up in\nOthello which portray Iago as a conniving, scheming villain.\n\nThe first way in which the film lessens the evil we see in Langda is by allowing\nthe audience to empathize with Landa's situation. In Othello, there is no sympathy felt\nfor Iago, throughout the play. From the beginning to the end he is seen as a villain, with\nno room to doubt. In Omkara, on the other hand, Langda is a character to which the\naudience has an ability to relate, even though he is seen performing evil actions. This is\nachieved through delving into Langda's motives for revenge, and showing them in a\nmore human light.\n\nIn Othello, the reason why Iago hates Othello is given briefly in the beginning;\nIago tells Roderigo that in response to Iago's requests to become Othello's lieutenant,\nOthello replied, \"'I have already chosen my officer.' And what was he? Forsooth, a great\narithmetician, one Michael Cassio.\" (1.1.17-20). While Iago feels that this was a great\ninjustice done to him, the reader is not necessarily compelled to think the same. In\nOmkara, however, the storyline starts earlier than the time of the first scene of Othello,\nand the film actually shows Omkara's choice of Kesu over Langda, as opposed to only\nreferring back to it in conversation. In this scene, the ritual where Langda is to choose\nhis replacement, Langda, as well as others around him, believes that he will be chosen as\nthe new general. There is a buildup of expectation, at which point Omkara hands Langda\nthe ceremonial plate, and it seems as if he is about to place the beads on Langda,\nsignifying his choice. At the last moment, however, Omkara turns to Kesu and appoints\n\nCourtesy of Miriam Huntley. Used with permission.\nhim as the new general. This choice is unexpected, both by the audience and by Langda,\nand the shot of Langda's fallen face, full of with disappointment and hurt, is meant to be\ndeeply felt by the audience.\n\nThis scene moves the viewer to sympathize with Langda, in a way that Iago's\nsimple explanation of his hate towards Othello does not. The viewer of this scene feels\nas if Langda actually deserved to be appointed (and it indeed seems he would have been\nhad Omkara not thought Kesu would help draw more political votes); the audience senses\nthat that something rightful is stripped from Langda when Kesu is appointed.\n\nAnother way in which the viewer is led to sympathize with Langda arises from\nthe film's depiction of Kesu's character. While Cassio, in Othello, is seen by the\ncharacters other than Iago as an courageous man who is able to fight, Kesu, in the film, is\nportrayed more as a smiling, charming man who does not belong in the place of a fighter.\nCassio seems to have been chosen rightly to be lieutenant, while in Omkara there is\nspecial mention that the reason Kesu is appointed is not for his own merits but rather\nbecause he will draw the college students' votes. There are no additional motivations\ngiven for Cassio's appointment, and no reason supplied to believe Cassio is not worthy to\nbe appointed, with the exception of Iago's complaints about the fact. Kesu seems less\nworthy of the position of general than Cassio seems for that of lietenant.\n\nAn example of this comes after Kesu is appointed general; everyone is celebrating\nin a club, and Langda goads Kesu to drink, just as during the festival in Othello, Iago\npresses Cassio to drink as well. Kesu is then seen partying with the other men and Billo;\nhowever, when Raju smokes next to Kesu after being told not to, the audience sees Kesu\nexplode. He begins beating up on Raju, and fighting him madly. Now, it is true that a\n\nCourtesy of Miriam Huntley. Used with permission.\nparallel scene exists in Othello; however, in Othello, we do not get to see exactly what\nwrong Roderigo has done to Cassio, while in Omkara it is very clear that all that set Kesu\noff was the petty act of Raju smoking near him. In Othello, we know that Roderigo tries\nto incite Cassio, but we do not see Cassio flare up at the actal wrongdoing; we only see\nthe aftereffects. By showing Kesu's overblown reaction to Raju's small offence, instead\nof just referring to it after the fact, Kesu seems less worthy of being general, a position\nthat requires resilience instead of uncontrollable drunkenness, and this in turn makes\nLangda seem more right in his claim.\n\nAgainst this depiction of the charismatic but soft character of Kesu, Langda is\nportrayed as a character who would fit well in the position of general. Langda is very\nmasculine and strong willed, and perhaps only Omkara is seen as a more powerful\ncharacter. The difference between Kesu and Langda is more pronounced in Omkara than\nthe analogous difference between Cassio and Iago in Othello. Thus Langda, against this\nbackdrop, is seen as justified in his claim that Kesu was given the position of general\nwhich was rightfully his own.\n\nThe second method the film uses to create a less villainous antagonist in Langda\ncomes through underplaying Langda's willful plotting against Omkara. In Othello, Iago\nis seen scheming at every turn. In Omkara, though, Langda appears less a catalyst for\nevents and more as someone who takes advantage of the way events play out.\n\nIn Othello, Iago is seen from the beginning planning his revenge on Othello.\nIndeed, in just the first scene Iago says about Othello, \"Though I do hate him as I do\nhell's pains, Yet, for necessity of present life, I must show out a flag and sign of love,\n\nCourtesy of Miriam Huntley. Used with permission.\nwhich is indeed but sign\"(1.1.153-156). In Omkara, on the other hand, Langda does not\ncome off as conspiratorial as Iago. One of the reasons for this is that Omkara begins the\nstory at an earlier point than Othello does. While in Othello Iago is seen from the first\nplanning his revenge, Omkara begins before Omkara chooses Kesu over Langda, and\ntherefore shows Langda before he begins looking to revenge. It is not until later in the\nfilm that Langda decides to take action against Omkara. The scene that reveals this takes\nplace on a bridge, with Langda and Raju talking. Raju taunts Langda about the injustice\ndone to him by Omkara when Kesu was chosen over him; a transformation occurs on\nLangda's face as he realizes that yes, a wrong has been committed against him. It is only\nat this point that Langda appears to decide to do something about what Omkara has done.\n\nThe difference between Langda and Iago is subtle but appreciable. Iago is seen as\na villain who from the start is plotting his revenge against Othello. Langda, on the other\nhand, is a portrayed as a man who, once realizing a wrong that has been committed\nagainst him, decides to take action to avenge himself. While Iago comes off as an\nunreasonably wicked character whose desire for revenge is warped and disproportionate,\nLangda's decision comes as an understandable consequence of a chain of events.\n\nIn addition to depicting the motives of Langda as more reasonable, the film makes\nother small modifications to make Langda seem less of a conniving character than Iago.\nOmkara glosses over the scenes of Othello in which Iago is seen detailing his plans for\nrevenge. For instance, in Othello, the viewer knows that Iago specifically tells his wife to\nsteal Desdemona's handkerchief. Emilia says, \"I am glad I have found this napkin...My\nwayward husband hath a hundred times wooed me to steal it\"(3.3.292-295). In Omkara,\nhowever, there is no indication that Langda asks Indu to steal the ritual wedding belt.\n\nCourtesy of Miriam Huntley. Used with permission.\nIndu, after finding it on her own, wears it for Langda because she wants to; Langda does\nnot plan to have the belt, but upon seeing it realizes its usefulness and takes advantage of\nthe situation. Instead of going out of his way to carefully plan his revenge, as Iago does,\nopportunities which help Langda's cause seem to fortuitously show up, and Langda\nrecognizes them and utilizes them for his revenge.\n\nAnother example where the scheming characteristic of Iago becomes muted in\nLangda comes in the buildup to Cassio's or Kesu's drunken fights. In Othello, an entire\nscene is devoted to Iago telling Roderigo that Desdemona is having an affair with Cassio,\nand explaining to him how to provoke Cassio in order to start a fight. In Omkara, Langda\ndoes not lie to Raju and tell him that Kesu and Dolly feel anything for each other. In\naddition, though it seems as if Langda does direct Raju to provoke Kesu, we do not hear\nwhat he tells him. Thus, in Omkara, the plotting characteristics of Langda are not\nperseverated upon as they are in Othello.\n\nAnother difference between Iago and Langda can be seen in their relationships\nwith Roderigo and Raju, respectively. In Othello, Iago uses Roderigo for his own\npurposes, and is not connected to him in any other way except for use: for money, and as\na pawn to advance his own revenge. About Roderigo, Iago says, \"If this poor trash of\nVenice, whom I trace for his quick hunting, stand the putting on, I'll have our Michael\nCassio on the hip\" (2.1.284-286). In Omkara, though, there is a sense of friendship that\nexists between Langda and Raju before Langda begins planning his revenge. Langda\nseems to care about Raju and the fact that he is so despondent about his loss of Dolly, and\nnot to only be using him for his own purposes. Thus, while Iago exploits Roderigo solely\n\nCourtesy of Miriam Huntley. Used with permission.\nfor his own machinations, Langda, though he certainly also uses Raju, does not base his\nrelationship with Raju entirely on manipulation.\n\nOne of the clearest ways the film highlights the difference between the characters\nof Langda and Iago comes in the very last scene of the film. In Othello, after Desdemona\nis killed and Emilia reveals Iago for who he is, Othello demands of Iago why he has done\nwhat he has done. Iago responds simply, \"Demand me nothing; what you know, you\nknow. From this time forth I never will speak a word\"(5.2.300-301). Afterwards, Iago is\ntight-lipped, and shows no regret for his actions, only a strong will. The parallel scene\nwith Langda and Omkara is similar, except that Langda, though he also vows that he will\nno longer speak, also adds that he no longer knows what is right and what is wrong, that\nhe has confused the two. It is a small, but unmistakable, indication that Langda is\nsuddenly aware of his own wrongdoing and awful actions. It is in this final scene that the\naudience senses an inkling of regret from Langda, who has been caught up in actions he\nonly now sees as evil. This is a clear departure from the cut-and-dry villainous character\nthat Iago represents.\n\nAfter watching the film, there is no question that the antagonist of the story is\nLangda, just as Iago is in Othello. However, with its subtle departures from the play,\nOmkara is able to create a character in Langda that is much more complex than Iago's.\nLangda is not the unambiguous (and rather artificial) villain that Iago is, but rather a\ncharacter with depth and complexity. Thus, with the changes Omkara makes to present\nLangda in a different light than Iago is shown in in Othello, the story becomes more\nrealistic and transforms itself into account that is at once more meaningful and rich.\n\nCourtesy of Miriam Huntley. Used with permission.\n\nbut ratherHowever, Omkara succeeds in transforming the character of Iago into the more\ncomplex character of Langda, who is not entirely evil. Small but meaningful changes\ncreate a___ which leads to a more true to life and meaningful story.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.011 Topics in Indian Popular Culture: Spectacle, Masala, and Genre\nFall 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}