{
  "course_name": "Topics in Experimental Biology",
  "course_description": "This independent experimental study course is designed to allow students with a strong interest in independent research to fulfill the project laboratory requirement for the Biology Department Program in the context of a research laboratory at MIT. The research should be a continuation of a previous project under the direction of a member of the Biology Department faculty.\nThis course provides instruction and practice in written and oral communication. Journal club discussions are used to help students evaluate and write scientific papers.",
  "topics": [
    "Science",
    "Biology",
    "Science",
    "Biology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 2 hours / session\n\nCourse Outline\n\n7.18 is for students who carry out independent research as part of MIT's UROP program to fulfill the Biology Department Project Lab requirement. UROP is MIT's\nUndergraduate Research Opportunities Program\n. Although research is carried out in different labs, the regular meetings in class will provide the same educational opportunities and training as those offered by the Project Labs. The goals of this course are to learn the following:\n\nhow to present research, both orally and in writing\n\nthe mechanics of writing papers and abstracts\n\nhow to read and critique papers\n\nhow to analyze and critique research\n\nThese sessions will provide an opportunity to\n\ncommunicate your findings to your peers,\n\nreceive help and constructive criticism of your work, and\n\ncritique others' work.\n\nA significant component of 7.18 will be the\nwriting tutorial\n, which will provide both general and specific training in writing a scientific report.\n\nPrerequisites and Requirements\n\n7.18 has the same prerequisites (7.02 - Experimental Biology and Communication, 7.03 - Genetics, 7.05 -Biochemistry) and the same number of units (24) as the three project labs (7.13, 7.16, 7.17) offered by the Biology Department. The written assignments for 7.18 will be the same as for other project labs and will include a 15-page research report.\n\nStudents should only enroll in 7.18 if they plan to complete a paper on their research by the last day of class in the semester they are enrolled. A student who is planning to work in a lab for several semesters before writing a paper should plan to enroll in 7.URG. A minimum of a one semester enrollment in 7.URG (or full time work over the summer) in the proposed laboratory is required before a student is eligible to enroll in 7.18. While enrolled in 7.18, students should plan that the number of hours they are working in the lab are sufficient for progress of their project to completion.\nIt is recommended that students are in lab 16-20 hours a week\n.\n\nOral Presentations and Journal Paper Discussions\n\nAt the beginning of the semester, every student will give a 5-min/3-slide presentation of his/her research project, using lay language and focusing on overall objectives (big picture).\n\nDuring the second class period, every student will submit four primary scientific papers directly relevant to his/her research project. Some of the papers will be chosen for in-class discussion. The student whose paper is chosen will lead the paper discussion. He or she will meet with the instructors in advance to go over the paper. The rest of the students, i.e., those who do not lead the paper discussion, will need to write a one-page summary of the paper.\n\nThe summary (2 copies) will be collected and evaluated for scientific content and writing. The papers that are discussed in class will provide materials for writing tutorial.\n\nFor the remainder of the semester, the class will meet to discuss specific research projects and their progress. Students will present their research projects, results, and problems. The class as a whole will critique the project and troubleshoot problems. Every student is expected to give two presentations on his or her research project. The presentation will form the basis for the final 15-page research report due at the end of the semester.\n\nTwo\nhard copies of all assignments must be submitted to the instructors.\n\nFinal Paper and Supporting Documents\n\nOne goal of the course is that you write a research article, following\nstandard IMRAD format\n(Introduction, Material and Methods, Results, and Discussion). Each section will first be submitted separately. (Figures will be submitted with the Results section.) You will receive comments for revision from your instructors and a peer reviewer. The complete draft is a revision and joining together of the individual sections. The final paper is a second draft.\n\nSome of you may not have enough results to write up a paper. In this case, you may, instead, work on a grant proposal. Please speak to the instructors.\n\nYou will be asked to assemble a cumulative file of documents as an underpinning for your research article. Some of the documents you need to collect; others you will write.\n\nInstructions to authors\n\nChoose a likely journal to which you might submit your final paper (e.g., Cell). Photocopy or print out Instructions to Authors and highlight anything of interest to you.\n\nSummaries\n\nWe will read and discuss several \"model\" articles in class. For each, unless you are the person presenting the article, please submit a one-page summary as described.\n\nAnnotated bibliography\n\nWrite two or three sentences describing each of about ten articles that will be included in your final bibliography. Consider how the article applies to your own work.\n\nFigure critique\n\nAnalyze the figures from one of the model papers. Interpret and evaluate the figures.\n\nGlossary\n\nList alphabetically, and define, about ten terms you are using in your paper with which your readers may be unfamiliar.\n\nNonscientific abstract\n\nWrite a one-page abstract of your paper addressed to a general audience.\n\nSupporting documents will include an \"Instructions to Authors\" sheet from a selected journal, your journal article summaries, an annotated bibliography, a figure critique, glossary, and a nonscientific abstract.\n\nGrades\n\nACTIVITIES\n\nPERCENTAGES\n\nNOTES\n\nClass Participation\n\n20%\n\nThree presentations and participation in the class discussion.\n\nWriting Assignments\n\n10%\n\nAll writing assignments, including paper summaries.\n\nResearch Report\n\n70%\n\n35% of the grade will be based on the faculty mentor's evaluation of lab performance, research progress, and quality of the written report; 35% will be based on the course instructor's evaluation of the final 15-page research report. The research report is due by the end of the semester.",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "lecture_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-18-topics-in-experimental-biology-fall-2005/a47a8a3ecfd189edeb35ad47bd601ff1_lecture_1.pdf",
      "content": "7.18 Day 1 Agenda\n- sorting students into sections\n- description of research projects\n- logic of a paragraph\n- five sentence paragraph\n\n7.18 fall term sections\n1. requirements for 7.18\nprior UROP in same lab\nfaculty mentor commitment\n2. TuTh 1-3pm Prof. A. Sinskey, Dr. K.\nPepper\nTuTh 2-4pm Prof. P. Matsudaira, Dr.\nL. Roldan\n3. identical syllabus\n\nResearch Project description\n- name, lab, title of project\n- what's the biological question\n- how are you answering the question\n\nLogic of a Paragraph\n- tells a story-beginning, middle, and\nend\n- first sentence introduces the topic of\nthe paragraph\n- middle sentences builds the story\n- last sentence reaches a conclusion or\npoint\n- all sentences are linked together\n- first and last sentences link to\nprevious and next paragraphs\n\nIn-class Five Sentence Paragraph\n- figure 1 image or figure 2 gel\n- describe the data\n- make up the names for abbreviations\n- 15 minute time limit\n- hand in hard copy, review Gopen and\nSwann, submit revised paragraph by\ntuesday."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-18-topics-in-experimental-biology-fall-2005/109e47a393e3629df4c6ac4e253637d2_lecture_2.pdf",
      "content": "7.18 Day 2 Agenda\n- revised syllabus\n- paragraph revision\n- logic of a research paper\n- organization of a research proposal\n- how to present data in a lab talk\n\nParagraph revision\ncritique:\nwhat is the main topic\ndoes the logic flow progressively\nwhat is the conclusion or punchline\nis the data interpreted correctly\ncomment about word choice, sentence structure,\ngrammar\n\nLogic of a research paper or\nproposal\nwhat's the question\nwhat did you do\nwhat did you see\nwhat do you think\nwhat are your specific aims\nwhat is the big question and its\nsignificance\nwhat do you want to do\njustify its significance\nhow will it answer the question\nis there preliminary results to\njustify the plan\n\nHow to present data in a lab talk\ntell a story\nintroduce the topic and specific problem\nstructure, diagram, or model\ndescribe the method to solve the problem\ndetails of the methodology\nwhat are the main results\nshow the raw data and processed data\nwhat is the interpretation and hypothesis\nall figures, diagrams should be in black and\nwhite, NO COLOR\nprint out copies of your ppt presentation and\ndistribute to class\nemail presentation to the instructors 2 days in\nadvance for their comments\n\nGuidelines for slides\nwhite background\nblack and white text, charts, diagrams\nimages imported from jpeg or tiff files\n(not GIF)\nproper attribution of sources\nmaximum ten slides\n20 minute talk (time your talk)\nemail slides by monday morning"
    },
    {
      "category": "Lecture Notes",
      "title": "fal05lec21_dipo.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-18-topics-in-experimental-biology-fall-2005/9177f961a8dd22ecf6606d617c66269c_fal05lec21_dipo.pdf",
      "content": "7.18 Day 21 Agenda\n- Discussion section\n- Polishing your writing\n\nElements of a Discussion\nSection\n- Summarize findings presented in the Results section.\n- State what you expected to find and why.\n- Compare your findings with those of previous reports. Cite\nthe literature!\n- Explain (un)expected results: deduce and hypothesize.\n- Point out shortcomings of your work and define unsettled\npoints.\n- Discuss theoretical and practical implications of your work.\n- End with a short summary or conclusion about the work's\nimportance.\nThe Discussion tells a story - or makes an argument - that\nrelates to the \"big picture\" issues mentioned in your Introduction.\n\nExample Discussion section from following article removed due to\ncopyright reasons. Please see\nZeng, et al. The EMBO Journal 24 (2005): 138-148.\n1st paragraph: restates context & justification of work.\n2nd paragraph: summary of conclusions; comparison to background\n3rd paragraph: unexpected result & implications\n4th paragraph: explanation of unexpected result\n\nExample Discussion section from following article removed due to\ncopyright reasons. Please see\nZeng, et al. The EMBO Journal 24 (2005): 138-148.\n5th paragraph: consistency of unexpected result with previous research\n6th paragraph: explanation of other results; comparison with previous research\n\nExample Discussion section from following article removed due to\ncopyright reasons. Please see\nZeng, et al. The EMBO Journal 24 (2005): 138-148.\n7th paragraph: Model, hypothesis\n8th paragraph: conclusion, summary, and future directions.\n\n- Topic sentences outline the development of your\nargument\n- Topic sentence should reflect topic of the\nparagraph\n- Smooth your transitions\n- Be concise\nPolishing your Writing\n\nUse active voice\nWe demonstrate a technique whereby the proteins of an entire\ncellular lysate may be separated on a gel, and subsequently...\nThe effects indicated several important results. Such results\nwere a decrease in size when...\n\nDon't end with a preposition\nThe results should indicate which subtype, if any, the...oligomers\nhave the most affinity for.\nDuring increasing PCR cycles, each DNA segment will have an\nincreasing number of overlapping partners that it can possibly\nanneal with in a cycle.\n\nAvoid colloquialisms\n... a clean band on the one hour slide, and a blob of fluorescence\non the overnight slide.\n... we will be able to manipulate the nanoparticles to our liking\nand possibly set up qualitative trends.\n\nAvoid jargon\n...we PCR added a sequence of 57bp to the C-\nterminus...\n... as well as PCRing up certain DNA fragments\nusing labeled primers.\nThree labeled proteins...were run on a 15%\nSDS-PAGE gel with a 3% stacking gel, and then\nsubsequently...\n\nUpcoming assignments\nDue Tuesday, 29 November:\n- Submit first draft of research paper or grant proposal.\n- Group meeting (optional): Dress rehearsal or Latest results.\nTuesday, 1 December until Thursday, 8 December:\n- Final lab presentations.\nDue Tuesday, 13 December:\n- Submit final draft of research paper or grant proposal.\n- Class party."
    },
    {
      "category": "Resource",
      "title": "fall05abstra_lar.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-18-topics-in-experimental-biology-fall-2005/a19af18a06a8f19ffde1c329f0ccca12_fall05abstra_lar.pdf",
      "content": "7.18 Day 19 Agenda\n- abstract: scientific & non-scientific\n\nAbstract\nScientific abstract:\n- Summarizes paper\n- Gives main results & conclusion\n- Written concisely & precisely\nNon-scientific abstract:\n- For the lay person, e.g. your mom\n- Gives background, motivation for the study\n- Ends with the goal or main finding of the study\nScientific abstract: details given in the paper\n- does not give too many details\n- Can be written in 4-5 sentences\nNon-scientific abstract:\n- written for someone who doesn't understand the problem.\n- Therefore, explain context before the experiment\n- For example, New York Times or New Scientist\n\nExample Abstract section from following article removed\ndue to copyright reasons. Please see\nLin, H, et al. \"Amyloid β protein forms ion channels:\nimplications for Alzheimer's disease pathophysiology.\" FASEB J\n15 (2001): 2433.\n\n5-sentence scientific abstract\nAmyloid β protein (AβP) is the major constituent of senile plaques associated with\nAlzheimer's disease (AD), but its mechanistic role in AD pathogenesis is poorly\nunderstood. Using atomic force microscopy and electrical recording, we show that\nmonomeric AβP1-42 forms multimeric channel-like structures after incorporation into a\nplanar lipid bilayer. At the cellular level, AβP1-42 allows calcium uptake and induces\nneuronal degeneration and death in a dose-and time-dependent fashion. These effects\nare prevented by zinc (an AβP channel blocker) and by the removal of extracellular\ncalcium, but are not prevented by antagonists of putative AβP cell surface receptors.\nThus, AβP channels may provide a direct pathway for calcium-dependent AβP toxicity\nin AD.\n\nExample Abstract section from following article removed\ndue to copyright reasons. Please see\nTakyar, S., R. P. Hickerson, and H. F. Noller. \"mRNA helicase\nactivity of the ribosome.\" Cell 120 (2005): 49-58.\n\nNon-scientific abstract\nThe genetic information of a cell is stored in DNA, but much of the information\nprocessing of a cell is carried out by DNA's chemical cousin, RNA. Like a tape, RNA\ncopies the information in DNA and uses it to direct the synthesis of proteins. The\nprocess of converting the information of RNA to a protein is called translation, and is\nperformed by a molecule called a ribosome. Translation can slow down when RNA\nsticks to itself like a zipper. In this study, scientists find that the ribosome itself unzips\nthe RNA as it translates the RNA.\n\nGroup exercise:\nWriting a non-scientific abstract\nExample Abstract section from following article removed\ndue to copyright reasons. Please see\nChatelain, F, et al. \"The Pore Helix Dipole Has a Minor\nRole in Inward Rectifier Channel Function.\" Neuron 47\n(2005): 833-843.\n\nUpcoming assignments\nDue Thursday, 17 November:\n- Submit scientific and non-scientific abstracts of your work.\n- Submit critiques of Erica's & Jennifer's journal club articles.\nDue Tuesday, 22 November:\n- Submit peer review of scientific & non-scientific abstracts. Peer is the\nperson listed BEFORE you on roster.\n- Leslie: Polishing your writing.\n- Paul: Journal Club from 7 Nov 2005 issue of Journal of Cell Biology.\nChoose a number from 437-568. NO critiques necessary.\nDue Tuesday, 29 November:\n- Submit first draft of research paper or grant proposal.\n- Group meeting (optional): Dress rehearsal or Latest results."
    },
    {
      "category": "Lecture Notes",
      "title": "fall05lectu7_lar.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-18-topics-in-experimental-biology-fall-2005/dc0046852d7c1dc1fd69e512a0c71921_fall05lectu7_lar.pdf",
      "content": "7.18 Day 7 Agenda\n- introduction/background and significance\n\nIntroduction/Background & Significance\n- provides context, focus, and justification of the project\n- gives critical background information of the main\nelements of the project (e.g., disease, genes, protein)\nfor the non-expert reader\n- concisely reviews and stresses importance of past\nprimary research papers most relevant to the project\n- highlights deficiencies in current knowledge or\nunderstanding\n- shows how references provide intellectual foundation\nof the project\n- tell a story: start with the general area and questions,\nthen narrow to the topic area\n\nExample of an Introduction\nText of example introduction removed. Please see the Introduction\nfor the following paper:\nChatelain, F. C., N. Alagem, Q. Xu, R. Pancaroglu, E. Reuveny, and\nD. L. Minor, Jr. \"The pore helix dipole has a minor role in inward\nrectifier channel function.\" Neuron 47, no. 6 (Sep 15, 2005): 833-43.\n- This introduction provides background information about the state of knowledge about\npotassium channels, ion selectivity, role of pore helix in ion selectivity.\n- Introduction does a nice job of going from the general to the specific, in about 2 double-spaced\npages:\nFirst paragraph: ion channels, role in electrical signaling\nSecond paragraph: potassium channels, ion selectivity\nThird paragraph: pore helix\n- The introduction also shows how references provide an intellectual foundation for their\nexperiments.\n\nBackground and Significance\nBriefly sketch the background leading to the present application, critically\nevaluate existing knowledge, and specifically identify the gaps that the\nproject is intended to fill. State concisely the importance and health\nrelevance of the research described in this application by relating the\nspecific aims to the broad, long-term objectives. If the aims of the\napplication are achieved, state how scientific knowledge or clinical\npractice will be advanced. Describe the effect of these studies on the\nconcepts, methods, technologies, treatments, services or preventative\ninterventions that drive this field. Two to three pages are recommended.\nhttp://grants2.nih.gov/grants/funding/phs398/instructions2/phs398instructi\nons.htm\n-These are the instructions taken directly from PHS 398: Public Health\nService Grant Application.\n-The Office of Extramural Research (OER) is the focal point for NIH\nmedical and behavioral research grant policies, guidelines and funding\nopportunities.\n\nAn example of Background & Significance\nOur primary goal is to understand how the cell stores and uses energy by twisting and untwisting an actin filament. Using a combination of\nstructural, biochemical, biophysical, and molecular biology approaches, we will continue our structural and biochemical studies on the\nacrosomal process of Limulus sperm and the energetics of the reaction. As background, this section will describe a poorly understood class\nof cellular engines, molecular springs, and then discuss how actin filaments power the extension of the Limulus sperm acrosome using a\nspring-type of mechanism.\nMolecular Springs Among the types of cellular engines, molecular motors and ratchets are the best understood (17). Molecular motors\ninclude the cytoskeletal proteins: myosin, kinesin, and dynein and the membrane rotary motors such as the bacterial flagella rotor (4,39).\nLinear and rotary motors convert the energy derived from ATP or a membrane potential into movementムeither a stepping along a filament\nor ATPase subunits. In the absence of an external energy source, there is no motion. Polymerization also performs work by pushing a\nmembrane forward. According to the Brownian ratchet model, thermal energy causes a filament to fluctuate, permitting addition of a\nsubunit to the end (35). The mass of unpolymerized subunits drives the reaction like the imbalance of ions forms a membrane potential\n(13).\nSpring-like properties of individual proteins play widely diverse roles in proteins. A spring-loaded mechanism involving the formation\nof a coiled-coil segment may be responsible for positioning fusion peptides at the membrane (6). A major contribution to the elastic force in\nmuscle is thought to be due to the spring-like titin molecule. Optical tweezer and AFM measurements show that titin extensibility arises\nfrom modular domains which unfold at moderate to high (20-300 pN) forces (21,38). In this case, the resting sarcomere length is restored\nby titin after contraction.\nWhile individual proteins maybe elastic, they do not generate large movements like a crawling cell. However, the fastest and most\npowerful movements are caused by supramolecular springs made of bundles of a protein polymer. For example, the contractile stalk of\nVorticella contracts several mm in several msec when the cell body is agitated (19). On a power-to-weight basis, the contractile stalk is\nten-fold more efficient an engine than a gas-powered automobile engine and an ATP-fueled muscle and two orders-of-magnitude more\nefficient than the polymerization-drive Thyone acrosome reaction (17). In contrast to other types of molecular motors, contraction occur in\nthe absence of nucleotide hydrolysis because glycerinated cells contract when exogenous calcium is added. Calcium binds a calmodulin-like\ncentrin-homolog, spasmin, and the expanded lattice of filaments contract. Although the major protein in the stalk, spasmin does not form\nfilaments and the identity of the filament protein is undetermined (20). Although a component of contractile fibers associated with the oral\napparatus of protozoa and positioning the nucleus (40), centrin, like spasmin, has not been shown to polymerize. However, centrin is\nimplicated in centriole reproduction (23).\n- Example is from Professor Paul Matsudaira's NIH grant.\n(NIH grant proposal. Courtesy of P. Matsudaira. Used with permission.)\n- Introduces the concept that elastic energy is used to cause motion.\n- The three sections discuss the acrosome reaction which is the cellular event that we study, the structure of\nthe actin bundle, and the structure of the scruin protein.\n- The significance is that the project seeks to answer unsolved mechanisms of motility, describes a novel\nclass of cellular engines, and generalizes the study to biological springs.\n\nAssignments\nDue Tuesday, 4 Oct:\n- Preliminary figures and tables\n- Critiques of Journal Club papers (Lincoln, Tiffany)\nDue Thursday, 6 Oct:\n- 2-page introduction/background & significance\n- full citation (author, year) & references\n- Annotated references: 20+ references, with a sentence or\ntwo highlighting the importance of the paper to the field"
    },
    {
      "category": "Lecture Notes",
      "title": "fall05lecture6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-18-topics-in-experimental-biology-fall-2005/931b881838a1deade0063594aa5d7eb8_fall05lecture6.pdf",
      "content": "7.18 Day 6 Agenda\n- Project outline\n- Journal club\n- Student presentations\n\n7.18 Project Outline\n- Introductory paragraph: an abstract of your project\n- Context and justification\n- Hypothesis or overall goal\n- Outline\n- Main headings (at least 3): Subgoals of your project,\ne.g. identification/analysis of a gene, establishment of\nan essay\n- Subheadings: Experiments performed to accomplish\ngoals\n\nAn example\nThe bacteriophage Mu is unique among transposons\nbecause it performs not one but two types of transposition\nreactions during its life cycle. Nonreplicative transposition\nallows the initial insertion of the mu genome into the host\nchromosome; replicative transposition enables Mu to make\nmany copies of itself during lytic growth. While the\nmechanism of replicative transposition has been well\ncharacterized for phage Mu, comparatively little is known\nabout the molecular events of nonreplicative transposition.\nThe following approaches will be used to understand how Mu\ntransposes nonreplicatively at the time of infection:\nA.Isolation and characterization of the DNA\nintermediates during infection.\nB.Establishment of an in vitro assay for nonreplicative\ntransposition.\nC.Determination of the role of MuN in transposition\n\nJournal Club\n10 minute presentation on the article:\n- brief introduction to the topic\n- statement of the goal of the authors, and method(s)\nthey use\n- analysis and critique of the key figures in the\npaper, e.g. not all the figures\n- conclusion and future directions of the work\n- questions to lead 30 minute discussion on paper\n\nArticle critique\nOne-page critique (~500 words) for EACH paper:\n- A brief summary of the field when the\nexperiments were conducted.\n- One or two sentences describing the major\nfindings of the paper\n- Assessment of whether the experimental methods\nused were appropriate.\n- Assessment of whether the data presented support\nthe conclusions drawn.\n- Proposal of experiments for improving the study\nand/or for further studies."
    },
    {
      "category": "Resource",
      "title": "fall05mm_lar.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-18-topics-in-experimental-biology-fall-2005/76f8381ac77dfa2acb16a8e737b4909a_fall05mm_lar.pdf",
      "content": "7.18 Day 16 Agenda\n- materials and methods\n\nMaterials & Methods\n- Enough detail for interpretation or replication\n- Cite and provide context for previously published methods.\n- Detail new methods and modifications of previous methods: final\nvolume, components in standard units, temperature, time.\n- Do not provide a protocol.\n- Structure\n- In general, only one level of exposition, e.g. no sub-subheadings.\n- Describe methods in logical order, not the order in which you\nperformed experiments.\n- Reagents/equipment\n- Explain concepts of kits and other reagents, unfamiliar equipment.\n- Cite source, but city unnecessary.\n- Language\n- Write in the past tense and passive voice.\n- Watch your grammar, e.g. \"After scraping the desired plate in four\nswipes, the bacteria were placed in 8 ml of media with no antibodies.\"\n- Details: final volume, components in standard units, temperature, time.\n- Kits: Avoid referencing, but if you must, then explain the concept of the kit.\n\nOocyte Transfers and Embryo Injections\nExample Materials and Methods section from following\narticle removed due to copyright reasons. Please see\nAmaya et al. Cell, 66 (July 26, 1991): 257-270.\n- Sub-subheadings unnecessary.\n\n2.1. Materials\n2.2. Preparation of nanoparticles\nExample Materials and Methods section from following\narticle removed due to copyright reasons. Please see\nWin, & Feng. Biomaterials 26 (2005): 2713-2722.\n- Materials should be incorporated.\n- No need to mention city of company: there are catalogs.\n- No need to mention water.\n- Modified protocol mentioned, but not cited.\n\nSouthern blot analysis\nExample Materials and Methods section from following\narticle removed due to copyright reasons. Please see\nEllis, et al. Human Molecular Genetics 14, no. 18 (2005): 2705-\n2715.\n- No need to mention experimental variables in first sentence.\n- Reference for genomic DNA prep, Church buffer?\n- Washes in incomplete sentence; number not specified.\n\nElectrophysiology\nExample Materials and Methods section from following\narticle removed due to copyright reasons. Please see\nChatelain, et al. Neuron 47, no. 6 (2005): 833-843.\n- Explain concept of kit.\n- Note use of citation\n- Can give range of variables.\n\nProteins and In Vitro Substrates\nExample Materials and Methods section from following\narticle removed due to copyright reasons. Please see\nVal, et al. Molecular Cell 19, no. 4 (2005):559-566.\n- Unclear sentence in middle.\n- pET vector not specified. Unclear antecedent in next sentence.\n\nNext week's assignments\nDue Tuesday, 8 November:\n- Submit 2-page Methods & Materials\n- Group meetings\nDue Thursday, 10 November:\n- Submit critique of selected student's journal club\narticle\n- Journal club"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-18-topics-in-experimental-biology-fall-2005/b35b320034a7a15151fce8437b60f2e3_lecture_5.pdf",
      "content": "Creating figures for papers and talks\nwhat is the data\nnumbers\npictures\ntext\nstatic vs dynamic\nwhat is the main point\nhow to render the data\ngraphs and charts\nmicrographs and photographs\ndiagrams\ntables\n\nFeatures of a figure\naesthetics\nbalance, symmetry of content\nblack, gray, white\nfilled and open circles\nsolid, dashed, and dotted lines"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-18-topics-in-experimental-biology-fall-2005/e9cb816ccecb047a82578de70b4ef7a2_lecture_9.pdf",
      "content": "7.18 Day 9 Experimental Plan\nwhat are the goals\nhow will the goals be achieved\nquestions\napproaches\npotential pitfalls and solutions\nwhat are the deliverables\nidentify the new information, reagents,\ntechniques\nwhat are the key milestones\na timeline of the plan"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_12.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-18-topics-in-experimental-biology-fall-2005/c81b6d42cec8082ce5eb2364e4b585ac_lecture_12.pdf",
      "content": "7.18 Day 12 Agenda\nDiscussion Section\nConduct in the lab\nSafe lab practices\nradioactivity\ntoxic chemicals\nbiologics\nEthical standards in science\nCase Study\nconfidence, freedom to communicate\npriviledged information, proper\nattribution of\nwork\n\nDiscussion Section\nPurpose: Interpretation of the data\nThe story relates the data to the\nintroduction\nIdentify key pieces of data\nDiscuss the significance (new finding,\ncrucial step in protocol, alternative\ninterpretation, etc.,)\nRelate data to a model, hypothesis\nWhat is missing, what is next?\n\nLab Safety\nEnvironment, Health, and Safety Office (EHS)\nhttp://web.mit.edu/environment/ehs\nradioactive safety MIT RPO\nlaser safety\nMIT RPO\nchemical safety\nMIT EHS\nhttp://web.mit.edu/environment/ehs/chemical_safety.html\nbiosafety guidelinesMIT\nhttp://www4.od.nih.gov/oba/rac/guidelines/guidelines.html\nanimal safety\nCAC\nclean bench, protective safeguards (clothing,\ngoggles and gloves, monitors, limits, swipes,\nstorage and disposal, and record keeping)\n\nLab conduct\nFreedom to communicate\nconfidentiality and privileged\ninformation\nconflict of interest\nConfidence in information\nlab notebook and record keeping\nstandards for accuracy and\nreproducibility\nmanipulating and reporting data\nProper attribution of work\nauthorship and order of authorship\nsources of funding\n\nCase Study: Collaborative research and authorship\nBill Williams has constructed a plasmid that allows carefully regulated\nexpression of genes inserted into it. He has not found the plasmid useful in\nhis own work but has discussed it with his colleague Harry Douglas at a\nmeeting. Harry thinks he can put the plasmid to good use and asks Bill if\nhe can try it. Bill is receptive to this and sends the plasmid to Harry. Harry\nand his coworkers proceed to use the plasmid to create several novel\nconstructs that provide considerable insight into the function of two\npreviously ill-studied genes. The impact of these studies is great, and\nHarry and his coworkers write a manuscript for submission to a\nprestigious journal. In the final stages of writing, Harry calls his group\ntogether and asks how they feel about including Bill Williams on the\nauthor byline. What would you say?\n\nLab relationships\nfaculty mentorship\nlab collegiality\nconflict resolution\nharassment\nmisconduct"
    }
  ]
}