{
  "course_name": "Traditions in American Concert Dance: Gender and Autobiography",
  "course_description": "This course explores the forms, contents, and context of world traditions in dance that played a crucial role in shaping American concert dance. For example, we will identify dances from an African American vernacular tradition that were transferred from the social space to the concert stage. We will explore the artistic lives of such American dance artists as Katherine Dunham, Pearl Primus, and Alvin Ailey along with Isadora Duncan, Martha Graham, George Balanchine, and Merce Cunningham as American dance innovators. Of particular importance to our investigation will be the construction of gender and autobiography that lie at the heart of concert dance practice, and the ways in which these qualities have been choreographed by American artists.",
  "topics": [
    "Fine Arts",
    "Performance Arts",
    "Dance",
    "Social Science",
    "Anthropology",
    "Ethnography",
    "Society",
    "African American Studies",
    "Gender Studies",
    "Women's Studies",
    "Fine Arts",
    "Performance Arts",
    "Dance",
    "Social Science",
    "Anthropology",
    "Ethnography",
    "Society",
    "African American Studies",
    "Gender Studies",
    "Women's Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nGeneral Course Description\n\nThis course explores the forms, contents, and context of world traditions in dance that played a crucial role in shaping American concert dance. For example, we will identify dances from an African American vernacular tradition that were transferred from the social space to the concert stage. We will explore the artistic lives of such American dance artists as Katherine Dunham, Pearl Primus, and Alvin Ailey along with Isadora Duncan, Martha Graham, George Balanchine, and Merce Cunningham as American dance innovators. Of particular importance to our investigation will be the construction of gender and autobiography that lie at the heart of concert dance practice, and the ways in which these qualities have been choreographed by American artists.\n\nWe will first look at the roots of classical ballet and its American presence via visiting ballerinas such as Fanny Essler and Marie Taglioni. From this we will trace a rise in performance venues; the Puritan resistance to dance as 'immoral;' and the breaking of tradition which allowed Isadora Duncan, Loie Fuller, and Ruth St. Denis to create a space for concert dance that was not ballet. We will unearth the streak of feminist independence which is at the root of modern dance practice. Martha Graham, Katherine Dunham, Pearl Primus, Agnes de Mille fit directly into this lineage as first-generation modern dance artists. Class lectures and discussions will analyze works created by these artists, taking into consideration a variety of historical and political contexts which gave rise to their inventions. Frequent viewing assignments will help students identify visual, musical, and kinesthetic underpinnings of choreographic structure.\n\nThe requirements for this subject conform to the mechanical requirements for all HASS-D's and CI-H: There will be no fewer than three writing assignments that will add up to a minimum of 20 pages; one of these papers will be rewritten; and no less than one hour per week will be devoted to discussion.\n\nReadings and Materials\n\nThe required course texts are:\n\nJonas, Gerald.\nDancing\n. New York, NY: Harry Abrams, 1998. ISBN: 9780810927919.\n\nNeedham, Maureen.\nI See America Dancing: Selected Readings, 1685-2000\n. Urbana, IL: University of Illinois Press, 2002. ISBN: 9780252026935.\n\nRequired Performances on the MIT Campus\n\nBrenda Dixon Gottschild and Helmut Gottschild, \"Tongue, Smell, Color\", Broad Institute Auditorium.\n\nAmanda Loulaki \"Delerium, or, That Taste in My Mouth\", Kresge Little Theater.\n\nRequired Performance Off Campus\n\nAttendance at one concert dance performance off campus, to be determined. Possible performances to include:\n\nAlvin Ailey American Dance Theater, Wang Center.\n\nBill T. Jones/Arnie Zane Dance Company, \"Chapel/Chapter\", Institute for Contemporary Art.\n\nClass Requirements\n\nApproximately 50 pages of reading and 2 hour of viewing weekly. Participation in class discussions will account for 5% of the final grade.\n\nWe will attend at least two performances of dance concerts in the Boston area or on the MIT campus. Each student will submit a 2 page response to each of these performances. Each response will be worth 2.5% of the final grade.\n\nThree short papers, of 7-10 pages length, on the topics described below in response to a video viewing of American concert work to be determined by the instructor. All viewing assignments will be available at the Music Library, some will be available in our private course locker. Short papers account for 75% of the final grade (25% each):\n\nPaper One - Religion and Social Order\n\nPaper Two - Cultural Mores\n\nPaper Three - Gender and Individual Identity\n\nRewrite assignment. One of the short papers will be revised and resubmitted.\n\nA Web-research assignment leading to an oral presentation, defining a work of American concert dance as classical art. The oral presentation assignment will account for 15% of the final grade.\n\nCourse Organization:\n\nThe course will be divided into seven major units, as follows:\n\nUnit 1 -- Introduction and overview (2 sessions)\n\nUnit 2 -- Dance as an expression of religious worship (3 sessions)\n\nUnit 3 -- Dance as an expression of social order and power (4 sessions)\n\nUnit 4 -- Dance as an expression of cultural mores (4 sessions)\n\nUnit 5 -- Dance as the autobiographical creation of individual artists (4 sessions)\n\nUnit 6 -- Dance as a classical art (5 sessions)\n\nUnit 7 -- Dance as an emblem of cultural identity and fusion (3 sessions)\n\nWrap-up and review (1 session)\n\nNote from the Writing Center\n\nThe Writing and Communication Center offers you free professional advice from published writers about oral presentations and about all types of academic, creative, and professional writing. To schedule an appointment, go to\nMIT Online Writing and Communication Center\nand click on the yellow sunburst. If you cannot find an open appointment slot, do not despair. There are always cancellations on the day of the appointment (sometimes as many as 15 cancellations in one day). Click on the Wait List (the blue strip that says \"Is the time that you want already reserved?\"). Whenever a cancellation occurs on that day, you will be automatically notified by email. Because several people might receive that same message, go online ASAP to schedule that open spot; 96% of clients who want an appointment end up with one if they use the Wait List. If you can't find an appointment, you try dropping in or try the\nOnline Tutor\n.",
  "files": [
    {
      "category": "Resource",
      "title": "BALANCHINE BALLET ORAL PRESENTATION",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-670-traditions-in-american-concert-dance-gender-and-autobiography-spring-2008/3c87103a01a786a404208f150712fa9c_MIT21M_670S08_orals.pdf",
      "content": "BALANCHINE BALLET ORAL PRESENTATION\nView repeatedly, and with great care, the Balanchine ballet or excerpt\nyou have chosen.Prepare a curatorial overview of the dance to share\nwith us in class on either April 29, or May 1. Your presentation must\ninclude the following information:\nHISTORY\nYear of creation for the work\nDate and place of its premiere\nCreators of roles in the original production of the work\nNames, interesting information about these dancers and their relationship to\nBalanchine\nBackground to the creation of the work\nCollaborators - costume, composer, set and lighting designers interesting\ninformation about the collaborative process\n\nHISTORICAL ANALYSIS\nHow did professional critics respond to this work? Did opinions of the dance\nchange over time?\nINTERPRETATION\nOverview of the work's construction - how many sections, how many dancers,\nwhat musical format\nDescriptive analysis - what happens in the dance; what sorts of recurring\nmovement gestures define the work distinctively?\nInterpretive analysis - what is this dance 'about?' How does it achieve meaning?\nSummation - how is this dance successful? What do you think is its importance to\nthe legacy of American ballet?\nOTHER DETAILS\nYour presentation can have more information than this, but it must have at least\nthese elements. For background information, you may consult the various\nEncylopedias of Dance and Ballet in the Humanities Library. For critical reviews,\ntry The New York Times on the libraries.mit.edu website; Arlene Croce's many\nbooks of reviews of Balanchine's work; and the several Balanchine biographies in\nthe Humanities library.* A lot of information about Balanchine is available on the\nweb.\n\n*None of these sources are on closed reserve, so please be considerate of your\nclassmates, and do your work in the library. There will be no extensions for this\nassignment, so allow yourself enough time to do the research necessary. If you\nhave any questions/concerns feel free to e-mail me or schedule a meeting.\nYour presentation should include a screening of the most important sections of\nthe work, as you see fit to curate it.\nTIME CONSTRAINT -- Your presentation must last no more than 10 minutes\ntotal!\nGood luck!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21M.670 / WGS.591J Traditions in American Concert Dance: Gender and Autobiography\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Fall River Legend:  Conveying Cultural Mores and Cultural Identity",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-670-traditions-in-american-concert-dance-gender-and-autobiography-spring-2008/07421617b62f40ccc86aa7a810be1b22_MIT21M_670S08_chao_fall.pdf",
      "content": "Gloria Chao\nApril 3, 2008\n\nFall River Legend:\nConveying Cultural Mores and Cultural Identity\n\nOn April 4, 1892, Andrew and Abby Borden, father and stepmother of Lizzie\nBorden, were found brutally murdered with a hatchet in their home. This case has\nfascinated people for over one hundred years and the story is still told today. Lizzie\nBorden has even been immortalized in a playground jump rope verse, and continues to\npop up in television shows and movies. Many different explanations and interpretations\nof the story have been offered, and many question the jury's 1893 verdict of \"Not\nGuilty.\" In 1950, Agnes de Mille choreographed the ballet Fall River Legend based on\nthe life of Lizzie Borden. De Mille recreates the legend, presenting the story from her\nperspective and offering an explanation for what happened and why it happened. Using\nmovement, de Mille paints a vivid picture of each character and the society that they\nlived in. This analysis will focus on the specific portions of De Mille's piece which\nconvey concepts of cultural mores and cultural identity.\nAccording to Aiuto, the case attracted so much attention due to Lizzie Borden's\nreputation, the time period, and the associated cultural norms. Lizzie Borden was a\n\"church-going, Sunday-school-teaching, respectable, spinster-daughter (Aiuto 2007)\"\nwho was thought incapable of such an atrocious murder. The murders also occurred in an\n\"otherwise respectable late nineteenth century domestic setting (Aiuto 2007)\" thus\ncausing the acts to be especially unexpected and shocking. Although she was found to be\ninnocent by the jury, many, including Agnes de Mille, believed her to be guilty. In Fall\nRiver Legend, de Mille changes the story so that Lizzie is found guilty. However, despite\n\nthis, de Mille viewed Lizzie Borden as the victim in this whole mess, and communicated\nthis perspective of Lizzie through the piece. She believed that Lizzie Borden began as\nthe respectable, religious woman everyone perceived her to be, but was driven mad by\nher evil stepmother and the small-minded culture that she lived in. The society at the\ntime was strict, with pre-determined roles and expectations for men and women, which\nde Mille successfully captures these concepts through her choreography.\n\nFall River Legend begins on a dark, cloudy night, with dramatic eerie music, and\nnine dancers standing still. The only props onstage are the wooden gallows towards stage\nright and a black, leafless tree to stage left. Six of the dancers in the center of the stage\nare facing the front, legs apart and hands behind their back, looking straight ahead, with\nno expression on their faces. One dancer stands behind them, leaning with one arm\nagainst the wooden post of the gallows, the other arm behind his back. These are the\njurors of the trail of Lizzie Borden. Off to the right hand side, a male, the pastor, and a\nwoman, Lizzie Borden, are holding hands and looking at the six people in the center.\nThe male dancers are dressed in dark colored suits, and the woman is dressed in a long\ndark green dress, with a black cloak and matching dark green hat. One dancer begins to\nspeak, describing the murder in detail. The stillness of the characters and the words\nbeing spoken emphasize the brutality of the murders. De Mille selects harsh words and\nphrases to illustrate the violence. Some of these phrases include \"assault,\" \"cut,\"\n\"strike,\" \"beat,\" \"bruise,\" \"20 mortal wounds,\" and \"instantly died.\" The first movement\nthat takes place occurs when the words \"instantly died\" are spoken. Lizzie swoons and\nfalls into the arms of the man next to her, almost as if she cannot believe that her parents\nare dead, and cannot believe what she did. This implies that Lizzie is still in disbelief\n\nthat she could do such a thing and has not quite come to terms with it. Agnes de Mille\nuses this swoon to convey her thought that Lizzie is the victim, and that she was driven\nmad by the society she lived in. It is also important that Lizzie, the female, swoons, and\nis caught by the male standing next to her. During this time, female were viewed as\ndelicate, graceful, weak individuals that needed to be saved, supported, and protected by\nmales. Even after the murders have been committed and Lizzie is awaiting her verdict,\nshe is still struggling with her cultural identity defined by society. De Mille continues\nthis portrayal of men and women throughout the rest of the piece, with the men always\nsupporting and catching the women, and with the women frequently falling and\ndepending on the men.\nThe man walks Lizzie to the center of the stage as the speaker announces that the\njury finds Lizzie guilty of the murder. As soon as the speaker finishes, there is a dramatic\nchange in the music, the pastor takes Lizzie's hat and black cloak, and Lizzie faces the\naudience as she raises her right hand, fingers and palm outstretched. She has a\nbewildered look on her face, resulting from the realization that she has been found guilty\nof the murders. This causes Lizzie to appear more as a victim than a monster, reflecting\nDe Mille's perspective.\nThere is then a transition to Lizzie's childhood, when her mother is still alive and\nthey are a happy family. This is when the cultural norms of the time period are first\nillustrated. All of the women are dressed in colorful, flowing dresses with matching hats\nwith flowers. The only exception is Abby Borden, Lizzie's stepmother, who is dressed in\nblack. De Mille chose to do this to represent the evilness of Abby's character. The\ntownspeople are out, socializing and dancing together, illustrating the small-town\n\natmosphere and the fact that everyone knows each other. The women curtsy to the men,\nand everyone is polite, prim, and proper. Each gender has a role that they are expected to\nfit into, based on the way they dress, act, and interact with the opposite sex. The society\nas a whole is socially coercive and demanding. Lizzie and her parents fulfill their roles in\nsociety as mother, father, and daughter. Lizzie shows how she is depends on and loves\nher parents by holding their hands and placing her head on her mother's outstretched\nhand, as if resting. Lizzie is obedient and listens to her parents throughout this scene.\nWhen the townspeople leave, Andrew Borden dances with his wife and with Lizzie,\ndepicting the love and support he offers to both.\nThe society at this time is further demonstrated in later scenes in the piece. Lizzie\nturns to the pastor for comfort, love, and support, demonstrating the importance of\nreligion at the time. The church scene towards the middle of Fall River Legend further\ndevelops the small-town, socially coercive setting. All of the townspeople are attending\nchurch, and they all know each other, greeting one another warmly. The fact that\neveryone attends church emphasizes the large role religion plays in everyone's lives.\nReligion implies that there were specified, and most likely strict, rules and regulations for\neveryone in society, the concept of which was touched upon earlier.\nAbby Borden's character is defined early on, and she appears immediately after\nthe transition to Lizzie's childhood. The first time the audience sees her, she has a stern,\nunhappy look on her face, with her hands clasped in front of her, staring straight ahead.\nHer black outfit stands out among all of the bright colors. She greets Lizzie's parents\npolitely, but treats Lizzie cruelly. Her first interaction with Lizzie is behind her parents\nback, and she points her right index finger sharply at Lizzie with a stern expression on\n\nher face, appearing to threaten her. She walks to stage right and pauses, looking to the\nleft while stroking the left side of her face with her left hand, fingers curled. This\nmovement eludes malice and gives the image that she is thinking malevolent thoughts.\nThis becomes her trademark move throughout the piece, and she repeats it often. She\nbegins to walk back and forth from stage right to stage left, walking slowly but\ndeliberately while the rest of the town dances behind her. There is a sharp contrast\nbetween Abbey's purposeful steps and the townspeople's graceful waltz-like movements.\nShe pauses between changing directions only to stare unkindly at Lizzie's parents. When\nLizzie's mother falls into her father's arms, Abby is there, pushing Lizzie away from her\nmother and preventing her from being near her parents. She repeats this twice, the\nsecond time hitting Lizzie on the arm first. She holds Lizzie's mother's hand, pretending\nto be compassionate, demonstrating how she hid her true character in the presence of\nLizzie's parents. When Lizzie's mother passes away, Abby again prevents Lizzie from\ngetting close to her mother, barricading the house door. She even grabs Lizzie and\nshakes her violently until Lizzie's father pulls her away.\nAndrew Borden's character is also defined early, first as a loving father as\ndescribed above, and then as the weak-minded and negligent father he becomes when\nLizzie's mother dies. The transition occurs immediately after Lizzie's mother's death,\nand Andrew Borden grabs his head in anguish, his whole body shaking as his upper body\nrepeatedly contracts so that it is rocking back and forth. He then reaches out to Abby,\nwho stretches her arm out to him, and he runs to her, collapsing and embracing her\naround her waist. He leaves Lizzie by herself, who has fallen to the floor and is huddled\nin a heap of anguish and pain. Lizzie slowly gets up and faces Andrew and Abby,\n\nclasping her hands and reaching towards them, but her father picks up Abby in his arms\nand brings her in the house, ignoring Lizzie. Lizzie is left alone to deal with her mother's\ndeath and the loss of her father.\nAndrew, Abby, and Lizzie's characters are further developed in the next scene,\nwhich takes place in 1892, after Lizzie becomes an adult. This scene focuses on how\ncruelly Abby treats Lizzie, and how Andrew has abandoned Lizzie for Abby. This, along\nwith society, drives Lizzie to commit the murders. Andrew, Abby, and Lizzie are sitting\nin their house, with Andrew on the left, Abby on the right, and Lizzie in the middle.\nThey are all sitting with their backs straight, very proper, as demanded by society. Lizzie\nreaches out first to her father, then Abby, but neither respond, and she stands up\nsuddenly, puts her head in her hands frustratingly, and then looks up, pounding her fists\nas if helpless and exasperated. When Lizzie has her back turned, Abby leans forward and\nwhispers something to Andrew, appearing to speak about Lizzie behind her back. When\nLizzie turns around and glares at them, they return to being proper. When she tries to\nlook out the window, Abby prevents her from doing so, storming over and pulling the\ndrapes shut from behind her. Lizzie tries one last attempt to reach her father, kneeling\nbefore him and putting her arms around his neck, but Abby hurries over and throws\nLizzie's hands off. Andrew allows this and never responds to any of Lizzie's attempts,\nemphasizing his weak-mindedness. Thus far, Lizzie has obeyed her parents because it is\ndemanded by society, but she is beginning to go mad, which she demonstrates when she\nspins quickly away from her father after her last attempt to reach him. Once she stops,\nshe puts her head in her right hand, breathing hard. This again shows frustration and\nhelplessness. Cultural norms command Lizzie to obey her father and stepmother, but her\n\nstepmother is evil and her father listens to everything his new wife says. She begins to go\ncrazy from trying to obey people who treat her cruelly. Abbey comes over and taps\nLizzie's left temple with two fingers and then smiles wickedly, as if making fun of her\nand tormenting her. She then repeats her characteristic move of touching her face with\nher left hand, reminding the audience of her evilness. De Mille uses this scene to\nillustrate how society, along with Andrew and Abby are at fault for causing Lizzie to go\nmad, and that she is the victim.\nIn this piece, there is an axe that Lizzie grabs three different times. Each of these\ninstances represents a turning point in Lizzie's character. The first time Lizzie grabs the\naxe Andrew and Abby are sitting down, proper, looking straight ahead. She steps out of\nthe closet and pauses, facing front, legs spread apart, with the axe in her right hand.\nAndrew and Abbey jump up in fear and Andrew puts his right hand on Abby, as if to\nprotect her, again demonstrating the cultural mores of the time. Lizzie looks at Andrew\nand Abby, looks at the axe, and then walks outside calmly and chops a block of wood,\nleaving the axe in the tree stump and carrying the split logs back into the house. They all\nsit down again, and Lizzie begins to laugh uncontrollably, symbolizing her craziness.\nHowever, as soon as she finishes laughing, she looks shocked, and brings her right hand\nto cup her face, almost as if she is in disbelief of what has just gone through her head. In\nthis instance, Lizzie's actions with the axe are calm and seem as if they were part of her\nevery day routine. Andrew and Abby's fear indicate that they have noticed Lizzie\nbeginning to go mad, and fear for their lives.\nThe second time Lizzie grabs the axe she is dancing by herself, outside, while her\nparents are inside, in the dark. The entire stage is darkly lit, giving an ominous,\n\nforeboding feeling. She spins towards the axe and stops directly in front of it. She raises\nher hand forcefully as the music crescendos, but then gently lowers her hands to embrace\nthe tip of the axe handle. She circles her upper body, head, and neck, as she continues to\nhold onto the axe, and then she begins slowly backing away from the axe, putting her\nhands over her heart and then on her waist, as if she was scared by her thoughts and\nemotions. She leans backwards, away from the axe, and slowly extends her arms towards\nthe axe with her palms out, as if pushing the axe away. However, her palms quickly turn\nover and seem to draw her to the axe. She slowly walks towards the axe, as if it is pulling\nher in through her hands, but keeps her upper body leaning away from the axe. When she\nreaches the axe, she steps towards it and puts her right hand on it, but reacts as if it is hot,\nand she runs away, looking back a few times, before she falls on the ground, curled in a\nball. Once she stands up, she pushes her hand towards the axe and leans back, with her\neyes closed. This clearly illustrates the conflict that Lizzie feels, and shows how she is\nstruggling with her thoughts. She is drawn to the axe, but is trying to resist its pull. This\nsuggests that Lizzie was the victim, pushed to madness by society and her evil\nstepmother. This scene demonstrates that she tried to resist in the beginning, but could\nnot in the end.\nThe third and final time Lizzie grabs the axe, she walks deliberating and\nconfidently towards it, wearing a white shawl. She grabs the axe forcefully and with\npurpose, and hides the blade within her dress. She walks confidently back in to the\nhouse, turns towards the audience, and screams, covering her mouth with her hands,\nfingers outstretched. By using these three instances of grabbing the axe, De Mille\n\nbrilliantly illustrates the change in Lizzie's character over time, tracing how and when\nshe went mad.\nThrough Fall River Legend, Agnes de Mille narrates a story that has continually\nfascinated the public and weaves her own perspective and interpretations into the piece.\nShe clearly illustrates the cultural mores of the time and the expected roles of each\ngender. She demonstrates the delicacy and dependency of the women on the strength and\nsupport of the men. She conveyed the wickedness of Abby Borden, and communicated\nthat she believed Lizzie was driven mad by society's demand to obey her parents,\nregardless of how poorly she was treated. Though Lizzie was viewed as a monster by\nmany, De Mille presents Lizzie Borden as a victim, driven mad by society's demand to\nobey the cultural mores.\n\nReferences\n\nAiuto, Russell. \"Lizzie Borden Took An Axe.\" Crime Library: Criminal Minds and\n\nMethods: 2007. 25 March 2008\n\n<http://www.crimelibrary.com/notorious_murders/famous/borden/index_1.html>.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21M.670 / WGS.591J Traditions in American Concert Dance: Gender and Autobiography\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "FINAL PAPER",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-670-traditions-in-american-concert-dance-gender-and-autobiography-spring-2008/74a6ce2ec41514977f2c1966ec2fccfb_MIT21M_670S08_paper3.pdf",
      "content": "FINAL PAPER\nDue May 15th. NO EXCEPTIONS.\n\nView the hour-long dance The Catherine Wheel and write a paper of 7-10 pages length\nthat addresses this question:\n\nHow does the \"gold section\" of The Catherine Wheel (Tharp, 1981) describe issues of\ngender and individuality?\n\nFocus your essay on the gold section, which is the last 15 minutes of the work.\n(It begins about an hour into the video. The gold section begins with a flashing golden\nsparkler effect that flashes across the screen.)\nHow does the choreographer depict gender?\nWhat kinds of movements does she allow men and women?\nHow does she describe social order?\nWhat does the dance suggest about the culture in which these men and women exist?\nYou may base your observations and interpretations on the gold section only; you\nneedn't try to extrapolate from the first hour of the work.\nWhat particular dance gestures (movements) support your thesis?\nBe sure to write about particular dance gestures to support your thesis.\nYou must try to describe movement in exact terms, and then build upon your\ndescription to support your interpretation of the dance.\n\nYour thesis should be informed by some of the readings we have done all semester. You\nshould refer to at least 3 but no more than 5 of the readings from the entire semester in\nyour paper to articulate your thesis. It's up to you to decide which 3-5 readings you will\nuse.\n\nALWAYS IMPORTANT:\nYou should not retell the dramatic plot of the dance. You should not provide a\nbiography of the choreographer, although you may wish to discuss her\nmovement aesthetic as you understand it from this work and others viewed in class.\nYou may wish to check some source material for information about the choreographer;\nyou may consult her entry in the\nInternational Encyclopedia of Dance at GV1585.I586 1998 in the Humanities Library.\n\nThe video is available at:\nhttp://web.mit.edu/21m.670/www/paper3.htm\n\nALL OF YOU MUST MEET WITH ME FOR AT LEAST ONE SESSION TO DISCUSS\nYOUR RE-WRITE AND THIS PAPER. PLEASE SET UP APPOINTMENTS WITH ME\nAS SOON AS POSSIBLE. THIS IS A REQUIREMENT FOR YOUR FINAL GRADE.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.670 / WGS.591J Traditions in American Concert Dance: Gender and Autobiography\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Gender and Individuality in the 'Gold Section' of Twyla Tharp's The Catherine Wheel",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-670-traditions-in-american-concert-dance-gender-and-autobiography-spring-2008/d2117319149e628b022e6218d1912e99_MIT21M_670S08_chao_final.pdf",
      "content": "Gloria Chao\nMay 15, 2008\n21M.670 Paper Three\n\nGender and Individuality in the \"Gold Section\" of Twyla Tharp's The Catherine Wheel\n\nIn an interview with the Academy of Achievement, Twyla Tharp reveals that at\nthe start of her career, she believed she could make an impact on dancing, the future of\ndancing, and what can be accomplished through dancing. She believed that there were\nunexplored possibilities, \"in terms of physical movement, in terms of community, and in\nterms of what dance could address in our society (Tharp, 1993).\" This vision has served\nas Tharp's motivation throughout her career, and her works have successfully brought\ndance to the next level by being the first to focus on various controversial issues. In the\n\"gold section\" of The Catherine Wheel, Tharp abolishes preexisting perceptions of\ngender and individuality.\n\nThe current culture is defined by myths of established gender differences, called\n\"masculine\" and \"feminine\" (Daly 1987). These beliefs are especially strong in the\ndance world, where dancers are distinguished based on gender, with each sex embodying\na predetermined role and set of movements. Across various cultures and dance styles, a\nwoman's movement is smooth and graceful, while a man's is vigorous and athletic (Jonas\n1992). Partnering consists of one male and one female, with the male supporting the\nwoman. He and she are not equals and do not \"participate equally in their choreographic\ncoming together (Foster 1995:1).\" In response to this issue, Twyla Tharp choreographed\nThe Catherine Wheel, in which she creates a society where everyone is equal and there is\nno concept of gender. She abolishes the stereotypes of \"femininity\" and \"masculinity\"\nG.Chao 1\n\nthrough her use of movement and interaction between dancers. She accomplishes this so\nwell that it is difficult to determine the gender of each dancer.\n\nIn this dance, the women and men dance the same movements; there is no\ndistinction between female and male actions. For instance, ten minutes into this section,\nthere is a group consisting of three males and one female dancing together in unison. All\nthree dancers swing their right arm forward in a half circle parallel to the group, followed\nby two skips forward. They lead the skips with their right leg and use these movements\nto curve around in an arc, ending with their backs facing the audience. They jump once\nand as they land, they swing their right arm up to the side and then across their body.\nThey skip backwards towards stage right, with their arms straight out in front of them,\nwith only the forearms, wrists, and hands moving up and down. The hands point in the\nopposite direction as the movement, and the movement as a whole is quick. After two\nskips, they finish in a lunge with their right leg forward, facing stage left. Their arms\nstretch upwards until they are straight up over their heads. Similarly, approximately two\nminutes later, two men and a woman dance in unison as they move from downstage to\nupstage. They begin with one leg bent and the other straight, with all of their weight on\nthe bent leg. The straight leg quickly swings around in a half circle behind the dancer.\nMeanwhile, the opposite arm to the standing leg is bent at the elbow, wrapped across the\nfront of the body. The other arm is also bent at the elbow, but behind the dancer's body.\nThey repeat this leg swing twice, alternating sides per swing, and beginning with the right\nleg bent. After the second time, the straight leg taps the ground once, and the entire\nsegment is repeated again, this time with the left leg bent first. These are examples of\nG.Chao 2\n\nmovements which are neither \"feminine\" nor \"masculine,\" and are danced by both men\nand women.\nIn addition, Tharp's use of partnering is especially powerful in removing the idea\nof gender. Two minutes into the \"gold section,\" a male dancer stands next to the upstage\nleft entrance, with his knees bent and legs apart. His hands are placed on top of his left\nknee, with one palm on top of the other. Another man, the runner, sprints onstage and\nquickly steps on the first dancer's awaiting hands. Instantaneously, the first man pushes\nthe runner to the right, and this momentum propels the runner into the air. He lingers for\na moment, pulling his right foot up to his knee, forming a triangle with his right leg. He\nthrows his arms into the air, straight up over his head, and he appears as if he is flying.\nHe lands just as quickly as he took off, continuing to run towards stage right with full\nspeed. He loops around and begins running towards another male dancer, the base, who\nis spinning in the center of the stage. The runner throws himself in the air, with his arms\nin a \"V\" over his head. His straight legs quickly come together and then apart, beating\nonly once in midair. The base stops spinning as soon as the runner jumps, and catches\nthe runner under the armpits, helping him land. The runner then lifts his right leg behind\nhim in a 90 degree angle, perpendicular to the ground. This leg is bent at the knee, such\nthat it forms a 90 degree angle parallel to the ground. His supporting leg is also bent, and\nhis arms are stretched to the sides. The base holds the runner by the waist, and spins him\nin a circle one and a half times. Suddenly, a third male who has been dancing\nindependently onstage joins them just as the runner puts his right leg down. The base and\nnew male surround the runner on each side, with the base on the right and the new male\non the left. The runner places one arm on each of the other two dancers, and kicks his\nG.Chao 3\n\nlegs upward until his legs are perpendicular to the ground. By having male dancers\nsupport each other, Tharp destroys the common idea that partnering involves one male\nand one female, with the man supporting the woman. The move where the base spins the\nrunner in a circle is often done in ballet, with the danseur holding and spinning the\nballerina. Tharp erases the idea of gender by showing two males dancing this same\nmove.\nFurthermore, approximately one minute after this segment, two women support a\nmale dancer. There is one woman on each side of the man, and the man has his arms\nstretched to the sides. Each woman holds one of his arms with both of her hands.\nTogether, they run forward, and the man kicks his right foot up, propelling himself into\nthe air just as his left foot comes off the ground. He is momentarily suspended in a split,\nwith the two women still holding his arms and supporting him. He lands gracefully on\nhis right foot and quickly steps out and begins to turn. Similarly, approximately two\nminutes later, a man is standing on his right leg with his left leg out straight behind him\nin a 45 degree angle. A woman runs to him and holds him by the waist, supporting him\nas he spins to his left. In these movements, the role reversal abolishes the idea that men\nalways support the women. Tharp uses this to demonstrate that men and women are\nequal, and that people must support one another regardless of gender.\n\nIn today's society, the issues of gender and individuality are coupled together,\nwith the common belief that men are superior to women and thus are entitled to possess\nand manipulate them. According to Ann Daly, women are viewed not as individuals, but\nas objects that belong to men. These ideas have been carried over into the dance world,\npartly due to Balanchine's ballets. In his pieces, the women are often completely\nG.Chao 4\n\nsubmissive to the males, who gladly dominate them. Balanchine himself believed that a\nwoman's role is to fascinate men (Daly 1987). Also, Susan Foster describes how two\nbodies \"dance out a specific kind of relationship between masculine and feminine (Foster\n1995: 1)\" as a result of their distinctly gendered behavior. The woman represents\nattraction itself, and is presented by the man for everyone to see (Foster 1995). Twyla\nTharp opposes these ideas in the \"gold section\" by emphasizing the independence of the\nfemale dancers.\n\nWhen the women and men partner in this piece, they act as equals. The women\ndecide their own movements, and are never submissive or dominated by the men. Within\nthe first minute of the dance, a man is standing with his knees bent at stage right. A\nwoman runs towards him and leaps, with her legs in a split in the air. She throws herself\nat him, with complete trust, and the man catches her around her waist mid-leap. He holds\nher in the split and throws her up. The woman quickly turns around, landing in his arms\non her stomach with her hands straight out behind her. The man puts her down, and the\ndancers run in opposite directions, the woman towards stage right and the man towards\nstage left. The man leaps twice, and stops at stage left. He turns to the right, with his\nright knee bent, leaning towards stage right. A woman runs in towards him, and just as\nshe reaches him, she jumps and turns in midair, kicking her left leg behind her and\npulling her right leg up to meet her left knee. Her right leg forms a triangle and her left\nleg is extended behind her, in a 135 degree angle from the ground. The man catches her\nby her left leg and her waist, and dips her upper body forward, causing her left leg to\nextend higher. He spins her quickly to the right multiple times, and they spin so fast that\nthey become a blur. The image of these two women throwing themselves at the man\nG.Chao 5\n\ndemonstrates that they are in control of their movement, and are free and independent.\nSimultaneously, the man is there to support them, but is not controlling them.\n\nSocietal norms have become powerful in today's world, influencing an\nindividual's decisions and actions. People have a tendency to \"go with the flow,\" and\nthose that differ are often rejected by society. Tharp demonstrates in the \"gold section\"\nthat individuality is a positive force, and can coexist with a strong community. Although\nthe dancers are united by the pure energy that is created on stage, each dancer acts as an\nindividual.\n\nThis is shown from the start of the dance, with multiple performers dancing\nunique sequences at the same time. Within the first minute of the piece, four dancers\nperform different sequences simultaneously. Two of the four dancers are moving\ntogether as a pair, as described in the previous paragraph. The female dancer has just\nthrown herself into the arms of the male dancer, and after they spin together, the male\nreaches his right arm towards the female as he slides down to the floor, ending up on his\nback. Meanwhile, the female kicks her right leg over him, drawing an arc with her\npointed toe. She then grabs the male's arms and helps him up. They continue holding\nhands as they skip twice and then spin three times, leaning back with their arms\noutstretched. Both the male and female lift their left legs up in a 45 degree angle and exit\nstage right by hopping on their standing leg. While this pair is dancing at the front of the\nstage, the remaining man and woman dance their own sequences. The man runs across\nthe stage, entering from stage left, and kicks his left foot up in the air in a 45 degree\nangle. His right leg follows and meets his left foot in the air. His arms are stretched in a\n\"V\" over his head. He lands quickly and immediately begins spinning in place with his\nG.Chao 6\n\narms pulled in close to his body. He takes a step in preparation and propels himself in the\nair, kicking his right leg behind him in a 90 degree angle as he jumps. He repeats this on\nthe other side and steps as he lands. He jumps and kicks his left leg out to the side,\nallowing the momentum of the kick to carry his body, turning him around to face the\nback. Simultaneously, his arms swing above his head as he kicks, and lower as his left\nleg descends. Upon landing, the man spins quickly again and exits the stage. Separate\nfrom his movement, the woman runs onstage from the opposite side, stage right, and\nleaps twice, kicking her left leg forward up to a 90 degree angle, followed by her right leg\nbehind her. She reaches forward with her arms, and opens to the side, alluding to the arm\nmovements of the breaststroke. During each leap, she momentarily holds the split midair,\nand continues running as soon as she lands. Once she reaches stage left, she turns and\nrepeats the leaps across the stage, this time leading with her right leg. After two leaps,\nshe runs off of the stage. Clearly, each of these dancers is independent; two dancers\npartner in the front of the stage, one man kicks and spins in the back, and a woman leaps\non and off the stage in a semicircle. Their distinct movements emphasize their\nindividuality, and this theme is continued throughout the piece.\n\nFurthermore, even when the dancers are doing the same choreography, they\ncomplete the movement on their own time. Approximately two minutes into the piece,\nfour female dancers run on the stage, completing the same sequence of movements, but in\na canon. Each dancer is delayed from the previous dancer by approximately four counts,\nillustrating that they are moving to their own beat. The sequence begins with a small\nleap, with each leg out to the side at a 45 degree angle. The right leg leads, and the\ndancer lands with her weight on her right leg. Her left foot is pointed and lands behind\nG.Chao 7\n\nher right foot. Both knees are bent and her arms form a circle in front of her,\nperpendicular to the ground. This is repeated to the other side, this time leading with and\nlanding on the left leg. The dancer then quickly spins three times to the right with her\narms in a circle parallel to the ground. She steps out of the turn onto her right leg, with\nher left leg straight and extended to the side, the pointed toe touching the ground. Her\narms open such that her right arm is straight up over her head and her left arm is in front\nof her, parallel to the ground. This pose is held for only one second, and the dancer\nimmediately steps on her left leg and kicks her right leg up in front of her, forming a 90\ndegree angle to the ground. The momentum of this kick propels her in the air, and she\nquickly turns her torso and kicks her left leg behind her, forming a 135 degree angle to\nthe ground. She lands in a lunge with her right foot forward, and the momentum of the\nprevious move causes her torso to turn towards her back leg. Her arms follow, swinging\nand wrapping around her body with the right arm in front and left in back. This entire\nsequence is danced with a domino effect, which helps convey the independence of each\ndancer.\nTwyla Tharp's choreography as a whole is also a form of individuality. She is\namong the \"newest generation of experimenters [who] recognize no boundaries -\ngeographical or otherwise - in its search for dance that speaks to contemporary audiences\n(Jonas 1992: 235).\" Tharp has taken dance to a new level, not only because she\naddresses controversial issues, but also because she incorporates characteristics of a\nvariety of cultures and dance styles. She utilizes what is called \"crossover\" dance, in\nwhich she \"rules out nothing, from ballet to boogaloo, from Bach to rock. Her own label\nG.Chao 8\n\nfor what she does is simply: dance (Jonas 1992: 235).\" Tharp has created a new unique\nstyle that is based on the interchange of cultures and traditions on a global scale.\nG.Chao 9\n\nReferences\n\nAcademy of Achievement. Interview with Twyla Tharp. Washington D.C., June 25,\n\n1993. http://www.achievement.org/autodoc/page/tha0int-1 (Viewed May 11,\n\n2008)\n\nDaly, Ann. \"The Balanchine Woman: Of Hummingbirds and Channel Swimmers\" in\n\nTDR Vol 31 NO. 1, 1987.\n\nFoster, Susan. \"The ballerina's phallic pointe\" in Corporealities: Bodies Knowledge,\n\nCulture, and Power. Susan Foster, ed., London & New York: Routledge, 1995.\n\nJonas, Gerald. Dancing. New York: Harry Abrams, 1992.\nG.Chao 10\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.670 / WGS.591J Traditions in American Concert Dance: Gender and Autobiography\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Religion and Social Order in Alvin Aileyâ€™s Revelations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-670-traditions-in-american-concert-dance-gender-and-autobiography-spring-2008/7eefe92be7e40c1f6217bdc5110d4d38_MIT21M_670S08_chaorevel.pdf",
      "content": "Gloria Chao\nMay 15, 2008\n\nReligion and Social Order in Alvin Ailey's Revelations\n\nIn a time when America was gradually being redefined as ethnically diverse,\nAlvin Ailey played a vital role in carrying this progression into the dance world. He\nintroduced African-American history to the world through a company created to make a\nsocial and political statement. Ailey's goal in creating the Alvin Ailey American Dance\nTheater (AAADT) was to remind other choreographers of the beauty and elegance of\nblack people (Ailey 1986). He focused his choreography on the African-Americans'\nstruggle for freedom and opportunity. The first step towards accomplishing these goals\nwas achieved through Revelations, first choreographed and performed in 1960 and edited\nin 1986. Ailey drew upon his own memories - blood memories, as he called them - to\ncreate Revelations. Because religion and social order were so prevalent in Ailey's life\nand the world at the time, they were clearly illustrated in this work. Through this work of\nart, Ailey uses choreography, music, color, dancers' emotions, and costume design to\nconvey concepts of religion and social order.\n\nAccording to DeFrantz, Revelations tells the story of African-Americans from\nslavery to freedom (DeFrantz 1996). The piece has three distinct sections, which are:\n\"Pilgrim of Sorrow,\" \"Take me to the Water,\" and \"Move, Members, Move.\" According\nto Ailey, \"Pilgrim of Sorrow\" symbolizes the African-Americans hope and prayers to\nescape their situation in the South, \"Take me to the Water\" brings to life a baptismal, and\n\"Move, Members, Move\" illustrates a Sunday morning at church (Ailey 1986).\nThe first section, \"Pilgrim of Sorrow,\" illustrates the legacy of slavery. Within\nthis section, there are three songs: \"I've Been Buked,\" \"Didn't my Lord Deliver Daniel,\"\nG.Chao 1\n\nand \"Fix Me, Jesus.\" The entire piece conveys social order by describing the African-\nAmericans' emotions towards slavery. African-American religion is captured with the\nmovements and the three songs, which are spirituals and gospels. The lyrics in all three\nsongs match the message - all are pleas to God to save them from their suffering. Much\nof the movement in this section possesses the downward energy characteristic of African\ndance, which symbolizes a connection to the earth (Blanco 2008).\n\"I've Been Buked\" has a total of nine dancers, all of whom have somber\nexpressions on their faces throughout this dance. According to DeFrantz, this part\ndepicts a group prayer (DeFrantz 1996), which is conveyed by the clustered formations of\nthe dancers. This dance also embodies the collective pain African-Americans felt as\nenslaved people, and illustrates how they are united by this suffering and dependence on\nGod despite being spread all over the world. The lyrics emphasize this point, saying\n\"I've been Buked\" and \"there is trouble all over this world.\" The sadness and seriousness\nof the situation is conveyed through earth-toned colors; there is brown and black lighting\nand dark-brown costumes. The costumes are also very plain - sleeveless tank tops and\ngaucho pants, with no design or unique characteristics.\nThe dancers begin in unison and alternate from deep stances with bent knees and\nheads facing downwards to reaching and looking upwards. Throughout this piece, when\nthe dancers stretch their arms upwards, it represents reaching for God. As the dance\nprogresses, the dancers repeatedly break out of the mass in the center and then come back\ntogether. When they are in the group, their dancing is synchronized. The dancers do\nslow rotations of the upper body while reaching upwards, alternating with deep stances\nwith their heads facing downwards. When the group breaks apart, the dancers dance their\nG.Chao 2\n\nown sequences. While there is still reaching upwards during these sequences, the\nmovements are faster, filled with spins and kicks. There are also fast level changes, with\nthe dancers ending their spins kneeling on the ground or contracting over their legs. This\ncontrast between synchronization and individuality symbolizes how African-Americans\nare unified despite the distance separating them from each other and from their home.\nMore specifically, the group dancing together symbolizes how African-Americans are\njoined together by culture and prayer. The group breaking apart and the dancers dancing\nindependently symbolizes the physical distance between them. One pose that they hold\nhas six dancers, three one each side, mirroring each other, holding hands, lunging, and\nbent over at the waist. In the center, a woman is holding her leg behind her, almost\nparallel to the ground, while holding the hands of two dancers closest to her. There is\nalso one dancer lying on the ground in the center in front of the woman holding her leg\nup. A male dancer is also in the back, posing with his leg behind him, bent at the knee,\nforming a 90 degree angle to the ground. This beautiful pose shows that African-\nAmericans are all connected and supporting one another, physically and emotionally.\nThe next section, \"Take Me to the Water,\" revives a baptismal, which Ailey said\nhe choreographed based on his own personal baptismal. He was baptized outside of a\nchurch in a lake, all dressed in white (Ailey 1986). All of the dancers in this section are\ndressed completely in white, just like Alvin Ailey was on the day of his baptism. In\nAfrican culture, the color white symbolizes cleanliness, purity, and ancestors (Blanco\n2008). Thus, since the baptized individual is being cleansed and reborn, it makes sense to\ndress her in white. The lighting is also very bright, and the overall color of this section is\na stark contrast to that of \"Pilgrim of Sorrow.\" The dresses worn by the women in this\nG.Chao 3\n\nsection are also very different, much more flowing, elegant, and stylish than the costumes\nworn in the first section. This was done to demonstrate the beauty and joy surrounding\nthe occasion. There is an overall feeling of excitement and celebration throughout this\npart. This entire section, \"Take Me to the Water,\" communicates ideas of religion by\nbringing to life a baptismal experience.\nThe first piece of this section, \"Processional/Honor, Honor,\" begins with a beat,\nunlike the rest of the dances thus far in Revelations. It starts with much more excitement,\nboth in the music and the choreography. The beat is comprised solely of voices and\ndrums, and lasts for a significant portion of the piece. A man and woman spin onstage to\nthe drumbeat, entering from stage right. Their arms are bent at the elbows, with their\nhands up. The man holds a stick with white ribbons attached to it in his right hand, with\na long white cloth in his left hand. When he reaches downstage left, the man lifts his left\nhand up. The momentum of this movement makes it appear as if the white cloth jumps,\nwhich gives a feeling of excitement and celebration. The woman wears a long dress,\nwhich billows and fans out gracefully as she spins, appearing as if it dances along with\nher. Once onstage, the woman spins with her leg out behind her in a 90 degree angle to\nthe ground, again causing the dress to fan out. Her arms spread open, and it appears as if\nshe is flying, which captures the joy of the occasion. With a burst of energy, she kicks\nand leans back when she finishes the fast spin, relishing the extension. She smoothly\nwalks backwards towards stage left with arms outstretched, welcoming the second man\nand woman who spin onstage towards her awaiting arms. The entering man and woman\nspin and stop at center stage, facing downstage left. They clasp their hands together in\nfront of their chests and contract forward and release. They continue this movement\nG.Chao 4\n\nwhile simultaneously walking towards stage left. Suddenly, two men with long poles\nadorned with ribbons and a woman with a white umbrella run in, circling the dancers\nalready onstage. This mix of movements on stage establishes a celebratory atmosphere,\nsetting the stage for the ensuing baptism.\nAll seven dancers soon stop to face downstage left in the formation of a triangle.\nThe three men on the edges of the triangles have their arms and poles in the air, whereas\nthe two women and the man in the center of the triangle have their hands clasped in front\nof their chests. Everyone looks upwards, as if communicating with their God. They walk\nback and forth in unison, only moving their legs and rotating their hips - the hips\nbecoming the focus of the movement, and alluding to characteristics of African dance\nwhere the hips are said to represent fertility and life (Blanco 2008). As this section\ncelebrates a baptism, it is only fitting for Ailey to draw on legacies of African dance to\nshow the beginning of a new spiritual life.\nAfter a second set of hip rotations, the dancers break apart and half of them leave\nthe stage, leaving one woman and three men on the stage, forming a trapezoid with the\ntwo men with poles in the back and the woman and man in the front. The back two and\nfront two dancers take turns doing turns with their legs behind them in 90 degree angles.\nThey finish their turn by dipping their upper bodies forward, causing their back leg to\nextend higher. This set of movements continues the celebratory mood of the dance.\nTwo women and a man are in the center of the stage in the formation of a triangle.\nThe woman at the tip of the triangle holds the white umbrella. They spin forward and the\nman and woman in the front reach upwards and throw their heads back. Next, they\ncontract and bend their knees, throwing their upper body forwards and parallel to their\nG.Chao 5\n\nground. A split second later, they straighten their knees and use their hands to gesture as\nif they were climbing up a wall, with their palms pressed against the invisible wall. This\nsymbolizes how humans sin and fall from God, but because of His mercy, are able to\nclimb back up again and receive forgiveness.\nTwo of the male dancers bring in a white sheet, which symbolizes cleanliness and\npurity (Blanco 2008). The two male dancers hold the sheet horizontally, and the other\nthree dancers stand behind it, with their arms reaching up. The music changes and\nbecomes slow and more serious, and the dancers rotate their upper bodies and arms,\nmatching the rhythm of the music. Although the baptism is a joyous, exciting occasion, it\nis also serious since they make their commitment to God official. For the last few\nseconds of the piece, the music switches back to upbeat, finishing the section festively.\n\nThe last section, \"Move, Members, Move,\" takes place on a Sunday morning at\nchurch. According to DeFrantz, this scene takes place in a \"very specific place in a\nTexas church, (DeFrantz 1996)\" close to where Alvin Ailey grew up. Although the\nchurch is different now, this section keeps the scene respective to the '30s and '40s when\nAlvin Ailey was attending church with his mother (Croft 2006). This section conveys to\nthe audience the intense joy that God and religion bring to African-Americans, and how\nmuch they enjoy worshiping their God. The music in this section is upbeat, fast, and\ncheerful. The last dance in this section, \"Rocka My Soul in the Bosom of Abraham\" is\nthe big bang finale of Revelations.\n\n\"Rocka My Soul in the Bosom of Abraham\" is a fun, joyous dance with nine\nwomen and nine men. The men and women are paired into couples in the beginning of\nthe dance, with the women sitting on stools and the men kneeling next to the women.\nG.Chao 6\n\nThe dancers are all dressed in their Sunday best. The women are dressed in beautiful\nyellow dresses and hats with flowers on them, with matching fans. The men are wearing\nwhite dress shirts, gold and black vests, black dress pants, and black dress shoes. This\nsection is unique because the dancers appear to be very free and blissful, smiling the\nentire time. Towards the middle of the dance, the women stand in a diagonal line from\ndownstage left to upstage right and they dance in unison. They first skip forwards,\nfanning themselves, and then do two fan kicks on alternating legs, moving backwards.\nThey are very energetic and constantly jump during these movements. Following this,\nthe men begin to come forward in a line, and one of the women dances in the center,\nrotating her fan while bending her knees, spinning, and reaching up with her fan.\nAnother woman joins her, spinning. While she spins, she raises her arms over her head\nand rotates her neck. These two women dance independently and appear to be\nimprovising and just having fun, celebrating life and dancing out of happiness. Towards\nthe end of the dance, the entire cast comes together and begins dancing together. The\nmen stand in the front, in a \"W\" shape, and the women stand behind them in the same\nformation. They bend their knees and point upwards and diagonally, alternating from\nright to left. The bent knees, bouncing, and pointing signifies a celebration of God. The\ndance ends with spinning, and the entire cast ends on their knees with their arms straight\nover their head in a \"V\", in veneration. When the final sections of \"Rocka My Soul in\nthe Bosom of Abraham\" are repeated as an encore, it certainly emphasizes the importance\nof religion to African-Americans in the past and present, and the spiritual wholeness that\nit brought to them. The repetition communicates to the audience that religion is\nG.Chao 7\n\nsignificant in all aspects of their lives, helping them survive through slavery and its\naftermath.\n\nAs a whole, Alvin Ailey believes that Revelations was a great work because of\nhow personal it was (Ailey 1986). This is supported by the fact that despite changes and\nedits throughout the years, Revelations has kept emotion at its core, eliciting emotional\nconnections from its audience and its dancers. DeFrantz writes that \"even though the\ntechnique is so heightened, the audience still has a sense of a person doing it and not a\ndancer who's just a technician (Croft 2006).\" The dancers are able to convey the\nemotional messages of the piece to the audience by drawing on their own experiences.\nMatthew Rushing, who is a 12-year member of AAADT, says that he \"loves his role in\n'Wade in the Water'...because it allows him to tap his own spirituality (Croft 2006).\" He\nclaims that \"if I continue to bring my life experience to the stage in Revelations, then it\nwill never grow old. I'm not the same person I was last year, so the ballet should feel\ndifferent too (Croft 2006).\" The dancers have kept Revelations alive and have helped it\nevolve by bringing their own experiences to it.\nG.Chao 8\n\nREFERENCES\n\nAiley, Alvin. Revelations video 1986. Viewed: February 15, 2008 and April 18, 2008\n\nhttp://web.mit.edu/21m.670/www/unit-2.htm\n\nBlanco, Melissa. 21M.670 Lecture, February 21, 2008.\n\nCroft, Clare. \"Alvin Ailey's beloved masterpiece is still a revelation.\" Special to the\n\nAmerican-Statesman. Thursday, February 09, 2006.\n\nViewed: February 15, 2008\n\nwww.austin360.com/arts/content/arts/stories/xl/2006/02/9arts.html\n\nDeFrantz, Thomas. \"Alvin Ailey.\" Encyclopedia of African-American Culture and\n\nHistory. 5 vols. Macmillan, 1996.\n\nG.Chao 9\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21M.670 / WGS.591J Traditions in American Concert Dance: Gender and Autobiography\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Paper # 1: Due Tuesday, February 26, at the BEGINNING of class",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-670-traditions-in-american-concert-dance-gender-and-autobiography-spring-2008/7b9d64d86f3128efb971e62b5b1d4cb9_MIT21M_670S08_paper1.pdf",
      "content": "Traditions in American Concert Dance: Gender and Autobiography\n21M.670J/ WGS.591J\nSpring 2008 HASS-D CI-H\n\nPaper Assignment # 1\nDue Tuesday, February 26: at the BEGINNING of class. No e-mails, hard\ncopies ONLY.\nView the half-hour dance Revelations, and write a paper of 7-10 pages length which\naddresses this question:\nHow does the dance Revelations (Ailey, 1960) convey concepts of religion\nand social order?\nThe dance has four distinct sections. You may write in depth about one or two sections,\nor attempt to treat the entire dance as a whole. You might write about the use of basic\ncompositional techniques (weight, spacing of dancers, focus, effort) or you might write\nabout the overall effect of viewing the dance. You may look at the gender component of\nthe piece, and/or the historical component. You can situate the dance within the\nhistorical moment in which it was conceived and examine it through that lens.\nYou may wish to check some source material for information about the dance; you may\nconsult Thomas DeFrantz's entry in the Encyclopedia of African American Culture and\nHistory available in the Humanities Library at REF / E185.E54 under \"Alvin Ailey and\nthe Alvin Ailey American Dance Theater.\" The videotape is available in the Humanities\nLibrary \"An evening with the Alvin Ailey American Dance Theater\" GV1786.A42.A48\n1986. You may write about either the 1962 or the 1986 version of the dance, and view\neither or both versions to prepare your essay.\nYour paper must be typewritten, double-spaced, and thoroughly edited for spelling and\ngrammar. Composition counts! Try to make your writing lively and informative. Be sure\neach paragraph has a central idea, and that each sentence has a subject and verb.\nRemember, this paper should be treated as a writing exercise: grammar, spelling, and\npunctuation will count. All work submitted must be typewritten, double-spaced, and\nformatted according to Modern Language Association style. Your paper must include a\nproperly formatted bibliography and endnotes. For details of MLA style, see the Guide\nfor Writing Research Papers at http://owl.english.purdue.edu/owl/resource/557/01/.\nIf you need help with your writing, the Writing Center on campus offers a variety of\nsupport. See the last page of our class' syllabus for more information.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.670 / WGS.591J Traditions in American Concert Dance: Gender and Autobiography\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "PAPER # 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-670-traditions-in-american-concert-dance-gender-and-autobiography-spring-2008/217cbe76c0a24b3c405c11feb0fa5687_MIT21M_670S08_paper2.pdf",
      "content": "PAPER # 2\nDue Thursday, April 3rd, 2008.\nView the half-hour dance Fall River Legend and write a paper of 7-10 pages\nlength that addresses this question:\nHow does the dance Fall River Legend (De Mille, 1950) convey\nconcepts of cultural mores and cultural identity?\n\nThe dance has terse narrative structure.\nYou should not retell the dramatic plot of the dance; you should not provide a\nbiography of the choreographer.\n\nYou should attempt to create a critique of how specific gestures in the dance\ndefine characters, and how those characters define the society depicted in the\ndance and its mores. You should write about the theatrical elements the\nchoreographer uses to strengthen her depiction of the story. You should also\nwrite about how the dance suggests cultural identity and cultural structure in its\ninventions: its choreographic techniques, its design, its overall impact.\n\nBe sure to write about specific details in the dance, and the meaning that those\ndetails suggest to you. Here is where you would write about how a specific\nmovement phrase might suggest an idea to you. You don't have to write out what\nthe body/bodies are doing from beginning to end, but you do have to explain\nwhat the body/choreography is doing if you are using that specific movement\nvocabulary or movement phrase to make a point/argument.\n\nYou may wish to check some source material for information about the\nchoreographer. You may consult her entry in the International Encyclopedia of\nDance at GV1585.I586 1998 in the Humanities Library.\n\nYour paper must be typewritten, double-spaced, and thoroughly edited for\nspelling and grammar.\n\nComposition counts!\n\nTry to make your writing lively and informative.\n\nBe sure each paragraph has a central idea, and that each sentence has a subject\nand verb.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21M.670 / WGS.591J Traditions in American Concert Dance: Gender and Autobiography\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Paper # 2 Due March 20 â€“ How does the dance â€œFall River Legendâ€ (DeMille, 1950) convey concepts of Cultural Mores and Cultural",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-670-traditions-in-american-concert-dance-gender-and-autobiography-spring-2008/3c2be433ff75615b2b5fe92cb96407e5_MIT21M_670S08_sinhafall.pdf",
      "content": "Sinha 1\n\nAnila Sinha\n21M. 670J: Traditions in American Concert Dance and Gender Autobiography\nProfessor Melissa Blanco\n3 April 2008\nVictorian Society in \"Fall River Legend\"\nIntroduction\nThe dance \"Fall River Legend\" choreographed by Agnes DeMille in 1948 attempts to recreate\nthe social era in which a Victorian spinster, Lizzie Borden, was charged with the murders of her\nfather and stepmother in Fall River, Massachusetts in August of 1892. The dance is in the form\nof a ballet, a representation of traditional dance that was respected in Victorian society. Although\nLizzie Borden, often referred to as the \"Accused\" was historically never found guilty for the\nmurders, the dance starts with a narration of the conviction following the trial. This firm\nconfirmation of history's unsolved mystery serves to set up the theme of how a woman trapped\nin the Victorian cultural mores could be driven to commit such a heinous crime. If there were\nany question as to whether or not Lizzie was truly guilty, the theme of the performance would be\nimmediately undermined. This theme of portraying a woman's frustrations and captivity within\nVictorian society is then examined throughout the play by recounting the life of Lizzie Borden\nand what forces propelled her to inherently \"un-Victorian\" actions at the conclusion of the dance.\nIn Victorian society, the role of the woman was clearly defined to be one that exhibited pure\nfemininity in the form of grace, elegance and innocence (\"The Victorian Web\" 2). The Victorian\nwoman was to be social, but only with those who were deemed to be acceptable. A woman was\nonly to be emotionally and physically intimate with one man - her husband - and only within the\nprivacy of the home. While Lizzie's biological mother upheld these standards in the truest\nregard, Lizzie's stepmother took on the role of enforcing such values rather than exhibiting them\nherself. The constant oppression of her stepmother to shape her into a Victorian woman coupled\n\nSinha 2\n\nwith Lizzie's emotional abandonment by her father and eventually by her pastor drives her to\nmurder in cold blood. This production by the Harlem Dance Theater illustrates the stringent\nsocial and cultural mores of the Victorian era through portrayal of Lizzie's childhood,\nrelationship with the church and pastor, and society's reaction after the murders.\n\nChildhood\nFollowing the official conviction of Lizzie Borden, the flashback on the Accused's life\nbegins with her childhood, when she was arguably the happiest. Lizzie's biological mother and\nfather perform a duet while the child Lizzie watches, holding her mother's revered white shawl.\nLizzie's mother wears a white dress with a blue border to signify her purity outlined with\nsadness, foreshadowing her eventual untimely death. The outline in blue could also suggest\nLizzie's mother's own imprisonment within the role of a Victorian woman and mother.\nAlternatively, Lizzie's future stepmother wears black, a symbol of darkness and often evil. The\nuse of color to represent disposition relates to cultural identifications of personality during the\nVictorian era and is even present to a large extent today. The mother's movements are graceful\nand swan-like, representing the epitome of a \"successful\" Victorian woman. She makes use of\nher slender arms to extend upward coupled with her left foot raised horizontally above the\nground so that her dress opens in the shape of a half moon. However, a Victorian woman is never\ncomplete without a man and it is the father's hands delicately placed on her waist that finishe the\nVictorian picture. Lizzie's mother presents this pose in a variety of angles onstage, with each\ntransition guided by the hands of her husband. Her husband's guidance represents the inherent\nmale dominance in their relationship due to social norms.\n\nSinha 3\n\nWhen Lizzie's mother dies shortly after, the turmoil of Lizzie's entrapment in Victorian\nlife begins. Upon notice of her mother's death, she clings onto her father's leg for comfort only\nto be pushed aside by her future stepmother who also takes away her mother's white shawl. This\naction symbolizes the replacement of her mother by the \"evil\" stepmother who captivates the\nattention of the father in one swift motion, leaving the child Lizzie to grieve after her late mother\nby herself. The older Lizzie Borden who is observing this flashback begins to move her legs in a\nclockwise and counterclockwise motion while keeping her feet firmly on the ground, resembling\nan angry animal about to pounce and attack its prey. As she watches her father fall into the arms\nof the stepmother, her movements become quicker and more pronounced, eventually forming a\ncrouching pose that is distinctive of an animal ready to charge. There are two instances during\nsuch predator-like movements in which Lizzie stretches her arms towards the audience and runs\nin a forward half-circle in order to elicit sympathy and compassion from the audience due to her\nunfortunate predicament. These movements that resemble predatory behavior also symbolize the\ninner turmoil that she undergoes which starts to change her inherent character and shape her into\nthe person that will eventually become a murderer.\nWhen Lizzie enters into her newly structured household, the constraints on her life as a\nVictorian woman become more apparent and severe; she is not even allowed to look out the\nwindow. When the protagonist attempts to appeal to her father, he merely ignores her and looks\nat his hands in prayer. The frustration that Lizzie possesses with her stringently imposed female\nconstraints are manifested in her unceasing hand gestures, moving up and down the upper half of\nher body while snapping - an outlet for the energy that has built up inside her. This eventually\ncauses her to run towards the only social place that she is allowed to go as a Victorian woman -\nthe church.\n\nSinha 4\n\nChurch and Pastor\n\nDuring the middle of the play, Lizzie Borden befriends the church pastor and their brief\nduet together is reminiscent of the duet performed earlier by Lizzie's parents. The pastor's gentle\nhands guide Lizzie's waist as she glides from each graceful pose that extends her arms and legs\noutwards. Lizzie's father then quickly disparages this new relationship by ordering her inside\ntheir home. However, the pastor later returns with flowers - a symbol of friendship and even\nlove. Lizzie willingly accepts them and then falls into the arms of the pastor. Not only does this\nexemplify women's apparent dependence on men in Victorian society, but also shows Lizzie's\nemotional fall into the open arms of her new friend. When Lizzie's stepmother sees this\nunsanctioned relationship beginning to materialize, she does all that is in her power to prevent it\nfrom developing. This most clearly illustrates the stepmother's concern for propriety at the\nexpense of the happiness of others, a cultural more that was common in the Victorian era. In an\nattempt to impart the \"proper\" cultural norms onto her stepdaughter, she raises her forefingers to\nthe temples of Lizzie so as to brainwash her into the cultural mores of Victorian society.\nMoreover, the stepmother never dances throughout the performance. This is because dance in the\nVictorian era was considered a form of art and beauty - a quality the \"evil'\" stepmother does not\npossess.\n\nThe next scene depicts the church, a cultural center in Victorian society. The women\nwear traditional long dresses and are adorned with typical church hats that were common in the\nVictorian era. Moreover, the women wear bright colored dresses to symbolize the inspiration\ntheir religious order has given them to reach higher spiritual levels. The men wear traditional\nsuits and are never seen to be fully on their toes as the women ballerinas are. This is due to the\n\nSinha 5\n\nmale image of strength and power that does not come along with the instability when standing in\nsuch a classic ballet pose. The dance is characterized by both men and women joining their\npalms and moving side to side in prayer, eventually dropping to their knees in the ultimate\nreligious gesture. Everybody onstage is meticulously synchronized to show conformity that was\npervasive in Victorian society. In the dance, all the churchgoers form two lines and begin to\ndance in a circle onstage with the men leading and the women following as dictated by social\nnorm. Following this, all the men and women pair up and briefly dance with each other,\nillustrating the heteronormativity that was rampant in Victorian culture. Then, the women form\nan inner circle, the men form an outer circle and all members of the church kneel down and lift\ntheir hands in prayer. The synchronization of the subsequent motions further illustrates the\nobedience and submission that all members of the community willing endure in the name of\nreligion. Furthermore, when the members of the church stand up and nod their heads all at the\nsame time, it is clear that a lot of the Victorian values and cultural identity comes from the\nreligious sector of society.\n\nFollowing the piece with the members of the church community, Lizzie and the pastor\ndance in another duet where the pastor guides Lizzie by the arms back and forth across the stage.\nThe action serves to demonstrate once again how the male figure always serves as the controlling\nfigure, even in such an unorthodox relationship as the one between Lizzie and the pastor. A\nwoman's dependence on man is further entrenched when Lizzie falls backwards into the arms of\nthe pastor who catches her and brings her back up. However, despite such explicit representation\nof Victorian standards, this duet also displays Lizzie's true inner turmoil and angst in living in\nsuch a constraining society. The protagonist shows this by momentarily beating her chest and\nupper thighs, resembling a war cry. It is also interesting to note that while Lizzie reveals her\n\nSinha 6\n\ninner feelings, the pastor dances in the background by extending his legs upwards and dancing\non his toes - movements that are unprecedented by any other male in the whole performance.\nThese less masculine movements, as set forth by Victorian codifications may suggest the pastor's\nhomosexuality or the lack of sexual relationship between him and Lizzie. As the duet progresses,\nboth Lizzie and the pastor's movements become faster and involve more contact with the body\nshowing the growing intimacy they share. There is then a transition back into the church\ncommunity where Lizzie becomes fully integrated into and begins to find solace through\ninteractions with the community. However, it is important to note that when the men and women\npair for one last piece of the dance, Lizzie merely stands in the middle without a partner. This\nfurthers the notion that even at the church in the presence of her fellow townspeople, Lizzie still\nremains separate from the society and outside the social norms that the Victorian era put forth.\nThis could refer to Lizzie's possible homosexuality. Historical records reveal that Lizzie had at\nleast a two-year affair with a young actress named Nance O'Neil (Troy 3). However, in the\nVictorian era, homosexuality was not readily accepted, especially among women. Being forced\nto restrain another part of who she was from society because it was not part of the cultural mores\ncould have caused further grief for Lizzie.\n\nThe peace that Lizzie finds in the church is only momentary since Lizzie's stepmother\nreturns to further distance the protagonist from anyone she may potentially love. Once Lizzie's\nstepmother enters the stage, Lizzie's sharp movements indicate her fear in the presence of such a\nfigure of wicked authority. Lizzie grasps her head in a moment of desperation before quickly\nfalling to the ground, only to be picked up again by the pastor. Lizzie then kneels to the floor\nwith her hands over her ears indicating that she is disturbed by the situation. Then, the\nstepmother whispers something inaudible in the ear of the pastor that effectively changes the way\n\nSinha 7\n\nthe pastor thinks of Lizzie. He then places a hand on Lizzie's forehead, but the demoralized\nprotagonist promptly withdraws. The stepmother then takes the pastor away from Lizzie, thus\nsuccessful in breaking the relationship between the two. Lizzie exhibits her emotional distress by\nextending her arms outward towards the pastor who is walking away from her. The circles she\nmakes around herself with her arms stretched out also suggest how lost she becomes without the\nfriendship of the pastor, one of the few people who understand her. The actions taken by the\nstepmother in this scene were common in the Victorian era as intimate relationships between a\nwoman and a pastor were discouraged. Therefore, it can be inferred that the stepmother may not\nhave been inherently a villainous character, but simply a manifestation of the Victorian norms\nthat prohibited such a relationship to exist.\n\nAs Lizzie recalls her stepmother attempting to brainwash her, taking away her father, and\nnow the pastor, the emotional turmoil that she endures translates into anger as she decides to put\nan end to her misery. The white shawl is again placed on Lizzie's shoulders, an salute to her late\nbiological mother who represented pure and untainted femininity as imagined by Victorians\nduring such an era.\n\nSociety After Murders\n\nUpon killing her father and stepmother with an axe, Lizzie changes out of her blood\nstained clothes and wears blue to signify the grief that she carries with her actions. After a\nmomentarily mournful period, Lizzie runs out to the town and dramatically tells the town of the\nmurders. Upon hearing the news, the townspeople scamper around in panic and hysteria, also\nshown by the women jumping and twirling in midair to convey a sense of confusion and\ndramatization. With Lizzie and her comforters standing in the middle, the townspeople encircle\n\nSinha 8\n\nher and bend down towards her, symbolizing their sympathy and sorrow for Lizzie. However,\nwhen the bloody shawl and axe are brought out and laid in front of Lizzie, the people\nimmediately recoil away from the protagonist, fearful of her possible guilt. This quick change in\nfeelings towards Lizzie exemplifies the constantly changing attitudes that society has for people\nbased on the most recent events. These actions also demonstrate the lack of loyalty people have\nwhen in a group setting. Despite the mounting evidence against her, Lizzie continues her charade\nof mourning and grief upon seeing the bloody shawl and axe.\n\nHowever, Lizzie's reputation in society quickly changes as illustrated by the scene where\nLizzie runs around the stage and desperately knocks on the doors of townspeople to no avail.\nLizzie's quick and jumpy movements, especially with her hands, vividly express her anguish.\nThe pastor then comes in to calm his friend by holding her hands. Thus, even amidst the rumors\nand social gossip, the pastor remains faithfully by her side. This reveals how deep the\nrelationship between Lizzie and the pastor was in addition to the loyalty that the pastor held for\nLizzie. The pastor is contrasted with the rest of the society who walks in pairs (one man and one\nwoman as established by social norm) and condescendingly faces Lizzie before walking away.\nThroughout this scene, Lizzie's hands are constantly moving, a symbol of both her angst and\nguilt upon murdering her father and stepmother. When Lizzie reaches out and kneels one last\ntime in hopes of finding comfort, all the townspeople abruptly turn their backs towards her,\nrefusing to listen to her story.\n\nWhen the townspeople leave the stage, the pastor briefly kisses her on the cheek and then\nwalks away from her as well - the ultimate abandonment of Lizzie by one whom she loves.\nWhen Lizzie extends her arms in hopes of calling the pastor back, the pastor continues to walk\noff the stage, refusing to listen. This ultimate betrayal by the pastor closes the play with the\n\nSinha 9\n\nprotagonist looking up towards the sky in agony, as the freedom that she sought was still not\nattained upon the murders of her father and stepmother. Instead, the role of her stepmother as the\nauthority on social conduct was assumed by the townspeople who scorned her for her criminal\ndeeds, refusing to empathize with her plight. Ultimately, Lizzie's actions in the murders threaten\nthe idea of the nuclear family unit, a value revered by Victorian society. This can be considered\nironic since Lizzie's early childhood was spent in happiness while her biological mother was still\nalive. However, the untimely death of such a pure Victorian woman brought an end to Lizzie's\ndesire to become a Victorian woman. The subsequent negative influences she received from her\nstepmother, a proprietor of social standards, made Lizzie desire a life beyond what the social\nmores of Victorian society allowed. The oppression and rigid definition of the Victorian woman\nthat Lizzie feels she is forced to uphold to gain acceptance by her father and possibly by the\ntownspeople translates into anger and frustration, causing her to behave in a most \"un-Victorian\"\nmanner - murdering in cold blood with an axe.\nConclusion\n\nIn conclusion, the choreography by Agnes DeMille intensely illustrates the oppressive\naspects of Victorian culture that drove Lizzie to commit the murders of her father and\nstepmother. It is the frustrations and confinement that the protagonist felt throughout her life that\ncaused her mental anguish and torment. The movements throughout the production clearly\nsymbolize a storyline in which Lizzie is the most prominent victim - a victim of Victorian\ncultural mores that prohibit her freedom. Historical records exclude the emotion and turmoil that\nLizzie must have felt during her life and this performance is an attempt to give the audience\ninsight into her motives. The purpose of this dance is not to have the audience exonerate\nvindicate Lizzie, but merely to illustrate how the culture and Victorian norms may have\n\nSinha 10\n\ninfluenced Lizzie to commit such an \"unwomanly\" crime. The cultural norms that furthered\nLizzie's desolation begin with her childhood, are extended into her relationship with the church\nand the pastor, and conclude with the townspeople's behavior towards her upon hearing of the\nmurders and her possibility as a suspect. In childhood, Lizzie's stepmother takes away the\ncomfort of her father thus leaving the protagonist emotionally empty. This emptiness is briefly\nfilled by Lizzie's relationship with the pastor and the church where she finds peace. However,\nLizzie's stepmother takes that away from her as well, deeming it unfit for a Victorian woman to\nbecome so intimate with a pastor. When Lizzie murders her father and stepmother in hopes of\ngaining her freedom, she simply finds that the constraints her stepmother and father put on her\nhave been replaced by society who convicts her. Thus, this melodrama of a Victorian woman's\nquest for freedom concludes with the feeling that in such a culture, a female could not easily\nattain the freedom she desired.\n\nSinha 11\n\nWorks Cited\n\nTaylor, Troy. \"Lizzie Borden: History & Hauntings of this Famous Case\". Dead Men Do Tell\nTales. (c) 2004. <http://www.prairieghosts.com/lizzie.html>. 23 March 2008\n\"The Victorian Web\". Attitudes towards sexuality and sexual identity. 10 August 2006. Duke\nUniversity <http://www.victorianweb.org/gender/theory.html>. 23 March 2008\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21M.670 / WGS.591J Traditions in American Concert Dance: Gender and Autobiography\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21M. 670 â€“ Traditions in American Concert Dance: Gender and Autobiography",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-670-traditions-in-american-concert-dance-gender-and-autobiography-spring-2008/4576e550c641026de1825aa83386cd10_MIT21M_670S08_sinharevel.pdf",
      "content": "Sinha 1\n\nAnila Sinha\n21M. 670 - Traditions in American Concert Dance: Gender and Autobiography\nProfessor Blanco\n26 February 2008\n\nThemes in \"Revelations\"\n\nThe performance \"Revelations\" by Alvin Ailey reflects both black southern\nculture in the early twentieth century as well as its creators' childhood. Ailey once said\nthat the performance was based on \"blood memories\" that he had acquired from his years\ngrowing up in the South, particularly Texas. This perhaps explains the existence of blues,\ngospel, ragtime, and folk music that have all been incorporated in the dance performance.\nIn addition to this, Ailey endeavors to make bold social statements by addressing racism\nin the society where he grew up and most directly experienced such inequality. Ailey also\nstates that his dance company of primarily black people is itself a social and political\nstatement. By creating such a company, Ailey aimed to showcase the talent, beauty, and\nart of the African American heritage. Among this, Ailey also conveys concepts of\nreligion and social order that are inherent to Southern culture, particularly among those of\nAfrican American descent. In a program note Alvin Ailey once wrote:\n\"This suite explores motivations and emotions of Negro religious\nmusic which, like its heir, the Blues, takes many forms --\"true\nspirituals\" with their sustained melodies, ring-shouts,\nsong-sermons, gospel songs, and holy blues -- songs of trouble,\nof love, of deliverance.\n-- Ailey program note, Kaufmann Concert Hall YM-YWHA,\n31 January 1960 (DeFrantz 2)\nThe individual songs convey a deep sense of meaning independent of one another that\ncorrelate to such motifs of trouble, love and deliverance in the beginning, middle and end\nof the performance. These issues are all profoundly interconnected with the broad themes\n\nSinha 2\n\nof religion and social order since an individual can be inspired to experience such\nfeelings during religion and thus be motivated to help create and be part of a social order.\nAlvin Ailey divides the performance into three distinct sections in which he displays such\nthemes: Pilgrim of Sorrow, Take Me to the Water, and Move, Members, Move.\n\nPart I: Pilgrim of Sorrow\nThe first dance of the performance, \"I Been 'Buked,\" starts with the dancers\narranged in the middle of the stage in the form of a pyramid. This arrangement resembles\na ship that native Africans traveled by when they were forced to migrate west. The\nmovements of the hands and torso while in this pyramid are spread and elongated, yet\nswift, as if to resemble the oars of the ship. Such movements might have been drawn\nfrom the Graham Technique (a dance technique created by Martha Graham), which is\nbased on the principle of contraction and release in a movement that is similar to the act\nof breathing so as to create a current of energy though the body. The backs of the dancers\nare rounded during contraction and the chest is lifted in the release, making the\nmovement dramatic and expressive (Abrams 12).The pyramid structure also serves to\nexpress the social organization of people during the slave trade. At the front of the ship\nwere the few white slaveholders who controlled everyone else in the line of command, all\nthe way down to the slaves themselves who constituted the majority of the ship. The\nrepeated phrase \"I've been scorned\" in the lyrics of the music serve to more directly\nconvey the suffering of thousands of Africans during the slave trade. Towards the end of\nthis first piece, the dancers come back to form the ship-resembling pyramid structure\nafter briefly diverging, so as to extend one hand and slowly lift up the other to equal its\nheight, only to abruptly bring it back down after it almost reaches equality. This subtlety\n\nSinha 3\n\nalludes to the civil rights movement that has slowly progressed in America, especially\nduring the time that Alvin Ailey created this performance. However, such a striking hand\ngesture also represents the hardships that generations of African Americans have had to\nendure socially. These characteristics create a powerful impression in the audience of the\ntroubled past of African Americans, especially of those in the South. Ailey also suggests\nthat social order today has been affected by such a past in black history. Sociologically,\nthe diverging of the black bodies from the rigid pyramid structure may also represent the\ndispersion of African Americans across North America where members from different\ntribes and cultures in Africa were split to form new groups and a common culture while\nbeing enslaved.\n\nIn the next piece, titled \"Fix Me Jesus,\" a man and woman show dependence on\none another both physically and emotionally. This dance as well as two other couples\nperformances in the show highlights classic ballet movements such as extensions of limbs\nand protrusion of the torso during dance. The arms of the woman are lifted high and\ncurled inward while her leg is extended outward, horizontal to the ground and supported\nby the man who holds her at her extended thigh as well as around the waist. The man will\nalso occasionally pick up the woman as she graciously displays her upper body and while\nher legs shape in a half moon. This suggests that Ailey could have drawn inspiration from\nboth his ballet background as well as from the Dunham technique (created by Katherine\nDunham) which employs the styles of ballet, modern dance, jazz and basic folk patterns\n(Abrams 12). Incorporated into these movements, are intricate balance poses such as the\nman holding the woman by the underarms, then waist, and finally solely by the neck.\nThis illustration of balance and support might represent the intensely personal\n\nSinha 4\n\nrelationship with Jesus. These poses also reflect the trust that such people hold in their\nSavior and His power to save those in need. In this depiction, the people waiting to be\nsaved were the slaves who were being mistreated by slaveholders and were regarded as\nbelow the bottom of the social ladder with almost no hope of upward mobility. This is\nmost clearly exemplified when the woman falls backward and the man (most likely\nrepresenting Jesus) is there to catch and bring her full body back to an upright position\nwhere she can continue to dance. The dance ends with the woman standing on the man's\nknee, reaching up to the sky - the most direct way of showing a call upon Jesus for\nsalvation. Once again, this performance shows how people within the African American\nculture treasure hope and have faith in the idea of salvation by Jesus, even in times of\ndesperation.\n\nAs such, both of these major portions in the first third of the performance express\nthe deep suffering and sorrowful past of African Americans starting from their ancestors'\npilgrimage west. However, Ailey also makes it a point to demonstrate how people have\ncalled upon Jesus and their Christian roots in order to sustain faith in the idea of salvation\nand the ending of suffering. These concepts of religion based on social order also offer a\nnice transition into the middle third of the performance that elucidates how religion has\nbecome such an intricate part of the African American social culture.\n\nPart II: Take Me To the Water\n\nThe second part of the performance centers on the social culture of Black\ncommunities in the South during the time that Ailey was growing up. Such communities\nwere often tightly connected to, and very much rooted, in Christian values. This section\n\nSinha 5\n\nof the performance most vividly incorporates the spirituals into the dance and movements\nonstage. Spirituals are folk songs that are sung both in church and informally outside of\nthe church to describe events in the bible or personal religious experiences (Abrams 10).\nThese spirituals have largely become part of America's common social and musical\nlanguage and can trace their origins to Africa (Abrams 10). When the Africans were\nbrought to the United States beginning in the 1700s, the enslaved people left a record of\ntheir lives through their music which traveled with them across the continent where it was\npassed down from generation to generation and deeply influenced the growth of\nAmerican music (Abrams 10).\nThe first dance of this section, \"Processional/Honor, Honor\", most directly\nillustrates the social and religious practice of baptizing in a river while dressed in all\nwhite. The color white in this context is the symbol for the purity that one attains once he\nor she is baptized. The most direct allusion to this aspect of Christianity is when the\nvocalist sings \"hand me down to the river,\" the physical act of bathing in the water for\ncleansing and purification. An interesting component of this dance is also the contrast in\nmovements before the woman steps into the artificial body of water created on stage, and\nafter she starts wading in the water. Before stepping in, the woman had graceful yet\nsomewhat sharp movements, especially in the arms and hands. Her torso would remain\nfirm while her arms extended outward only to be quickly retracted towards her body\nagain; yet the path her arms would follow would be curved so as to maintain the notion of\ngrace and femininity. However, upon stepping into the water, the movements of the\ndancer became more fluid and resembled the properties of water itself. Her torso visibly\nmoved in a curved fashion while her arms and even her legs extended outward and were\n\nSinha 6\n\nnot contracted quickly as they would have before she stepped into the water. This shows\nAiley's conception of oneness with water and how deeply it can affect the individual both\nreligiously and intuitively. Religiously, the individual can attain spiritual attributes while\nin the water (especially during baptism) which translates into intuitive movements as\nshown by the woman in the performance.\nThe following dance, \"Wade in the Water,\" keeps the water theme but uses it in\nan entirely different context. Instead of a duet, many other dancers enter the stage, and\njoin the original man and woman who bend on the floor and move their upper body up\nand down in a symbol of water running through their body so as to spiritually enlighten\nthem. In the background there are dancers that run across the stage as if they are running\naway (from a slaveholder perhaps). This song alludes to the history of how slaves learned\nto give double meaning to the religious songs they sang. Negro spirituals contain\nmessages that white slave masters did not know about in \"sorrow songs\" which expressed\nthe deep suffering the slaves endured and their yearning for redemption and peace in\nheaven (Abrams 10). This can been seen through the movements of the background\ndancers as they first lift their hands to the sky after briefly touching the floor and then\nmove one step to the right and repeat the process until all are offstage. This particular\nsong was used as a medium of communication between slaves. When a slave ran away\nand the master discovered his absence, the other slaves on the plantation would sing\n\"Wade in the Water\" so that slaves on the neighboring plantations would hear the song\nand sing along so that the slave would know that he should go to the river so that the\nbloodhounds would not be able to follow his scent (Abrams 13). As all the performers\nexit the stage, each dancer conveys this method of communication by responding to the\n\nSinha 7\n\nmovements of the preceding dancer: as the first dancer lifts his hand and briefly touches\nthe ground, the next performer does the same which initiates a similar signal that moves\ndown the line. This deeply rooted aspect of black history and culture reflects the social\norder and norms that African Americans adhered by in order to protect a member of their\nsociety, exemplifying the cohesiveness of such a culture despite its sorrows and pain.\n\nIn the next piece, \"I Wanna be Ready\" a sole man dressed in white starts on the\nfloor of the stage. The repetition of the phrase \"I want to be ready when I put on my long\nwhite robe\" is a metaphor for the man's desire to have his sins absolved before he dies.\nThe man starts on the floor because the sins and guilt of his past is weighing him down;\nthe upward movements made by not only his hands but also by his whole body symbolize\nthe man's aspiration towards the heavens. This religious value is clearly shown to be\nevident in Alvin Ailey's culture while he was growing up. The requirement of remorse\nand regret in order to fully achieve salvation is a very prominent ideal in the Christian\nbelief system.\nThis dance most intensely incorporates the Horton technique (created by Lester\nHorton) where the movements explore how many different ways the body can move so as\nto give a feeling of strength and energy. During the midpoint of the dance, the man\nassumes a bird like pose with one of his legs stretched horizontally out, perpendicular to\nhis extended hands that flap on either side of his body. This bird-like stance symbolizes\nthe man's yearning for freedom from his chains of bondage. This bondage could be\ninterpreted in both a social and religious context. Socially, Ailey could be referring to the\nbondage of the rights of African Americans, set forth by American society. However, this\nbird pose seeking for freedom could also represent the freedom that will be attained after\n\nSinha 8\n\nhis sins have been absolved through remorse. This not only makes the dance particularly\npowerful aesthetically, but also shows the determination of the man to attain his freedom\nboth socially and religiously.\n\nPart III: Move, Members, Move\nThe last portion in the performance starts with \"Sinner Man\" where three men\ndressed in black enter into a stage with an intensely red background. The lighting of the\nstage rapidly changes to specific portions of the stage, yet the stage as a whole remains\nrelatively dark when compared to the other dances in the performance. The three men\ndance to a song that talks about the sins that men have made historically in the Bible.\nTwo such stories are that of the story of Samson and the story of Adam. In the story of\nSamson, a Herculean figure, a woman named Delilah asks Samson where he gets all of\nhis immense strength from and because of Samson's attraction towards the beauty of\nDelilah; he reveals to her that his strength comes from his hair. With such knowledge,\nDelilah cuts off Samson's hair so that he is \"weak as any other man\" (Abrams 7). The\nstrength of Samson is illustrated by a solo where the dancer keeps his arms outstretched\nwhile balancing on one foot and then spinning around - a mark of power, might, and\nsteadiness. Then, the dancer's strength is quickly disintegrated as he falls to the ground\nbackwards on one hand and then reverts to get back up and protect himself by extending\nan arm outwards, but to no avail. The dancer stretches back upwards in an attempt to seek\nhelp from God, but falls back to the floor frontwards with his hands stretched in front of\nhim. This story attempts to illustrate the repercussions of going after pure lust and\nbreaking an oath with God. The similar story of Adam and Eve is also recited within the\n\nSinha 9\n\nlyrics of this song where Adam disobeys the word of God when eating an apple from the\nGarden of Eden. These biblical accounts were common practice in black culture so as to\nteach children both about Christianity as well as the moral and social values instilled in\nsuch stories. A repeating theme in this dance is that of \"God a mighty gonna cut him\ndown\" which is illustrated by the men reaching up but then suddenly releasing back down\ntowards the ground, as if physically struck by God. The swift movements (hands and feet\nstretched outwards immediately before spinning around) by the men also portray the\ndesperation and the underlying theme of running away from ones sins. The dancers move\nall around the stage to signify the instability of such sinners who, as the lyrics point out,\nwill eventually be cut down by the Lord.\nThe last dance of the performance titled \"Rocka My Soul in the Bosom of\nAbraham\" is more informal and light-hearted but keeps with African American social\nculture. The dancers are all synchronized and placed in a strictly symmetrical pattern on\nstage illustrating the strong influence that cultural values had members of the society to\nadhere to the norms. The song starts with women coming on stage dressed in long yellow\ndresses, Sunday hats, and holding a fan in one hand and a stool in the other. This\nresembles the traditional dress that African American women might wear to Church. The\nmusic is gospel music where clapping and the \"call-and-response\" technique are\nincorporated so as to truly replicate the aura of a Southern Church. The women make use\nof their fans which they hold in the their right hand as they circle their chairs and move\ntheir upper body back and forth in a way that make their lower body move so that their\ndress flows outwards. Such movements are both light-hearted and appear fun as they\nmatch the upbeat tempo of the music. The video of the performance shows a close-up of\n\nSinha 10\n\na few dancers who appear to be smiling and even laughing in this piece that creates a\ncheery mode on which to leave the audience with. In an interview, Alvin Ailey himself\nsaid that although his performances were filled with political, social, and religious\nstatements, the audience came to the show also to be entertained. Thus, this upbeat song\nis most likely to get the audience involved while still keeping with the theme of\nvenerating Southern black culture in America.\n\nIn conclusion, through the performance \"Revelations\" by Alvin Ailey, concepts of\nreligion and social order are interspersed through various mechanisms in each section of\nthe dance. In the first portion, \"Pilgrim of Sorrow,\" Ailey shows the history of African\nAmerican culture and how it has shaped the generations today that resulted from such a\nmigration. The second portion, \"Take Me to the Water\" shows how spirituals that came\nfrom such a past have influenced the religious and social culture of the South through the\npursuit of salvation. The last portion of the performance, \"Move, Members, Move\"\nconnects all the previous pieces of the performance into a common message of hope and\nmotivation that energizes the audience into taking home the deep aspects of the dances.\nThe titles of each section support such an analysis: \"Pilgrim of Sorrow\" refers to the\nAfrican American history that has influenced the religious and social culture put forth by\n\"Take Me to the Water\" and finally ends with an appeal to the audience to interact and\nget involved with the statements put forth by \"Revelations\" so as to better society through\nthe mechanisms and values seen in Christianity.\n\nSinha 11\n\nWorks Cited\nAbrams, Laura et al. \"Alvin Ailey American Dance Theater.\" University of California\nBerkley. Copyright (c) 2007 Cal Performances\n<http://64.233.169.104/search?q=cache:10BskPsDny4J:cpinfo.berkley.edu/inform\nation/education/pdf_files/2006/study_guide_ailey.pdf+Revelations+Alvin+Ailey+\nlyrics&hl=en&ct=clnk&cd=13&gl=us&client=firefox-a>. 25 February 2008.\nDeFrantz, Thomas. \"Dancing Revelations: Alvin Ailey's Embodiment of African\nAmerican Culture.\" Oxford University Press. New York: 2004. 25 February 2008.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.670 / WGS.591J Traditions in American Concert Dance: Gender and Autobiograph\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\ny"
    },
    {
      "category": "Resource",
      "title": "21M.670: Traditions in American Concert Dance and Gender Autobiography",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-670-traditions-in-american-concert-dance-gender-and-autobiography-spring-2008/d729063d4bc88216c03e88f420e637f6_MIT21M_670S08_sinhafinal.pdf",
      "content": "Sinha 1\n\nAnila Sinha\n21M.670: Traditions in American Concert Dance and Gender Autobiography\nProfessor Melissa Blanco\n15 May 2008\n\nGender and Individuality in The Catherine Wheel\n\nIntroduction\n\nThe final portion of Twyla Tharp's The Catherine Wheel (1981), entitled the \"Gold\nsection\" can be regarded as a vivid exploration of how gender influences both individuality and\nsocial relationships. The title \"The Catherine Wheel\" comes from a type of firework consisting\nof a powder-filled spiral tube, or an angled rocket mounted with a pin through its center. When\nignited, such a wheel will rotate quickly and produce a display of sparks (\"Catherine Wheel\" 1).\nFor the purposes of the \"Gold section, this Catherine Wheel, shown in multiple forms at the\nbeginning of the section, serves to introduce how Tharp describes the relationship between\ngender and individuality. The uniform energy that the Catherine Wheel gives off enables it to\nspin and produce fireworks - in a similar fashion, the combined energy of individuals involved\nin a functional relationship can produce remarkable explorations of the human body that match\nthe phenomenon of the fireworks a Catherine Wheel emits. In the golden section, Tharp\ndeconstructs some conventions of traditional Western concert dance, demonstrates how such a\ntype of dance born in a patriarchic society represses specifically the female body, and then\nredefines a new kind of heterosexual relationship that can then be symbolized by a Catherine\nWheel.\n\nI. Deconstructing Traditional Western Concert Dance\n\nSinha 2\n\nIn order to depict the true beauty of a functionally independent relationship, Tharp\nstarts with depictions of how the male and female bodies have historically functioned in Western\ndance. The gold section begins with a rendition of traditional ballet where a man and woman\ndance within the confines of their strictly defined roles: the woman twirls and leaps while the\nman stands and waits to catch the woman. In one of the following sections, alternating pairs of\nmen and women dance in synchronized movements diagonally across the stage. As soon as the\nsecond pair enters, the previous pair promptly leaves the stage. The synchronization of the pairs\n- first two women, then two men and then finally two women - once again leads the viewer to\nobserve how distinct and separate each gender is defined, yet how uniformly the members of\neach sex adhere to gender roles. In this sense, Tharp shows how the individualities of both man\nand woman can be confined in the traditional roles expected in classical dance forms. Doris\nHumphrey supports this idea of limited creativity by using the example of traditional ballet. She\nwrites ballet is \"limited and suffered from arrested development - a permanent sixteen...So well\nestablished was the formula over many hundreds of years that, as the twentieth century dawned\nwith its flood of new ideas, there was considerable resistance to any change from the light love\nstory and the fairy tale, and there still is\" (Humprey 15). As female choreographers, both\nHumphrey and Tharp are able to see such characteristics evident in traditional Western concert\ndance because of the possible parallels they may have drawn from the societies they lived in.\nAs a subsequent contrast, multiple men and women dressed differently dance onto the\nstage using different movements, angles, and directions while keeping the same beat. One man in\nthe front of the stage even wears a skirt and dances in movements traditionally identified with the\nwoman such as continuous twirls and extension of the leg. These expressions of individuality\nserve to explore the ways in which traditional gender roles can be rejected to create new realms\n\nSinha 3\n\nof choreographic freedom for both men and women. These innovative possibilities can then\nbetter express the uniqueness of each dancer's interpretation rather than his or her ability to\nportray what is expected given their gender.\n\nAs a departure from the heterosexual dyad, one movement phrase involves two women\nand even includes the man leaping by himself in a gesture that highlights his own individuality\napart from the choreographic demands of partnering. The explorations of gender roles further\nexpand with the depiction of a trio of men dancing onstage. One man lifts the other man, who\nthen leaps and wraps his leg around his supporter. Simply the presence of three dancers all\ninvolved in a common relationship opens up the prospect of other types of \"pairing.\" The\nabsence of a woman in the relationship challenges heteronormativity, a hallmark of classic\nballets and traditional dance.\n\nTharp later reintroduces a trio comprised of two female and one male dancer, that\nfunction with a different purpose. While the male dancer slowly yet barely lifts one of the female\ndancers up to an insignificant height, the other female dancer jumps and extends to greater\nheights as she dances around the couple. The contrast between the limited nature of the couple\ndancing with the freedom of the solo female dancer (who has the ability to reach greater heights\nsince she is not bounded by the limiting hands of the male dancer) serves to highlight Tharp's\nintention of expressing individuality beyond the bounds of traditional Western concert dance. In\nthis sense, Tharp conveys the same message of how the customary roles of gender that produce\ndance pieces do not utilize the full capability of bodies due to the repression of individuality. An\nexample of the full deconstructive ability that dance has to question gender roles is further\ndeveloped by Tharp at the end of this section when two female dancers, standing on opposite\nsides, lift up the male as he decoratively displays his body midair.\n\nSinha 4\n\nII. Repression of Female Individuality\n\nOne of Tharp's messages conveys how specifically the female body is repressed during\ntraditional western concert dance. She choreographically indicates how a woman is shaped by\nthree significant male roles: father, brother and lover. As the three men bend her limbs, she\nassumes a variety of poses through no will of her own. Tharp uses this to depict how such\nimportant men in a woman's life maintain her subversive role both in society and domestically.\nThe section begins with the men passing her from one set of hands to another, symbolizing how\na woman living in a patriarchal society gets handed from her father's household to her husband's\nhousehold in one quick motion. While she is being given away to her next male dominator, the\nfemale dancer moves her feet against the direction in which her carrier moves, signifying her\npossible discontent due to lack of freedom.\nTharp continues to demonstrate how codified gender roles represented through restrictive\nmovements confines the female body. When the man and woman dance steps similar to the\ntraditional Western concert stage dance, her movements are slower and all of her extended limbs\ngradually move back towards the core of their body. Moreover, the viewer can see the energy of\nthe movements that was once displayed as outward turn inward to replicate the tension between\nthe male and female body. Such movement phrases characteristic of this classic male and female\ndynamic include the women leaning on the man while she uses her legs to create a variety of\nposes. The female's dancer's legs are often regarded to be one of the most sensual parts of the\nballerina. The woman also slides underneath the man at various points, as if to physicalize the\nsubordinate role of women in patriarchy. Susan Leigh Foster analyzes this by noting that \"She\nand he do not carry equal valence. She is persistently put forward, the object of his adoration. She\n\nSinha 5\n\nnever reaches out and grabs him but is only ever impelled towards him, arms streaming behind in\norder to signal her possession by a greater force\" (Foster 2). When the woman is finally released\nfrom the grasps of the man who firmly holds her in place, her body moves freely and reveals the\nvariety of ways her body moves. This female dancer twirls before bending to the floor and\nslowly extends back upward so that she can then stretch her limbs simultaneously in different\ndirections. Here, the female body becomes self-enlightened, expressing her individuality that\ndoes not necessarily correspond entirely with either roles in classical dance.\n\nIII. Redefining Heterosexual Coupling\n\nAfter the rigidity of observed traditional roles in Western concert dance is deconstructed\nin the first portion of the golden section, Tharp begins to redefine how a functional male/female\nduo can create an atmosphere whereby both partners express individuality. In the next section, a\nmale and female couple enters the stage and the woman wraps her legs around the man's waist\nwhile she extends her torso backwards, facing him. Tharp uses this movement phrase to\nrecognize the need for such a relationship to exist so that self-discovery can occur, even outside a\nromantic relationship. The following movement phrase furthers the idea of a platonic\nrelationship between a man and woman when both the man and woman dance separate\nchoreographies, yet to the same beat. A quick transition suddenly occurs into first a female solo\nfollowed by a male solo where each dancer explores the extent of his or her own body's\nmovements. The female dancer expresses her uniqueness by what may seem to be traditionally\nfeminine movements, but in fact represent her extension of her role as a woman, creating a new\nstyle. She characterizes this by twirling with more power as well as extending her limbs farther\nthan before so that her body fully displays the muscles that drive her independent movements. In\n\nSinha 6\n\na similar manner, the male solo features classically masculine movements such as high jumps\nand spinning with visibly accumulating speed so as to demonstrate the power and might he\nholds. However, he also expresses a softer side by momentarily bending down with his hands\noutstretched in front of him before gliding back up to spin his body angularly. In this transitory\nstep, the man exposes an uncharacteristically delicate side. Other such movements include an\nextension of the leg upward followed by a bend backward so that his head is unsupported by his\nneck. Moreover, his torso is no longer linear - a position never required of danseur for a classic\nballet performance. These phrases contrast with traditional Western concert dance where \"the\nmen keep their heels together and their feet more or less flat on the ground...they are careful to\nkeep their hips stationary, because a man who sways his hips from side to side looks effeminate\"\n(Jonas 19). Thus, the hints of non-classic gender roles behind the individual expression\ncommunicate that each dancer is not simply a \"man\" or \"woman\" but instead a result of the\ncombination of techniques traditionally identified with one or the other. While the female dancer\nmay embody more \"feminine\" techniques and the male more \"masculine,\" this does not exclude\nthe possibility of combinations from both choreographic styles to make individuals unique.\n\nTaking a broader look at these newly defined relationships of a man and a woman the\nnext section incorporates multiple couples who play off each other so that the individuality of\neach dancer becomes part of a larger context. These couples possess greater energy visible by the\nincreased heights of women when the men lift them off the ground. The couples suddenly break\naway to do their own individual dances that before immediately coming back together in unison.\nThis structure of movements show how important both interdependence and independence are in\nartistic expressions of dance.\n\nSinha 7\n\nTharp illustrates a man's discovery of his own body outside of his role as the supporter\nfor a woman. This male solo consists of a dancer who bends his torso both back and forth and\nmakes use of his knees by bending them towards the ground before jumping back up to full\nheight and extending back. He then spins around with one leg bent backwards and his head\npointed upwards. These movements are the opposite of what a danseur would be expected to\nhold due to the strict requirement of keeping the torso rigid and linear with the head set upright\non a firm neck. After the male dancer shatters the expectations of an accomplished danseur, he\nbegins to explore other areas of his body by moving his head, neck and torso in circular motions.\nHe then continues to flail and shake his limbs in an unorganized fashion before reverting back to\nspinning, allowing a transition to the next solo. The new male soloist makes use of discoveries\nmade by the previous one in order to create a cohesive movement phrase that remains unique yet\naesthetically organized.\n\nOnce again, Tharp shows her contemporary redefinition of couples dance by illustrating\ntwo different ways in which such a relationship can highlight individuality. In a new section, the\nmale and female dancers dance separately before coming together when the woman completely\nleans on the man in an ultimate demonstration of absolute trust. Then, the woman lifts her own\nleg in a classic ballerina pose, but the man does not hold or guide her; instead he creates a new\npose of his own by extending his arms. This collaborative effort in the expression of\nindividuality despite coupling, results in both dancers reaching their full potential not with the\nhelp of their partner, but by the ability of their partner to inspire such expression. The balance in\nstructure is then shown by the couple holding hands and crouching down so that their weight is\nbalanced by one another. This pose shows how no one figure - man or woman - dominates over\nthe relationship; instead, both dancers have an equal freedom in expressing their individuality.\n\nSinha 8\n\nThe second couple serves to convey the same message through new choreographic\nexpression. This couple shows the increase in energies that result when two dancers have the\nability to control their method of movements and are not constrained to simply representing what\nis expected. Not only are the lifts of the woman higher, but the choreography extends showing\ndifferent results that do not end with the woman simply landing back to her feet on the ground.\nFor example, when the man lifts the woman extremely high, she jumps out of his hands and\nlands with her whole body on the floor. She then performs a floor movement phrase before\nrejoining her partner. Another deviation from normal lift patterns occurs when the woman is\nplaced on the man's shoulders and she lets her body fall backward against the back of her\npartner. In the last segment of this duet, Tharp reinterprets earlier phrases of the choreography\nthat showcase the woman jumping and wrapping her legs around the man's waist. However,\ninstead of having a contained strained tension (characterized by the slower and less firm\nmovements), the couple starts to spin around and the woman moves her torso forward and back\nso that her upper body oscillates as the man rotates. This most directly alludes to how the\nenergies of a couple dancing must be expressed outwardly - similar to a Catherine wheel that\nexudes fireworks when spun around in uniform motion. As the couple exit, each dancer\nalternates in running forwards and back. While doing this, the two dancers never lose eye contact\nwith one another, symbolizing the powerful relationship that can occur by playing off their\nrespective partners actions.\n\nConclusion\n\nThe last portion of the golden section brings together all the elements that Tharp has\nexplored throughout the piece. Multiple dancers enter, and either couple to form a redefined\n\nSinha 9\n\nheterosexual relationship, or remain dancing solos. In either case, all the dancers have the\nchoreographic freedom to express their individualities. The increase in tempo combined with\nexplorations of non-typical gender movements creates a new dynamic on which to express the\nindividual dancing body. Furthermore, the presences of trios onstage introduce the possibility of\na man and a woman to engange in a non-platonic relationship. Thus, Tharp uses the golden\nsection in \"The Catherine Wheel\" to deconstruct the traditional heterosexual coupling in Western\nconcert dance, to demonstrate the repression of the female body in the patriarchic society in\nwhich Western concert dance was born, and to redefine her interpretation that expresses the\ndancer's individuality. In this sense, Tharp encourages her viewers to future choreographers to\ncontinue to improve upon this fundamental aspect of modern dance.\n\nSinha 10\n\nWorks Cited\n\n\"Catherine Wheel.\" Wikipedia Foundation Inc. 1 February 2008 <\nhttp://en.wikipedia.org/wiki/Catherine_wheel_%28firework%29>. 8 May 2008.\nFoster, Susan Leigh. \"The Ballerina's Phallic Pointe.\"\nHumphrey, Doris. \"The Art of Making Dances.\" A Dance Horizons Book. Princeton Book\nCompany. Princeton, NJ.\nJonas, Gerald. \"Dancing: The Pleasure, Power, and Art of Movement.\" New York: Harry N.\nAbrams, 1992.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n21M.670 / WGS.591J Traditions in American Concert Dance: Gender and Autobiography\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Some ways to consider movement/movement quality",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-670-traditions-in-american-concert-dance-gender-and-autobiography-spring-2008/f371366f91089e5188765336337c2b7e_MIT21M_670S08_movement.pdf",
      "content": "Some ways to consider movement/movement quality:\nTension\n\nRelaxation\nRising\n\nSinking\nOpening\n\nClosing\nAdvancing\n\nRetreating\nStillness\n\nPerpetual Motion\nGiving (Gravity)\nResisting (Gravity)\nTiming\nRhythm, complex rhythm, complex rhythmic isolations\nCoordination\nWeight Shift\nDirectionality: Up/down/forward/backward/sideward\nStrong/Bound/Sustained/Direct movement qualities (Laban)\nFree/light/sudden/indirect movement qualities (Laban)\nDoris Humphrey's ordering of body positions from most powerful to least:\n1. Facing forward\n2. Facing diagonal\n3. Side to Side\n4. Around\nShapes in space: lines, circles, diagonals, squares\nSolo/duet/trio/quartet, etc., -- How does the amount of bodies on the stage affect the\nperception of the dance?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.670 / WGS.591J Traditions in American Concert Dance: Gender and Autobiography\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}