{
  "course_name": "Transport Processes",
  "course_description": "Principles of heat and mass transfer. Steady and transient conduction and diffusion. Radiative heat transfer. Convective transport of heat and mass in both laminar and turbulent flows. Emphasis on the development of a physical understanding of the underlying phenomena and upon the ability to solve real heat and mass transfer problems of engineering significance.",
  "topics": [
    "Engineering",
    "Chemical Engineering",
    "Transport Processes",
    "Science",
    "Physics",
    "Thermodynamics",
    "Engineering",
    "Chemical Engineering",
    "Transport Processes",
    "Science",
    "Physics",
    "Thermodynamics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nRecitations: 1 session / week, 1 hour / session\n\nTexts\n\nRequired\n\nIncropera, Frank P., and David P. DeWitt.\nFundamentals of Heat and Mass Transfer\n. 5th ed. New York, NY: John Wiley & Sons, 2001. ISBN: 9780471386506. Including software tools, users' guides and associated CD.\n\nAdditional References\n\nBird, R. Byron, Warren E. Stewart, and Edwin N. Lightfoot.\nTransport Phenomena\n. New York, NY: John Wiley & Sons, 1960. Also 2nd ed. 2001. ISBN: 9780471410775.\n\nCussler, E. L.\nDiffusion: Mass Transfer in Fluid Systems\n. 2nd ed. Cambridge, UK: Cambridge University Press, 1997. ISBN: 9780521564779.\n\nKreith, Frank, and Mark S. Bohn.\nPrinciples of Heat Transfer\n. 6th ed. Pacific Grove, CA: Brooks/Cole, 2000. ISBN: 9780534375966.\n\nMiddleman, S.\nAn Introduction to Mass and Heat Transfer\n. New York, NY: John Wiley & Sons, 1998. ISBN: 9780471255369.\n\nHolman, J. P.\nHeat Transfer\n. 8th ed. New York, NY: McGraw-Hill, 1996. ISBN: 9780078447853.\n\nMills, Anthony F.\nHeat and Mass Transfer\n. Chicago, IL: Irwin, 1994. ISBN: 9780256114430.\n\nModest, M. F.\nRadiative Heat Transfer\n. Burlington, MA: Academic Press, 2003. ISBN: 9780125031639.\n\nWelty, J. R., C. E. Wicks, R. E. Wilson, and G. Rorrer.\nFundamentals of Momentum, Heat, and Mass Transfer\n. 4th ed. New York, NY: John Wiley & Sons, 2000. ISBN: 9780471381495.\n\nAssignments\n\nReading assignments are listed on the syllabus. Additional reading assignments may occasionally be announced in class.\n\nHomework assignments will be given out on Wednesdays and will be due at the beginning of class the next Wednesday, unless otherwise specified.\nNo late homework will be accepted.\n\nRecitations\n\nRecitation sections will be devoted to working example problems. Problems will be handed out in class the Wednesday before recitation. You should work the problems to the best of your ability before coming to class on Tuesday. Students will be called on in recitation to work problems. There will be a ten minute\nclosed book\nquiz during certain recitations. The problems will be drawn from the material contained in the lectures, text readings, or the homework. Example problems scheduled to be covered that day are likely to be emphasized. We will strive to emphasize concepts rather than mathematical details, but the problems may be quantitative.\nThe lowest quiz grade will be dropped. There will be no make-up quizzes.\n\nLabs and Exams\n\nThere is a laboratory component to the course consisting of two experiments: a conduction and a heat exchanger experiment. Additional details on the labs can be found on the Heat Transfer Project website. There are three one hour exams and a final exam.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nHour Exams (3)\n\n45%\n\nFinal\n\n25%\n\nHomework\n\n10%\n\nIn-class Quizzes (Drop Lowest Grade)\n\n10%\n\nLabs\n\n10%\n\n10.302 Policy on Collaboration\n\nThe fundamental principle of academic integrity is that you must fairly represent the authorship of the intellectual content of the work you submit for credit. In the context of 10.302, this means that if you consult with others (such as fellow students, TA's, faculty) in the process of completing homework, you must acknowledge their contribution in any way that reflects their true ownership of the ideas and methods you borrowed.\n\nDiscussion among students to understand the homework problems or to prepare for laboratories or quizzes is encouraged. Copies of previous year's problems and quizzes (\"bibles\") will be made available and are considered useful in the educational process.\nCollaboration on homework is allowed as long as all references (both literature and people) used are named clearly at the end of the assignment.\nWord-by-word copies of someone else's solution or parts of a solution handed in for credit will be considered cheating unless there is a reference to the source for any part of the work which was copied verbatim.\nFailure to cite other student's contribution to your homework solution will be considered cheating.\nOfficial Institute policy regarding academic honesty can be found in the MIT Bulletin Course and Degrees Issue under \"Academic Procedures and Institute Regulations.\"\n\nStudy groups are considered an educationally beneficial activity. However, at the end of each problem on which you collaborated with another student you must cite the students and the interaction. The purpose of this is to acknowledge their contribution to your work. Some examples follow:\n\nYou discuss concepts, approaches and methods that could be applied to a homework problem before either of you start your written solution. This process is encouraged. You are not required to make a written acknowledgment of this type of interaction.\n\nAfter working on a problem independently, you compare answers with another student, which confirms your solution. You should acknowledge that the other student's solution was used to check your own. No credit will be lost if the solutions are correct and the acknowledgments is made.\n\nAfter working on a problem independently, you compare answers with another student, which alerts you to an error in your own work. You should state at the end of the problem that you corrected your error on the basis of checking answers with the other student. No credit will be lost if the solution is correct and the acknowledgment is made, and no direct copying of the correct solution is involved.\n\nYou and another student work through a problem together exchanging ideas as the solution progresses. Each of you should state at the end of the problem that you worked jointly. No credit will be lost if the solutions are correct and the acknowledgment is made.\n\nYou copy all or part of a solution from a reference such as a textbook or a \"bible.\" You should cite the reference. Partial credit will be given, since there is some educational value in reading and understanding the solution. However, this practice is strongly discouraged, and should be used only when you are unable to solve the problem without assistance.\n\nYou copy verbatim all or part of a solution from another student. This process is prohibited. You will receive no credit for verbatim copying from another student when you have not made any intellectual contribution to the work you are both submitting for credit.\n\nVerbatim copying of any material which you submit for credit without reference to the source is considered to be academically dishonest.",
  "files": [
    {
      "category": "Resource",
      "title": "exprobs.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/2c7279ed7869bc9964708ca612cd9a85_exprobs.pdf",
      "content": "10.302\nFall 2004\nEXAMPLE PROBLEMS\nProblem 1\nTransdermal drug delivery devices (such as the nicotine patch) typically consist of a\nreservoir of drug sealed onto the surface of a polymer membrane as shown in the figure.\nThe device is manufactured by injecting a drug solution into the reservoir (labeled \"drug\"\nin the figure) and sealing the reservoir shut. The polymer membrane does not contain\nany of the drug initially. During use, the bottom of the polymer membrane is attached to\nthe surface of the skin and drug diffuses from the reservoir down through the membrane\ninto the skin. The drug essentially remains at a constant concentration cinf in the reservoir\nduring use.\nL\ndrug cinf\nPolymer membrane (diffusion barrier)\na) How long after the device is manufactured will it take for drug to penetrate to the\nexterior (bottom) surface of the polymer membrane?\nb) How long after manufacture before the membrane is saturated with drug? You may\nassume saturation has been obtained if the concentration in the membrane has reached\n99% of its final value.\nData:\nL\n=\n1 mm\ncinf\nD\n=\n=\n100 mg/ml\n5 x 10-8 cm2/s (diffusion coefficient of drug in membrane)\nS\n=\n0.01 (concentration of drug in membrane/concentration of drug in\nreservoir fluid)\n\nProblem 2\nMammalian tissue is to be grown in the annular space between a tube of (poly) dimethyl\nsiloxane (PDMS) and an impermeable outer shell (see figure). Oxygen will flow through\nthe interior of the tubing. In order to meet the metabolic demands of the tissue, the\noxygen will diffuse through the tubing wall and then into the tissue. For this problem, it\nmay be assumed that any resistance to mass transport associated with the tubing may be\nneglected. Thus, the appropriate boundary condition at r = R1 is\n°\n= CO2\nr\n@ = R1\nCO2\nIt is assumed that the O2 reacts with the tissue in accordance with\n-\nNo2 = constant = 7x10\n-\n- mol/ m3 ⋅ s\nFurthermore, the diffusivity of O2 in tissue is known to be about 2 x 10-5 cm2/s. In\no\naddition, the value of\nis about 1.4 mol/m3. Convective transport of O2 may be\nCO2\nneglected.\ni.\nWhat is the expression for\n(r)?\nCo2\nii.\nThere is a critical value of R2 at which Co2 =\nR\nat\n2 . What is the\nexpression for this critical radius? For the parameters given above, show\nthat Rcrit <4R1 if R1 = 0.25 cm.\nDATA\nIn cylindrical coordinates\n1 ∂\n∂ Fz\n⋅\n∇ F = r ∂ r (rFr ) + 1 ∂ Fθ +\nr\nθ\n∂\n∂ z\n∇ 2f = 1 ∂ ∂ f\n1 ∂ 2f\n∂ 2f\nr\n+\nr ∂ r ∂ r\n+\nr2 θ\n∂ 2\n∂ z2\nTissue\nR2 R2\nR1\nr\nR2\n\nProblem 3\nA wetted wall column is to be used to study the absorption of CO2 into water. The\ncolumn is supplied with solute-free water at the top and air containing 5 mole percent\nCO2 is supplied at the bottom. The air flow rate is such that the change in gas\ncomposition may be neglected. The gas phase resistance to mass transfer is negligible.\nThe situation is as depicted in Sketch A.\nThe velocity profile in the draining film is given by:\ngd\n\nμ\nρ\n\ny\n-\nu =\n\nd 2\n\n(See Sketch B)\nIt has been proposed that the absorption be analyzed by using \"penetration\" theory and\nsetting\nu ≅2\ndepth.\ngd\nμ\nρ\nfor all values of y which lie within the penetration\nThe anticipated range of d is 0.1 mm to 0.3 mm.\nA.\nIs the penetration theory valid for this range of d? Justify.\nB.\nIt is permissible to neglect axial diffusion in this problem. Please justify\nthis conclusion.\nC.\nAssuming the penetration theory concept and the above approximation for\nthe velocity profile to be valid, develop an expression for the mass transfer\ncoefficient, as a function of x and other appropriate parameters.\nD.\nWhat is the CO2 flux (gm/cm2 sec) at x = 10 cm if d = 0.3 mm?\nSee Sketches A & B next page.\n\nFigure by MIT OCW.\nH2O\n2cm\nL=20cm\nFilm thickness - d\nSKETCHES FOR PROBLEM 3\nA\nB\n=\nCO2\nCO2-bearing air\n1- γ2\nd2\nProperties etc:\nCO2 solubility = 0.15 gm CO2/100 gm H2O\nat a CO2 partial pressure of 2 atm.\nρH2O = 1gm/cm3\nυH2O = 0.01cm2/sec\ng = 980 cm/sec2\n0.1 mm < d < 0.3 mm\nDCO2/H2O = 2x10-3 cm2/sec\nx\nγ\nρgd2\nμ\nx\nd\n\nProblem 4\nA liquid/liquid extractor is being studied to determine the values of the \"film\ncoefficients\" which characterize its performance. In the extractor, an aqueous solution\nforms the continuous phase and toluene drops which are dispersed by agitation constitute\nthe organic phase. The volume ratio of the aqueous and organic phases is 2:1 (Vaq/Vorg =\n2). It is also known that the interfacial area for transport, a, is 20 cm2/cm3 of toluene.\nFurthermore, a \"lumped\" analysis may be employed in order to describe the device, i.e.,\nit may be assumed that concentrations are uniform within each phase and all of the\nresistance to transport is associated with the interface.\nTwo separate experiments using quite different solutes, X and Y, have been performed in\nwhich the solute is dissolved in the aqueous phase and then extracted into the organic\nphase. In each case, the initial concentration in the aqueous phase was 0.01M.\nThe results are as follows:\n\nConcentration of X\n\nConcentration of Y\n\nin organic phase\n\nin organic phase\n\nTime (seconds)\n(mol/1)\n\n(mol/1)\n\n3.2 x 10-4\n\n7.9 x 10-5\n\n1.5 x 10-3\n\n3.8 x 10-4\n\n5.3 x 10-3\n\n1.3 x 10-3\n\n1.4 x 10-2\n\n3.5 x 10-3\nIt is believed that solutes X and Y have identical diffusivities in water. The diffusivities\nin toluene are different than in water, but still the same for X and Y. However, the\npartition coefficient for X and Y is quite different. It is defined here as:\nSo/Aq =\nin toluene\nion\nconcentrat\nm\nequilibriu\nin water\nion\nconcentrat\nm\nequilibriu\nand it is known that So/Aq = 8 for X and So/Aq = 0.5 for Y.\na) What is the overall transport coefficient for solute X based on an overall organic\nphase driving force? Based on an overall aqueous phase driving force?\nb) What is the overall transport coefficient for solute Y based on an overall organic\nphase driving force? Based on an overall aqueous phase driving force?\nc) What are the values of the individual coefficients for the two phases?\nd) Does one or the other phase pose a dominant resistance for the transport of solute X?\nIf so, which phase? Repeat for solute Y.\nNotes: In the above, the individual coefficients are defined by:\n\"\nN = hm,aq(Caq - Caq,i) = hm,o(Co,i - Co)\nWhere \"i\"\nrefers to the interface\n\"o\"\nrefers to the organic phase\n\nand\n\"aq\"\nrefers to the aqueous phase\n\nC\n\"\nOverall coefficients are defined by:\nN = U\n(S\nC - C ) = U\nC\n-\no\n/ Aq\no\n,\nm\no\naq\no\naq\n,\nm\naq\nSo / Aq\n\nProblem 5\nConsider a single spherical ice crystal growing in a stagnant sea of subcooled salt water.\nThe fluid is water at -4°C containing 0.04 gm NaCl/cm3; and all NaC1 is excluded from\nthe interior of the growing ice particle.\n(a) If the diffusivity of sodium chloride in water were (for the moment) assumed to be\ninfinite, how long would it take for the ice crystal to grow from infinitesimal size to a\nradius of 0.1 cm? You may assume the temperature field around the ice particle to be\nquasi-steady.\n(b) Demonstrate whether the assumption of quasi-steady behavior is satisfactory.\n(c) In truth, the diffusivity of sodium chloride in water is about 1.2 x 10-5 cm2/sec.\nPlease develop a better estimate of the time for a crystal to grow to a radius of 0.1 cm.\nYou may assume that both the temperature and the concentration fields are quasi-\nsteady. Since salt is totally excluded from the growing crystal, note that the flux of\ndR\nsalt at the surface of the crystal is simply Ci\nwhere Ci is the salt concentration at\ndt\nthe surface of the crystal and R is the radius of the sphere. This flux due to rejection\nmust equal the quasi-steady rate at which salt diffuses away.\nData\n- The freezing point depression is given by:\n∆TFPD = 60 CNaCl\nwhere ∆TFPD is in degrees Kelvin and CNaCl is in gms/cm3.\n- The heat of fusion for water is about 250J/gm\n- The density of water and ice may be assumed equal at the value of 1 gm/cm3.\n- Other physical properties of liquid water include the following:\nthermal conductivity = 5.7 x 10-3 W/cm K\nkinematic viscosity\n= 0.018 cm2/sec\nthermal diffusivity\n= 1.3 x 10-3 cm2/sec\nspecific heat\n= 4.2 J/gm K\n\nProblem 6\nConsider a droplet of water with an initial diameter of 1mm. The droplet is placed in\nslightly humid, stagnant air. You may assume that the water concentration is dilute, i.e.\ndiffusion-induced convection in the air may be neglected.\na.\nIf the air temperature is 25°C and the humidity of the air at large distances from\nthe drop is 0.006 kg of water/kg of air, how much time will be required to totally\nevaporate the drop?\nb.\nIf the temperature of the air is sufficiently high, the dilute assumption fails and\ndiffusion-induced convection must be included in the analysis. Will this\nconvection tend to increase or decrease the heat flux? Will it tend to increase or\ndecrease the mass flux? Will the temperature of the evaporating drop increase or\ndecrease relative to the no convection prediction? Justify your choices.\nc.\nIn accordance with item (c), under the Data below, the process is quasi-steady, i.e.\nthe drop temperature is independent of time. Please develop an expression which\ngives a rough estimate of the time required to establish this condition. Note that\nthere are two time scales which may be much shorter than the evaporation time.\nOne is the time required to establish the temperature profile in the gas phase. The\nother is the time required to cool (or heat) the droplet from its initial temperature\nto the evaporation temperature.\nData\n(a) Water:\nρ = 1000 kg/m3\ncp = 4200 J/kg⋅K\nλfg = 2.4x106 J/kg\nk = 0.67 W/m⋅k\n(b) Air-Water:\nD = 0.26x10-4 m2/s\nk = 0.027 W/m⋅K\ncp = 1000 J/kg⋅K\nρ = 1.04 kg/m3\n(c) Miscellaneous:\nFor Part (a) of the problem statement, sensible heat effects may be\nneglected relative to latent heat effects.\n\nPhase\nProblem 7\nA pharmaceutical product is expressed by yeast which are grown in a large aerated\nfermentor. The desired product, along with a lot of undesired products, is found in the\naqueous phase. As a first step toward purification, current procedure is to filter the broth\nand then extract the product (and some of the undesired products) into an organic phase\nin a batch-operated direct-contact extractor. However, sales have been increasing, and\nthe plant must be expanded. It has been suggested that it might be possible to eliminate\nthe filtration step and use a continuous hollow-fiber exchanger in order to move the\nproduct from the broth into an organic phase. The general arrangement would be as\nshown in the sketch.\nThe broth will pass through the tubes, which are 1cm in diameter, and the organic fluid\nwill be the shell-side fluid. It is thought that the inside coefficient, hm, aq, will have a\nvalue of 1 x 10-3 cm/sec. It is estimated that the outside coefficient, hm, org, will have a\nvalue of 1 x 10-4 cm/sec. The tube wall will be highly porous and oil-filled. Its thickness\nwill be 0.5 mm. The diffusivity of the pharmaceutical product in oil is 0.5 x 10-5 cm2/s.\nThe distribution coefficient, S, has a value of 8.5, i.e.\nphase\norganic\nin\nconc.\nS =\n= 5.8\nphase\naqueous\nin\nconc.\nThe concentration of the pharmaceutical product, Cp, must be reduced from an inlet\nvalue of 100 μg/L to a maximum value in the outlet of 10 μg/L.\n(a)\nIf the exchanger is infinitely large, what is the required flow rate of the\norganic phase?\n(b)\nWhat is the required exchanger area if the flow rate of the organic phase is\n1000 L/hr?\nBroth\n5000 L/hr\ncp=100 μg/L\nExchanger\n10 μg/L\nHollow Fiber\nOrganic\nPhase\n\nProblem 8\nAn artificial kidney (hemodialyzer) consists of a bundle of hollow fiber membranes\nthrough which blood flows (see Figure 1). The fibers, which are potted in epoxy sheets\nand contained within a plastic shell, are bathed on the outside by countercurrent flow of\ndialysate, which is an osmotically balanced aqueous solution that contains no biological\nwastes. During passage through the device, waste products of metabolism permeate from\nthe bloodstream across the membrane to the dialysate phase. The device design\nparameters are as follows:\nActive hollow fiber length\nL\n= 15 cm\nHollow fiber internal diameter\nd\n= 200 μm\nHollow fiber wall thickness (wet)\nt\n= 20 μm\nNumber of hollow fibers\nn\n= 10,000\nActive surface area (based on d)\nA\n= 10,000 cm2\nShell volume outside hollow fibers Vshell\n= 100 ml\nYou have carried out a laboratory experiment with the blood replaced by water to test the\neffectiveness for the removal of urea. Although there are only aqueous solutions for both\nstreams, they will be referred to as blood and dialysate streams to denote the fluid\nflowing inside and outside of the hollow fibers, respectively. Operating conditions were\nas follows:\nBlood flow rate\nQb\n= 100 ml/min\nDialysate flow rate\nQd\n= 500 ml/min\nInlet blood urea concentration\nCb,in\n= 1 mg/ml\nTemperatures of all streams were maintained at 37°C. A laboratory analysis states that\nurea was removed from the blood-side fluid at a rate of 75 mg/min.\nNotes:\nDiffusivity of urea in water at 37°C = 1.8 x 10-5cm2/s.\nViscosity of water at 37°C = 695 x 10-6Ns/m2\nA. What was the urea concentration in the blood outlet and in the dialysate outlet\nstreams?\nB. Calculate the average overall mass transfer coefficient for urea in your\nexperiments.\nC. Within the hollow fibers, what was the Reynolds number? Was the\nhydrodynamic boundary layer fully developed? Was the concentration\nboundary layer fully developed? Estimate the average mass transfer\ncoefficient for urea in the blood-side fluid within the hollow fibers.\nThe rate of mass transfer per unit area across the membrane may be expressed as:\nN \" = Dm KP (C1,w - C2, w )\nt\n\nwhere Dm is the solute diffusion coefficient in the membrane, Kp is the\npartition coefficient, defined as the ratio of equilibrium concentrations in the\nmembrane and in water, Cm/Cw, and C1,w and C2,w are the concentration of\nsolute in the water in contact with the internal (bloodside) and external\n(dialysate side) membrane surfaces, respectively. The group DmKp/t is often\nreferred to as the membrane permeability, Pm. For the membrane in your\nexperiments, Dm = 0.25 x 10-5cm2/s, Kp=0.4, and Pm = 5 x 10-4cm/s at 37°C.\nD. From your results in parts B and C and the membrane permeability\ninformation, estimate the average mass transfer coefficient in the dialysate.\nE. If the dialysate mass transfer coefficient varies with dialysate flow rate in\nproportion to Qd\n0.8 , what would the overall mass transfer coefficient be if Qd\nwas increased to 1000 ml/min?\nF. If your experiment had been carried out in co-current flow (instead of counter\ncurrent flow), what rate of urea removal would you expect to have occurred?\nG. Assume that the entire device is initially at equilibrium with a urea\nconcentration of zero. At t = 0, the inside surface of the hollow fiber\nmembranes undergoes a step change to some non-zero value, while the\noutside surface is fixed at zero. Approximately how long will it take for the\nconcentration throughout the membranes to reach about 90% of its steady-\nstate value?\nH. Now assume that the step change occurs at the inlet blood concentration, and\nthe inlet dialysate concentration remains at zero. Does your answer from part\nG provide a good estimate of the time scale required for the device to come to\nsteady state? Describe all of the phenomena that would affect the device\ntransient response, and provide an order-of-magnitude estimate for the time\nscale associated with each phenomenon.\n\nFigure by MIT OCW.\nDIALYSATE IN\nPOTTING\nBLOOD OUT\nSHELL\nDIALYSATE OUT\nBLOOD IN\nNOT DRAWN TO SCALE. Assume flow arrangement is: PURE COUNTERCURRENT FLOW\nHOLLOW CELLULOSIC FIBER\nSCHEMATIC DIAGRAM OF HOLLOW FIBER MEMBRANE HEMODIALYZER\nSKETCH FOR PROBLEM 8\n\nProblem 9\nIn the painting of automobiles, the primer coat (which is the coat applied to the bare steel\nfor corrosion protection) is electro-deposited. More specifically, the polymer which\ncomprises the paint is ionic in character and therefore soluble in water at the right pH. In\nelectro-deposition, two things happen:\n(1) an applied electrical field drives the ionic polymer toward the car body, and\n(2) the passage of electrical current produces an electrode reaction at the car body\nwhich shifts the local pH and leads to deposition of the polymer. The\ndeposited polymer is later cured in an oven.\nOne of the problems with this process is that it requires that the aqueous solution\nbe relatively free of any ions except the polymer and its counterions. Excess ions of any\nsort simply waste current. But extraneous ions are always present on the surface of the\nsteel, so the procedure requires use of a process to remove these extraneous ions. One\nway to do this is to use ultrafiltration membranes which retain the polymer, but allow\npassage of the ions and water. A schematic showing how the process works is as\nfollows:\n(\nPaint Tank\nion source)\nClean 'Make-up'\nWater and Paint\nPurge Water + Ions\n\nThe design group which is responsible for constructing the ultrafilter has\ndeveloped a schism in which one subgroup prefers small diameter ultrafiltration tubes\n(because they offer large area per unit volume) and another subgroup prefers large\ndiameter ultrafiltration tubes (because they tend to offer low pressure drop).\nYou have been asked to help with one aspect of the comparison. Specifically,\nultrafiltration tends to concentrate the polymer molecules near the surface of the\nmembrane, and this is deleterious to performance. Consequently, it is important to know\nthe values of the mass transfer coefficients for the transport of polymer in the various\ndesigns.\nA.\nWhat value of hm would you predict for polymer transport if:\na. the tubes are 3m long and the I.D. of each tube is 1mm? The average velocity\nof the aqueous solution is 0.30m/s.\nb. the tubes are 3m long and the I.D. of each tube is 1cm? The average velocity\nof the aqueous solution is 3m/s.\nDATA\nc\nν\n= 1 x 10-6 m2/s\nD\n= 5 x 10-11 m2/s for polymer in water\nα\n= 1 x 10-7 m2/s\nk\n= 0.6 W/m⋅k\nρ\n= 1000kg/m3\np\n= 4000 J/kg⋅K\nB.\nThe bulk concentration of the polymer is 50kg/m3 and the trans-membrane flux of\nwater is 1.0 x 10-3 kg/m2⋅s. The membrane does not permit the passage of any\npolymer across it. For each of the design cases, what is the polymer concentration\nat the surface of the membrane?\nC. Solely from a mass transfer perspective, which tube would you recommend?\nD.\nFor design (a), what is the (approximate) thickness of the concentration layer?\nE.\nOn the basis of some vague notion about \"disrupting the boundary layer\", it has\nbeen suggested that the tubes be fabricated with annular bumps on the tube wall.\nThese would be located every 50cm along the length of the tube. Would this\nconcept substantially enhance the value of hm for the 1mm tube? Why or why\nnot? For the 1cm tube? Why or why not?\n\nProblem 10\nIt has been suggested that the diffusivity of a sparingly soluble gas in a liquid (e.g. CO in\nwater) may be measured as follows:\n1. A small bubble of pure gas is injected into the liquid and held in place on the\nend of a small rod.\n2. The diameter of the bubble is observed vs time; and the diffusivity is inferred\nfrom application of an appropriate theory.\nA. Please derive the appropriate theory for the bubble diameter as a\nfunction of its initial diameter (Di), the density of the bubble phase\n(ρB), the mass concentration of the dissolved gas in equilibrium with\nthe bubble ( ρDG), etc. You may assume that the bubble is spherical,\nthat the presence of the stabilizing rod may be ignored, that\nconvection is absent in both phases, that the pressure in the bubble is\nconstant, and that the process is quasi-steady. In addition, it may be\nassumed that the initial concentration of dissolved gas in the liquid is\nzero.\nB. What criterion must be satisfied if the quasi-steady assumption is to\nbe valid?\nC. Very small velocities in the liquid phase due to natural convection are\nalmost inevitable. What criterion must be satisfied if these velocities\nare to have no perceptible effect on the rate of dissolution, i.e. how\nsmall a velocity would be permissible?\nD. For NO in water, it is thought that D ≅ 2 x 10-5 cm/s and ρDG ≅ 0.05\ngm/L. The value of ρB would be approximately 1 gm/L. How long\nwould it take for the bubble to dissolve? Assume that the initial\ndiameter is 1 mm. Would this be a sensible technique to use as a\nmeans of measuring diffusivity?\n\nProblem 11\nWestern Mountain Sports (WMS) is a small company which caters to the needs of hikers\nand campers who enjoy the high desert areas of the American West. The company is\nnow considering production of a device which would serve as a passive cooler in order to\nprovide relatively cool drinking water for thirsty campers. The idea would be to use\nmicroporous polymer in order to manufacture a bag which would be essentially spherical\nwhen filled with water. The porosity of the bag would be carefully selected to permit the\nflow of just enough water to keep the exterior of the bag constantly wet. So, the campers\nwould fill the ECO-CHILLER with warm water, hang it in the shade, and allow\nevaporative cooling to proceed. It is believed that desert conditions will typically\ncorrespond to a temperature of 37°C (310K), a relative humidity of 20%, and a wind of 5\nm/s. The situation is shown in the sketch.\nA. What is the value of the heat transfer coefficient which would characterize\nexchange between the bag and the air?\nB. What is the value of the mass transfer coefficient which would\ncharacterize exchange between the bag and the air?\nC. What temperature will the contents of the ECO-CHILLER eventually\nreach? Assume the contents to be isothermal at all times.\nD. WMS has consulted with two old prospectors, Pyrite Pete and Calcite Cal,\nwho tell WMS that they had used this trick often with a simple leather bag\nand that the contents would cool down \"right quick\". Please give your\nestimate of the time constant for the cool-down process.\nE. If it is not possible to hang the ECO-CHILLER in the shade, it is\nexpected that it will intercept 50W of solar energy. Will this significantly\ncompromise the performance of the device?\nF. Will evaporation claim a significant fraction of the contents of the device\nduring the time required for cool-down?\n\nSketch (Problem 11)\nV = 5 m/s\nT = 37°C\n(310K)\nRH = 20%\nVolume of Contents = 8.2L\nPROPERTIES\nAir/Water Vapor @ 310K\nρ = 1.13 kg/m3\ncp = 1008 J/kg⋅K\nμ = 190 x 10-7 N⋅s/m2\nν = 16.8 x 10 -6 m2/s\nk = 0.027 W/m⋅K\nD = α = 23.7 x 10-6 m2/s\nPr = 0.71\nSc = 0.71\nLiquid Water @ 310K\nρ = 993 kg/m3\ncp = 4200 J/kg⋅K\nμ = 690 x 10-6 N⋅S/m2\nk = 630 x 10-3 W/m⋅K\nν = 6.9 x 10-7 m2/s\nα = 1.5 x 10-7 m2/s\nPr = 4.6\nλfg = 2.4 x 106 J/kg (latent heat of vaporization)\nPVP = 6.22 x 103 Pa\n25cm\n\nProblem 12\nThe bioavailability of drugs delivered orally is often low. Following absorption from the\ndigestive tract into the blood, many drugs are quickly converted by the liver to an inactive\nform before they can reach the rest of the circulation. One way to get around this\nproblem is to implant a device which will release the drug at a constant rate into the\nsystemic circulation. This type of device can also improve the efficacy of the drug\nbecause patients often forget to take drugs at the right time. Norplant is an implantable\ndevice which releases the steroid hormone Norgestrel into the blood when implanted\nunder the skin of the arm. It consists of a silicone rubber cylinder surrounding a core\nmatrix containing the drug, as shown below. The silicone rubber serves as a diffusion\nbarrier to control the release rate of the steroid.\nDrug\nCS\nR1\nR2\nC\ndrug particle\nfluid saturated\nwith drug\nsilicone rubber\nmembrane\nbody fluid\na)\nDerive an equation for the rate of steroid release from the device in terms of:\ncb = concentration of drug in the body fluid at the surface of the device (assume\nconstant)\ncs = drug concentration in the core (assume constant)\nR1, R2 = inner and outer radii of the membrane\nDm = diffusion coefficient of the steroid in the membrane\nS = cmembrane/cbody fluid (partition coefficient)\nb)\nIt is desired to deliver 76μg of the drug per day to the patient using device that is\n2 cm long with an inside diameter of 1.57mm. The desired steady-state\nconcentration in the plasma of the patient is 1 ng/ml. What should the wall\nthickness be to give the correct dosage?\nData: S = 70; Cs = 0.2 mg/ml; Dsteroid-silicone = 2 x 10-7 cm2/s\nThe partition coefficient between the core fluid and the silicone for this steroid is\nunity.\nc)\nIn the clinical trials of the device, it is noted that the release rate is much slower in\nsome patients than in others. This is attributed to the formation of scar tissue\naround the device, which adds a resistance to transport from the device to the\n\nblood. In one patient, a capsule of scar tissue 0.75mm thick was found\nsurrounding the device. If the solubility of the drug in the scar capsule is the\nsame as that in body fluids, and the diffusion coefficient in tissue is 6 x 10-7 cm2/s,\nwhat would be the expected rate of drug delivery in this patient? Assume that the\nscar capsule acts as a 0.75 mm thick coating on the device, and that the surface of\nthe scar is in contact with body fluid.\n\nGraph removed due to copyright reasons.\n(Dry-bulb temperature [oC] vs Humidity ratio [kg moisture per kg dry air] vs\nEnthalpy [kJ/kg of dry air] vs Saturation temperature [oC] vs Specific volume\n[m3 per kg dry air] vs Wet-bulb temperature [oC] vs Relative humidity)"
    },
    {
      "category": "Assignment",
      "title": "pset_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/7f7631b03c38f13bb1a10033e3fcba7e_pset_1.pdf",
      "content": "10.302\nFall 2004\nHomework Problem Set 1\nDue Wednesday, September 15 at start of class\nPart A\n1. I&D 1.6\n2. I&D 1.13\n3. I&D 1.24\nPart B\n1. I&D 1.44\n2. I&D 1.60\n3. I&D 2.3\nPart C\n1. I&D 2.21\n2. I&D 2.39\n3. I&D 2.46\nPart D\n1. I&D 3.2\n2. I&D 3.41\n3. I&D 3.44"
    },
    {
      "category": "Resource",
      "title": "problem_set_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/a83decb3906efb5be9c1106bc1ac26cc_problem_set_2.pdf",
      "content": "10.302\nFall 2004\nHomework Problem Set 2\nDue Wednesday, September 22 at start of class\nPart A\n1. I&D 3.69\n2. I&D 3.72\nPart B\n1. I&D 3.77\n2. I&D 3.84\nPart C\n1. I&D 3.104\n2. I&D 3.112\nPart D\n1. I&D 3.119\n2. I&D 3.120"
    },
    {
      "category": "Assignment",
      "title": "pset3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/7173fb32543a106b683895937b6e1ec3_pset3.pdf",
      "content": "10.302\nFall 2004\nHomework Problem Set 3\nDue Wednesday, September 29 at start of class\n\nPart A\n\nI&D 3.100\n\nPart B\n\nI&D 3.126\n\nPart C\n\nI&D 4.16\n\nPart D\n\nI&D 5.4\n\nI&D 5.7"
    },
    {
      "category": "Assignment",
      "title": "pset4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/3e69e2c0ffd20698178c41dbb3e2ab18_pset4.pdf",
      "content": "10.302\nFall 2004\nHomework Problem Set 4\nDue Wednesday, October 6 at start of class\n\nPart A\n\n1.\nI&D 5.25\n\nPart B\n\n1.\nI&D 5.40\n\nPart C\n\n1.\nI&D 5.51\n2.\nI&D 5.59\n\nPart D\n\n1.\nI&D 5.74\n2.\nI&D 5.87"
    },
    {
      "category": "Resource",
      "title": "ps_5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/2e552673f38304018e99b97c31bf827b_ps_5.pdf",
      "content": "10.302\nFall 2004\nHomework Problem Set 5\nDue Wednesday, October 20 at start of class\nPart A\nI&D 12.7, verify the value for the direct intensity from the sun if the sun is\na black body at 5800K.\n\nI&D 12.09\nPart B\nI&D 12.69, calculate the radiosity of the surface.\n\nI&D 12.79\nPart C\n\nI&D 13.1\n\nI&D 13.23\n\nPart D\nI&D 13.63\nI&D 13.66"
    },
    {
      "category": "Assignment",
      "title": "pset6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/3887d04e21208358cc71260a916f2453_pset6.pdf",
      "content": "10.302\nFall 2004\nHomework Problem Set 6\nDue Wednesday, October 27, at start of class\n\nPart A\n\nProblem 6.1 of I&D\n\nProblem 6.13 of I&D\n\nPart B\n\nProblem 6.27 of I&D\n\nProblem 6.28 of I&D\n\nPart C\n\nProblem 6.39 of I&D\n\nProblem 6.43 of I&D\n\nPart D\n\nProblem 7.19(a) of I&D\n\nProblem 7.50"
    },
    {
      "category": "Assignment",
      "title": "pset7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/fa8bd7a05377d8b38ecf2bcce1b4f893_pset7.pdf",
      "content": "10.302\nFall 2004\nHomework Problem Set 7\nDue Wednesday, November 3, at start of class\n\nPart A\n\nProblem 7.43 of I&D\n\nProblem 7.44 of I&D\n\nPart B\n\nProblem 7.58 of I&D\n\nProblem 7.70 of I&D\n\nPart C\n\nProblem 7.71 of I&D\n\nProblem 7.78b of I&D\n\nPart D\n\nProblem 8.22 of I&D\n\nProblem 8.27 of I&D\n\nProblem 8.62 of I&D"
    },
    {
      "category": "Resource",
      "title": "ps_8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/e0e0a7e70f0a9a75181ea32c05da3b0a_ps_8.pdf",
      "content": "10.302\nFall 2004\nHomework Problem Set 8\nDue Wednesday, November 17, at start of class\n\nPart A\n\n1. Problem 11.38(a) of I&D What tube area would be required if the exchanger\nwere of the true countercurrent type?\n\n2. A mixed organic liquid is to be vaporized in a true countercurrent exchanger.\nThe mixture will enter at 100°C and it is desired that it leave at 300°C. A temperature-\nenthalpy diagram is attached. As indicated, the design heat duty for the exchanger is 1\nMW. A high temperature liquid heating medium will be used to achieve the vaporization.\nThis fluid has a constant heat capacity equal to 2000 J/kg⋅K.\n\n(a) If the heating fluid enters the exchanger at 320°C, and if the exchanger is\ninfinitely large, what is the required flow rate of the heating medium?\n(b) If the heating fluid enters the exchanger at 320°C, and if the exchanger is\ninfinitely large, and if the flow rate of the heating medium is 2 kg/s, what\nwill be the exit temperature or the mixed organic stream? Note that the\nactual heat duty maybe less than the desired value of 1 MW.\n(c) If the flow rate of the heating fluid (which enters at 320°C) is 3 kg/s and if\nthe overall heat transfer coefficient is constant at 350 W/m2⋅K, what area\nwill be required?\n\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\nTemparature (°C)\n1.1\nChange in Enthalpy Flow (MW)\n\nPart B\n\n1.\nProblem 11.24 (a) and (b) of I&D\n\n2.\nProblem 11.36 (a) of I&D. Repeat for a water flow rate of 20 kg/s\n\nPart C\n\nA diesel truck engine is turbocharged with 500 kg/h of air. The air is heated to\n420K by the compressor in the turbocharger. It is desired to cool the air (which is at 2.5\natm) to 392K or less before it enters the engine. For this purpose, pressurized liquid\nwater at 380K will be taken from the truck radiator at a rate of 250 kg/h. The intercooler\nwill be configured as a true counter-current exchanger, (F = 1). The overall situation is\ndepicted in the sketch.\n\nA vendor has offered an exchanger which consists of 300 tubes, each of which is\n0.5 m long and 0.5 cm in diameter. The water will flow in the tubes and the heat transfer\ncoefficient is expected to be 9000 W/m2⋅K. The shell side will carry the air. It will be\nfilled with a web of longitudinal fins (ηf = 1) so that the air-side heat transfer area is 5\ntimes greater than the heat transfer area on the water side. The air-side heat transfer\ncoefficient is expected to be 30 W/m2 ⋅ K. Fluid mechanically, the ducts on the air-side\nmay be regarded as tubes which are 0.5 m long with an equivalent diameter of 0.004 m.\nThe cross-sectional area available for flow on the shell-side is twice that available on the\ntube-side.\n\nA. Will the vendor's exchanger do the job? For this purpose, you can assume that\nthe vendor's claims with regard to the two heat transfer coefficients and with\nregard to the fin efficiency (ηf = 1) are correct.\n\nB. If the truck is allowed to idle so that both the air and the water flow rates are\nreduced ten fold, will the exchanger performance be much better, slightly better,\nslightly worse, or much worse? Justify your response. \"Better\" or \"worse\" should\nbe assessed with regard to how closely the outlet air temperature approaches the\ninlet water temperature. Note that the heat transfer coefficients cannot necessarily\nbe expected to remain unchanged.\n\nMiscellaneous Data\n\nAir\ncp = 1015 J/kg⋅K\nρ = 2.18 kg/m3\nν = 26.4 x 10-6 m2/s\nμ = 57.6 N⋅s/m2\nk = 33.8 x 10-3 W/m⋅s\nα = 38.3 x 10-6 m2/s\nPr = 0.69\n\nWater ρ = 993 kg/m3\n\ncp = 4250 J/kg⋅K\nν = 2.2 x 10-7 m2/s\nμ = 2.18 x 10-4 N⋅s/m2\nk = 0.69 W/m⋅K\nα = 1.6 x 10-7 m2/s\nPr = 1.35\n\nExchanger\n\nTotal cross sectional (flow) area on tube\nside = 5.9 x 10-3 m2\n\nTotal cross sectional (flow) area on shell\n\nside = 11.8 x 10-3 m2\n\nHeat transfer area (tube-side)\n\n= 2.36 m2\n\n500 kg/h\n\nWater out\nAir out\n\nIntercooler\nat 392K\nEngine\n\nTurbocharger\n\nAir in\nat 420K\nkg/h\nwater in\nat 380K\n\nPart D\n\n(i)\n\nA hot oil stream of 50,000 pounds/hr. is to be exchanged against a cold oil\nstream of 80,000 pounds/hr. The hot oil is available at 380oF and has a\nspecific heat of 0.5, the cold oil will enter at 100oF and also has a specific heat\nof 0.5. An existing 1-2 parallel-counterflow exchanger is to be used for this\npurpose. The exchanger has an area of 8000 ft2 and the overall heat transfer\ncoefficient is expected to be 20 Btu/hr ft2oF. Determine the outlet\ntemperature.\n\nFor the situation described above, it is desired that the outlet temperature of\nthe cold stream be at least 200oF. If a new 1-2 parallel-counterflow exchanger\nis to be purchased for this task, what must the area be? It may be assumed\nthat the overall heat transfer coefficient in the new exchanger will be 20\nBtu/hr ft2oF.\n\nSuggestion: For the first part of this problem, the effectiveness method may\nprove to be easier than the mean temperature difference method.\n\n(ii)\nIt has finally been decided that the heat transfer situation described in Problem\n(i) will be resolved by using two existing exchangers arranged in series. Both\nexchangers are of the 1-2 parallel-counterflow type but are otherwise\ndifferent. The areas and expected overall heat transfer coefficients are given\nbelow:\n\nExchanger 1:\n\nArea = 1500 ft2\nU = 30 Btu/hr. ft2 oF\n\nExchanger 2:\n\nArea = 1000 ft2\nU = 25 Bru/hr. ft2 oF\n\nTwo possible flow arrangements are given on the next page.\n\nYou have been asked to choose the arrangement which will give the closest\ntemperature approach and to calculate the exit and interstage temperatures for the\nconfiguration.\n\n100°F\nEX. 1\nEX. 2\n380°F\n100°F\nEX. 2\nEX. 1\n380°F"
    },
    {
      "category": "Resource",
      "title": "ps_9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/c4a9a6e9af13b4b5e00df85f90d24445_ps_9.pdf",
      "content": "10.302\nFall 2004\nHomework Problem Set 9\nDue Wednesday, November 24, at start of class\n\nPart A\n\n1.\nConsider an iron surface which serves as a catalyst for the production of ammonia\nfrom nitrogen and hydrogen. The temperature is 500°C. The pressure is 100 atm (10 x\n106Pa). The rate of ammonia production is 0.02 kg /m2⋅s. At the surface of the catalyst,\nit is believed that the mole fractions of N2, H2, and NH3 are 0.10, 0.40, and 0.50\nrespectively.\n\nWhat are the corresponding mass fractions for N2, H2, and NH3? What is the\nmass average velocity? What is the mole average velocity?\n\nNotes: Despite the high pressure, it is permissible for this purpose to use the ideal gas\nlaws.\n\nN2\nIRON\n\nH2\n\nNH2\n\n2.\nProblem 14.16 of I&D, but, in addition,\na. Sketch the Helium concentration profile from the interior of the tube, through\nthe glass cylinder, and into the ambient.\n\nb. If the tube contained Helium at a partial pressure of 4 bar, but another gas was\nalso present, would the answer be different? What role might be played by\nmass transfer coefficients?\n\n3.\nA test tube contains methanol at 50°C, at which condition methanol has a\nvapor pressure of 400mm Hg. Air, also at 50°C, is gently blown across the top\nof the test tube. Initially, the liquid level is 2cm below the top of the tube.\n\nUse a quasi-steady analysis to estimate the time required for the liquid level to\ndrop by 2cm. Please show whether or not the quasi-steady assumption is valid.\n\nData:\n\n- For air/methanol the diffusivity is 0.2 cm2/s.\n\n- For liquid methanol, the density is 0.8 gm/cm3.\n\nPart B\n\n(a) I&D 14.22\n\n(b) If the density of carbon is 2000 kg/m3, how long would you estimate\nwould be required for complete combustion of the particle? For this\npurpose, you may assume that the concentration profile around the\nparticle is quasi-steady. Can you show that this assumption is valid?\n\nPart C\n\nMany insects breathe through structures called spiracles, which are essentially\nopen tubes extending keep into the insect's body as shown below. Oxygen diffuses into\nthese tubes from the surrounding air and gas exchange occurs along the walls. It can be\nassumed that about one mole of carbon dioxide diffuses into the spiracle gas phase for\nevery mole of oxygen that diffuses out of the spiracle into the tissue. To prevent\nexcessive water loss, the walls of the spiracles are coated with a cuticle which serves as a\ndiffusion barrier for gases. The thickness of this cuticle is 10 microns, except at the end\n(x = L), where it is thicker and the flux of oxygen is zero out the end of the tube. Outside\nthe cuticle, in the tissue, the concentration of oxygen is essentially constant and is\napproximately 5% of the concentration which would be in equilibrium with air.\nComparative entomologists (scientists who study insects and compare their features) are\ninterested in understanding how the ability of various insects to exchange gases with the\nenvironment limits the size or activity level of the insects. For example, it has been\nproposed that larger insects are found in the tropics than in the artic regions because\ndiffusion is faster in warm equatorial climates. You want to show the entomologists how\nto quantitatively assess their hypotheses by providing a mathematical model of insect\nrespiration.\n\n(a) What is the local flux of oxygen from the spiracle to the tissue at any\npoint along the wall in terms of the gas phase concentration driving force\nand other relevant parameters? Note that the cuticle is thin relative to the\nradius of the spiracle.\n(b) Use your answer from (a) to derive a differential equation for the oxygen\nconcentration within the spiracle, ca, as a function of x. Validate the\nassumption that radial concentration gradients are negligible in the gas\nphase.\n(c) Does the oxygen concentration in the spiracle ever drop to less than 20%\nof ambient for the case of an insect in the tropics (data shown below)?\nYou do not need to show all the steps in the solution of your equation in\n(b) if you cite a relevant solution in your notes or text.)\n(d) Is the spiracle an efficient way to exchange gases? The efficiency of the\nspiracle an be judged by comparing the amount of oxygen which is\ntransferred within the spiracle to the amount which would be transferred\nif the ambient oxygen concentration prevailed in the gas phase all along\nthe length of the spiracle.\n\nData (all at 35°C, the temperature of the tropics):\nSpiracle radius, r = 0.01 cm\n\nDo-cuticle = 2 x 10-5 cm2/s\nSpiracle length, L = 0.8 cm\n\nDo-air = 0.2 cm2/s\nCuticle thickness, t = 0.001 cm\n\noxygen concentration in tissue, ct = 0.01 mmol/L\nOxygen solubility in cuticle or tissues\noxygen concentration in air, ca = 8 mmol/L\nRelative to air, cc or ct = 0.025 ca\n\nspiracles\n\ncarbon dioxide\ntissue\n\nL\nx\nCross section along\nlength of spiracle\nair\nInsect body\ncuticle\noxygen\nca\ncarbon dioxide\nClose-up\nof\ngas\nexchange\n\nPart D\n\nConsider a small, spherical, airborne cellular organism which consumes oxygen in\naccordance with a zero-order homogeneous reaction rate model. The temperature is\n25°C. Except possibly for diffusion-induced effects, the contents of the cell and the\nsurrounding air are both stationary.\n\na.\nAssume for the moment that the reaction rate is very slow. Does the\nresistance to oxygen transport lie predominantly in the air phase or within\nthe organism? Are the two resistances comparable?\n\nb.\nIf the O2 consumption rate, -\nis 1gmole/m\n,\nN\nO\n-\n3⋅s and if the diameter of\nthe organism is 0.02 cm, what is the steady state concentration of O2 at the\ncenter of the cell? The concentration of O2 in the cell is everywhere very\nlow, so the \"dilute\" forms of the mass transfer equations are appropriate.\n\nc.\nIs there a cell size such that the steady state concentration of O2 at the\ncenter would be zero? If so, please give this size.\n\nDATA\n\ns\n/\ncm\nx\nD\ns\n/\ncm\n.0\nD\nLIQ\nO\nGAS\nO\n-\n=\n=\n\nSCELL/AIR = 0.5\n\nf\nsin\nr\nf\nsin\nsin\nr\nr\nf\nr\nr\nr\nf\nθ\n∂\n∂\nφ\n+\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\nφ\n∂\n∂\nφ\nφ\n∂\n∂\nφ\n+\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n∂\n∂\n∂\n∂\n=\n∇\n\n(in spherical coordinates)"
    },
    {
      "category": "Exam",
      "title": "final_exam.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/d79f1bdf74ae857c7d27b9c35ce7fff1_final_exam.pdf",
      "content": "10.302\nFall 2004\nFINAL EXAMINATION\nDecember 14, 1004\n\nGOOD LUCK!\n\nProblem 1 ( 40 points)\n\nConsider a small droplet (dp = 1 mm) of n-butane that falls through still air at\n325K. As the droplet evaporates, it will cool, but then reach a steady temperature. It is\nagreed that radiation and diffusion-induced convection may be neglected.\n\nA. What is the value of the steady temperature?\nB. What is the value of the convective heat transfer coefficient that characterizes\nheat transfer from the air to the droplet?\nC. Very approximately (seconds, minutes, or hours), how long will it take to reach\nthis steady temperature? Justify.\nD. If diffusion-induced convection had been included in the analysis, would the\nsteady state temperature have been higher or lower? Explain.\n\nDATA\nair /c\nD\n\n= 0.22 cm2/s\nρair\n= 1.16 kg/m3\nυair\n= 1.6 x 10-5 m2/s\ncp, air\n= 1000 J/kg⋅K\nαair\n= 2.2 x 10-5 m2/s\n∆HVAP\n= 400,000 J\nkg\n\nc\nMW\n\n= 58\n\nc (liq.)\nρ\n\n= 580 kg/m3\n\np, c\nc\n(liq.) = 2000 J/kg⋅K\n\nc\nk\n(liq.)\n= 0.15 w/m⋅K\n\nThe vapor pressure curve for n-butane is attached.\n\nFIGURE 1\nFigure removed due to copyright restrictions. [Diagram of vapor pressure (mole fraction) versus temperature for n-butane.]\n\nProblem 2 (60 points)\n\nMany current models of automobiles have a readout in the passenger\ncompartment that indicates ambient temperature. The temperature sensor for this\ninstrument is usually located in the air intake manifold for the motor, downstream of the\nair filter. A sketch of the sensor, and the long circular duct in which it is located, is\nshown in Figure 2. A thermocouple is located inside a small diameter stainless steel\nsheath that protrudes through the wall of the duct.\n\nFIGURE 2\n\nThe duct is 7.5 cm in diameter and carries air at between 2000 and 8000 liters/min\ndepending on engine speed. The driver of the car would like the thermocouple to indicate\nan accurate air temperature independent of the engine speed and temperature of the wall\nof the air duct. An expanded sketch of the thermocouple and its sheath is given in\nFigure 3.\n\n7.5 cm\nThermocouple Sheath\nLong Plastic Duct\nEnlarged in Figure 3\nAir Intake\nNOT TO SCALE\n\nFIGURE 3\n\nThe thermocouple sheath is made of stainless steel and has an outside diameter of 3 mm,\nan inside diameter of 2 mm, and a length from duct wall to thermocouple bead of 2.0 cm.\nConduction along the leads of the thermocouple and within the air space between the\nthermocouple wires and the walls of the sheath can be neglected.\n\nProperties of Stainless Steel\n\nDensity ρ\n\n8000 kg/m3\n\nHeat capacity c\n\n0.480 kJ/kg K\n\nThermal conductivity k\n15 W/m K\n\nThermal diffusivity α\n4 x 10-6 m2/s\n\nProperties of Air\n\nDensity ρ\n\n1.2 kg/m3\n\nHeat capacity c\n\n1.0 kJ/kg K\n\nThermal conductivity k\n0.026 W/m K\n\nThermal diffusivity α\n2.2 x 10-5 m2/s\n\nKinematic viscosity\n1.6 x 10-5 m2/s\n\nPrandtl number\n\n0.7\n\n2 cm\nID = 2 mm\nOD = 3\nmm\nDuct Wall\nThermocouple Bead\nThermocouple Sheath\nAir\n\nNOT TO SCALE\n\nA. If the airflow rate in the duct is 3000 liters/min what is the average heat\ntransfer coefficient to the thermocouple sheath?\nB. If the true air temperature is 25 oC and the wall of the duct is 80 oC what\ntemperature will the thermocouple read? The heat transfer coefficient along\nthe entire length of the sheath, including the convective loss from the tip, may\nbe assumed to be that found in part A. You may neglect radiation. If you did\nnot obtain a numerical value in part A, assume that h = 150 W/m2 K.\nC. Estimate an average radiative heat transfer coefficient between the\nthermocouple sheath and the walls of the duct. The duct may be assumed to\nbe much larger than the thermocouple sheath. The air is at 250C and the duct\nwall is at 800C.\n\nEmissivities\n\nStainless steel\n\n0.2\n\nPlastic duct wall\n\n0.8\n\nD. Derive a differential equation for the temperature distribution along the length\nof the thermocouple sheath incorporating both convective and radiative heat\ntransfer. The equation should account for the physical and thermal properties\nof the sheath; the convective and radiative heat transfer coefficients, and the\ntemperatures of the duct wall and air. Specify appropriate boundary\nconditions for your equation.\nE. The convective heat transfer coefficient for the tip of the thermocouple sheath\nis likely to be three times larger than the coefficient along its length. Will this\nfact affect the temperature reading of the thermocouple by more than 1⁄2 oC?\nF. What changes in design would you recommend to reduce the difference\nbetween reading of the thermocouple and the true air temperature? Justify\nyour recommendations.\n\nProblem 3 (40 points)\n\nThe role of aerosols in human health and in the solar energy budget of the Earth\nhas become increasingly apparent. One interesting problem of this sort is the interaction\nof anthropogenic pollution with natural forest products. For instance, the Smoky\nMountains owe their name to a natural aerosol associated with pinenes and related\nspecies. These can interact with nitrates emitted from upwind urban sources. The\nPROPHET site in northern Michigan is dedicated to the study of this interaction. One of\nits facilities is a tower (30 m) that permits sampling in the air space just above the forest\ncanopy. Unfortunately, it is usually necessary to run sampling lines to instrumentation\nlocated on the ground.\n\nYou have been asked to assess the loss of aerosol particles to the walls of the\nsampling line. In other words, since most atmospheric aerosol \"particles\" are actually\nliquid, if they contact the wall, they will simply \"wet\" the wall and remain there. It is\nagreed that, since the aerosol particles are small, they are subject to Brownian diffusion,\nfor which\n\nkT\nD\na\n=\nπμ\n\n(1)\n\nThus, the behavior of the particles is exactly that which might be expected of a solute.\nFor the base case, the sampling line will be 35 m long and 1 cm in I.D. The average\nvelocity of the air will be 2.5 m/s. For a particle diameter (2 a) of 20 nm, Eq. 1, when\ncorrected for mean-free-path effects, gives D= 1x10-8 m2/s.\n\nA. What is the value of hm that describes the transport of particles to the wall?\nB. What fractional loss of particles would you expect?\nC. What fractional loss would you expect if the sampling velocity were reduced\nfrom 2.5 m/s to 1 m/s?\nD. What fractional loss would you expect if the sampling velocity were increased to\n6 m/s?\n\nProperties of Air\n\nρ = 1.16 kg/m3\nυ = 1.6 x 10-5m2/s\ncp = 1000 J/kg⋅K\nα = 2.25 x 10-5 m2/s\n\nProblem 4 (60 points)\n\nA small aqueous waste stream, at a flow rate of 400 cc/min, is contaminated with\nan organic material at a concentration of 1 mg/cc. It has been suggested that most of this\ncontaminant can be removed by passing the waste stream through a mass exchanger\nwhere the contaminant is transferred to a non-aqueous solvent stream. The mass\nexchanger is a small shell-and-tube device with many tiny plastic capillaries as the tubes.\nThe aqueous stream flows through these tubes and the solvent stream flows through the\nshell side. The solvent stream enters the exchanger as a pure material free of all\ncontaminant. The walls of the plastic capillaries allow the contaminant to diffuse but no\nwater or solvent passes through the plastic.\n\nGeometry of the Capillaries\n\nInside diameter\n\n200 μm\n\nWall thickness\n\n15 μm\n\nLength\n\n20 cm\n\nNumber\n\nArea for mass transfer\n\n(based on inside diameter)\n\n0.817m2\n\nProperties of the Fluid Streams and Capillaries\n\nWater Stream\n\nDensity\n\n1000 kg/m3\nViscosity\n\n10-3 N s/m2\nDiffusivity of contaminant\n\n2 x 10-9 m2/s\n\nSolvent Stream\n\nDensity\n\n850 kg/m3\nViscosity\n\n8 x 10-4 N s/m2\nDiffusivity of contaminant\n\n10-9 m2/s\nPartition coefficient of contaminant Ssolvent/water\n\nCapillary Tubes\n\nDiffusivity\n\n2 x 10-11 m2/s\nPartition coefficient of contaminant Scapillary/water\n\nA. If the mass exchanger were counter current and infinitely long what would be\nthe solvent flow rate necessary to reduce the contaminant in the aqueous\nstream to 0.1 mg/cc?\nB. The mass transfer coefficient on the outside (shell side) of the tubes is\n7 x 10-5 m/s (based on flux in solvent-based units) at a solvent flow rate of\n\n75cc/min. What is the overall mass transfer coefficient based on the inside\narea of the tubes? Please express the overall coefficient with flux based on\naqueous phase concentration units.\nC. The mass exchanger is operated in counter current flow at a solvent flow rate\nof 75 cc/min and with the overall mass transfer coefficient found in part B.\nThe total area for mass transfer, based on the inside diameter of the\ncapillaries, is 0.817m2. What are the concentrations of contaminant in the\naqueous and solvent streams leaving the exchanger? How did you select the\nmass capacity rate to be used in finding NTU? If you did not find an answer\nto part B use 1.5 x 10-5 m/s for the overall mass transfer coefficient based on\nflux in aqueous-phase concentration units.\nD. It is desired that the concentration of the contaminant in the effluent aqueous\nstream be 0.1 mg/ml. What flow rate of solvent is required for a counter\ncurrent exchanger? You may assume that the Sherwood number on the shell\nside follows the relation\n\nSh = C Re0.5 Sc0.33\n\nFIGURE 4\nAqueous\nStream\nIn\nAqueous\nStream\nOut\nSolvent\nStream\nIn\nSolvent\nStream\nOut"
    },
    {
      "category": "Exam",
      "title": "exam1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/c4c247bbd4f7e75124dc972df58fe77d_exam1.pdf",
      "content": "10.302\nFall 2004\nExam 1\nWednesday, October 13, 2004\n\nProblem 1 (40 points)\n\nA very long composite cylinder consists of two concentric cylinders. See attached\nsketch. The inner cylinder of radius r1 has no heat generation. The outer cylindrical shell,\nwith inner radius r1 and outer radius r2, is capable of being heated at a uniform\nvolumetric heat generation rate of\n. The two cylinders are in intimate thermal contact.\nThe outside of the cylindrical shell is immersed in a flowing fluid with temperature\nq&\nTinf far\nfrom the cylinder and heat transfer coefficient h. The thermal conductivity, heat capacity,\nand density of the inner cylinder are\nand ρ\nk , c ,\n1, respectively. The values of these\nthree thermal properties for the cylindrical shell are\nk ,c ,and ρ . Initially, the\ntemperature of the entire composite cylinder, Ti, is equal to the ambient temperature,Tinf,\nand there is no heat generation\n= 0 in the outer cylindrical shell. At\nthe heater is\nturned on and the outer cylindrical shell is heated at rate q .\nq&\nt\n=\n&\n\na) (5)\nWrite the heat diffusion equation that describes the unsteady heat transfer\n\nwithin the inner cylinder. Specify appropriate boundary and initial\n\nconditions.\n\nb) (5)\nWrite the heat diffusion equation that describes the unsteady heat transfer\nrate within the outer cylindrical shell. Specify appropriate boundary and\ninitial conditions.\n\nc) (15)\nSketch a series of temperature profiles versus radial position at different\ntimes. Include the initial profile at t = 0, the steady state profile and two\nintermediate profiles. Be sure to identify the shapes of the curves\n(e.g. linear, hyperbolic, parabolic, etc.). Specify slopes and relative\nmagnitudes at r1, and r2. Use the attached template for the sketch.\n\nd) (10)\nAt steady state, find an equation for the temperature profile in the inner\ncylinder and another equation for the temperature profile in the cylindrical\nshell.\n\ne) (5)\nFind an expression for the centerline temperature at steady state.\n\nRegion 1\n.\nRegion 2\nk1,c1,ρ1\nk2,c2,ρ2,q\nr1\nr2\nTinf,h\n\nTEMPLATE\n\nProblem\nName:__________________\nr\nT\nr1\nr2\nTinf\n\nProblem 2 (60 points)\n\nThe solid, cylindrical brass rod used in the 10.302 Experiment One, Extended\nSurface Heat Conduction, is 1 cm in diameter and 35 cm long, with eight thermocouples\nplaced along its length at 5 cm intervals. The thermal conductivity, heat capacity, and\ndensity of the rod are\nW\nJ\n, 380\n, and 8500\n,\nmK\nkgK\nm\nkg respectively. The heat transfer\ncoefficient, including contributions from radiation and convection, is\nW\n.\nm K\n\nAt steady state, the temperature at the heated end of the rod, T1, is 60oC. Ambient\ntemperature is 20oC.\n\na) (5) Find the temperature at the tip of the rod, T8.\nb) (5) How much heat qf is supplied to the rod at T1, at steady state?\nc) (10) It is known that it took 100 minutes for a steady state temperature profile\nto be established in the fin. How long would it take if the rod were twice\nas long, i.e., L = 0.70m? An answer which is accurate to within 20% will\nsuffice.\n\nThe rod is now covered with a concentric cylinder of high quality foam insulation.\nThe inner diameter of this insulation is 1 cm and the outer diameter is 2 cm. The\ninsulation has negligible thermal mass (low density, low heat capacity) and a thermal\nconductivity of\nW\n0.030\n.\nmK The same amount of heat qf is supplied to the rod at T1 as\nfound in part b. (If you do not have an answer for part b, assume qf = 2.5W.)\n\nd) (20) Calculate the appropriate new value of the Biot number. Is an analysis of\nthe fin type still appropriate?\ne) (5) Calculate the value of the steady state temperature at T1.\nf) (5) Find the steady state temperature at the tip of the rod, T8.\ng) (10) Estimate the time it would now take to attain steady state.\n\nThe equation which describes the response of a finite fin to a step change in heat\nflux is\n\nL\nx\nn\ne\nn\nmL\nmL\nmL\ne\nmL\nmL\nt\nx\nL\nt\nmL\nn\nn\nb\nt\nm\nb\nss\nπ\nπ\nθ\nθ\nθ\nθ\nα\nπ\nα\ncos\n)\n(\n)\n(\ntanh\ntanh\n)\n,\n(\n)\n)\n(\n)\n((\n+\n-\n=\n-\n∑\n+\n-\n-\n=\n\nss\nb\ncosh\n(\nx)\ncosh\n-\nθ\n= θ\nm L\nmL\n\nDescription of Parameters:\n\nSymbol\nDefinition\nUnit\nb\nθ\nb\nss\nθ = θ @ x=0\noC or K\nm\nm= (hP/kA)1/2\nm-1\nL\nLength of the rod\nm\nh\nHeat transfer coefficient\nW/m2K\nP\nPerimeter\nm\nk\nThermal conductivity\nW/mK\nA\nCross sectional area\nm2\nα\nThermal diffusivity\nm2/s"
    },
    {
      "category": "Exam",
      "title": "exam1soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/3d6ca849f75290bf3c58b4a5a2364fff_exam1soln.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "q1_solution.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/96e340108baca31e24dc268394450ce2_q1_solution.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "q1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/4a6da680c32301db56c4494cfd95bbaf_q1.pdf",
      "content": ""
    },
    {
      "category": "Exam",
      "title": "exam2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/7b770c64ee327086ee36d2a27c637dcc_exam2.pdf",
      "content": "NAME: ____________________\n10.302\nFall 2004\nExam 2\nWednesday, November 10, 2004\n\n1.\n(60 points) The product obtained from the bottom of a distillation column\nneeds, for safety reasons, to be cooled before it is sent to storage. It is\nproposed that this be achieved by cooling with air in a crossflow exchanger\n(both fluids unmixed). The general situation is shown in Figure A.\nA. If the exchanger is infinitely large and if it were counter current (rather\nthan crossflow), what is the minimum mass flow rate of air that would\nsuffice to cool the 10 kg/s of product from 300°C to 50°C? You may take\nthe air temperature to be 20°C.\nB. If the actual air flow rate exceeds the minimum found in Part A by 10%,\nbut the exchanger configuration is crossflow, will operation be possible in\nan exchanger of reasonable size?\nC. The plan is to use tubes for which the OD is 1.0 inch and the ID is 0.8\ninch. The tube length will be 10 ft. The material is carbon steel. The\naverage linear velocity of the product within the tubes will be 1 m/s. That\nof the air outside the tube will be 4 m/s. The situation is sketched in\nFigure B.\ni)\nWhat is the value of the heat transfer coefficient at the inner\nsurface of the tubes?\nii)\nWhat is the value of the heat transfer coefficient at the outer\nsurface of the tubes? [You may ignore any flow effects due to\nthe presence of other, nearby, tubes.]\niii)\nWhat is the value of the overall heat transfer coefficient?\nBase your answer on the inside area of the tubes. A value\nwithin 5% is adequate.\niv)\nIf the total mass flow rate of air is 100 kg/s, what is the\nrequired exchanger area (based on tube ID)?\n\nD. If it were desired to increase the effective overall heat transfer coefficient,\nwould you recommend that fins be placed on the tube interior or the tube\nexterior or both? Why?\n\nE. If square fins, each 3\" on a side (see Figure C), were placed on the tube\nexterior, what would you predict for the average value of the heat transfer\ncoefficient between the fins and the air? The distance between fins is 0.5\ninches.\n\nNAME: ____________________\n\nStill bottoms\n50°C\n@ 300°C\n10 kg/s\nair @ 20°C\nFIGURE A\n\nProduct:\n1 m/s\nAir: 4 m/s\nFIGURE B\n\nNAME: ____________________\n3 in\n3 in\nAir\nFIGURE C\n0.5 in\n3 in\n3 in\nAir\nFIGURE C\n0.5 in\n0.5 in\n\nProperties\n\nProduct\n\nρ\n=\n1050 kg/m3\ncp\n=\n2500 J/kg⋅K\nν\n=\n2 x 10-6 m2/s\nk\n=\n0.25 W/m⋅K\nα\n=\n0.95 x 10-7 m2/s\nPr\n=\n\nAir\n\nρ\n=\n1 kg/m3\ncp\n=\n1000 J/kg⋅K\nν\n=\n21 x 10-6 m2/s\nk\n=\n0.030 W/m⋅K\nα\n=\n30 x 10-6 m2/s\nPr\n=\n0.7\n\nCarbon Steel\n\nρ\n=\n7800 kg/m3\ncp\n=\n400 J/kg⋅K\nk\n=\n60 W/m⋅K\n\nNAME: ____________________\n2.\n(40 points) You park your car outside overnight in the late fall. The sky is clear\nand the wind is calm. Just before daybreak, you note that the air temperature is\n6°C but that the roof of your car is covered with a layer of frost. You may assume\nthat the car roof has a full view of the night sky, which has an effective black\nbody temperature of 230 K. The roof is also black and the inside surface of the\nroof is well insulated. The roof can be considered a flat plate of length 1.5 m from\nwindshield to back window.\n\nThe properties of air are:\n\nThermal conductivity, k\n2.5 x 10-2 W/mK\n\nDensity, ρ\n\n1.1 kg/m3\n\nHeat capacity, cp\n\n1.0 kJ/kgK\n\nKinematic viscosity, ν\n1.5 x 10-5 m2/s\nPrandtl Number, Pr\n\n0.71\n\nA. Assume that the heat transfer coefficient by natural convection for\nthe roof of the car is 5 W/m2K. Calculate the temperature of the car\nroof.\nB. How high must the local convective heat transfer coefficient be for\nthe temperature of the roof to reach 0°C?\n\nYou start your car and drive a short distance at 30 mph (13.4 m/s). The roof of the\ncar continues to have a full view of the night sky. The roof may be assumed to be\nthermally non-conducting.\n\nC. At a position of 0.3 m from the windshield will the frost melt?\nD. At a position 1 m from the windshield will the frost melt?\nE. Roughly delineate the boundaries of the regions over which you\nexpect frost to remain on the roof of the car and the regions that are\nfrost-free?\n\nWindshield\nBack Window\nx\nx= 1.0 m\nx= 0.3 m\nAir\nT = 6 OC\nUinf= 13.4 m/s\nx= 1.5 m\nFIGURE C\nCar Roof\nWindshield\nBack Window\nx\nx= 1.0 m\nx= 0.3 m\nAir\nT = 6 OC\nUinf= 13.4 m/s\nx= 1.5 m\nCar Roof\nFIGURE C\nFIGURE D"
    },
    {
      "category": "Exam",
      "title": "exam2solution.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/50984c5426b221d2c85f129cd5953464_exam2solution.pdf",
      "content": ""
    },
    {
      "category": "Exam",
      "title": "quiz_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/c4819a02c93e0ddb17f516de65ce2c16_quiz_2.pdf",
      "content": "QUIZ TWO\nOctober 19, 2004\nThe surfaces of the very long, thin strip heater and its hemi-cylindrical shell, discussed in\nthe recitation problem for October 19, are now gray and diffuse. The emissivity of both\nsides of the thin strip heater is 0.8 and the emissivity of both sides of the reflector is 0.6.\nThe heat transfer coefficient for each side of the reflector is 15 W/m2K as in part (c) of\nthe recitation problem. You may neglect any convective heat transfer from the heater\nstrip. All dimensions and other parameters given in the recitation problem remain\nunchanged. You may use the view factors calculated in class (and given below) and\nassume that the surroundings are much larger than the strip heater and its reflector.\na) Calculate the temperature of the reflector. An answer within 25K will suffice.\nb) Calculate the energy required per unit length of heater to maintain its\ntemperature at 11000C. An answer within 10% will suffice.\nUsing the notation in the recitation problem the view factors and parameters are:\nF11 = 0\nTemperature of strip heater is 1100oC\nF12 = 1\nTemperature of ambient is 20oC\nF13 = 0\n\nDiameter of shield is 15cm\nF14 = 0\nHeight of heater is 2cm\nF21 = 0.085\nF22 = 0.363\nF23 = 0\nF24 = 0.552\nF31 = 0\nF32 = 0\nF33 = 0\nF34 = 1"
    },
    {
      "category": "Exam",
      "title": "quiz2soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/06d5b8bfa0dec4cc72020f90d2ead398_quiz2soln.pdf",
      "content": ""
    },
    {
      "category": "Exam",
      "title": "exam3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/bed054d78311bc9579e1b0814554134b_exam3.pdf",
      "content": "10.302\nFall 2004\nExam 3\nWednesday, December 1, 2004\n\n1. (60 points) A pure liquid is available from storage at its boiling point of 100°C. The\nmaterial is to be fed to a reactor as a vapor at 200°C. The heating is to be achieved by using\nsaturated high pressure steam at 230°C. Subcooling of the condensate will not be practiced.\nRelevant properties of the flow stream and of the steam are given below. The flow rate of the\nfeed stream is 10kg/s.\n\nA. What is the minimum flow rate of steam that can accomplish this task in an\ninfinitely large, true counter-current exchanger? In an infinitely large true co-current\nexchanger?\nB. Subject to the following assumptions, determine the area required for a true counter-\ncurrent exchanger. The tube wall is very thin so the inside and outside areas are\nessentially equal.\n(i)\nOn the feed stream side of the tubes, h = 1000 W/m2⋅K when the feed\nstream liquid is in contact with the tubes;\n(ii)\nOn the feed stream side of the tubes, h = 300 W/ m2⋅K when the feed\nstream vapor is in contact with the tubes;\n(iii)\nOn the steam side of the tubes, h = 5000 W/ m2⋅K;\n(iv)\nThe thermal resistance of the tube walls is negligible;\nC. It has been suggested that it might be possible to use hot flue gas to replace the\nsteam. Like the steam, it is available at 230°C. What is the minimum flue gas flow\nrate in an infinitely large counter-current exchanger? In an infinitely large co-current\nexchanger?\nD. Re-work Part B if combustion gas is used at a rate of 100 kg/s and all conditions are\nas described in Part B except that the heat transfer coefficient on the combustion gas\nside of the tubes is 300 W/m2⋅K (rather than 5000 W/m2⋅K as it was if steam were\nused).\n\nProperties\n\nFeed Stream\n\nHeat of Vaporization\n=\n0.6 x 106 J/kg\n\nHeat Capacity of Vapor\n=\n3,000 J/kg⋅K\n\nHeat Capacity of Liquid\n=\n2,000 J/kg⋅K\n\nSteam\n\nHeat of Condensation\n=\n1.8 x 106 J/kg\n\nCombustion Gas\n\nHeat Capacity\n\n=\n1000 J/kg⋅K\n\n2. (40 points) A small aqueous waste stream is contaminated with a small amount (1 kg/m3)\nof an organic species.\n\nIt has been suggested that this might be removed by the following procedure:\n\n(a) Charge 5m3 of waste water to a tank as shown in the sketch.\n(b) Charge 0.5m3 of solid beads to the tank. The beads will be chosen to\nhave a strong affinity for the contaminant (Sbead/water = 100).\n(c) Stir well for a specified period.\n(d) Stop the stirrer, allow the beads to float, and drain off the water.\nIt is agreed that mass transfer external to the beads may be modeled as though\nthe fluid around each bead were stagnant. The plan is to use beads with a\ndiameter of 2mm.\n\nA. What will the concentration be in the aqueous stream and in the beads if the vessel is\nstirred for an infinitely long time?\nB. What is the value of the Biot Number?\nC. Roughly (to within a factor of two) what duration of stirring would you recommend\non the basis of engineering judgment? The idea is to select the shortest time\nconsistent with effective use of the beads.\nD. For the stirring period that you selected, roughly what contaminant concentration\nwill be attained in the aqueous stream? Do you think that your answer is valid to\n±10%? ±50%? ±100%?\nE. Why do Parts C and D contain the word \"roughly\"?\n\nProperties\n\nDiffusivity of the contaminant in water = 10-5 cm2/s\n\nDiffusivity of the contaminant in the beads = 10-7 cm2/s"
    },
    {
      "category": "Resource",
      "title": "rec1012.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/da3192c752242894abdcaceb14a328a3_rec1012.pdf",
      "content": "10.302\nFall 2004\nDiscussion Problem for Recitation on\nTuesday, October 19, 2004\n1.\nI&D 12.11\n2.\nSpherical aluminum shell of inside diameter 2m is evacuated and used as a\nradiation test chamber.\na. If the inner surface is coated with carbon black (ε = 1) and maintained at\n600K, what is the irradiation, G, on a small black test surface placed in the\nchamber? At thermal equilibrium, what is the radiosity, J, of the test surface?\nb. Repeat Part (a) for the case in which the inside surface of the aluminum\nsphere is not coated (for aluminum, ε = 0.1).\nc. Repeat Part (a) for the case in which the sphere is coated (ε = 1), but the test\nspecimen is gray (for the test specimen, ε = 0.8).\nd. If, in Part (c), the initial temperature of the test specimen is 300K, what is the\ninitial net rate at which the specimen receives heat from the surroundings?\nExpress your answer in W/m2.\nStefan-Boltzmann Constant = 5.670 x 10-8 W/m2 ⋅ K4."
    },
    {
      "category": "Resource",
      "title": "rec1019.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/4304bfe7502ad9afd4264d8faa4f6c29_rec1019.pdf",
      "content": "10.302\nFall 2004\nDiscussion Problem for Recitation on\nTuesday, October 19, 2004\n\n1.\nConsider a thin strip heater and its hemi spherical cylindrical reflector, as shown in\nthe sketch. The diameter of the reflector is 15 cm and the height of the strip heater is\n2 cm. Both may be treated as infinitely long. The temperature of the strip heater is\n1100oC and that of the environment is 20°C. All surfaces may be assumed to be\nblack.\n\n(a) What is the view factor F22? F24? (where \"4\" denotes the general environment).\n(b) If the convective interactions may be ignored (i.e., h = 0), what is the steady-state\ntemperature of the reflector?\n(c) If both sides of the reflector convectively interact with the environment, and if\nthe heat transfer coefficient for each side is 15 W/m2-K, what temperature will\nthe reflector attain? Assume that the heater remains at 1100oC. An answer to\nwithin ± 25 C will suffice."
    },
    {
      "category": "Resource",
      "title": "rec1019soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/ab3c4c8ebe936ec1c17f46cfc71a977c_rec1019soln.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "rec1028.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/8ac06cd60d6a8fbd9967cfa547587a29_rec1028.pdf",
      "content": "10.302\nFall 2004\nDiscussion Problem for Recitation on\nTuesday, October 26, 2004\n\nConsider the situation described in Problem 7.24 of I&D. In addition, assume that the\ntransverse width is 2 cm and that the supporting rods are always at ambient temperature (25°C).\nThe strip temperature of 35°C as given in I&D should be understood to refer to the temperature\nat the back edge of the strip and half-way between the supporting rods. The thickness of the strip\nis 1 mm. Do not answer the questions posed by I&D. Instead, please respond to the following:\n\n(a) What is the power requirement if V = 1 m/s? If V = 5 m/s? If V = 25 m/s?\n\n(b) If the accuracy with which the temperature can be read is ± 0.2°C, what is the\nuncertainty in V if V ≅ 1 m/s? If V ≅ 25 m/s?\n\n(c) Is this a good idea?"
    },
    {
      "category": "Resource",
      "title": "rec1109.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/bc0b1dab7a550b8e833fbf3be29e236f_rec1109.pdf",
      "content": "10.302\nFall 2004\nDiscussion Problem for Recitation on\nTuesday, November 9, 2004\n\nA one-shell-pass, two-tube-pass heat exchanger is being designed to cool vegetable oil\nfrom 150oC to 60oC. The oil flows through stainless steel tubes with an O.D. of 15mm and a\ntube wall thickness of 1mm. Cooling water, which enters at 20oC, flows on the outside of the\ntubes. It is estimated that the heat transfer coefficient on the water side will be 1000W/m2·K and\nthat the coefficient on the oil side will be 300W/ m2·K. The water flow rate and the oil flow rate\nwill each be equal to 1kg/s.\n\na. What is the required exchanger area (based on tube O.D.)?\n\nb. The exchanger is put into service and operates satisfactorily, but its performance\ngradually declines. At the end of one year, the oil outlet temperature is 80oC. It is\nspeculated that the oil-side is fouled. How thick would a layer of stagnant goo have to be\nto explain the result? Is this plausible?\n\nc. If the exchanger were infinitely large, what would be the required water flow rate to cool\n1 kg/s of oil from 150oC to 60oC?\n\nData\n\nOil\n\nk = 0.139 W/m⋅K\n\nρ = 850 kg/m3\n\ncp = 2120 J/kg⋅K\n\nWater\n\nk = 0.670 W/m⋅K\n\nρ = 975 kg/m3\n\ncp = 4190 J/kg⋅K\n\nGoo\n\nk = 0.139 W/m⋅K\n\nStainless Steel\n\nk = 15 W/m⋅K\n\nρ = 8000 kg/m3\n\ncp = 480 J/kg⋅K"
    },
    {
      "category": "Resource",
      "title": "rec1109sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/38e2cc3fdb737da702b39af8ecf9d39b_rec1109sol.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "rec1116.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/ba4687aa94c8b00fb77ff3f8ae2696ef_rec1116.pdf",
      "content": "10.302\nFall 2004\nDiscussion Problem for Recitation on\nTuesday, November 16, 2004\n\nExhaust gas from a furnace is to be used to preheat the combustion air supplied to the furnace\nburners. The gas has an inlet temperature of 1100K and the air has an inlet temperature of 300K. The\nheat capacity for each fluid is 1075J/kg.K. The overall heat transfer coefficient is 100 W/m2·K.\n\na. In one configuration that is contemplated, the flow rate of each fluid will be 15 kg/s and the\nexchange will occur in a single-pass crossflow exchanger (both fluids unmixed). What exit\ntemperature will the air attain if the exchanger area is 500 m2?\n\nb. What exit temperature would the air attain if the heat exchanger were of the true counter-current\nvariety and infinitely large?\n\nc. Consider the situation described in Part (a) but permit the combustion gas flow rate to assume\nvalues other than 15 kg/s. What value of the combustion gas flow rate would be necessary if the\ndesired exit temperature of the air were 1000K?\n\nd. As another method of increasing the exit air temperature (without increasing the combustion gas\nflow rate as in Part (c)), it is suggested that it might be desirable to simply increase the heat\nexchange area. To this end, two configurations are under consideration:\n\n(i)\nA situation exactly as described in Part (a) except that the area of the single exchanger\nwould be 1000m2 rather than 500m2.\n(ii)\nTwo single-pass crossflow exchangers would be used. Each would be identical to the one\ndescribed in Part (a), i.e., A = 500m2, etc. The flow arrangement would be as follows:\n\nU = 100\nA = 500\nU = 100\nA = 500\nAir\n300K\n1100K\nCombustion gas\n\nWould scheme (i) or scheme (ii) give the higher air exit temperature? Why? What would the air\nexit temperature be?"
    },
    {
      "category": "Resource",
      "title": "rec1116sln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/1e6a7ec00b5e9a4f010190a13aa14e06_rec1116sln.pdf",
      "content": "Recitation 9\na.\nGas:\nTin = 1100K\nm = 15kg/sec\ncp = 1075J/kgK\nA = 500m2\nAir:\nTin = 300K\nm = 15kg/sec\ncp = 1075J/kgK\nGas:\nTout = ?\nAir:\nC\nTout = ?\nmin = C\n= (15kg/sec)(1075J/kgK) = 16125W/K\nmax\nR = 1\nW\nC min\n16125 K\n\n(\n\nW\n2)\n500m\nm K\nUA\n.3 1\nNTU\n=\n=\n=\nFig. 11.18: ε= 0.69\nEqn. 11.33:\n\nC r\n{\n0 22\n.\nexp\n\n}\n(\n-\n[ C\nNTU\nr\n]\n)\n0 78\n.\n(\n\n)\nexp\n\nε = -\n-\nNTU\n)\n(\n[\nexp ( )\n.\n1 3 1\n- ] }\n{\n0 22\n.\nexp\n)\n(\n[ -( )\n.\n1 3 1\n0 78\n. ]\nε = -\n0 689\n.\n=\n-\n-\n-\nK\n300K\nTair out\n,\nT\nT\nT\nTair out\n,\nair in\n,\nair in\n,\nε =\n= .0 689\n=\n-\nK\ngas in\n,\n852K\nT\n⇒\n=\nair out\n,\nb.\nA → inf\nSince C\n= Cmin, the slopes of the lines for the two streams are the same (i.e. the lines are\nmax\nparallel). Therefore, the only way for a pinch point to occur is for the lines to completely\ncoincide.\n⇒ Tair,out = 1100K\n\nc. Want Tair,out = 1000K\nSince mair will have to increase for this final temperature, Cgas = Cmin\n⇒ NTU = 3.1 still\n⋅\n\n,\n,\nm cp (Tair out -Tair in ) 1000K -300K\n\nair\nε =\n=\n= 0 875\n⋅\n\n.\n,\n,\nm cp (Tgas in -Tair in )\n1100K -300K\n\nair\n⋅\nR\n.\n⇒\n=\n\n0 3 = C min = m air\nC\n⋅\nmax\nm gas\n⋅\n⇒ m gas ≈ 50 kg\nsec\nC\nd.i. This is the same solution technique as in part (a):\nmin = C\n= (15kg/sec)(1075J/kgK) = 16125W/K\nmax\nR = 1\n\n100 W\n(1000m )\nUA\n\nm K\n.\nNTU =\n=\n= 6 2\nW\nC min\n16125 K\nFig. 11.18:\noff the chart!!!\n0 22\n0 78\n.\n\n)\n{exp[-( )( .\n.\nEqn. 11.33:\nε = -exp[( )( .\n.\n\n) ] -1}] = 0\n\nε = Tair out -Tair in = Tair out -300K = 0 77\n,\n,\n,\nT\n.\ngas in -Tair in\n1100K -300K\n,\n,\n= 916K\n⇒ Tair out\n,\nd.ii.\nCombustion gas\nU = 100\nA = 500\nU = 100\nA = 500\n1100K\nAir\n300K\n\nSince both exchangers have the same area and heat transfer coefficient as the heat exchangers\nin part (a), their efficiencies and NTU's will be the same:\n\n100 W\n(500m )\nUA\n\nm K\n.\nNTU =\n=\n= 3 1\nW\nC min\n16125 K\n0 22\n0 78\n.\nε\nε 2 = 1-exp[( )( .\n.\n1 3 1) ] -1}] = 0 689\n=\n1 3 1)\n{exp[-( )( .\n.\nThe following equations apply:\nh(\n,\nc(\n,\nε1 = qact = C Th i -Th,int )\nC Tc o -Tc,int )\n=\nq\n,\nmax\nCmin (Th i -Tc,int )\nCmin (Th i -Tc,int )\n,\n(1\n⇒Th,int = Th i -ε1(Th i -Tc,int ) =\n-ε1)Th i + ε1Tc,int\n,\n,\n,\nh(\n,\nc(\n,\nε2 = qact = C Th,int -Th o)\nC Tc,int -Tc i)\n=\nmax\nCmin (Th,int -Tc i)\nCmin (Th,int -Tc i)\nq\n,\n,\n⇒Tc,int = ε C\nh,int -Tc i) + T\n= ε2C T\n+\nε C\nc i\nr(\n,\n(1\nr)\n,\n,\nc i\nr\nh,int\nC Th i -Th,int ) = C\nc o -Tc,int ) ⇒T , = C\nh i -T\n) + T\nh(\n,\nc(\n,\nc o\nr(\n,\nh,int\nc,int\nh(\n,\nc(\n,\n,\nC\n,\nC Th,int -Th o) = C\nc,int -Tc i) ⇒Th o = Th,int -1 (Tc,int -Tc i)\nr\nPutting the equations together:\nTh,int =\n-ε1)Th i + ε1Tc,int = (1-ε )T\n+ εε C T\n+ ε\nε C\nc i\n(1\n(1-\nr)\n,\n,\n,\nh i\n1 2\nr\nh,int\nT\n⇒\nh,int = (1-ε1)Th i + ε1(1-ε2C\nc i\n,\nr)\n,\n1-εε C\n1 2 r\nT\n⇒Th,int = Tgas,int = 773.6K\nTc,int = Tair,int = 626.4K\nh,o = Tgas,out = 447.2K\nT = Tair,out = 952.8K\nc,o\nNote: This solution can be checked using an overall energy balance on the system or on\neach heat exchanger individually:\n?\nq\n= C\nh i -T , )=C T\n-Tc i)\nh(\n,\nc(\n,\nact\nh o\nc o\n,\nWhen numbers are plugged in, the solution works out correctly\n⇒The configuration with the heat exchangers in series will allow for more efficient heat\ntransfer compared to a single larger heat exchanger. This is because the heat exchangers in\nseries are closer to a counter-current flow heat exchanger (F→1)."
    },
    {
      "category": "Resource",
      "title": "rec1123.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/d60e5bef2a6e1e0a2cf69be3509e5779_rec1123.pdf",
      "content": "10.302\nFall 2004\nDiscussion Problem for Recitation on\nTuesday, November 23, 2004\nThe Druckelhammer Brewing Company is contemplating a switch from one-liter glass bottles\nto one-liter plastic bottles for their famous beer. This will obviously result in a lighter bottle that will\nnot break when dropped. However, they are concerned that the beer will go \"flat\" during storage. You\nhave therefore been asked to estimate the rate at which CO2 is lost from the beer. For estimation\npurposes, it is agreed that the following properties and assumptions may be used:\nBottle\nThe bottle may be treated as a simple right circular cylinder. The diameter is 8.5 cm and\nthe height is 18.5 cm. The bottle is filled to a height of 17.5 cm with 1 cm of \"gas space\"\nabove the liquid. The thickness of the plastic (polyethylene terephthalate) will be 0.75mm. For\ntransport calculations, use an area of 580 cm2.\nBeer\nInitial concentration of CO2 = 0.25 moles/L\nhm = 10-4 cm/s for that portion of the bottle which is \"wet\" by the beer\nhm = 1 cm/s for that portion of the bottle which is not \"wet\" by the beer, i.e. for\nthe gas space above the beer\nAmbient\nIn the surrounding air, the concentration of CO2 is 20 x 10-6 moles/L\nhm = 1 cm/s\nPlastic\nDco2 =\nx\n- cm2 /s\nThickness = 0.75 mm\nUnless stated otherwise, you may assume that the concentration profile in the\nplastic has attained steady state.\n\nPartition Coefficients for CO2\nSair/beer = 0.5\nSplastic/air = 3\nA. Sketch the CO2 concentration profile that would exist at very long times when equilibrium with\nrespect to the ambient has been achieved (i.e. at t = inf, after the beer is completely \"flat\").\nBeer\nPlastic\nAir\nC = 20 x 10-6 moles/L\nC = 0\nB. What is the value of the overall mass transfer coefficient for the transport of CO2 from the\nliquid to the air? Use the beer-phase concentration to describe the driving force.\nC. How will the flux of CO2 from the gas phase (top of the bottle) compare with that from the rest\nof the bottle? In other words, which flux is larger? Why?\nD. What fraction of the CO2 will be lost to the ambient air during one month of storage?"
    },
    {
      "category": "Resource",
      "title": "rec1130.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-302-transport-processes-fall-2004/26730584b801de19f19dd1299afef7af_rec1130.pdf",
      "content": "10.302\nFall 2004\nDiscussion Problem for Recitation on\nTuesday, November 30, 2004\n\nLong polymeric cylinders with a radius of 2 mm have been produced in the laboratory with the\nintent of using them as part of an implantable biomedical device. Unfortunately, the rods contain\na small amount of monomeric residue which must be extracted prior to use. In order to achieve\nthis, the rods will be immersed in a large volume of well-stirred solvent. You have been asked to\nestimate the time required to achieve a ten-fold reduction in the monomer concentration at the\ncenterline of the cylinders. The diffusivity of the monomer within the polymer is 10-6 cm2/s, and\nthe mass transfer coefficient between the surface of the rods and the solvent is 10-3 cm/s. Two\nsolvents are under consideration and the solubilities of the monomer in the two solvents are\nknown to be quite different. Specifically, the equilibrium partitioning of the monomer between\nthe solvent and the polymer is given by:\n\nSolvent A:\n[\n]\n[\n]P\nM\nA\nM\nC\n\nC\n=\n\nSolvent B:\n[\n]\n[\n]P\nM\nB\nM\nC\n\n0.05\n\nC\n=\n\nwhere:\n\n[\nM\nC ] is the monomer concentration\nA refers to solvent A\nB refers to solvent B\nP refers to polymer\n\na) What is the Biot number associated with the use of solvent A?\nb) What is the Biot number associated with the use of solvent B?\nc) If solvent A is used, how many hours will be required to achieve a 10-fold reduction in the\ncenterline concentration?\nd) If solvent B is used, how many hours will be required to achieve a 10-fold reduction in the\ncenterline concentration?"
    }
  ]
}