{
  "course_name": "Transmedia Storytelling: Modern Science Fiction",
  "course_description": "Transmedia narratives exist across multiple storytelling platforms, using the advantages of each to enhance the experience of the audience. No matter which medium nor how many, the heart of any successful transmedia project is a good story. In this class we will spend time on the basics of solid storytelling in speculative fiction before we move on to how to translate those elements into various media. We will then explore how different presentations in different media can complement and enhance our storytelling. While we will read scholarly articles and discuss ideas about transmedia, this is primarily a class in making speculative fiction transmedia projects. We will analyze the strengths and weaknesses of various mediums and consider how they complement each other, and how by using several different media we can give the audience a more complete, rewarding, and immersive experience.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Visual Arts",
    "Film and Video",
    "Photography",
    "Humanities",
    "Literature",
    "Creative Writing",
    "Fiction",
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Visual Arts",
    "Film and Video",
    "Photography",
    "Humanities",
    "Literature",
    "Creative Writing",
    "Fiction"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nIn 2006, Henry Jenkins defined 'transmedia' as narrative that has been conceived across multiple storytelling platforms to take advantage of each in order to enhance the experience of the audience. Most transmedia experience rarely adheres to this definition; more generally we find a story that has success in one medium expanded into another for commercial as well as artistic reasons. No matter which medium or how many, the heart of any successful transmedia project is a good story. In this class we will spend time on the basics of solid storytelling in speculative fiction, before we move on to how to translate those elements into various media. We will then explore how different presentations in different media can complement and enhance the experience for the audience.\n\nWhile we will read scholarly articles and discuss ideas about transmedia, this is primarily a class in making speculative fiction transmedia projects. We will analyze the strengths and weaknesses of various media and consider how they complement each other, and how by using several different media we can give the audience a more complete, rewarding and immersive experience.\n\nStudents will write one theoretical paper, do one solo expansion, and then work in teams to create a transmedia project that they will present to the class. Graduate students will do additional readings and write an additional and more advanced paper.\n\nMajor Assignments\n\nThere will be three major assignments in this class.\n\nA single expansion from a student's previous original work onto another platform.\n\nA critical, analytical essay on some specific aspect of transmedia or a single transmedia product.\n\nAn original team-created narrative that functions on multiple platforms, each of which enhances and expands the storytelling in a manner unique to that platform.\n\nRequired Texts / Media\n\nMost readings will be made available online. The following text and game are required for the class and must be acquired by all students.\n\nCollins, Suzanne.\nThe Hunger Games\n. Scholastic Press, 2010. ISBN: 9780439023528. [Preview with\nGoogle Books\n]\n\nZombies, Run\n. Six to Start with Naomi Alderman, 2012-present.\n\nStudents will also be required to sign up for and use an online tool to create and share curated collections of multiple media.\n\nTo receive graduate credit, students will do additional reading and write a second paper on a more advanced topic.\n\nGrading\n\nIn this class I will use what is called \"contract grading.\" That means that you and I have a contract: You will take this class seriously and fulfill the requirements to your best ability and you are guaranteed a B. If your grade ever drops below a B I shall notify you immediately. To receive an A will take more effort, talent, or originality.\n\nDeadlines\n\nDeadlines count. In the real creative commercial world, creators are penalized for missing deadlines. (Even if you work for yourself, if your audience expects a product at a specific time and you do not deliver, they become disappointed and then apathetic, and later reluctant to buy.) If you ask for an extension 24 hours before the deadline, I am frequently generous.\nDo Not\nshow up without work or an extension on the day something is due. In that case the assignment will\nDrop a Full Letter Grade, No Exceptions.\n\nAttendence\n\nThis is a hands-on class. While there will be some lecture and discussion, we will do exercises and work toward creating transmedia projects. The last classes of the terms are reserved for teams to work together on their projects. Missing class means missing far more than you can make up by reading some notes. Therefore, more than two absences for any reason other than serious illness / family emergency will be penalized.\n\nElectronics\n\nPlease bring laptops to every class. Laptops and phones are\nNot\nto be open during lectures and discussion unless I specify; they will be used to access various images and examples, for exercises, and for group work throughout the semester. Please remember to silence all cell phones before class.\n\nFood And Drink\n\nPlease do\nNot\nbring food to class unless you bring enough for everyone! It is rude to eat in front of others (who may be hungry and tempted to snatch your snack.) Beverages, however, especially those that will keep you alert and hydrated, are strongly encouraged.",
  "files": [
    {
      "category": "Resource",
      "title": "A Memoir of Helheim",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/60985d8eea970ae84d77a2e0ffccaa43_MIT21W_763JS14_MmoirHelhm.pdf",
      "content": "A Memoir of Helheim\nHel. There are two words with this pronunciation in the languages of the natives of this\nplanet. One is used to describe a most despicable place, a fiery prison where those who commit\nsocially unspeakable acts (according to their sense of morality), are sentenced to be punished\nand suffer for eternity. This is not my Hel. My Hel-short for Helheim-is much better described\nby the other word. It comes from the Nordic people, who are based in a region known here as\nScandinavia. In their myths, fables, and ancient stories, it is a place where people go after death\nif they have not perished in battle. This is a preposterous thing to say of my home, but their\ndescriptions are strikingly accurate, with some exceptions. It begs the question of whether they\nhave made contact with us before. I believe that they have. Presumably, that is what gave those\nfoul, mad scientists the idea of summoning us in the first place. Now we are stranded here, on\nEarth, by some scientific or magical process that I do not fully understand.\nWhile others from my planet bicker and quarrel over returning home or not, I cannot help\nbut remember with some nostalgia the world from which we came. In the Norse culture it is\noften depicted as a dark and cold place. To humans, this seems a hostile environment. This\nunderstandable, as the place they come from is so noxiously bright. But we are Æsmegir. We\nprefer the low-lit valleys, the twisting caves, and the frigid waters of the Gjoll river that\nmeanders around much of the land of Helheim. Walking in most directions eventually leads to\nthis river; it almost forms a vast twisted ring around our home. A deep, rich mist often forms on\nits banks, as well as the other rivers, creating a soothing, mysteriously peaceful environment as\nfar as the eye can see. The psychedelic colors of Earth can be a strain to the take in, and the\nsimpleness of the gleaming ice and rock that make up our home would would certainly be a\n\nsoothing sight in comparison.\nThroughout the flatlands, where most of us lived, there are scarcely dispersed towering\npillars of stone. In the cracks and on the tips of these pillars, the Hrafnar make their homes. They\nare slim, bony flying creatures resembling birds that are sometimes kept as a sort of pet by the\nÆsmegir, but are more often considered a rather amusing nuisance. Their awkward screeching\nand the constant clatter of their bones as they fly are often the subject of jest and mockery.\nThough Earth's Norse have often depicted them as ravens that eat the eyes of sinners, they are\nmostly docile beings, behaving more like roaches and fluttering away in fear at any movement.\nIf one follows the pillars in one direction, they increase in size and become more\nfrequent, giving rise to rocky mountains that make Earth's peaks seem feeble, at most. Living\nhere is more difficult (but not impossible) for us, for the mountains are the preferred shelter\nof the Drekar. To a human, these beasts are best described as great winged reptiles. They can\nbe seen circling the mountains from a great distance, for their mouths emit sparks and their\nwings create strong winds that rip through the valleys with booming howls. They arrive at the\nflatlands as light breezes. On particularly windy days we know the Drekar are flying. In the\nother direction, the pillars become smaller, and the land colder. The rivers begin to freeze, the\nair thickens, and all sound diminishes to a low whistle. Ice formations and snow dunes dominate\nmost of the land, and a peaceful race of small, dwarven beings resides here. We do not interact\nwith them very much, for they are timid and reserved. We respect them, as they respect us, and\nwe do not meddle in each others' affairs.\nA shining beacon can be seen in the distance from most parts of the realm, a glistening\nstar in the fog. It is the Helgate, which lies at the end of an almost iridescent gold bridge that\ncrosses the Gjoll. This bridge is the safest way across the river, for the water flows with a\n\nstinging poison that it displaces from the rocks underneath. The gate and bridge are very dear to\nmany of the Æsmegir, as it evokes cherished memories from our younger years. We used to play\non the radiant cobblestones and race to the gate. There was a great black hound with glowing\neyes and a blank stare that sat at the foot of the gate. We would tease him while keeping our\ndistance, for he would growl and attack anyone who got too close.\nWe were described by many of the human scientists as \"evil spirits.\" In fact, many of the\ninhabitants of my planet are described as such by the Norse as well, in order to make their deaths\nseem more frightening. It seems that they only view that which they do not understand with a\nself-created fear. As a different species, we differ with humans in specific physical, intellectual,\nand emotional characteristics; as sentient intelligent beings, we share basic ambitions, social\nstructures, and desires.\nHel does not have \"government\" as it is known on Earth. These hierarchies seem petty\nand irrelevant, within our civilization. Admittedly, certain individuals do have more influence on\nothers, but they do not truly rule. This brings to mind a memory of the great Hel. Not the land,\nbut an equally named Æsmegir. She was known by most for a characteristic best approximated\nby the human concept of \"beauty.\" She was also greatly admired for her eloquence and charm.\nHel lived with her husband-who was also stranded on Earth with me-in a great hall in the center\nof the flatlands. The skillfully carved stone and great columns made this the most unnecessarily\nlavish dwelling in all the land. Most other dwellings across the flatlands are more humble,\nconsisting of simple stone huts. The few that live in the mountains use caves for homes.\nAll Æsmegir generally expect a high level of respect from one another, regardless\nof specific identity. It seems that only upon arriving to this new planet has this respect been\ndisturbed. Perhaps connected to this fact, for greed seems to be a driving force for many humans,\n\nwealth as Earth knows it does not really exist on Helheim. This may be because we require little\nsustenance (though some of the stranded Æsmegir have developed quite the human appetite\nsince arriving at Earth) and the distinction between rare resources and more common ones\nbecomes more blurred in a world of sheer stone and ice. In fact, the only variations to this simple\nand peaceful atmosphere are the Helgate and bridge, whose origins and material are unknown.\nÆsmegir also do not have individualized professions or specific duties. We are, in a sense, all\nphilosophers, scientists and artists. In Hel, we do what we choose, as long as we try to stay\nrespectful and helpful to our society.\nI have not failed to notice that there is one region of Hel that I have not described. This\nis because I know very little of it. The Æsmegir, including myself, lived in Niflheim. It includes\nthe land within the Gjoll river. Most of us stayed there, and were not too well informed of what\noccurs outside. The vicious hound, the poisonous waters, and the familiarity of home were\nenough to keep most of us close to our dwellings. As for the other region, past the gate, on the\nother side of the Gjoll, we know it only by what we see: pure darkness, or Myrkr.\nI know of only one fellow Æsmegir, who on Earth goes by the name of James, that\nknows of Myrkr. He lived there a good amount of his life, but refused to reveal to us how he\narrived there. In our years together, he recounted many stories of the treachery and vileness of\nthat land. It seems fear is a characteristic of all life, for if I have ever seen fear upon the visage\nof an Æsmegir, it was on James' face when he told those stories. He could barely see in Myrkyr,\nmost of the time. He spoke with a tormented gaze of bottomless gorges where the most foul of\nbeasts live. Sometimes pale, transparent beings that could be mistaken for a cloud of mist would\nemerge from the ravines and congregate in flocks that would circle over him. He'd hear their\nconstant whispers, almost resembling Æsmegir voices, but not quite. When he tried to interact\n\nwith them, they screamed sharply and repeatedly smashed him against the boulders. James also\nmentioned great monsters of epic proportions that could sometimes be distinguished lurking in\nthe darkest corners of the precipices. On one occasion, he had an encounter with a serpent that\nshot an excruciatingly painful venom into his chest. Learning of the horrors of these lands made\nme wonder if it was in Myrkr that the Norse based their idea of Hel.\nIn any case, this is not the Helheim I remember. My Hel is peace, it is familiarity, it is\nhome. I do not know when or if I will ever return. It is of no great importance. I have lived on\nEarth far too long. The others will likely argue for eternity about getting back, but I refuse to take\npart in these discussions. They are futile. I simply wish to make the most of the situation I find\nmyself in. Memories of Hel keep me sane on long days, and when I look to the night sky, the\nstars are reminders of a the great gate that must still be standing in the fine place I once called\nhome.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Chuck Travels on His Stomach",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/e14c5123072a2d865ecf982807bd1cbc_MIT21W_763JS14_ChuckTravel.pdf",
      "content": "This is following Chuck and his food as he moves through places\n1. (1945) Nazi Germany\nChucks body felt foreign. Like all his limbs were asleep. He saw through his eyes, but\nit seemed unreal. The world was bright, terrifyingly so, but he felt to disconnected to\nexperience this as pain. Bright and hot. Slowly Chuck felt pricks of sensation through the\nfog. While his host body didn't seem to object to the warmth or light, Chuck did. The pins\nand needles of temperature, light, taste, sound were disorienting. Where am I? Hel was\ndark, by comparison this room was awash in a blinding light. As the pricks of sensation\nbecame more frequent Chuck came to an increasing understanding that this was not his\nhome and that he was very very far from being okay. Chuck wondered what sort of cruel\nbeing would create a world filled with scorching light.\nChuck lay unmoving in the dimly lit room, the only light cast by dim bulb in the corner.\nChuck would later discover with a sense of despair that the midday sun was a solid 3\norders of magnitude brighter than Hels brightest day.\na. Can of beans (nothing cooked)\n2. (1945) Britain\nThe first month of shaky body control and nausea inducing light and heat flowed into two\nmonths of prodding from the scientists. The scientists were deeply disappointed in their\nfailure to create either an improved soldier or a spy. We just seemed weak, confused\nand discoordinated after their efforts.\nAfter three months in confinement Chuck is freed by the British allied soldiers. As awful\nas that place was, Chuck can't help but feel despair when he finally reaches freedom\nonly to find that it is bathed in hot white light. This world, is the worst. His one comfort\ncomes from the relief offered by the often miserable weather of Britain. Nothing in\nLondon made Chuck happier than the smoggy, dark rainy days.\na. carrot and potato mash: (Will)\nhttp://1940sexperiment.wordpress.com/2010/01/12/carrot-and-potato-mash/\n3. (1946) United States, New York\nMoving to America, while clearly the correct choice, came at a terrible time. June, Chuck\nfeels, is the month from Hell. Not Hel, Hel is a place of cool dark peacefulness. Hell is\nfilled with light and fire. Just like June. Chuck thinks he has a good grasp on human\nreligion, Chuck is not correct. At the moment he still believes that Jesus was killed by a\nmistletoe dart shot by Loki. He is very convinced that mistletoe being hung at Christmas\nis intended as a reminder to be watchful of Loki. He will be corrected by a shocked\nminister at a Christmas party in 1948.\nChuck, with his questionable understanding of human culture, has not passed an\ninterview. He is currently living in a New York slum while figuring out how to get involved\nwith nuclear science. Chuck bonds with Robert with all the time they spent in the UK and\nNew York together. Robert often seems cold and distant, constantly thinking about his\nwife Hel. Chuck, however, is more than happy to have something in this world be cold\nand dark.\na. Cole Slaw (Derek)\n\ni. Cracker\nii. Canned pickled cabbage\n4. (1948) United States, Boston\nChuck moves to Boston with Thomas. Thomas managed to get Chuck an unpaid\ninternship as a lab assistant at MIT. Chuck is getting money from James, who has\napparently been successful in the banking industry. Moving to Boston in November\ngave Chuck an excellent impression of Boston. Rainy, cold, dark, Chuck is pretty sure\nBoston is the most beautiful place on the planet. His hopes for a truly enjoyable home\nare dashed when April comes around. When his coworkers get excited to play baseball\noutdoors Chuck conveniently needs to study, a lot, in the basement library.\na. Vegetable casserole (Andrea)\ni. Many options\n5. (1950) United States, Albuquerque\nThe Z division is amazing. The work is very exciting. Directly building weapons makes\nChuck excited. His co-workers even start to describe him as 'peppy'. Whenever Chuck\nthinks about it he worries that humanity is rubbing off on him. Having been on earth for\n5 years Chuck now has a pretty good sense of human culture. He even understands the\nexistence regional sports teams. Chuck feels that regional sports teams are the most\nconfusing piece of human culture.\na. Red chili on potatoes and seitan? (andrea)\nb. Red chili over rice and bell peppers?\n6. (1952) United States, Albuquerque\nChuck runs into Ruth on his lunch break. Ruth works at an air force base. Ruth\nHashimoto is unusual as an air force employee for two reasons, she is a woman and\nshe is of Japanese descent. Chuck mentions his surprise that the air force would hire\nher, Ruth explains that she taught Japanese to the air force and what did he care she\nwas a citizen. He asked if she had been interred. Chucks question makes Ruth visibly\nuncomfortable,\n\"Yes\" she says.\n\"I was in a German prison camp\" Chuck mentions conversationally.\nChuck continues smiling jovially and Ruth starts laughing.\n\"Bergen-Belson, specifically.\" Chuck continues to have a giant smile plastered on his\nface.\nAfter swapping dates and food conditions in respective camps the two decide to take\ntheir lunch break together. Ruth takes Chuck to a Japanese restaurant in the city. The\ntwo talk about the horrors humankind commits during war.\n\"I think that war is what caused people to do these things to us, which is why I am\nagainst war\" Ruth explained.\nChuck just reinforced his belief that people do terrible things. This world was terrible, but\nsoon he would get to leave. They were testing the TNW. They had set up their spell to\nsent them home and the TNW would serve as the high energy sacrifice required. Chuck\nwas ready.\na. Golden curry\n\n7. (1954) On a Boat in between Bikini Atol and Hawaii\nChuck was not ready for this. The bomb had gone off, that had been determined. Why\nweren't they home? They had run on deck and around the boat enough times to be sure\nthat, yes, they were still on earth. Chuck shot a look at Thomas, they had both done the\ncalculations! Why were they wrong? The two brought out sheets of paper and started\ndoing math again.\n\"Maybe our assumptions about the yield are wrong?\" said Chuck\n\"No, we tested those experimentally.\" Thomas shouted\n\"Not at this scale we didn't\" Chuck snipped.\nAfter a slew of math and caustic comments shared between Thomas and Chuck,\nthey start to share their conclusions. Thomas is sure they can't get home. The spell\ndidn't work. This was a failure. Chuck, however, found that while they had previously\npredicted a linear curve for yield of power spent to power in the spell, that the curve was\nactually sublinear! They just need more bombs. 150 TNW at the same time should be\nenough.\nChuck suggests that they could just start a thermonuclear war. Then everyone starts\nshouting. Anyone who thinks Thomas is correct feels destroying earth means being\ntrapped on a dead wasteland. Anyone who thinks Chuck is correct just wants to get\nhome.\nThe boat ride back to shore will be a long one.\na. Cake (Dillon)\ni.\nCake from a box works.\nii. If you are willing to replace eggs with applesauce (about 1⁄4 cup of apple\nsauce for an egg) then the cake would be me edible. But, don't do it if\nit will make it hard. (Also the cheapest pre-made icings are vegan. Yay\ncheap food!)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project Helheim Dialogue for Recording Script",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/d8561ca67d9297addd9c9d041b03d874_MIT21W_763JS14_Dilguercrdng.pdf",
      "content": "Start with 2 Nazi scientists (NS) talking about how to hide everything\nNS 1: Ahhh. Shit. I just ran into that table. I think something fell on the floor. Do you see\nanything? (slight pause) No matter. It is all going the same place now. We need to destroy all\ninformation from Project Helheim. The Allies can never know what we were working on here...\nwhat we accomplished.\nNS 2: You think I don't know that? I'm working on... What's that? Did you hear something?\nNS 1: No, you imbecile. There is no one here but us, but not for long. I have received word that\nthe British are already inside the walls. We don't have time for your fantasies.\nNS 2: Okay, I just... I could have sworn... (Noise simulating NS 2 being hit on head)\nJames: Quickly, knock the other one out.\nNS 1: What the... (hit on head)\nChuck: Thank you Robert. We don't have much time so I am going to be brief. The British are\ncoming and will be freeing these bodies from this horrid camp. I think it is best that we separate\nJames: Separate??? That is a terrible idea. We need to stick together. Our strength will only\ncome from being near one another and able to help each other.\nRobert: I think I'm with Chuck on this one James. The greater danger will be if more humans\ndiscover who we truly are.\nJames: Are you a fool? We can't possibly spli...\nFrank: Guys! Stop arguing! We don't have time for this!\nThomas: Fine, we will split up, but I do not think we should all be alone. I propose two groups:\nChuck and Robert, and James, Frank, and me.\nChuck: I think that can work. Here is what we will do: Thomas, you take James and Frank to\nAmerica. Robert and I will go to Britain. Communication will have to be kept to a minimum.\nOnce this crazy world has calmed down, we will figure out what to do.\nJames: Fine. But we figure it out together.\n\nRobert: Deal. I think our captors did have the right idea about destroying all of this evidence\nthough. Help me finish destroying these last few pieces of evidence that we ever existed.\nBritish Soldier in Distance: (Calls to fellow soldier) Hey! I hear voices over here. (In direction\nof demons) Come out with your hands above your head or else!\nChuck: Just stick to the plan and we will be fine.\nBritish Soldier: Oh God. There are more prisoners. Come on out. You're going to be okay.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Typescript",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/9f0845f00316bd9baea996f60f219fdc_MIT21W_763JS14_DilonHndwrt.pdf",
      "content": "2. It has been two months since we arrived here. I do not see us leaving anytime soon.\nWhat do we do?\nWe adapt. We learn about this world. There are 5 of us. We can learn a lot. Look at how\nwell we have mastered these bodies in such a short time. We need to blend in though.\nTake on human identities. From now on, call me Chuck. And make sure the others see\nthis note.\nI guess you can all call me Frank. But how does this get us any closer to leaving?\nThe humans brought us here somehow. I am going to figure out how and I will find a way\nto send us back home. For now, just lay low and find out everything you can.\n4. (Handwritten Letter from Thomas to Chuck)\nApril 10, 1946\nDear Chuck and Robert,\nHow has the United Kingdom been for you guys? America is\nfantastic. We are in some place called Boston. It is cold and cloudy\nand it rains and snows! The weather faintly feels like Hel. And I\nwould really like to go back, we all really want to go back. Speaking\nof home, I REALLY think you two should come here. The resources here\nmight be just what we need to make the spell work. In the meantime, we\nhave been doing like you asked and blending in with the humans. James\nhas started working with the humans in banking (I don't quite\nunderstand what he does), but he says it is going really well. He\nthinks pretty soon he will be able to help us all financially. Frank\nhas taken a liking to these collections of paper called books. He\nspends a lot of his time at a place called a library. I was recently\n\nhired in a nuclear engineering lab (I think our solution lies here,\nthey yield high energy) at some college called MIT (they are supposed\nto be pretty good). Again, you two should definitely come to America\nas soon as you can. We are looking forward to seeing you both again.\nSincerely,\nThomas, James, and Frank\n5. (typewriter note from T/C to R)\nJune 6, 1950\nDear Robert,\nThomas was able to get me an internship (unpaid) in the nuclear\nengineering lab with him at MIT! I started working almost two years\nago. I know what you are thinking, \"If it is an unpaid internship, how\nare you still living and how are you writing me with a typewriter?\"\nWell, it turns out James is doing extremely well here with his\nbanking. He is able to support me while Thomas and I work on OUR\nproblem. Which is the main reason I am writing you this letter.\nBecause of what I am going to tell you next, you need to make sure\nthis letter is always in your care or simply destroy it. Just make\nsure no one other than you ever views this letter. We have been\nworking tirelessly on figuring out just how much energy a nuclear\nwarhead (the humans call it a nuke) will give off. I guess I should\nalso explain what a nuke even is. So it is essentially a giant\nexplosion that will yield an enormous amount of energy. Thomas and I\nthink it might be enough to trigger the spell and get us home. We are\n\nstill running tests and I am actually moving to New Mexico for a new\njob working more closely with weapons. I can't say much more about my\njob, not in something like this letter. The government might be\nmonitoring me soon because of this new job. I know you want to go\nhome. We all do. Thomas and I will be using our influence to encourage\na nuclear test so we can use it to go home. We think with enough push,\nwe can make it happen in the next few years. I miss you my friend. I\nhope New York has been treating you well. Thomas, Frank, and James all\nsend their best, but you understand why they can't write you\nthemselves. We will be in contact if there is a test we can use.\nYour friends,\nChuck and the Boston gang\n6. (Typewritten letter from T/J to C/R)\nMay 5, 1954\nDear Chuck and Robert,\nI am glad I was able to find out you two are back in New York. I\nknow we did not end well after the spell did not work. I am writing\nyou to plead with you to not do anything rash. I'm sorry it didn't\nwork. We are all upset about this, but you cannot go and cause a\nthermonuclear war among the humans because you THINK it will work. We\nboth did our best with the calculations. It just is not going to work,\nregardless if it's one nuke or 150 like you think. We ran the tests\nChuck. We tried. And maybe this world isn't as bad as we thought. It\ncertainly is not bad enough to risk eliminating an entire race for the\nslim possibility it will work.\n\nFrank is gone. I'm not sure if you have heard yet or not. He has\nmoved to somewhere in Canada. He said he can't put up with the\nfighting between us. The last words he said to me before leaving were,\n\"We are all we have in this world. You, James, Chuck, Robert, and me.\nThat's it. And if you guys are just going to fight, I am not going to\nbe around for it.\" And you know what Chuck? I can't blame him. Frank\nis right, we ARE all we have. So please, do not keep this rift between\nus. I will be here in Boston with James. Contact us if you ever want\nto reconnect.\nAlways your friends,\nThomas and James\n7. (Typewritten letter from C/R to T/J)\nNovember 22, 1963\nWAS THIS YOU?? This ban on nuclear testing. I know you two had\nsomething to do with it. So just own up to it.\nHow dare you try and interfere with Robert and me. We are just\ncontinuing to do what we all agreed on doing since the moment we\narrived here, to go HOME. Do you even remember home anymore? Or have\nyou made yourself a new home here? Well I refuse. My home, Robert's\nhome, will always be Hel. Always. Just because you and James gave up\ndoes not mean we will.\nI have done the calculations Thomas. Thermonuclear war WILL work.\nI know you do not think so, but it will. Because of our history, I\nhave an offer, and I assure you, this is a one time deal. Robert and I\nwill give you one last chance to join us. I am going to give you both\n\none year to think this over, because if you are with us, then you need\nto be 100% with us. There is no alternative. Either you are all in or\nyou are all out. I hope you join us. I still remember what you said\nabout Frank's last words. I agree with him and that is why you must\njoin Robert and me. So we can all be together again. One year Thomas\nand James. No more. If you decline, that is the end of us.\nRobert and Chuck\n8. (Typewritten letter from C/R to T/J)\nNovember 29, 1964\nThomas and James,\nNot even a response. I expected, I hoped, for more. Consider\nthis the last time you will ever hear from Robert or me.\nI knew it was you two who caused that nuclear ban last year. I\ncan't believe you chose the humans over your own kind. Well hear me\nnow and hear me well, we will never give up on trying to go home.\nNever. Do not try and get in our way because the gloves are off now.\nWe will not hold back, against you or any human.\nGoodbye Thomas. Goodbye James.\nRobert and Chuck\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Assignment 1 - First Expansion",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/3394659f186732dd76456ed544707397_MIT21W_763JS14_Frst_Exp.pdf",
      "content": "First Expansion\nDue: Session 11\nIn this assignment, you will take a narrative you have previously created and\nexpand it into another medium. For example, if you have written a short story, you\ncan create a short video, a graphic story, or even a blog for one of the characters.\nLikewise, if you have created a game, you can take an element from the game and\nturn it into a story, video, graphic story, etc.\nRemember when you expand to another platform, you are not simply recreating the\nnarrative, but using the strengths and specific characteristics of the new medium to\nfurther explore and add depth and audience experience to the narrative.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project Helheim - Script 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/38498f7311599ffd4194db93de443a13_MIT21W_763JS14_Blog_1.pdf",
      "content": "Hello, and welcome to another episode of Security Theater, the only web series that gets to the\ntruth... beyond the truth.\n[Intro plays with title card]\nThere's been another development in Operation Kitty Danger. Fluffy continues to sleep on the\ncouch in the living room, and I'm now certain... very certain that her motives are sinister.\n[Cut to shot of sleeping Dos]\nI'm on to you...\n[Cut back to room]\nI've been recording her sleeping habits. Five days out of the last seven, she's been right there\nwhen I got home, and has used her cat bed once. Once! And why would she do that? Well,\nmaybe because the cat bed is in Rachel's room, whereas the couch, you see, the couch has a\nperfect view of the front door. Fluffy is watching us, and I think I know why.\nAt first I suspected Rachel, as it's her cat, but something happened last week that changed my\nmind. The landlord stopped by unexpectedly on Thursday, which is suspicious in its own right.\nAnd here's the thing -- our lease doesn't allow cats, but he saw Fluffy. He saw Fluffy, and all he\nsaid was\n[Cut]\n\"eh, as long as it doesn't make a mess, I'm okay with the cat.\"\n[Cut]\n\"I'm okay with the cat.\" A likely story. Clearly, clearly the landlord has been using the cat to spy\non us. I'm not quite sure how, yet. An implant, or telepathy maybe. Cat telepathy. If any of\nyou are cat telepathy experts, send me an email.\nBeat\nEmails!\n[Holds up email printouts]\n'CraftyDog' writes, \"Hey Stupid, why are you always so insane, did you get dropped or\nsomething as a baby. You are so dumb, you probably think that Mickey Mouse is mind\ncontrolling you.\"\n\nWell, no obviously Mickey Mouse isn't mind controlling me. That would be ridiculous. That\nbeing said, Disney is one of the most powerful forces on the planet right now, and is definitely\nworking with the government. Think about it. You walk into Disney World, and they slap an\nRFID tag around your wrist to track your every move. Then they herd you into nice orderly\nlines and shove you into gigantic machines, and when you start screaming people in line think\nyou're just having fun. People actually pay to do this. It's all part of a government program to\npractice crowd control and ensuring complacency once martial law is declared at the next stellar\nconvergence.\n[Holds up papers again]\n'Concerned Arborist' writes \"yesterday I watched The Happening. I don't know if you've seen\nit, but it's a movie about trees deciding to kill Mark Wahlberg. I have several trees in my back\nyard. Should I chop them down?\"\nWell, I can understand your concern. Hollywood has been known to make movies about dark\nsecrets in order to discredit so-called \"conspiracy theorists\" -- remember the fiasco with The Da\nVinci Code? -- but in this case, I will have to do some more research before I can say anything\ndefinitive.\nAll right, that about wraps it up for today. Coming up next week, I'll be doing another historical\nshow. You're in for a real treat. I've gotten my hands on some information the Government\nreally doesn't want you to see -- the truth behind black magic in World War II.\n[End title card + music]\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project Helheim – Document 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/9ccba8ada103b873eff20a5fcc9af1f0_MIT21W_763JS14_Projct_doc1.pdf",
      "content": "-------------\nCLASSIFIED TOP SECRET // ULTRA, OCCINT, HELHEIM, FAITHFUL\nFROM: DENNISTON, ALASTAIR\nTO: SOE OCCDEF DIVISION\n4 FEBRUARY 1942\nColonel Harris,\nI apologize for my lack of communication this past week. Naval\nCommand has been in a bit of a snit, and I have been fending off irate\nadmirals with a broom for days. The boys here at Bletchley tell me\nthat the Germans have been rolling out a new iteration of the Enigma\nfor their U-boats, a rather fiendish improvement on the original,\nand we have had some difficulty providing any intelligence on the\nAtlantic. Professor Turing assures me that they'll have it cracked\nwide open by tomorrow, at which point I might have a modicum of\nblessed peace.\nAt the moment, I have found five minutes between angry phone calls\nfrom increasingly high-ranking individuals to pass on some ULTRA intel\nthat you might be interested in. To be honest, I don't know why\nyou are assigning such importance to Nazi superstition. Meaning no\noffense, if I were you I would get out of OCCDEF and back into the SOE\nproper, but since the PM seems to be throwing entirely unfair amounts\nof cash your way I suppose you may have made a wise career decision.\nIn any case, we've intercepted a message to Himmler himself from a\nmajor in the Ahnenerbe-SS stationed at Bergen-Belsen. I've taken the\nliberty of providing an English translation below.\nGod save the King,\nAlastair Denniston\nDirector, GC&CS\nReichsfuhrer,\nIt is my great pleasure to inform you of our latest success with\nProject Helheim. Thanks to your efforts in procuring Jews in great\nnumbers, we have had no shortage of resources to calibrate the\nwundermaschinen, and today we have reached a significant milestone.\nWhile the test subjects inevitably perish shortly after the procedure,\nthey are able for several minutes before their deaths to serve as\nmouthpieces for the æsmegir. Two test subjects recited several\nverses of the Prose Eda in Old Norse, a language with which which\nthe subjects were unfamiliar, and five further subjects were able\n\nto converse with Doctor Schultze in their native language, but with\nknowledge and personality that were not their own.\n\nCLASSIFIED SECRET // OCCINT\nFROM: DENNISTON, ALASTAIR\nTO: SIS OCCDEF DEVISION\n18 FEBRUARY 1942\nColonel Harris,\nhttp://en.wikipedia.org/wiki/Kinetic_bombardment\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Assignment 2 - Critical Essay",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/36cfdf9934f682959706053e5b42d4b0_MIT21W_763JS14_CrtcalEsay.pdf",
      "content": "Critical Essay\nDue: Session 19\nThis is a short essay. I am interested in depth of analysis, so a tight focus and\npersuasive argument weighs more than scattershot examples and trying to tie in\nseveral different ideas.\nWrite an essay of 2,000-3,000 words on one of the following questions:\n1) Choose a single character or a project that has a life in multiple media.\nDiscuss a single aspect of that character or project that we have not discussed\nin class and analyze in depth what is successful about this aspect and what\ncould be improved. Aspects can include world building, visual imagery,\nunderstanding of character, or other. Be sure to pay attention to how\nexpansion onto multiple platforms has enhanced understanding/experience\nfor the audience--or how the creators missed the mark and merely repeated\nwithout truly engaging the potential for enhanced experience.\n\n2) Think of a single specific abstract aspect of transmedia (such as changing\npoint of view with different media, immersive experience, audience\ninteraction, etc.) and analyze it in depth. Use specific examples from various\ntransmedia projects that we have not discussed in class to examine how that\naspect can be used most effectively and how it can be misused.\n\n3) Choose two platforms and analyze how a single project can benefit from\nexpansion between these specific platforms. Use examples of projects we\nhave not discussed in class to explore both effective and ineffective\nexpansion between these platforms.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project Helheim - Script 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/2a27c596aac6af196a2219f12009ede3_MIT21W_763JS14_Blog_2.pdf",
      "content": "Hello, and welcome to another episode of Security Theater, the only web series that gets to the\nTruth... beyond the Truth.\n[Intro plays with title card]\nHello, everyone. I'd like to start today with a little history lesson.\n[Picture of map of Europe]\nThe Second World War was one of the greatest catastrophes of the twentieth century. Tens of\nmillions of soldiers and civilians dead on battlefields, millions more killed in the Holocaust, and\nwe saw\n[Picture of mushroom cloud]\nthe first use of atomic bombs in warfare, touching off the Cold War and bringing the planet to the\nbrink of nuclear annihilation.\n[Cut back to room]\nThe war on the Western Front ended with the suicide of Adolf Hitler on April 30th, 1945, bringing\nsix years of planet-wide destruction to a close. Or so the history books tell us. In reality, Hitler\nfaked his death and fled to South America, before ending up in California. Hollywood, to be\nspecific. Some time between 1945 and 1950, Hitler assassinated his estranged younger\nbrother,\n[Cut to picture of Mickey Mouse with a Hitler 'stache]\nWalt \"Hitler\" Disney. From there, Hitler was able to insert sinister Nazi subliminal messages\ninto every Disney film and TV show since. His influence continues to this day, the secret of\nhis identity passed down only to a select few loyal Disney employees before his death. Yes,\nFrozen is a delightful movie with heartwarming themes about sisterhood and friendship, but if\nyou've watched it, the subliminal trigger is already set. Once they flip the switch, we'll all be\nsaying \"Let it Go\" to the very concept of free will.\nI'm not sure whether the US government is complicit in Disney's schemes, or whether they think\nthat Disney is working for them. I've said it before -- either way, for the love of God, stay out of\nDisney World.\nBeat\nBut that's not what we're here to talk about today. Today we're here to talk about one of the\nmost terrifying people in Nazi Germany, Heinrich Himmler.\n[Cut to picture of Himmler]\n\nWhile Hitler was responsible for ordering the Holocaust in the first place, Himmler was the one\nwho carried it out.\n[Cut back to room]\nHimmler was the most powerful sorcerer in Germany, and perhaps the world at the time. His\npower has been surpassed to this day only by David Blaine, who has mercifully used his powers\nfor good -- so far. Himmler's mastery of the dark arts was unparalleled, and under his direct\ncommand was a well-trained paranormal army, a division of the SS called the\n[Cut to emblem of Ahnenerbe]\n\"Ahnenerbe.\" The Ahnenerbe-SS was basically a militarized version of the Thule Society,\n[Cut back to room]\na group of German mystics who uncovered dark, dangerous secrets of the universe, and\nplanned to use them to conquer the world. In particular, they discovered ancient magics from\n[Cut to Armanen Futharkh]\nAncient runes, runes that described the secret paths to Hel itself.\n[Cut back to room]\nNow, why am I bringing up history that's been dead and buried for more than half a century?\nBecause it turns out the Ahnenerbe-SS is alive and well, my friends, and they have people\nin some very high places. I have a source who is sending me some interesting documents\ntomorrow, documents on an old Nazi endeavor called \"Project Helheim.\"\nI can't wait to read them.\n[End title card]\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project Helheim – Document 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/0171a48938a7b210788bbb88ce74ec0d_MIT21W_763JS14_Projct_doc2.pdf",
      "content": "SECRET -- BRUSA EYES ONLY\nOSS INTELLIGENCE BRIEFING\nJUNE 14, 1943\nTHE THULE SOCIETY AND THE AHNENERBE-SS\nThe objective of this briefing is to provide an overview of the\ntactical and historical importance of the occult in Germany, with\nspecial emphasis on the Ahnenerbe-SS, the Thule Society, and Project\nHelheim.\nTHULE SOCIETY\nThe Thule Society is a collection of powerful individuals within\nGermany who are devoted to studying the occult. Ostensibly founded\nas a secret society in 1918, the core of the Thule Society has roots\nthat reach back to at least the eighteenth century, and possibly much\nearlier. They study mythology, primarily Norse, with the goal of\nproving that the Germans are the inherently superior race of man,\nand as such, the Thule Society has become composed almost entirely\nof high-ranking Nazis. Hitler himself has in recent years become\na member, and the society has prospered greatly under the current\nGerman regime. To date, the OSS has not viewed the Thule Society as a\nserious military threat, though we have (without success) attempted to\ninfiltrate it to gain close access to Nazi leadership.\nAHNENERBE-SS\nThe Ahnenerbe-SS is a division of the Schutz-Staffel concerned\nwith occult warfare, operating under the direct leadership of\nHeinrich Himmler. Founded by Himmler in 1935, the Ahnenerbe-SS\nostensibly exists as an obscure scientific effort to prove German\nracial superiority through archaeological investigation, and as such\nhas been closely involved with the Thule Society. As the War has\nprogressed and Hitler's involvement with the Thule Society has grown,\nthe responsibilities of the Ahnenerbe have expanded. In April 1941\nHitler tasked Himmler with using the Ahnenerbe-SS to pursue research\ninto the tactical uses of the paranormal in warfare, superseding his\narcheological research.\nIn the intervening years, the German government has funneled large\namounts of capital to the Ahnenerbe-SS, to no significant result.\nHitler's devotion to the Thule Society remains unabated, however, and\nthere is no sign that Himmler has lost his superior's support despite\nthe lack of returns of any discernable tactical value.\n\nPROJECT HELHEIM\nProject Helheim is the brainchild of Himmler, and his pet project\nwithin the Ahnenerbe-SS. British ULTRA intelligence shared via the\nBRUSA Agreement reveals large amounts of unconventional materials and\nassets (silver and gold ingots, esoteric objects from various Thule\nSociety members, scientists specializing in physics and electrical\nengineering, etc.) being delivered to the Nazi base at Bergen-Belsen\nby Himmler's orders under the authority of Project Helheim, leading us\nto conclude that the Project is headquartered at that location. Due\nto a lack of intercepted long-range radio communication relating to\nProject Helheim, we have very little intelligence as to the precise\ndetails of Himmler's goals or methodology. However, the sporadic\nmessages sent to Berlin indicate a lack of significant progress in the\nendeavor.\nIt is the conclusion of this office that the Thule Society, the\nAhnenerbe-SS and Project Helheim do not pose high-priority threats\nto the Allied war effort. We recommend further cooperation with\nthe British GC&CS under the BRUSA Agreement to share intelligence\nrelated to the Thule Society, as its nature as a social hub for Nazi\nleadership makes it a prime avenue for espionage or assassination.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Session 1: What is Transmedia?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/52fb19588ddf931de8d9927810ca3b61_MIT21W_763JS14_Session_1.pdf",
      "content": "21W.739/CMS.309 - Session 1\n\nHow old is transmedia?\n\nWho are you?\n\nWhy are you here?\nWhat is transmedia?\n\nWhat do you think transmedia is?\n\ntelling a story/narrative on different platforms\ntransmedia\n\n(media)\nvs.\n\nthat take advantage of the specific properties of those media to expand the\nmultimedia\n\nunderstanding/experience/participation of the viewer (participant?) and the\n\nnarrative\n\nHow old? At least 1k years -\n\nStained glass\n\ntext/read aloud\n\npassion plays\n\nwhile we are working with new media, the idea of crossing media to enhance the experience is not at all\nnew -\n\nThis class is going to be about making.\n\nWhat we convey - (story) content\nHow we convey it - (medium)\n\nWe're going to look at content first because no matter how cool your media presentation, if you don't\nhave compelling story, no one is going to care.\n\nStructure of the class -\n\n(this class is divided into 3 parts)\n\n1st Narrative -\n\nStorytelling -\n\n2nd - Expressing storytelling/engage audience\n\n3rd Making major project -\n\nTerms - 3 platforms serve narrative\n\nMedia & 5 senses -\n\nWe have 'em, they haven't changed\n\nsight & sound\n\nothers - stimulate in imagination\n\ntexture (feeling) touch, taste, smell\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Session 2: Science Fictions - The Genre and the Media",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/15ff09090ae5af1b1cbcc2362acda997_MIT21W_763JS14_Session_2.pdf",
      "content": "Transmedia Storytelling - Session 2\n\nReader Writer Contract\n\nStableford - 3rd Generation Science Fiction (SF) -\n\nSF moving from print to media?\n\nAlways has been in media but -\n\nPNH@Tor now declares it a \"TV Genre\"\n\nStart w/Stableford -\nBabylon 5 - 1st of long arc\n\nwritten in 97\nBattlestar Galactica - long story\nnew kinds of TC SF -\n(Orphan Black!)\n\nFirefly?? = Western!\n\nMorality embedded in the medium - (Stableford argues it is - at least in SF)\n\nmorality OF SF -\n\nof today but towards better\n\ndoes TV as a medium stifle/restrict that?\n\nOther media?\n\nBooks in TV universes -\n\nRestricted - YES -\n\n(I can tell about Trek books)\n\nWhy the restrictions in TV and not books/stories?\n\nOther media?\n\nHow can we work with those restrictions?\n\nUse them to advantage?\n\nWhat has happened in TV since this article? (Arc of story expanded)\n\nAll media have restrictions & expectations, these are not always necessarily a function of the medium -\nthough perhaps -\n\nWhy the change in TV to series with long arcs of story where you can't miss anything?\n\nVCRs (now DVRs, streaming, TIVO)\n\ntechnology so that people don't miss points in story\n\nbut still -\n\nmoving from a minority to a popular genre\n\nno longer \"insider\"\n\nReader/Writer Contract (maker/audience contract)\n\nWhat is it?\n\nThey pay, they give: Time, Attention, Disbelief\n\n[(writer, not Trek!) Checkov said gun on mantle, shoot it!]\n\nWe give: a particular experience\n\nplay fair\n\nfulfill the genre/style\nnot hang disbelief until Dead\nDo\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Session 3: Building the World",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/42d7a53d4c6263754ef3b6e6dc203e68_MIT21W_763JS14_Session_3.pdf",
      "content": "Transmedia Storytelling - Session 3\n\nIf you like, next class bring - blank paper, colored pencils, graph paper\n\nWorld Building 1 - (Hunger Games & Zombies, Run)\n\nElements of a world -\n\ngeology - astronomy - spaceship?\n\ngeography artificial?\n\nresources\n\nclimate\n\npopulation(s)\n\nsocieties\n\ngovernments(s)\n\neconomics !!!\n\nback to resources-\n\nfood\n\nenergy\n\n->Is it Earth? If yes, when? (extrapolate)\n\nIf no - where? What?\n\nWhat conditions?\n\nWho lives there?\n\nWhat theres are there?\n\n(Cities? Villages? Factories? Farms? Spaceports? Trade satellites?)\n\nDownside of worldbuilding - Too much fun!\n\nWhat do we recognize?\n\nHunger Games -\n\nWhat is the world?\nintroduce\n\nHow much do we understand from these first chapters?\nthe biotech\n\nHow does Collins introduce us to Panem?\nwith the\n\nEconomics\nmockingjay\n\nDistrict 12 vs. train vs. Capitol\n\npin\n\n3 places pieces of world\n\nplus other Districts\n\nZomb ies, Run -\n\nWhat do we know of this world?\n\nWhat are the economics?\n\nWhat do these worlds have in common?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Session 5: Building the Characters",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/bcd01076decd9183cb57a295d7acaeab_MIT21W_763JS14_Session_5.pdf",
      "content": "Transmedia Storytelling - Session 5\nCharacters\nKatniss is\n\nWhat makes a character compelling?\nunreliable\n\nRelatable - but relatable can be dull\nre: Peeta\nWhat do you find compelling in Hunger Games? (or do you? Compelling ACTION?)\n\nWhen Katniss volunteers - the Action\n\nIn SF - characters are BIG - outsized heroes\n\nThey can make the big choices - do outsized deeds - even save the world\n\nDiscovery of greatness - many kinds of greatness\n\nKatniss' & Peeta's greatness are different\n\nWe all want to believe we have the capacity of greatness\n\nBut it cannot be too easy - and there must be a cost (Haymitch)\n\nDo not assign flaws -\n\nA character's flaws arise naturally from who they are\n\nKatniss' flaws?\n\nCharacters w/o flaws are dull and not relatable\n\nWe also have to believe they can lose\n\nHow do we find out about a character?\n\nWhat they say/do/think\n\nWhat others say/do/think about them\n\nAre all these sources reliable? Which are the most? Least?\n\nWhat does the character WANT?? More than anything?\n\nLet's talk about -\n\nKatniss\n\nPeeta\n\nHaymitch\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Session 6: Building the Story",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/e8f212268b4f2825ba302468b41b6b02_MIT21W_763JS14_Session_6.pdf",
      "content": "Transmedia Storytelling - Session 6\nStory is about how characters grow, change, and become\nConflict -\n\nHow do characters get what they want?\n\nIt can't be easy to get\n\nThey must be willing to do something - What are they willing to do? How far will they go?\n\n2 kind of conflict: external, internal (talk about Hunger Games - Katniss's internal conflict?? Haymitch!)\n\nBest stories have both\n\nBest stories have complexities\nincluding confusing who is the \"good guy\" and who the bad (Vader is Luke's father)\nMatrix - why/where is that complexity\nElysium - not complex\n\nMany kinds of conflict - (James White - sector General)\n\nMost SF today, especially media, is extremely simplistic (cold war, Nazis, aliens - easy bad guys)\n\nWe WANT to be reassured we are always on the Side of Right.\n\nIt is possible to have multiple conflicts - even beneficial - and depending on the arc of the story\n(medium dependent)) you may need to seed multiple and resolve only a few. But you must resolve one\nmajor to give emotional closure for the audience - otherwise they are unsatisfied (end of Smaug -\nHobbit 2)!\n\nCHEAT ending -\n\nMultiple characters, multiple conflicts\n\nCharacters compete wanting the same (one) thing -\n\nQuest\n\nHunger Games\n\nDefined so that only one can have the prize\n\nBut let's think of other scenarios\n\nWhat characters want is in opposition to each other (rebel/status quo)\n\nStory is the character's internal growth\n*Difference between story and plot: plot are events, the scaffolding for the story\n\nSTEAL Plots - History, Classics (people think this is smart and love it!))\n\nWhat elements in the Hunger Games are stolen?\n\nMyth of Theseus & Minotaur - tribute of young men and women to the Beast\n\nBlow things up only when you need to - when you're stuck in the story!\n\nWe can enjoy lots of explosions, but we can't follow into multiple media\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Session 7: What Makes it Speculative Fiction?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/cb45785c4286f9d6e0a6ad1d23d249a3_MIT21W_763JS14_Session_7.pdf",
      "content": "Transmedia Storytelling - Session 7\n\nWhat Makes it SF?\n\nIs genre just a marketing category?\n\nCould you recase the narrative without the SF/fantasy element?\n\nWhat would it lose?\n\nFirefly - loses nothing - it is a Western in SF dressing\n\nWhy?\n\nIs the Hunger Games SF?\nWhat makes the Hunger Games SF?\n\nSo what ARE the identifiers for SF?\n\nDoes it HAVE to be in the future?\n\nI say that science needs to be in the center of the story (to be hard SF)\nOR extrapolation/exploration of ideas/ideologies\n\n-it CANNOT happen today w/o the fantastic/science/extrapolative element\n\nLaetz & Johnson (the worst!)\n\nWhat is wrong with this article? (They don't have a clue what \"transmedia\" actually means and they\nknow absolutely NOTHING about fantasy!!!)\n\nSo why did I ask you to read it? (The whole question of \"how do we identify fantasy\" is really useful and\nimportant - and applies to SF as well.)\n\nThis is an essential, pivotal question: What makes a narrative speculative fiction?\n\nWhat do you think?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Session 8: Media Axis - Information",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/214bc84411c8963176b9bdc4f2462c68_MIT21W_763JS14_Session_8.pdf",
      "content": "Transmedia Storytelling - Session 8\n\nInformation (Exposition) - Teaching the World\n\nNow difference across media (what we did before was the same across media)\n\nThese elements exist in all media, but they work differently\n\nEssentially, ALL narrative is about information and flow of information and how that's regulated\n\n-\"beats\"\n\nStructures -\n\nTension between -\n\nAction & assimilation\n\nRevelation & comprehension\nWhat moves the story forward?\nWhat lets us keep up with the flow of information?\n\n\"Breathless\" not always (ever?) where you want your audience\n\nExposition - more in our genre because we need to teach our audience how our world works\n\n\"As you know Bob\" moments\n- Exposition lumps -\nIn Hunger Games - why it all happens\n\nZombies Run - let's talk about this world and how we learn about it\n\nHow do we get exposition? (common technique - newcomer/stranger)\n\nCharacters being relatable - characters have the same concerns & priorities no matter the world\n\nCharacters want:\n\nSurvival\n\nLove\n\nSuccess\n\nPower -\n\nJustice\n\nRevenge\n\nWe might not know what these things look like in this world, but we understand that on a basic level the\ncharacters want them.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Session 9: Media Axis II - Sensory Information & Iconography",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/df2a42f37d9fe11cdea26befc9277e3b_MIT21W_763JS14_Session_9.pdf",
      "content": "Transmedia Storytelling - Session 9\n\nVisual Information\n\nWe always get information visual and we trust visual information - we privilege it, \"eyewitness\"\n\nSilent film (explain Napoleon, England, and our own war of 1812)\nNonlinear - a lot of information can be conveyed very quickly & efficiently\nSlide show\n\nWhat information do we get? 1st clip from Richard III\n\nEfficiency in nonlinear forms!\n\nThink of things you can portray visually - nonverbally\n\nVisual information vs. iconography\nA maker decides what information to show rather than tell\n\nShowing can be: more effective, more powerful, faster\n\nWhy not? Why use verbal information?\n\nCertain complexities can be misconstrued, but than can be minimized\n\nSilent film\n\nCan become so involved in story that you accept limitations of the medium\n\nMary Pickford, \"Sound in movies is like lipstick on the Venus de Milo\"\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Session 11: Media Axis III - Arc of Story",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/fac9efc10e473b422c38518aa16ab873_MIT21W_763JS14_Session_11.pdf",
      "content": "Transmedia Storytelling - Session 11\n\nArc of Story\n\nHow TV grew up -\n\nAlways reset -\n\nNow arcs of story are nested: ( ( (episode) season ) series)\n\nThese arcs are fractile BUT there must be enough story for the full arc\n\nArcs are emotional - they are about characters; larger arcs can involve more characters\n\nWe always need to consider the length of the nested arcs we are working in\n\nSome media are more nested (TV, comics) than others (films)\n\nHow many nests? Arcs? Characters? Reward cycles?\n\nArc of Story and the Role of Roadtrips\n\nWhat is the Rule of Roadtrips/24 hour rule? (you must stay longer than the round trip journey)\n\nThe longer the event/arc, the greater the payoff - there must be a direct ratio\n\nAlso, little payoffs along the way\n\nArc is about story, not plot\n\nPayoff - rewards: emotional rewards = closures\n\nNeurology of games\n\nDopamine - pleasure rewards achievement\n\nBrain - making a prediction and receiving feedback it was correct\n\nIncremental goal progress\n\nChallenge must be challenging, must receive recognition of achievement\n\nDopamine (dopamine is what makes something addictive)\n\nArc for a reason\n\nExposition - information needed to put together the challenge(s)\n\nEmotional rewards - how that fits together to create a satisfying but unexpected climax\n\nHunger Games - climaxes (satisfactions)\n\nBerries (we learn about them - they are used - film 3rd time)\n\nTrilogy - so we have closure, but not entirely\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Session 12: Engaging the Audience for Repeat/Expansion Involvement",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-763j-transmedia-storytelling-modern-science-fiction-spring-2014/b6614117772fd6ea5f0b812c3552ca59_MIT21W_763JS14_Session_12.pdf",
      "content": "Transmedia Storytelling - Session 12\n\nEngaging the Audience for Repeat/Expansion Involvement\n\n(recall our talk about dopamine hits)\n\nidentifying w/characters -\n\nwhich character/house (H. Potter?)\n\nwhich group (LOTR: elf/dwarf/hobbit/new)\n\nAGENCY - character agency is key to identification\n\nCast of interesting &sympathetic characters in a complex and rich world\n\nSpaces & silences where expansion can happen - where the audience can build themselves in\n\n(Mary Sue)\n\nFanfic\n\nThis SPACE is in ALL media, for the audience to create, to imagine themselves into the world - it is the\nkey to expansion\n\nVs. author directed complete experience w/o space\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.763J / CMS.309 / CMS.809 Transmedia Storytelling: Modern Science Fiction\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}