{
  "course_name": "Transport Processes in the Environment",
  "course_description": "This class serves as an introduction to mass transport in environmental flows, with emphasis given to river and lake systems. The class will cover the derivation and solutions to the differential form of mass conservation equations. Class topics to be covered will include: molecular and turbulent diffusion, boundary layers, dissolution, bed-water exchange, air-water exchange and particle transport.",
  "topics": [
    "Engineering",
    "Chemical Engineering",
    "Transport Processes",
    "Environmental Engineering",
    "Aquatic Sciences and Water Quality Control",
    "Hydrology and Water Resource Systems",
    "Engineering",
    "Chemical Engineering",
    "Transport Processes",
    "Environmental Engineering",
    "Aquatic Sciences and Water Quality Control",
    "Hydrology and Water Resource Systems"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nThis class serves as an introduction to mass transport in environmental flows, with emphasis given to river and lake systems. The class will cover the derivation and solutions to the differential form of mass conservation equations. Class topics to be covered will include: molecular and turbulent diffusion, boundary layers, dissolution, bed-water exchange, air-water exchange and particle transport.\n\nCourse Introduction to MIT 1.061 by Professor Nepf.\n\nView video page\n\nDownload video\n\nPrerequisites\n\n18.03 or equivalent; 1.060 or equivalent; or 10.301 or equivalent.\n\nRelated Courses\n\n1.106 Environmental Fluid Transport Processes and Hydrology Laboratory\n\nBuilds on the lecture subjects 1.061 and 1.070. Fundamentals of mass and flow measurements in field and laboratory settings, and application of these measurement techniques to analyze real and model environmental systems. 3 Engineering Design Points.\n\n1.61 Transport Processes in the Environment\n\nMeets with undergraduate subject 1.061. Graduate level includes additional homework in the form of reviews of relevant journal and practical articles.\n\nClass Schedule\n\nLectures:\n\n2 sessions / week\n\n1.5 hours / session\n\nImportant Note:\nThis subject meets with 1.61 (the graduate version of this subject).\n\nReferences\n\nFischer, Hugo, John List, C. Robert Koh, Jorg Imberger, and Norman Brooks.\nMixing in Inland and Coastal Waters\n. San Diego, CA: Academic Press, 1979. ISBN: 9780122581502.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework\n\n25%\n\nThree quizzes (25% each)\n\n75%\n\nExam\n\nA final exam is part of this course.",
  "files": [
    {
      "category": "Resource",
      "title": "Homework 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-061-transport-processes-in-the-environment-fall-2008/551f434888f6280e7f95d95f2d67ee9b_f02homework1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n1.061 / 1.61 Transport Processes in the Environment\nFall 2008\n\n1.061: Homework # 1[10 pt total]\nProblem 1 [6 pts]\nUsing whatever means you desire, estimate the flow, Q[m3s-1], in the Charles River. Describe the\nmethod of estimation in one page of neatly worded prose. Include all assumptions and\napproximations, and an estimate of uncertainty. See the attached notes for a standard method of\nuncertainty analysis. HINT: You will have an easier time if you go upstream where the river is\nnarrower, e.g. at or beyond River Street. After making your estimate, look up the flow measured in\nWaltham at the following link http://waterdata.usgs.gov/ma/nwis/uv/?\nsite_no=01104500&PARAmeter_cd=00065,00060.\nYou will be graded on the effectiveness and originality of your method and the clarity of your prose.\nYou will not be graded on the proximity of your estimate to the reported value.\nProblem 2 [2 pts]\nNitrate is a common groundwater contaminant in rural areas. Sources of nitrate include fertilizers,\nseptic systems, and manure. Nitrate is regulated in drinking water because it causes\nmethemoglobinemia, or \"blue baby\" syndrome. See, e.g. http://pmep.cce.cornell.edu/facts-slides-\nself/facts/nit-heef-grw85.html.\nThe water standard for nitrate is 10 mg/l.\nConsider a small lake which receives input from a river at rate QR = 0.1 m3s-1 and from a\ngroundwater seepage at rate QG = 0.005 m3s-1. The river inflow is free of nitrate, but the\ngroundwater contains nitrate percolated from septic tanks around the lake. The mean nitrate\nconcentration in the groundwater is 40 mg/L. The lake volume is 105m .\na) Assuming the nitrate concentration has reached a steady state in the lake, what is the nitrate\nconcentration in the lake outflow?\nb) If the groundwater source could be instantly removed, approximately how long would it take for\nthe nitrate concentration in the lake to drop to zero?\nProblem 3 [2 pts] - Your roommate drops a bottle of foul smelling cologne in your small [200 m3]\nroom. The cologne begins to evaporate with first-order rate constant, k = 0.03 min-1. Your roommate\ndoes not bother to clean up the spill, because he thinks it will evaporate soon enough. To dissipate the\nodor more quickly he opens the door and window to create a wind current of 1 m3s-1. You think that\nthe air current is not much help in removing the odor, and you insist that you roommate should mop\nup the spill immediately. Who is right?"
    },
    {
      "category": "Resource",
      "title": "Homework 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-061-transport-processes-in-the-environment-fall-2008/8b9754ec4e9d243f4e2283d100a44065_f02homework2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n1.061 / 1.61 Transport Processes in the Environment\nFall 2008\n\n1.061/1.61: Homework # 2 [10 pt total]\n\nProblem 1 [4 pts]\nThe bottom of a bay is completely covered by continuous colony of mussels that graze on plankton from the\nwater column. All plankton is removed from water siphoned through the mussels. Each square meter of\nmussel colony can siphon 1 m3 of water per hour. During peak tidal flows (flood and ebb) the concentration\nof plankton in the water is uniform over depth. During slack tide, however, the vertical profile of plankton\nconcentration is not uniform. It is high at the surface and decreases toward the bed. Two representative\nprofiles of plankton concentration are shown below. The bay is 1 m deep.\na. Compare the time scale for vertical mixing during peak flood and slack tide. Why do they differ?\nb. Assume plankton growth is first order. Describe an upper and lower limit for the plankton growth rate, KP.\nProblem 2. [3 pts]\nYou have been asked to conduct flume experiments to examine the dissolution of chemical from the bed under\nconditions of smooth turbulent flow. You begin by measuring the velocity profile shown below.\na. Assuming that the flume cannot be truly smooth, but has some roughness of scale, d. What does it mean to\nhave smooth turbulent flow.\nb Determine whether the flow is smooth or rough turbulent.\nc. Estimate the laminar sub-layer thickness, δs.\nd. Sketch the pattern made by a streak of dye released at y < δs and y > δs.\nVelocity Measured in Laboratory Flume\ny(cm)\n0.1\n0.01 0\n0.4\n0.8\n1.2\n1.6\nU(cm/s)\n\nProblem 3. [3 pts] - Detach this page and submit with homework.\nThe velocity profile measured some distance downstream of a bluff is shown below. On the same graph,\na. Sketch the shape for the profile of turbulence intensity, urms/U;\nb. Sketch the largest eddy scale that forms in the wake of the body and indicate the direction of eddy rotation."
    },
    {
      "category": "Resource",
      "title": "Homework 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-061-transport-processes-in-the-environment-fall-2008/34680a18f5fd53b3927a2bf88387c46c_f02homework3.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n1.061 / 1.61 Transport Processes in the Environment\nFall 2008\n\n1.061/1.61: Homework # 3 [10 pt total]\n\nProblem 1 [3 pts]\nWhy do some rooms smell more than others do œ even when the same sources of smell exist in\neach [dirty laundry, perfume, mildew, smoke]? Estimate the residence time of the air in your\nbedroom with uncertainty. Give a clear description of the bases for your estimate œ including\nmethods of direct observation, models, and assumptions. Comment on the limitations of each,\nand how the limitations might affect your estimate.\nProblem 2 [4 pts]\nYou have been asked to assess a newly constructed wetland that is 40-m x 300-m. The design\nflow depth and rate are h = 1-m and Q = 0.1 m3/s, respectively. You release 300 g of dye at the\ninlet of the wetland and record the concentration of dye at the outlet.\nt [hr]\nC [μg/l]\nt [hr]\nC [μg/l]\na) What is the total mass of dye observed to exit the wetland?\nb) Plot the Residence Time Distribution\nc) Find the mean hydraulic residence time, TR, and the mean detention time, Tdet.\nd) Describe the flow pattern within the wetland based on the results in a), b), and c)?\ne) The wetland plants can uptake phosphorus at a rate of K = 0.05 hr-1. What fraction of\nphosphorus load entering the wetland is removed?\nf) What is the maximum phosphorus removal that one could achieve in this wetland? How\nwould you achieve it?\n\nProblem 3 [3 pts] Phosphorus loading from the surrounding watershed has caused a small lake\nto become eutrophic. Using the measurements given below, do you expect the phosphorus levels\nin the epilimnion will increase, decrease, or stay the same over time. The surface area of the lake\nis 2 x 104 m . The diffusivity across the thermocline is Dz = 2.0 x 10-6 m2/s. Measured river\ninflow is Q = 0.1 m3/s. The measured phosphorus concentration at the inflow and outflow is\n100μg/l and 50 μg/l, respectively.\nZ [m]\nepilimnion\nthermocline\ntemp.\nphosphorus\n\nT [deg. C]\nC [μg/l]"
    },
    {
      "category": "Resource",
      "title": "Homework 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-061-transport-processes-in-the-environment-fall-2008/7402b81d497cdad7102a189222551a76_f02homework4.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n1.061 / 1.61 Transport Processes in the Environment\nFall 2008\n\n1.061/1.61: Homework # 4 [10 pt total]\n\nBOTH PROBLEMS SHOULD BE DONE WITH EXCEL OR MATLAB\nProblem 1 [5 pts]\nA mass, M = 1 kg, is instantaneously released at mid-depth in a very wide pond that is h = 1 m\ndeep. Assume isotropic diffusion D = 0.001 m2/sec. The substance released is not volatile (no\nflux at surface) but absorbs perfectly to the bed material (perfect sink at bed).\na. Write an expression describing the evolution of concentration in the pond, C(x,y,z,t)\nb. Plot the concentration profile versus depth, z, thorough the horizontal center of the evolving\ncloud at the time steps: t = 5, 20, and 100 sec.\nc. Plot the horizontal concentration profile, C(x) through the vertical center of the cloud at the\nsame time intervals given above.\nd. How would your solution to parts a and b differ if instead of isotropic diffusion, the vertical\ndiffusion coefficient was Dz = 0.00001 m2/s while the horizontal diffusion coefficient was the\nsame as above. Specifically, compare the vertical and horizontal length-scale of the cloud for\ntimes before the cloud encounters any boundaries.\nProblem 2 [5 pts]\nCombined sewers are municipal wastewater collection systems in which sanitary sewerage and\nstorm water are combined. During normal weather, all of the flow goes to a wastewater\ntreatment plant. During storm events, however, there is too much water in the system, and the\nflow exceeds the capacity of the sewer pipes. In former times, these systems were designed to\nrelease excess water via discharge gates to rivers and streams. These discharges are known as\ncombined sewer overflows (CSOs).\nFecal coliform bacteria used as an indicator of the presence of pathogenic organisms\nassociated with human waste. Samples of 100 ml are collected and passed through a permeable\nfilter that is then incubated with growth media to see how many colonies form. The fecal\ncoliform concentration is reported as organisms per 100 ml. The concentration of fecal coliform\nbacteria in combined sewer overflow water is typically 6 million organisms per 100 ml.\nConsider a CSO that is located at the shoreline 1 kilometer upstream of a public beach.\nThere is a prevailing along-shore current of 0.1 m/s from the CSO to the beach. Under\nMassachusetts's regulations, if the fecal coliform count at the beach exceeds 200 organisms per\n100 ml, then swimming is prohibited. Consider a storm that causes 1000 m3 of wastewater to\ndischarge from the CSO. Assume the discharge occurs instantaneously and instantly mixes over\n-1\nthe depth of the water, which is 2 meters. Assume a horizontal diffusivity of 1 m2s .\na. Write and expression that describes the fecal coliform concentration, C(x,y,t).\nb. Plot the shoreline concentration of fecal coliform at the beach as a function of time.\nc. When does the concentration of fecal coliform at the beach reach its maximum value, and\nwhat is that value in organisms per 100 ml?\nd. At what time after the storm will it be safe to swim at the beach?\n-1\ne. Repeat b. and c. using a horizontal diffusivity of 0.5 and 2 m2s . Discuss the sensitivity of\nyour results in b. and c. to the assumed value of horizontal diffusion coefficient."
    },
    {
      "category": "Resource",
      "title": "Homework 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-061-transport-processes-in-the-environment-fall-2008/f4e517fe607256819717f31c50bf3e25_f02homework5.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n1.061 / 1.61 Transport Processes in the Environment\nFall 2008\n\n1.061/1.61: Homework # 5 [10 pt total]\nProblem 1 [5 pts]\nConsider a fluid system with a linear distribution of concentration, C(y) = C0 - by. Turbulent\nenergy is added to the system through an array of mechanical mixers which produces turbulent\nfluctuations (u', v', w') and eddy scales (lx, ly, lz) which are homogeneous and isotropic. Make a\nset of four graphs, one for each of the following quantities.\na) magnitude of turbulent fluctuation v'\nb) turbulence length scale, ly\nc) turbulence correlation v' C'\nd) turbulent diffusivity Dy(y)\nOn each graph compare the following two cases.\nCase 1. The system is completely unbounded.\nCase 2. A solid boundary exists at y = 0.\nProblem 2 [5 pts]\nConsider a river that is h = 2.0-m deep and b = 10-m wide. The flow, U = 1.0 ms-1, is spatially\nuniform. As part of a nutrient enrichment study you will release a slug of nutrient rich water into\nthe stream using a discharge of 2.0 gs-1 that is left on for 10s. The discharge will be at mid-depth\nand against the bank (x = 0, y = 0, z = h/2). The side walls, bed, and water surface are all no-flux\nboundaries. The turbulent diffusion in the river is homogeneous but anisotropic: Dx = 1 m2s ,\n-1\nDy = 0.1 m2s-1, and DZ = 0.05 m2s . You are interested in two particular field sites located\ndownstream at L1 = 500m and L2 = 2000m.\na) Write an expression in variable form that describes the concentration at each site. Clearly\nstate and justify each assumption. Include a sketch that defines the coordinate system.\nb) What is the peak concentration experienced at each site?\nGRADUATE STUDENTS ONLY - DUE December 4, 2002.\nBegin by reading the following three articles. Then find an additional related article, preferably\na more recent article, e.g. using the Web of Science citation search. Compare and summarize the\narticles in no more than 2 pages of prose.\nLawrence, G. 1995. Natural dispersion in a small lake. Limnol. Oceanogr., 40(8): p. 1519.\nOkubo, A. 1971. Oceanic diffusion diagrams. Deep-Sea Research. 18:789-802.\nLedwell J, Watson A, Law C., 1998. Mixing of a tracer in the pycnocline. JOURNAL OF\nGEOPHYSICAL RESEARCH-OCEANS 103 (C10): 21499-21529.\n-1"
    },
    {
      "category": "Resource",
      "title": "Homework 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-061-transport-processes-in-the-environment-fall-2008/8a75f57bb8f003ade922c7460df8abdf_f02homework6.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n1.061 / 1.61 Transport Processes in the Environment\nFall 2008\n\n1.061/1.61: Homework # 6 [10 pt total]\nProblem 1 [4 points]:\nA patch of dye is released into the middle of the ocean. The patch size is l .\na. How do eddies of scale L1 >> l interact with the patch.\nb. How do eddies of scale L2 << l interact with the patch.\nNormal View\nClose-Up View\nL1\nPatch of dye\nsmall eddies\nof size L2\nl\nl\nProblem 2 [6 pts]: During rain storms the street run-off is conveyed to a river by a concrete\nculvert. During a large storm event a peak flow of q = 0.5 m3/s in the culvert and Q = 4.5 m3/s in\nthe river upstream of the culvert are maintained for 36 hours. During the early part of the storm,\nthe street run-off contains fine sediment with high metal content, C = 500 g/m3, which persists\nfor 16 hours, starting 1 hr after the peak storm flow is reached. After that time the streets are\nwashed clean and the concentration in the run-off drops to zero. Assume that the particles are\nsufficiently fine that they are transported with the flow without settling, i.e. they behave like\ndissolved species. During the storm the river has width B = 10 m; depth h = 2 m; isotropic\nturbulent diffusion D=0.05 m2/s; and longitudinal dispersion KX = 0.5m2/s. Follow these steps to\nestimate the maximum sediment concentration observed at L = 2 km downstream of the culvert\ninflow. Assume the culvert inflow enters the river at x = 0.\na) At what distance downstream will the culvert inflow be mixed across the river cross-section?\nb) What time scale describes the transport between the culvert and x = L?\nc) Should the release of sediment be considered an instantaneous or continuous release?\nd) Starting with the full transport equation [∂C/∂t + ] derive an expression for metal concentration\nat x = L during the steady portion of the release. State and justify all assumptions.\ne) Sketch the metal concentration C(t) at x = L during the peak flow. That is, t = 0 should be the\nbeginning of the peak flow. Include the unsteady period at the front and end of the exposure\n\nperiod by showing the length of the front and tail and the time at which the center of the front\nand tail arrive at x = L."
    },
    {
      "category": "Resource",
      "title": "Homework 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-061-transport-processes-in-the-environment-fall-2008/3084690adbcea4fac75991b43dc12b45_f02homework7.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n1.061 / 1.61 Transport Processes in the Environment\nFall 2008\n\n1.061/1.61: Homework # 7 [10 pt total]\nProblem 1 [5 pts]: A slug of tracer is released into a smooth irrigation canal at X = 0m.\nThe canal is 1 m deep by 1 m wide with a mean velocity 1 m/s. The isotropic\n-1\ndiffusivity is D = 0.01 m2s . At X = 500 m the tracer distribution is Gaussian with\nstandard deviation σ1 = 32 m. Between 500 m and 1000 m the banks of the canal are\nvegetated with reeds that retard the flow, but do not stop it completely. Assume that the\nwater depth, h, and flow rate, Q, are unchanged in this reach. Beyond X = 1000 m the\ncanal returns to a smooth, unvegetated state.\n(a) Estimate the coefficient of shear dispersion, KX1, in the first reach x = 0 to 500m.\n(b) On the same graph draw the lateral profile of velocity, u(y), in both the first reach\n(X = 0 to 500m) and the second reach (X = 500 to 1000m).\n(c) At X = 1000m the concentration distribution is Gaussian with standard deviation, σ2.\nWill σ2 > = < (2 KX1 L/U)1/2, where L = 1000m and U = 1 m/s? Explain. What can\nyou interpret from the fact that C(X = 1000m , t) is Gaussian? Can you infer the\nmagnitude of laterl diffusion, DY?\n(d) Estimate the clouds length at X = 10 km. State and justify your assumptions.\nProblem 2 [5 pts]: A chemical plant is under construction and you have been hired to\nwrite the Environmental Impact Statement. A pipe will inject a waste stream containing\nchemical XX into a stream of depth h = 1m and width b = 2m. Assume a rectangular\ncross-section. The injection rate for XX is 10 gs-1. The injection point (x=0, y=0, z=0)\nis at mid-depth and mid-width. The mean current speed u = 15 cm/s. The isotropic\n-1\ndiffusivity is D = 20cm2s .\na) Write an expression in variable form for the near-field concentration, i.e. before the\nplume has reached uniformity in either y or z, under steady state conditions.\nAccount for the following boundary conditions. The chemical is so volatile that\nany molecule that touches the free surface is instantly volatilized, such that the\nconcentration at the water surface is zero, C(x, y, z = h)=0. The chemical does not\nadsorb, settle, react, or pass through the channel bed or walls.\nb) At x = 10m plot the vertical profile at mid-width (y = 0) and the lateral profile at\nmid-depth (z = 0). Confirm that the boundary conditions are met."
    },
    {
      "category": "Resource",
      "title": "Homework 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-061-transport-processes-in-the-environment-fall-2008/a21da0b532f57390b3c4c61ca3c97358_homework8.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n1.061 / 1.61 Transport Processes in the Environment\nFall 2008\n\n1.061/1.61: Homework # 8 [10 pt total]\nProblem 1 [4pts]: Consider a river channel of depth h = 1m and mean flow speed U =\n1 m/s. The bed is a source chemical through dissolution. The equilibrium\nconcentration is CO. Which concentration profile would you expect to see in the\nchannel. Defend your answer with clearly stated scaling arguments. The kinematic\n2 -1\nviscosity is ν = 10-6m s-1, and a typical molecular diffusion would be 10-9m s .\nZ\nZ\nh\nh\nδs\nδs\nC\nC\nCo\nCo\nProblem 2[6 pts]: A container filled with water is h = 40-cm high and has a base area\nof 100 cm2. At t = 0 a lid is placed on the container. The lid is filled with solid CaS04\nand fits snuggly to the water surface. The water in the container is stirred gently, such\nthat the laminar sub-layer is δs = 0.1 cm at every surface. Outside the laminar sub-\n-1\nlayer the diffusivity of all substances is Dt = 0.01 cm2s . Estimate the total of\ncalcium [in grams] in the water column at t = 6 hours. The molecular diffusivity of\nCa++ in water is Dm = 8x10-10m s-1. The solubility product for CaSO4 is\n[Ca ++][SO4\n--] = 230 mol\n=\nK SP\nm\n[CaSO4(S)]\na) Write an expression for the calcium concentration, C(z), in the water at t = 6 hrs.\nBeware: you must account for the no-flux boundary at the bottom of the container.\nb) Find the total mass of calcium in the water at t = 1 hr."
    },
    {
      "category": "Resource",
      "title": "Homework 9",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-061-transport-processes-in-the-environment-fall-2008/ee28b183432839e4fea1af861a350e37_homework_9.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n1.061 / 1.61 Transport Processes in the Environment\nFall 2008\n\n1.061/1.61: Homework 9 [10 points]\nA small stream is contaminated by TCE, a cleaning solvent, from an inflow of contaminated groundwater.\nThe groundwater plume enters at x = 0 and instantly mixes over the stream cross-section, creating a\nuniform concentration of 20 ug/L. Two kilometers downstream water is drawn from the stream into local\ndrinking water wells. Assuming that water-to-air is the only removal mechanism, estimate the TCE\nconcentration (in micrograms per liter) at this point (X = 2 km). Use the following steps\na) Estimate Henry's Law Constant for TCE using the following information. Explain its meaning.\nb) Estimate the relevant molecular diffusion of TCE - in air, water or both, whichever is needed.\nc) Estimate the TCE concentration (in micrograms per liter) at X = 2 km.\nd) Are you worried that the drinking water is made unsafe?\nThe ditch is 10 cm deep and 100 cm across. The stream flow is 10 liters per second.\nThe wind blows at about 4 meters per second, and the air and water temperature are both 20oC.\nTCE has the following properties:\nstructure:\nClHC=CCl2\nmolecular weight\n131.4 g/mol\nliquid density\n\n1.46 g/cm3\nmelting point\n\n-73oC\nboiling point\n\n87oC\nvapor pressure (20oC)\n0.1 atm\naqueous solubility (20oC)\n0.008 mol/L\n\nPrimary Drinking-Water Maximum Contaminant Level for TCE\n5 ug/L"
    },
    {
      "category": "Resource",
      "title": "Atmosphere-Water Exchange",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-061-transport-processes-in-the-environment-fall-2008/c503af18d2223d0b12fe6e9954ceb93c_lab10gasexchange.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n1.061 / 1.61 Transport Processes in the Environment\nFall 2008\n\nAtmosphere-Water Exchange\nYou will estimate the rate of exchange between a water body (the flume) and\nthe overlying air for two volatile compounds, molecular oxygen and chloroform. You\nwill use an oxygen electrode to measure the changing concentration of oxygen, and gas\nchromatography (GC) to observe the concentration of chloroform.\nPre-laboratory Activity: This will be collected at the beginning of lab.\nIn clearly worded prose, estimate the time needed for the slug of chloroform, introduced\nat t = 0, to mix to a uniform concentration along the length of the flume. Assume that the\nflume channel velocity is 10 cm/s. Including equations and assumptions.\nIn clearly worded prose describe how you will estimate the mass transfer coefficients for\noxygen and chloroform, koxygen and kchloroform, from a time series of concentration.\nDescription of Experiment:\nBefore you arrive oxygen levels in the flume water will be depleted by bubbling nitrogen\nthrough the water. The flume will then be covered until the start of the experiment to\nkeep the oxygen depleted. At t = 0 you will remove the cover and 'dose' the flume with\nwater that is enriched in chloroform.\nOxygen:\nAt t = 0 immediately begin monitoring the oxygen concentration. Continue to record the\noxygen concentration until the concentration has reached saturation. You will choose the\ninterval of sampling depending on the rate of observed change.\nSolubility of Oxygen in Water at Atmosperic Pressure\noC\nmg/L\noC\nmg/L\noC\nmg/L\noC\nmg/L\n10.084\n9.092\n8.263\n7.559\n9.870\n8.915\n8.113\n7.430\n9.665\n8.743\n7.968\n7.305\n9.467\n8.578\n7.827\n7.183\n9.276\n8.418\n7.691\n7.065\nChloroform:\nAfter the initial dose of chloroform has been added to the flume you must wait to begin\nsampling until after the chloroform has become uniformly distributed in the longitudinal\ndirection. After the chloroform has mixed longitudinally, begin drawing duplicate 100\nml water samples into 100-ml volumetric flasks and quickly stopper the flask to halt air-\nwater exchange. Note the time of each sample on the bottle. Use the following sampling\nseries; t = 0, 10, 20, 40, 80 minutes. Bring the samples to the second floor, where you\nwill measure the concentrations of chloroform.\n\nYour Lab Notebook Should Include\n1) A detailed sketch of the flume.\n2) A description of the sampling procedure.\n3) A description of the tracer study used to observe the mixing time scale.\n4) A graph of concentration versus time C (t).\n5) Details of your analysis to estimate the mass transfer coefficients.\n6) Clearly state your estimates for the mass transfer coefficient of oxygen and\nchloroform with uncertainty. Explain any differences.\n7) Estimate the thickness of the waterside laminar sub-layer, dw, using both the O2 and\nchloroform data. Do these two estimates agree? Should they?\n8) How might the transfer coefficients vary if the flow speed, U, increased?\n9) How might the transfer coefficients vary if wind were added and increased?\nUseful Constants:\n2 -1\nMolecular diffusivity of oxygen in water, Dw(O2) = 2 x 10-5 cm s\n2 -1\nMolecular diffusivity of chloroform in water, Dw(chloroform) = 1.02 x 10-5 cm s\nHenry's Law constant for toluene, Hchloroform = 0.16\nHenry's Law constant for oxygen, HO2 = 26\nThis lab was developed by H. Nepf, P. Gschwend, J. MacFarlane Parsons Laboratory, MIT"
    },
    {
      "category": "Resource",
      "title": "Dissolution of Gypsum and the Laminar Sub-Layer",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-061-transport-processes-in-the-environment-fall-2008/f4ef961acd4138c6995d58fb284c1464_lab8dissolution.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n1.061 / 1.61 Transport Processes in the Environment\nFall 2008\n\nDissolution of Gypsum and the Laminar Sub-Layer\nYou will use two methods to estimate the laminar sub-layer thickness in the laboratory\nflume. The first method is based on the observed dissolution rate of Gypsum bars, and is\ndescribed below.\nPre-Laboratory Activity: Collected at the start of lab.\nIn clearly worded prose describe the following. 1) Give the thickness of the laminar sub-\nlayer, dS, in terms of mean velocity, U, and viscosity, n, only. 2) Give the time-scale for\ntransport across the laminar sub-layer, Td, in terms of U, Dm, and the molecular viscosity,\nn, only. 3) Give the time-scale for transport across the full water depth, Th, in terms of\nwater depth h and U, only. 4) Consider the concentration profile depicted in the figure\nbelow. For what value of the product Uh (in cm2s-1) will this profile be valid in the\n2 -1\nflume. Use n ≈ 0.01 cm2s-1 and DM ≈ 10-5 cm s .\nEstimating the laminar sub-layer thickness from a boundary flux model:\nTo create a model for gypsum dissolution, we assume that the flux of calcium is\ncontrolled by the rate of molecular diffusion through the laminar sub-layer. Above the\nlaminar sub-layer we assume that turbulent diffusion rapidly mixes all concentration to\nuniformity. Further, at the interface between the gypsum bar and the laminar sub-layer\nthe concentration of Ca++ is assumed to be at equilibrium, i.e. C (y=0) = Ceq, where Ceq is\ndefined below. With these assumptions we can write the transport equation that describes\nthe dissolution of gypsum into the flume water.\n(C - Ceq )\n∂C\n∂C\n(1)\nV\n= -DmAbar\n= -DmA bar\n∂t\n∂y y=0\nd S\nHere, C is the concentration of Calcium ions, Ca++; V is the total volume of water in the\nflume; Dm is the molecular diffusivity of Ca++ in water [8x10-10m s-1]; and Abar is the\nsurface area of the gypsum. The right hand side of (1) uses a finite difference\napproximation for the concentration gradient at the surface of the bar.\n\n--\nEquation (1) can be written as a first-order rate equation,\n∂C = K C\n- C);\nwhere K = DmAbar .\n(2)\n\n( eq\n∂t\nVd S\nIf C = 0 at t = 0, then (2) has the solution,\nC = Ceq(1 - e\n-Kt ).\n(3)\nYou can estimate the rate constant K by measuring the concentration of Calcium ions\nover time and fitting the observed C(t) to equation (3). The laminar sub-layer thickness\ncan then be inferred from K using (2). During the early stages of the experiment the\nconcentration of Calcium ions in the water is small compared to the equilibrium\nconcentration, i.e. C<< Ceq, and (2) reduces to\n∂C = KCeq ,\n(4)\n∂t\nsuch that C increases linearly with time. From (4) K is estimated with linear regression.\nEquilibrium Concentration:\nIn a very, very thin layer next to the gypsum bar, O(nanometers), we assume that the\ndissolved phase is in equilibrium with the solid phase. The ratio of concentrations is then\ngiven by the solubility constant, KSP. At equilibrium\n[Ca++] [SO4 ]\n= 230 mol\n=\n(5)\nK SP\nm\n[CaSO4(S)]\nThe solid concentration is taken to be 1; and in solution [Ca++] = [SO4\n- - ]; such that the\nequilibrium concentration for Ca++ is √230 mol m-3 ≈ 608 g m-3.\nCalcium Analyses\nOne member from each group will try to observe calcium \"build up\" in the water by\nmonitoring the electrical conductivity of the water. Begin by setting up the conductivity\nelectrode and meter at the bend in the flume. Take conductivity readings of tap water,\nwater with 1 ppm Ca++, and water with 10 ppm Ca++. Next, take conductivity readings\nin the flume at time zero (i.e., when the gypsum strips are put into the flume), 5 minutes,\n10 minutes, 20 minutes, and 40 minutes.\nA second member of each group should be responsible for placing the gypsum strip in\nthe flume, SIMULTANEOUSLY WITH THE OTHER GROUPS. Subsequently, this\nmember should withdraw 10 mL water samples at times 0, 5, 10, 20, and 40 minutes\nusing the plastic pipettes and putting the samples in the acid-washed plastic bottles\nprovided. Be sure to label the bottles.\n\nA third member of each group will be responsible for atomic absorption (AA)\nmeasurements. Working upstairs in room 48-324, this person should familiarize\nher/himself with the AA sufficiently to (a) use the instrument and (b) explain its\noperation to the other lab group members. While water samples are being collected in\n48-109, this student should use at least three samples (a blank and two standards) to\nexamine the sensitivity of the AA as a function of Ca++ concentration. After the water\nsamples have been collected, run all the samples in series with blank water in between.\nAfter all data is collected, work as a team to estimate the rate of gypsum dissolution\nbased on 1) the conductivity measurements and 2) the Ca++ measurements. Estimate the\nboundary layer thickness based on both estimates of K.\nYour Lab Notebook Should Include\n1) A sketch of the flume indicating points of measurement and gypsum placement\n2) A description of the sampling procedure.\n3) A graph of calcium concentration versus time (C(t)) with line fitted to estimate K.\n4) A graph of conductivity vs. time with line fitted to estimate K.\n5) Analysis to estimate dS using the fitted K. Include the uncertainty in dS arising from\nuncertainty in your measurement of Abar, V, and K. Assume that Dm is a constant (i.e.\ncontributes no uncertainty).\n6) Analysis to estimate dS based on U. Do the two estimates agree?\n7) Discuss how the dissolution rate will vary with water velocity.\n8) Estimate the time to reach equilibrium, Teq.\n9) Our analysis assumes that the flume approximates a stirred reactor, in the sense that\nwe assume that the concentration is uniform in the water column. Use time scale\nanalysis to show whether or not this is a good assumption.\nThis lab was developed by H. Hemond, P. Gschwend, H. Nepf, and J. MacFarlane\nParsons Laboratory, MIT"
    },
    {
      "category": "Resource",
      "title": "Measuring Velocity in a Channel",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-061-transport-processes-in-the-environment-fall-2008/e7e380d567a472770680f349465f0f08_lab1velinchannel.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n1.061 / 1.61 Transport Processes in the Environment\nFall 2008\n\nMeasuring Velocity in a Channel\nBEFORE coming to lab:\n1. Purchase a lab notebook with duplicating paper.\n2. Read handout Why a Lab Notebook\n3. Read the handout Evaluation of Uncertainty.\n4. One estimate of velocity, U, is the flow rate, Q, divided by the cross-sectional area, A. In\none page of clearly worded prose describe the uncertainty in U given the uncertainty in\nQ and A. One copy of this will be handed in at the beginning of lab, and one\ncopy should be included in your lab notebook.\n5. Read handout Why a Lab Notebook.\n6.\nYOU WILL HAND IN THE COPY PAGES OF YOUR\nLAB NOTEBOOK AT THE END OF LAB.\nEstimating Flow in a Channel\nGoals: Measure the mean velocity in the laboratory flume using two different methods, and\ndetermine whether these estimates agree within the uncertainty.\nOutline for Lab Notebook:\nRecord Experimental Set-up and Procedure\n1. In your lab notebook make a sketch of the experimental set-up. Be sure to include\nsufficient detail so that someone could recreate the experiment from your sketch.\n2. Use the acoustic Doppler velocimeter (ADV) to measure the velocity in the channel.\nRecord the vertical and lateral position of the measuring volume in the channel. What is\nthe uncertainty in this measurement?\n3. Think of two additional and independent ways to estimate U and describe each method\nin your lab notebook. Record the equations you will use to estimate U and to propagate\nthe error in each measurement to your estimate of U.\n4. Record the necessary observations with uncertainty.\n5. Record the resulting estimate of U with uncertainty.\n6. Discussion - Use complete sentences. Clarity counts!\nDo the three estimates of velocity agree?\nWhich estimate is best?\nHow do the estimates differ? e.g. Lagrangian vs. Eulerian?\nFor the two methods chosen in part 3, indicate which observed quantity contributes\nthe most uncertainty to U?\nThis lab was written by H. Nepf, Parsons Laboratory, MIT"
    },
    {
      "category": "Resource",
      "title": "Residence Time Distribution and System Circulation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-061-transport-processes-in-the-environment-fall-2008/72c49b624f18bc60cff99b8c3e2abf56_lab3rtdmanipultn.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n1.061 / 1.61 Transport Processes in the Environment\nFall 2008\n\nResidence Time Distribution and System Circulation\nBEFORE COMING TO LAB:\nNeatly draw the Residence Time Distribution for 1) a Plug Flow Reactor, 2) a Stirred\nReactor, and 3) a system with Short-Circuiting. On each graph be sure to note the position\nof the mean hydraulic residence time, TR, and the detention time, Tdet. Clearly state the\nassumptions of each circulation model. One copy of this will be handed in at the\nbeginning of lab, and one copy should be included in your lab notebook.\nObjectives: Estimate detention time and nominal residence time in a model basin\nRecord Experimental Set-up\nMake a detailed sketch of the experiment. Include sufficient detail that you could recreate\nthe experiment from your sketch ten years hence. Record the length, L, width, W, and depth,\nH, of the model basin with uncertainty. Measure and record the flow rate, Q, with\nuncertainty. Estimate the nominal residence time, TR, including uncertainty. Include units.\nCase 1 - Open Basin\nIn this section you will observe the circulation and estimate the effective residence time for\nan open basin. Record the following observations.\n- Sketch the circulation indicating dead-zones [regions of slow or no motion], recirculation\nzones and the main flow zone.\n- Estimate the surface area of each zone with uncertainty.\n- Estimate the residence time in the flow zone, tfz. Include uncertainty.\n- Lagrangian Tracer Experiment. Release a series of 50 beads at the inlet. Record the\nresidence time of each bead. Plot the residence times in a histogram. Based on this\nResidence Time Distribution (RTD) is the circulation closest to plug flow, well-stirred\nor short-circuiting? Defend your answer with specific details from the RTD and your\nsketch of the circulation pattern.\n- Calculate the average arrival time of the beads, t\n.\nave\n- Which one of the time-scales, tave, TR and tfz, best represents the effective residence time in\nthe model. Why? Describe what each time-scales represents.\nCase 2 - Engineered Basin\nUsing the Plexiglass walls provided improve the residence time distribution by manipulating\nthe flow pattern in your model basin. Your goal is to minimize the ratio st/tave, and\nmaximize the average residence time, i.e. tave approaching TR. Repeat the Lagrangian\nTracer Experiment to evaluate t\nand st\nave\nThis lab was written by H. Nepf, Parsons Laboratory, MIT"
    },
    {
      "category": "Resource",
      "title": "Transport in Porous Media",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-061-transport-processes-in-the-environment-fall-2008/e4eb88885cef7b3156ca253823b6c16d_lab4porous_media.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n1.061 / 1.61 Transport Processes in the Environment\nFall 2008\n\nTransport in Porous Media\nObjective: Use a tracer study to estimate the dispersion coefficient, pore velocity and\nporosity of a sediment column.\nBackground:\nMaterial carried by a fluid flowing through a porous medium is dispersed by several\nprocesses; e.g. a) molecular diffusion, b) mechanical dispersion, c) stagnation in pore\nspaces, and e) spatial variation in hydraulic conductivity. In this lab you will observe\ndispersion in a porous media by observing its effect on a slug of tracer, M, released into a\ncolumn of soil. The concentration of tracer at the end of the column is given by the 1-D\nadvection-dispersion equation. The tracer travels at the mean pore velocity, v such that the\narrival time of the peak is L v . In this lab you will use conductivity as a surrogate for\nconcentration, and assume that there is a linear relationship between the concentration and\nconductivity, here C. Then, correcting for the background conductivity, CB, the observed\nconductivity, CO, should be,\nE\n\nCO - CB = [Cmax - CB] expA -(L - vt)\n2 ˆ\n.\nA\n4Dt\nE\n\nHere, Cmax is the maximum observed conductivity, D is the dispersion coefficient, and L is\nthe length of the column between the injection port and the measurement position.\nPre-Laboratory Activity:\nPrepare an EXCEL spread sheet that plots CO(t) based on the above equation. Allow the\nvariables Cmax, L, v , and D to be adjusted with ease to produce new CO(t) curves. Using the\nfollowing test values plot CO(t) versus t for t = 1 to 20 seconds at 0.5 second intervals.\nShow that the peak arrival time and the duration of the peak are correctly reproduced on the\ngraph. [See Chapter 3, Instantaneous Point Source in web notes].\nYou will hand in a copy of this graph at the beginning of class.\nTest Values: D = 0.1 cm2s-1, L = 10 cm, CB = 5, Cmax = 40 and v = 1 cms-1.\nOutline for Lab Report\n1. Record the experimental set-up and procedure in sufficient detail that you could recreate\nthe experiment ten years hence.\n2. Describe the analyses used to estimate the dispersion coefficient, D, the mean pore\nvelocity, v , and the effective porosity, ne.\n3. Table of observed conductivity and a plot comparing observations to 'best fit'\n4. Clearly state your estimates for D, v , and ne, with uncertainty.\n5. Discussion points:\n5.1 How do you know that turbulent diffusion is not contributing?\n5.2 Describe the processes that determine the observed spread of tracer.\nThis lab was developed by H. Nepf, and J. MacFarlane Parsons Laboratory, MIT"
    },
    {
      "category": "Resource",
      "title": "Why a Lab Notebook?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-061-transport-processes-in-the-environment-fall-2008/0849919860c1c1334af18edf289c921b_why_alabnotebook.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n1.061 / 1.61 Transport Processes in the Environment\nFall 2008\n\nWHY A LAB NOTEBOOK?\nThe scientific process depends on peer review, i.e. scientists check one another's\nresults, and work together to build a solid foundation for scientific advancement. To\nfacilitate this scientists are expected to lay out and describe their work carefully enough\nthat it can be reproduced and checked by others. The following story demonstrates why\nreproducibility is an essential component of proving new discoveries in science.\nSuppose that a stranger told you that she had discovered a new chemical mixture that\nwhen added to gas would increase a car's gas mileage. She plans to manufacture and\nmarket her discovery and asks if you want to be her partner. Would you give her money\nright away? Based only on her word? What if she took you for a ride and showed you\nthat her gas mileage was reduced? Would you believe her then? What if she showed you\nhow the chemical mixture was made, so that you could reproduce her results? You could\nmake the mixture yourself and test it in your own car. Then you would be confident in\nthe result. Similarly, the best proof for a new scientific result is that it can be reproduced\nby more than one scientist. A well-documented lab notebook will ensures that results can\nbe reproduced.\nElements to Include in Your Lab Notebook in order of appearance\n1. Title\n2. Objective: 1-3 sentence introduction to overall goal of experiment\n3. If needed, notes taken at start of class can be included here.\n4. Methods:\n4a. Sketch of experiment with sufficient detail, labels, dimensions, that you could\nrecreate the set-up as much as ten years later.\n4b. Describe any equations or general theories that contribute the basis for any\npart of the experiment. E.g. The mean velocity u is estimated as u= L/T,\nwhere T is the time recorded for a buoyant drogue to travel a distance L.\n4c. Description of how experiment is run - as sequence of steps or in prose.\n5. Tabulation of observed quantities with units and uncertainty\n6. Analysis. The manipulation of observed quantities using the equations and/or theory\ndescribed in 4b. Set off final result with box and label, or other highlight.\n7. Discussion of results\nRules for Significant Figures\n- Experimental uncertainty should be rounded to one significant figure.\n- The last significant figure in a stated result should be at the same decimal position as the\nuncertainty.\n- In multiplication and division, the least number of significant figures in any number in\nthe equation determines the number of significant figures in the answer.\n- In addition and subtraction, the least number of places in the decimal portion of any\nnumber in the problem determines the number of decimal places in the answer."
    },
    {
      "category": "Resource",
      "title": "1. Conceptual model of diffusion",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-061-transport-processes-in-the-environment-fall-2008/4c33878674c33a168456ba9f2385cb69_conserve.pdf",
      "content": "This section discusses the law of conservation of mass within a control volume,\nexpressed in both integral and differential forms. Mathemical descriptions of\nadvective and diffusive fluxes into/out of a control volume are shown, the end result\nbeing the all-important mass transport equation. The concept of the total derivative\nis also introduced, allowing us to relate Eulerian (fixed position) and Lagrangian\n(moving with the flow) perspectives. Two animations further explain the total\nderivative, showing the temporal temperature change of a probe moving through a\nspatial temperature gradient. The example problems require application of both\nforms of the law of conservation of mass to solve transport problems in both\nindustrial and environmental contexts.\n\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n1. Conservation of Mass\n1.1 Conceptual Model for Diffusion\nDiffusion is defined as the net transport due to random motion. A model for diffusive\nflux can be constructed from the following simple example. Consider a one-dimensional\nsystem with motion in the X direction only. An interface B-B' separates two regions of\ndifferent concentration, C1 and C2 = particles/volume on the left and right side of the\ninterface, respectively. The motion of each particle is a one-dimensional random walk.\nIn each time interval, ∆t, each particle will move a distance ± ∆X, moving right (+ ∆X) or\nleft (- ∆X) with equal probability.\nB\nX\nX\n-\n-\n-\n-\n-\n-\nC1\n-\nC2\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n- -\n-\n-\nX\nB'\nA, area of interface\nWithin each time step, any particle within a distance ∆X of the interface B-B' has a 50%\nprobability of crossing over that interface. The number of particles with the potential to\ncross B-B' from left to right (positive mass flux) is (C1 ∆X A), where A is the area of\ninterface B-B'. On average half of these take a positive step and cross the interface in\ntime ∆t, such that the flux left to right is (0.5 C1 ∆X A). Similarly, the number of\nparticles crossing right to left in ∆t (negative mass flux) will be (0.5 C2 ∆X A). The\nresulting mass flux, qX, is\n0.5 ∆X A (C1 -C2)\n(1)\nq x =\n.\n∆t\nIf C(x) is continuous, then C2 ≈ C1 + ∆X ∂C/∂x, and (1) becomes\n∆X2\n\nA ∂C = -D A ∂C = [mass /time].\n(2)\nqx ≈-\n2∆t\n∂x\n∂x\nThe coefficient of diffusion, D ~ (1/2)∆X2/∆t, has units of [length2 time-1]. The\ndiffusivity of a chemical molecule in a given fluid depends on the ease with which the\nmolecule can move, specifically, how far, ∆X, the molecule can move in a given time\n\ninterval. The ease of molecular motion, and thus the diffusivity of a particular chemical,\nwill depend on the molecule size and polarity, the type of fluid and the temperature.\nEquation (2) is a mathematical expression of Fick's Law. Fick's Law states that the\nflux of solute mass crossing a unit area, A, per unit time, ∆t, in a given direction, e.g. x, is\nproportional to the gradient of concentration in that direction, ∂C/∂x, and is counter-\ngradient, i.e. the net flux is down-gradient. Because the flux in any direction is\nproportional only to the concentration gradient in that direction, Fick's Law can be\ndirectly extended to three-dimensions.\n∂C\n∂C\n∂C\n(3)\n(qx, qy, qz) = (-DA\n, -DA\n∂y , -DA xy\n) .\nyz\nxz\n∂x\n∂z\nFor molecular diffusion the coefficient for diffusion is isotropic, i.e. the same in all\ndirections. This is not typically true for turbulent diffusion.\nDiffusion from a point source\nConsider a cloud of N particles (and total mass M) released at x = 0 and t = 0. Under the\naction of molecular diffusion, the cloud will slowly spread. We use the random walk\nmodel to predict the distribution of particle (mass) concentration, C(x,t). Note, that if we\nassume a unit mass per particle, we can conveniently interchange N = M. For simplicity\nwe again consider a one-dimensional system, with the same rules of random motion\ndescribed above, i.e. at each time step, ∆t, each particle will move either +∆X or -∆X\nwith equal probability. Over time each particle will move a bit forward and a bit\nbackward. The probable location of an individual particle after many such steps can be\npredicted with the Central Limit Theorem (see any basic statistics text). Specifically, in\nthe limit of many steps, the probability that a particle will be located between m∆X and\n(m+1)∆X approaches a normal distribution with a zero mean and a standard deviation of\n(4)\nσ = 2Dt ,\nwhere, as above,\n(5)\nD = (1/2)∆X2/∆t.\nThe probability that a particle ends up between x and x+∆X is\n\nx2\n\nx2\n(6)\np(x,t)∆X =\n2π exp -\n∆X = 4πDt exp -\n∆X.\n2σ\n2σ\nσ\nNow consider the full cloud of N particles. At any time t, the number of particles\nbetween x and x+∆X is expected to be n(x,t) = N p(x,t)∆X. Thus, the concentration, C,\nat position X is C(x,t) ≈ n(x,t)/(A ∆X), where A is the constant cross-section of the one-\ndimensional system. Exchanging M for N, the concentration distribution, C(x,t),\n\nM\n(7)\nC(x,t) = A 4πDt exp(-x\n2/4Dt) =[mass / length3]\nAs noted above, this distribution is the normal distribution with zero mean and standard\ndeviation, σ = 2Dt , which should be familiar to you from any basic statistics course.\nBriefly, the distribution forms a bell-curve, as shown below. At any time, sixty-eight\npercent of the total mass (total number of particles) falls within ± σ of the mean position\n(x = 0). Ninety-five percent of the mass falls within ± 2σ of the mean position. And,\n99.7% falls within ± 3σ of the mean position. Based on these limits, it has become\ncommon to define the extent of a concentration patch based on the contour that includes\nninety-five percent of the total mass, i.e. the contour at 2σ from the center. With this\nconvention the length of a diffusing cloud, L, is often taken as L = 4σ.\nC\n68%\n95%\nCmax\n0.61 Cmax\n-3 σ -2 σ\n- σ\n+ σ\n+2 σ +3 σ\nIt is also useful to note that the concentration level at one standard deviation from the\ncloud center is 61% of the maximum concentration, i.e. C (x = ± σ) = 0.61 Cmax, where\nCmax is the concentration at the center of the cloud. This value provides a useful way to\nrapidly define the standard deviation of a particle (species) cloud.\nAnimation Example of Random Walk:\nThis animation shows the motion of 500 particles in a one-dimensional random walk with\nstep size ∆X = 1 in time ∆t = 1. At t = 0 the particles are at x=0. The animation mimics\nthe effect of Fickian Diffusion. As you watch the animation, consider the following.\nGraph of Absolute Particle Location (lower left window).\nThis graph shows the number of particles located at each position of the x-axis. The\nnumber of particles per location is analogous to a concentration.\na) Over time how does the peak particle number, N, (concentration, C) change under the\ninfluence of random particle motion (diffusion)?\nb) Over time how does the gradient in particle number (concentration), i.e. dN/dx\n(dC/dx) change under the influence of random particle motion (diffusion)?\nc) What is the sign of the particle number (concentration) gradient (dN/dx) for x > 0?\nConsider the animation of individual particle motion (uppermost window). For x > 0,\n\nis the net particle flux positive (to the right) or negative (to the left)? Is the direction\nof flux up-gradient of down-gradient? Is the relationship between the direction of\nflux and the concentration gradient consistent with Fick's Law (equation 3)?\nd) Estimate the diffusion coefficient, D, using equation (4) above, and the values of σ\ngiven in the upper left corner of this graph. You can pause the animation. How does\nthe realized value of D compare with the theoretical value given in equation (5). Note\nthat no specific units are given here, such that D will simply have unit L2T-1, where L\nis an arbitrary length unit and T is the arbitrary time unit.\nGraph of Particle Location in Terms of σ.\nThis graph plots the distribution of particle location with the position normalized by the\nstandard deviation, σ. The solid curve is the Gaussian distribution.\ne) Note that at early time (first few time steps) the real distribution of particles does not\napproximate a Gaussian distribution very well. This is because the Gaussian\ndistribution is only valid after a sufficient number of steps (Central Limit Theorem).\nUse the animation to estimate how many steps are required for the distribution to\nconsistently fit the Gaussian distribution.\nKey Aspects of Diffusion\n-\nDiffusion is the net flux due to random motion.\n-\nDiffusive flux is proportional but opposite in sign to the gradient of concentration.\n-\nDiffusion acts to dilute concentration and reduce gradients of concentration.\n1.2 Conservation of Mass\nThe equation of mass conservation expresses a budget for the addition and removal of\nmass from a defined region of fluid. Consider a fixed, non-deforming volume of fluid,\nV , called the control volume (cv), which has a defined surface boundary, called the\ncontrol surface (cs). Conservation of mass requires that the time rate of change of mass\nwithin the control volume equals the rate at which mass enters the control volume plus\nthe rate at which mass is gained or lost within the control volume due to sources and\nsinks. A mathematical expression of this law is described below.\nWithin the control volume there is a distribution of some species defined by the\nconcentration field, C(x,y,z). The total mass within the control volume is\n(8)\nM = ∫cv C dV .\nM can change over time due to sources and sinks located within the volume, or due to\nfluxes of mass across the control volume boundaries. In a fluid system there are two\nforms of mass flux, advection and diffusion. The net flux of mass out of the control\nvolume due to advection is described by the integral,\nv\n(9)\n∫csC V ⋅ n v dA.\n\nv\nv\nHere, V = (u,v,w) is the velocity vector and n is the outward pointing normal for surface\nv v\nsegment dA. V ⋅ n represents the velocity component perpendicular to the area segment\ndA. The definition of n v as the outward facing normal makes equation 9 the net flux out\nv\nof V . That is, flow out of V (same direction as n ) contributes positively to the integral,\nand flows into V (opposite to n v ) contribute negatively. The net flux out of the control\nvolume due to diffusion is defined using Fick's Law.\n∂C\n(10)\n-∫ Dn\ndA ,\ncs\n∂n\nv\nNote that the concentration gradients are defined along the axis n , i.e. everywhere\nperpendicular to the surface, and position outward. Denoting Dn as the diffusion\ncoefficients along the axis n v allows for anisotropy in D. For molecular diffusion and/or\nisotropic turbulence D is not a function of direction and the subscript may be dropped.\nThe final mathematical expression for conservation of mass combines (8), (9), and (10).\nConservation of Mass in Integral (Control Volume) Form\nv\n∂C\n∂∫cv C dV =\n-∫csC V ⋅ n v dA\n+ ∫ Dn\ndA\n±S\n∂t\ncs\n∂n\n(11)\ntime rate of\nadvective flux into\ndiffusive flux into\nsource\nchange of mass\ncontrol volume\ncontrol volume\nsink\nwithin cv\nExample: South Meadow Power Station, Connecticut, burns 2000 tons of municipal\nsolid waste per day to generate electricity. Cooling water is drawn from and returned to\n-1\nthe Connecticut River at Qc = 250 ft3s . The cooling cycle raises the temperature of the\nwater by ∆T = 20 0F before it is returned to the river. Because thermal pollution can be\ndamaging to aquatic life, we want to know how the inflow affects temperature\n-1\ndownstream of the station. The median flow of the river is QR = 20,000 ft3s .\n\nThis problem can be solved using the integral form of conservation of energy. The\ncontrol volume is above as a dashed-box. Conservation of Energy is derived as (11), but\nwith energy replacing mass. The \"concentration' of heat energy is Cheat [J m-3] = ρ Cp T,\nwhere, ρ is the fluid density [kgm-3], CP is the specific heat [J/(degree kg)], and T\n[degrees] is temperature. Replacing C with ρ Cp T in (4), gives\nConservation of Thermal Energy\n∂\nv\n(12)\n∂t ∫cv ρC T dV = -∫csρC T V ⋅ n v dA +∫D ∂\n∂\nn (ρCpT)dA ±S\np\np\nn\ncs\nWe assume there are no sources or sinks of heat inside the control volume, i.e. S = 0. At\neach of the inflow/outflow points around the volume, the advective flux is UiAiρCpT,\nwhere Ai and Ui are the respective area and velocity. We assume that the diffusive flux\nacross each inlet/outlet area is negligible. With these assumptions (4.1) can be written,\n∂T\n(13)\nρCpV\n=\n∑UA ρCpT -\n∑U A ρCpT.\n∂t\ninlets\noutlets\nWe assume the power plant discharge has been turned on long enough that the system is\nat steady state, then ∂T/∂t=0. Finally, it is reasonable to assume that CP and ρ are\napproximately constant (only weak functions of T), so they cancel across (4.2). Then,\nusing the definitions in our sketch, (4.2) becomes\n0 = QRTR + QC(TR + ∆TC) œ QCTR œ QR (TR + ∆TR), and\n∆TR = TR + (-QRTR - QC(TR + ∆TC) + QCTR) / QR = QC ∆TC /QR = 1 0F.\nThe thermal plume shown below has not yet mixed fully with the river. Considering the\ncross-section marked in red, the mean plume temperature rise is ≈ 6 OF and the plume\noccupies approximately 1/3 of the river width. Since the plume is warmer (less dense)\nthen the river, it floats at the surface, occupying only about half the channel depth. Thus,\nthe plume reasonable occupies 1/6 of the channel cross-sectional area. Using these\n\nv v\nOn face 1 n v points in the negative x direction, such that V ⋅ n = -u , and ∂C/∂n = -∂C/∂x.\nThe evaluation of the surface integral for face 1 is then,\n(15)\nFlux across 1 = (uC)1 ∂y∂z - (Dx ∂C/∂x)1 ∂y∂z.\nv\nSimilarly for face 2, but noting that n points in the positive x direction,\n(16)\nFlux across 2 = -(uC)2 ∂y∂z + (Dx ∂C/∂x)2 ∂y∂z\nThe net x-direction flux into the control volume is the sum of (15) and (16).\n(17)\nNet flux in x = ( (uC)1 -(uC)2 - (Dx ∂C/∂x)1 + (Dx ∂C/∂x)2 )∂y∂z.\nIf we assume that C, u, ∂C/∂x, and Dx are continuous functions of x, a Taylor expansion\nmay be used to express each parameter at x2 as a function of the same parameter at x1.\n∂\n(18)\n(uC)2 = (uC)1 +\n(uC) ∂x + higher order terms\n∂x\n∂C\n∂C\n∂\n∂C\n(19)\n(Dx\n) = (Dx\n)1 +\n(Dx\n) ∂x + higher order terms.\n∂x\n∂x\n∂x\n∂x\nIf we drop the higher order terms and replace (uC)2 and (Dx∂C/∂x)2 in (17) with the\nexpressions in (18) and (19), then (17) becomes,\n∂uC\n∂\n∂C\n(20)\nNet flux in x = -\n+\nD\n∂x∂y∂z.\nx\n∂x\n∂x\n∂x\nSimilar expressions can be found for flux across the remaining four faces. Combining\nthese in (14) and noting ∂V = ∂x∂y∂z,\nConservation of Mass in Differential Form\n∂C\n∂uC\n∂vC\n∂wC\n∂\n∂C\n∂\n∂C\n∂\n∂C\n(21)\n= -\n-\n-\n+\nD\n+\nDy\n+\nD\n± S.\nx\nz\n∂t\n∂x\n∂y\n∂z\n∂x\n∂x\n∂y\n∂y\n∂z\n∂z\nThis expression can be simplified under the following conditions.\nFirst, consider the expansion of the advective fluxes in (21),\n∂uC\n∂vC\n∂wC\n∂u\n∂v\n∂w\n∂C\n∂C\n∂C\n(22)\n+\n+\n=\n∂x +\n+\nC + u\n+ v\n+ w\n∂x\n∂y\n∂z\n∂y\n∂z\n∂x\n∂y\n∂z\n\nIf the flow field is incompressible, then from continuity\n∂u\n∂v\n∂w\n+\n+\n= 0 .\n∂x\n∂y\n∂z\nThis eliminates the bracketed term in (22). Thus, conservation of mass for\nincompressible flow may be expressed as follows. By convention, advective terms are\nbrought to the left.\nConservation of Mass for Incompressible Flow\n∂C\n∂C\n∂C\n∂C\n∂\n∂C\n∂\n∂C\n∂\n∂C\n(23)\n+ u\n+ v\n+ w\n=\nD\n+\nDy\n+\nD\n± S\nx\nz\n∂t\n∂x\n∂y\n∂z\n∂x\n∂x\n∂y\n∂y\n∂z\n∂z\nFurthermore, when the coefficients of diffusion are homogeneous, Di = f(x, y, or z),\n∂C\n∂C\n∂C\n∂C\n∂2C\n∂ 2C\n∂ 2C\n(24)\n+ u\n+ v\n+ w\n= +Dx ∂x\n2 + Dy ∂y\n2 + D ∂z\n2 ± S.\nz\n∂t\n∂x\n∂y\n∂z\nIf the diffusion coefficients are additionally isotropic, Dx = Dy = Dz, then\n∂C\n∂C\n∂C\n∂C\n∂2C\n∂2C\n∂2C\n(25)\n+ u\n+ v\n+ w\n= D\n∂x\n2 + ∂y +\n2 ± S.\n∂t\n∂x\n∂y\n∂z\n∂z\nFor laminar flow molecular diffusion controls the diffusive flux. In general, molecular\ndiffusion is both homogeneous and isotropic, so that (25) is appropriate. For turbulent\nflow turbulent transport dominates the diffusive flux. Commonly the turbulence field is\nboth heterogeneous and anisotropic and the diffusion coefficients will be as well.\nMaterial Derivative\nFluid motion and any constituent (temperature, concentration) transported by fluid\nmotion can be described from two frames of reference, one which is stationary or one\nv\nX =(x,y,z) and with\nv\nX, t\nv\nX , t\nv\nV (\nwhich is moving along with the flow. In the Eulerian perspective, the flow and its scalar\nconstituents are described with respect to fixed spatial positions,\nrespect to time (t), and are written, e.g.\n) and C(\n). In the Lagrangian\nperspective moves with the flow, and traces the history of individual fluid particles.\nUnlike the Eulerian description, in which spatial position is a fixed reference, in the\nv\nX 0\nLagrangian perspective, the spatial position is another variable of the particle. The flow\nvariables are written with respect to time and a single, initial reference position, e.g.\nv\nthe particle position at t = 0, such that the variables are recorded\nv\nX ,t\nv\nX (\n) and C (X0,t).\nThe Eulerian perspective is generally easier to represent, and therefore is more\ncommon in analysis and flow description. However, the physics and transport of flow are\n\nmore fundamentally related to the Lagrangian perspective. For example, the Navier\nv\nStokes equations essentially represent Newton's Second Law (F = ma v ) applied to fluid\nparticles. For transport problems, e.g., tracking the evolution of a phytoplankton patch as\nis grows (source), is preyed upon (sink) and diffuses, one again sees the conceptual\nadvantage of a Lagrangian perspective - predicting concentration following the patch. It\nis important to understand how these perspectives are related.\nConsider F(x,y,z,t) to be any variable of the flow described in terms of fixed Eulerian\ncoordinates, (x, y, z). We wish to relate this description to a Lagrangian perspective,\nspecifically to describe the rate of change in F observed while following an individual\nparticle through the flow. First, we can describe a change in F, namely dF, due to a small\nv\nchange in spatial position (dX ) and/or time (dt), as\n∂F\n∂F\n∂F\n∂F\n(26)\ndF =\ndt +\ndx +\ndy +\ndz .\n∂t\n∂x\n∂y\n∂z\nv\nNext, we constrain the increments dt anddX such that they follow the trajectory of an\nindividual particle, specifically, dx = u dt, dy=v dt, and dz=w dt. Then (26) becomes,\n∂F\n∂F\n∂F\n∂F\n(27)\ndF =\ndt + u\ndt + v\ndt + w\ndt .\n∂t\n∂x\n∂y\n∂z\nDividing by dt produces a derivative that represents the rate of change in F observed\nwhen following the trajectory of a fluid particle. To emphasize this special definition the\nderivative is given the notation DF/Dt, i.e.\nDF\n∂F\n∂F\n∂F\n∂F\n(28)\n=\n+ u\n+ v\n+ w\n.\nDt\n∂t\n∂x\n∂y\n∂z\nThe notation DF/Dt is called the material derivative (also the particle derivative, the\nsubstantial derivative, and the total derivative) to emphasize that it is taken following a\nfluid particle. The material derivative has two parts. First, ∂F/∂t, called the local\nderivative, represents the rate of change at any fixed point. For steady flow, ∂/∂t = 0.\nThe remaining terms, u∂F/∂x + v∂F/∂y + w∂F/∂z, are called the advective derivative,\nbecause they record changes in F which arise as the fluid element advects through a\nspatial gradients in F. The following animations demonstrate the material derivative.\nAnimation -Steady Temperature Field: This animation shows a one-dimensional system\nwith a spatial gradient of temperature, T(x). A temperature probe (white dot) moves with\nthe flow, making a Lagrangian observation. The probe records the material (total)\nderivative, which in one dimension is,\nDT\n∂T\n∂T\n(29)\n=\n+ u\n.\nDt\n∂t\n∂x\nProbes located at the fixed positions A, B, and C make Eulerian observations. They show\na steady temperature field, i.e. ∂T/∂t =0, such that the material derivative is equal to the\n\nadvective derivative, DT/Dt = u ∂T/∂x. This is quantified in the lower right corner of the\nanimation. The temperature field shown here could result from a steady, uniform flow\nthrough a heating element. The temperature of the fluid rises steadily as heat is added\nalong the flow path.\nAnimation -Unsteady Temperature Field: This animation shows a one-dimensional\nsystem with an unsteady temperature field, T(x, t). One temperature probe is moving\nwith the flow (white dot) at velocity u, and it records the material derivative given in\n(29). Three additional probes are located at the fixed positions A, B, and C. These\nprobes record the local derivative, ∂T/∂t, which is non-zero (unsteady), but is the same at\neach position. The value of each derivative is given in the lower right hand corner.\nAnimation - Spatially Accelerating Flow in a Pipe: In this animation, flow through a pipe\naccelerates downstream as the pipe cross-section decreases, i.e. ∂u/∂x > 0. Three probes\nmeasuring the flow at fixed positions, A, B, and C, show that the flow is steady, ∂u/∂t = 0\nat every position. Another velocity probes is moving with the flow (blue dot) and records\nthe material (total) derivative, Du/Dt. Within each section of the pipe, Du/Dt = 0, as\nshown by the blue trace in the Velocity vs. Time graph. At the step changes in area, the\nfluid locally accelerates, ∂u/∂x > 0, and at these positions Du/Dt = u ∂u/∂x.\nWhat is the mean velocity in this system? From the perspective of transport, the best\ndefinition of mean velocity is a Lagrangian definition, i.e. the mean velocity experienced\nby a probe moving with the flow. The probe takes 109 s to traverse the 90-m pipe. This\ngives a velocity of 90/109 = 0.83 ms-1. One may be tempted to define a mean Eulerian\nvelocity based on a spatial average of velocity within the three sections. As the segment\nlengths are equal, the average is straightforward, (0.50 + 0.89 + 2.0)/3 = 1.13 m/s. This\nvalue is meaningless, however, from the perspective of transport, because it does not\npredict the travel time through the system, i.e. 90-m/1.13-ms-1 = 80 s = 109 s."
    },
    {
      "category": "Resource",
      "title": "1. Conceptual model of diffusion",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/1-061-transport-processes-in-the-environment-fall-2008/8260e3e1577cd739ce85143510d9c165_lec_01.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n1.061 / 1.61 Transport Processes in the Environment\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n1. Conceptual Model of Diffusion\nThis section introduces the concept of molecular diffusion based on the\nrandom path of molecules. The theory and animation demonstrate how,\nthrough Brownian motion, a Gaussian distribution of molecules is\nobtained from a point release. The diffusion coefficient, D, is introduced\nas the coefficient in Fick's Law - which states that mass flux is directly\nproportional to, and in the opposite direction of, the concentration\ngradient. As noted by Fischer et al. (1979), several environmental\ndispersion problems can be described by processes that are strongly\nanalogous to molecular diffusion, so it's an incredibly important concept!\nThe example problems test one's knowledge of Fick's Law, the physical\nmeaning of the diffusion coefficient, and the use of the Gaussian\ndistribution to describe concentration profiles.\n\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n1. Conceptual Model for Diffusion\nDiffusion is defined as the net transport due to random motion. A model for diffusive\nflux can be constructed from the following simple example. Consider a one-dimensional\nsystem with motion in the X direction only. An interface B-B' separates two regions of\ndifferent concentration, C1 and C2 = particles/volume on the left and right side of the\ninterface, respectively. The motion of each particle is a one-dimensional random walk.\nIn each time interval, ∆t, each particle will move a distance ± ∆X, moving right (+ ∆X) or\nleft (- ∆X) with equal probability.\nB\nX\nX\n-\n-\n-\n-\n-\n-\nC1\n-\n-\nC2\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n- -\n-\n-\nX\nA, area of interface\nB'\nWithin each time step, any particle within a distance ∆X of the interface B-B' has a 50%\nprobability of crossing over that interface. The number of particles with the potential to\ncross B-B' from left to right (positive mass flux) is (C1 ∆X A), where A is the area of\ninterface B-B'. On average half of these take a positive step and cross the interface in\ntime ∆t, such that the flux left to right is (0.5 C1 ∆X A). Similarly, the number of\nparticles crossing right to left in ∆t (negative mass flux) will be (0.5 C2 ∆X A). The\nresulting mass flux, qX, is\n0.5 ∆X A (C1 -C2)\n(1)\nqx =\n.\n∆t\nIf C(x) is continuous, then C2 ≈C1 + ∆X ∂C/∂x, and (1) becomes\n∆X2\n∂C\n∂C\n(2)\nqx ≈-\nA\n= -D A\n= [mass/ time].\n2 t\n∆\n∂x\n∂x\n\nThe coefficient of diffusion, D ~ (1/2)∆X2/∆t, has units of [length2 time-1]. The\ndiffusivity of a chemical molecule in a given fluid depends on the ease with which the\nmolecule can move, specifically, how far, ∆X, the molecule can move in a given time\n\ninterval. The ease of molecular motion, and thus the diffusivity of a particular chemical,\nwill depend on the molecule size and polarity, the type of fluid and the temperature.\nEquation (2) is a mathematical expression of Fick's Law. Fick's Law states that the\nflux of solute mass crossing a unit area, A, per unit time, ∆t, in a given direction, e.g. x, is\nproportional to the gradient of concentration in that direction, ∂C/∂x, and is counter-\ngradient, i.e. the net flux is down-gradient. Because the flux in any direction is\nproportional only to the concentration gradient in that direction, Fick's Law can be\ndirectly extended to three-dimensions.\n∂C\n∂C\n∂C\n(3)\n(qx, qy, qz = -DA\n\nyz\n, -DA\n, -DA xy\n)\n(\n\nxz\n).\n∂x\n∂y\n∂z\nFor molecular diffusion the coefficient for diffusion is isotropic, i.e. the same in all\ndirections. This is not typically true for turbulent diffusion.\nDiffusion from a point source\nConsider a cloud of N particles (and total mass M) released at x = 0 and t = 0. Under the\naction of molecular diffusion, the cloud will slowly spread. We use the random walk\nmodel to predict the distribution of particle (mass) concentration, C(x,t). Note, that if we\nassume a unit mass per particle, we can conveniently interchange N = M. For simplicity\nwe again consider a one-dimensional system, with the same rules of random motion\ndescribed above, i.e. at each time step, ∆t, each particle will move either +∆X or -∆X\nwith equal probability. Over time each particle will move a bit forward and a bit\nbackward. The probable location of an individual particle after many such steps can be\npredicted with the Central Limit Theorem (see any basic statistics text). Specifically, in\nthe limit of many steps, the probability that a particle will be located between m∆X and\n(m+1)∆X approaches a normal distribution with a zero mean and a standard deviation of\n(4)\nσ =\nwhere, as above,\n(5)\nD = (1/2)∆X2/∆t.\nThe probability that a particle ends up between x and x+∆X is\n\nx2\n\nx2\n(6)\np(x,t) ∆X =\nexp-\n∆X =\nexp-\n∆X.\nσ 2π\n\n2σ2\n4 Dt\nπ\n\n2σ2\nNow consider the full cloud of N particles. At any time t, the number of particles\nbetween x and x+∆X is expected to be n(x,t) = N p(x,t)∆X. Thus, the concentration, C,\nat position X is C(x,t) ≈n(x,t)/(A ∆X), where A is the constant cross-section of the one-\ndimensional system. Exchanging M for N, the concentration distribution, C(x,t),\n2Dt ,\n\nM\n(7)\nC(x,t) =\nexp(-x /4Dt)=[mass / length3]\nA 4 Dt\nπ\nAs noted above, this distribution is the normal distribution with zero mean and standard\ndeviation, σ = 2Dt , which should be familiar to you from any basic statistics course.\nBriefly, the distribution forms a bell-curve, as shown below. At any time, sixty-eight\npercent of the total mass (total number of particles) falls within ± σ of the mean position\n(x = 0). Ninety-five percent of the mass falls within ± 2σ of the mean position. And,\n99.7% falls within ± 3σ of the mean position. Based on these limits, it has become\ncommon to define the extent of a concentration patch based on the contour that includes\nninety-five percent of the total mass, i.e. the contour at 2σ from the center. With this\nconvention the length of a diffusing cloud, L, is often taken as L = 4σ.\nC\n68%\n95%\nCmax\n0.61 Cmax\n-3 σ -2 σ\n-σ\n+ σ\n+2 σ +3 σ\nIt is also useful to note that the concentration level at one standard deviation from the\ncloud center is 61% of the maximum concentration, i.e. C (x = ± σ) = 0.61 Cmax, where\nCmax is the concentration at the center of the cloud. This value provides a useful way to\nrapidly define the standard deviation of a particle (species) cloud.\n\nExample of Random Walk Process: See Animation\nThis animation shows the motion of 500 particles in a one-dimensional random walk with\nstep size ∆X = 1 in time ∆t = 1. At t = 0 the particles are located at 0. This random walk\nanimation mimics the effect of Fickian Diffusion. As you watch the animation, consider\nthe following.\nGraph of Absolute Particle Location (lower left window).\nThis graph shows the number of particles located at each position of the x-axis. The\nnumber of particles per location is analogous to a concentration.\n1) Over time how does the peak particle number, N, (concentration, C) change under the\ninfluence of random particle motion (diffusion)?\n2) Over time how does the gradient in particle number (concentration), i.e. dN/dx\n(dC/dx) change under the influence of random particle motion (diffusion)?\n3) What is the sign of the particle number (concentration) gradient (dN/dx) for x > 0?\nConsider the animation of individual particle motion (uppermost window). For x > 0,\nis the net particle flux positive (to the right) or negative (to the left)? Is the direction\nof flux up-gradient of down-gradient? Is the relationship between the direction of\nflux and the concentration gradient consistent with Fick's Law (equation 3)?\n4) Estimate the diffusion coefficient, D, using equation (4) above, and the values of σ\ngiven in the upper left corner of this graph. You can pause the animation. How does\nthe realized value of D compare with the theoretical value given in equation (5). Note\nthat no specific units are given here, such that D will simply have unit L2T-1, where L\nis an arbitrary length unit and T is the arbitrary time unit.\nGraph of Particle Location in Terms of σ.\nThis graph plots the distribution of particle location with the position normalized by the\nstandard deviation, σ. The solid curve is the Gaussian distribution.\n5) Note that at early time (first few time steps) the real distribution of particles does not\napproximate a Gaussian distribution very well. This is because the Gaussian\ndistribution is only valid after a sufficient number of steps (Central Limit Theorem).\nUse the animation to estimate how many steps are required for the distribution to\nconsistently fit the Gaussian distribution.\nKey Aspects of Diffusion\n(1)\nDiffusion is the net flux due to random motion.\n(2)\nDiffusive flux is proportional but opposite in sign to the gradient of concentration.\n(3)\nDiffusion acts to dilute concentration and reduce gradients of concentration."
    }
  ]
}