{
  "course_name": "U.S. Social Policy",
  "course_description": "This subject examines the historical development and contemporary politics of social policy in the United States. We will discuss the kinds of risks individuals face over a lifetime and why some are ameliorated by social policy while others are not (and how the U.S. is similar or different from other countries in this regard). We will examine the policymaking process in the U.S., why some alternatives are implemented and others abandoned, why some interests are privileged over others, and how the designs of policies can feed back and shape politics in a given policy area. Along the way we will examine interactions among political institutions, policy elites, the media, and the mass public.",
  "topics": [
    "Social Science",
    "Political Science",
    "American Politics",
    "Public Administration",
    "Public Policy",
    "Social Welfare",
    "Social Science",
    "Political Science",
    "American Politics",
    "Public Administration",
    "Public Policy",
    "Social Welfare"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Overview\n\nThis class is divided into four sections, each of which is illustrated with case studies of various social programs. We open by discussing cultural and institutional reasons for American exceptionalism in social policy, using the case of health insurance. In the second part of the class, we begin studying policy inputs with a focus on the mass public: defining political participation, studying subgroup differences in participation rates, exploring the origins of political preferences, examining patterns of interest group organization, and discussing the nature of representative government and the theoretical relationship between participation and representation. In the third part of the course we turn to the policymaking process, studying how problems come onto the political agenda and how Congress, the courts, and the bureaucracy shape policy. Fourth, we study policy in practice: how policies are implemented; how their designs shape client experiences and subsequent policy outcomes; where we draw the line between public and private provision; and with a few final case studies how the working years, gender, and human capital formation (education) are treated by U.S. social policy. We conclude by speculating about the likely course of American social policy in the future.\n\nGrading\n\nGrades will be earned on the following basis:\n\nACTIVITIES\n\nPERCENTAGES\n\nClass Participation\n\n20%\n\nIntermediate Projects (Assignments 1-4)\n\n20%\n\nFinal Paper\n\n60%\n\nStudents are expected to complete the intermediate projects, each of which is a stage in preparing the final research paper. For the research paper, students will choose a policy area and examine the course of policymaking - what factors led to the policy outcome that was achieved? The final paper (20-25 pages, double-spaced, 12-point type) is due 2 days after Lec #25 at 5:00 pm at my office. Students will also take turns writing discussion questions and helping to lead class discussion (3-4 times during the semester, depending on enrollment). These efforts will be part of the seminar participation grade. The discussion questions should be emailed to the class by 5:00 pm the evening before your assigned day.\n\nCalendar\n\nLEC #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nPart I: American Exceptionalism and a Case: Why No National Health Insurance in the United States?\n\n2-3\n\nU.S. Health Policy\n\nPart II: Preferences, Participation, and Representation\n\nWho Participates?\n\nWho Gets Represented? The Case of Social Security\n\nWho Gets Represented? The Case of Tax Cuts and Other Policies\n\nInterest Groups I\n\nInterest Groups II: Business vs. Labor\n\n9-10\n\nPublic Opinion and Preference Formation: The Case of Universal vs. Targeted Programs\n\nPart III: The Policy-Making Process\n\nProblem Definition and Agenda Setting I: The Case of Medicare Prescription Drug Coverage\n\nProblem Definition and Agenda Setting II\n\nAssignment 1 due: Select issue area for research paper\n\nPolicy-Relevant Institutions: Congress I\n\nPolicy-Relevant Institutions: Congress II; The Case of the Hidden Welfare State\n\nAssignment 2 due: List at least five sources\n\nPolicy-Relevant Institutions: The Courts; The Case of Welfare Rights\n\nPart IV: Policy in Practice\n\nImplementation: The Case of Rehabilitation in Prison\n\nAssignment 3 due: Write paragraph on actors in your issue area\n\nPolicy Design\n\nThe Consequences of Policy Design: The Cases of Welfare and the G.I. Bill\n\nPublic-Private Relations\n\nAssignment 4 due 2 days after Lec #19: 8-10 pages on opinion and participation in your issue area\n\nThe Working Years: Unemployment, Disability Insurance, and the EITC\n\nGender in U.S. Social Policy: The Case of Family and Medical Leave\n\nEducation Policy: Vouchers\n\nEducation Policy: Federal College Loans\n\n24-25\n\nCourse Conclusion: The Future of American Social Policy\n\nAssignment 5 due 2 days after Lec #25: Final paper due",
  "files": [
    {
      "category": "Resource",
      "title": "all_disc_ques.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-317-u-s-social-policy-spring-2006/b60d5ad143cbe03c63755c220c6d187f_all_disc_ques.pdf",
      "content": "Discussion Questions for 17.317, U.S. Social Policy\n\nPart I: American Exceptionalism and a Case: Why No National Health Insurance in the\nUnited States?\n- This section of the course uses a case study of national health insurance in the U.S. as a\nway to introduce the policymaking process in the United States and some of the major\nexplanations for policy outcomes\n\nU.S. Health Policy\n- What are some of the main explanations for the lack of universal health insurance in the\nUS? For the failure of the Clinton health care reform effort of 1993-1994?\n- What are \"cultural\" explanations? What are \"interest\" explanations? What are\n\"institutional\" explanations? What kind of evidence would proponents of one or the\nother put forth?\n- How would you describe the American political culture? What kind of evidence do we\nhave about what the American political culture is? What are the implications for\npolicymaking? What are the shortcomings of cultural arguments as an explanation for\npolicy outcomes - how well do cultural arguments explain cross-national variation?\nTemporal variation?\n- Similarly, how would you describe the institutional set up of American government, and\nwhat are its implications for policymaking? What are the advantages and disadvantages\nof institutional arguments?\n- What are \"interest\" explanations? What interests are we talking about, and why are they\ninfluential? What advantages does this kind of argument have over cultural arguments?\nWhere does this argument fall down?\n- When have the major pushes for national health insurance taken place in the U.S.? How\nwould each of the theories outlined above explain why NHI failed to achieve passage\neach time?\n- What is the state of public opinion around health care? How has it changed, or not, over\ntime? If you were a policymaker, what message would you take from the survey results\nlisted in the Blendon and Benson article?\n- If many Americans say they want universal health insurance (UHI) - as has often been\nthe case in surveys - what does the fact that UHI has repeatedly failed in the US say\nabout the place of public opinion in policymaking? Or about the characteristics of public\nopinion - are those surveys meaningful?\n\nPart II: Preferences, Participation, and Representation\n- This section of the course focuses on the mass public - what does the public want, who\nparticipates in politics, and whose preferences get expressed in public policy. We begin\nby looking at political participation, which is a key way in which citizens voice their\npreferences.\n\nWho Participates?\n- How can an ordinary citizen participate in politics in the US? What are the modes of\nparticipation? Are these similar to or different from other countries?\n- What are the ways in which we can differentiate among these activities?\n\no some hard, others easy (require more or less inputs)\no some convey more info to policymakers than others\no some more unequal than others\n- If you were an interest group official who wanted to influence policy, which acts would\nyou urge your membership to take part in?\n- Which political acts are the most and least unequal? Why?\n- Protests: are they a \"weapon of the weak\"? Why do affluent engage in disproportionate\nshare of protests?\n- What are the factors in participation? What explains why some people participate more\nthan others?\n- How much do the factors vary across individuals?\n- Where do these factors come from?\n- What is the relevance of education for participation? What are the differences between\nabsolute and relative levels of education?\n- What is the relevance of income for participation? Of free time?\n- What is the relevance of skills, and where can they be gained?\n- What are the sources of political interest, information, and efficacy?\n- What entities mobilize people to politics? How does mobilization vary over time?\n- Compare churches and unions as mobilizing entities\n- How can we explain the low participation rates of the young? The high participation rates\nof the old? Differences by gender and race?\n- What kinds of reforms aimed at increasing participation does this model suggest?\n- Would full participation matter for policy outcomes? How and why?\n- What are the ramifications of political inequality for social policy outcomes?\n\nWho Gets Represented? The Case of Social Security\n- Senior citizens have low levels of formal education and income - how can they be so\nparticipatory?\n- Old people didn't used to be so participatory - used to be age group least likely to\nparticipate - so what changed?\n- How has Social Security affected the participation rates of senior citizens over time?\nWhat are the mechanisms? What have been the program's effects on resources, political\nengagement, mobilization opportunities?\n- How have these program effects varied across senior subgroups?\n- Seniors participate in politics at higher rates than younger people - does it matter? How\nwould we know?\n- At the same time, there has not been backlash against senior citizens - why not?\n\nWho Gets Represented? The Case of Tax Cuts and Other Policies\n- Introductory questions: Did people want the Bush tax cuts? If not, why did we get them?\nHow do preferences enter pol system, and whose preferences are expressed?\n- Gilens paper:\no Most examinations of relationship between public preferences and public policy\nfind close relationship, esp. on salient issues. But whose preferences get\nrepresented most?\n\no He collects public opinion polls between 1992 and 1998 and sees whether the\nproposed change is enacted\no Much of the time there is no change - where does this status quo bias come from?\no He finds that the affluent are much more likely to have their preferences fulfilled\nthan the poor. Why would that be? Does it matter? On what issues is this the\ncase, and what are the ramifications?\no Long-time argument in political science that politicians have an incentive to move\nto the middle, to the median voter, to the person at the 50th percentile. What is the\nmedian voter model, and why would politicians have an incentive not to stray too\nfar from the median voter's preferences?\no And why does the median voter model seem to fail here?\n- What the Hacker/Pierson explanations for the ability of politicians to stray from the\nmedian voter without penalty?\no What are the design features of the Bush tax cuts which these authors say helped\nsecure middle class support? What are the future political and economic\nconsequences of these features?\n- On what kinds of policies do you think the public is the most manipulable?\n\nInterest Groups I\n- What are interest groups? What different kinds of interest groups are there? What is\ntheir role in the policymaking process?\n- What is a subgovernment? What is an issue network? How have political scientists'\nviews of policymaking and the nature of influence changed over time?\n- What factors in the political system changed over time to open up the older policy\nsubsystems?\n- What is the collective action problem in Olson's view? What kinds of groups are subject\nto free rider problems? What are collective goods? How can groups overcome the free\nrider problem?\n- How does Skocpol characterize changes in the nature of citizen interest groups over\ntime? What are the characteristics of old-style membership associations - what groups\nare we talking about, how were they organized, what kinds of activities did they engage\nin, how did they overcome free rider problems, in what ways were their memberships\ndiverse (and not diverse)?\n- What about membership associations now? How do they differ from the old-style\ngroups? What changed in American society and politics that caused these new types orf\norganizations to emerge? What is the nature of their organization, relationships with\nmembers? What are the implications for political mobilization and policymaking of the\nways in which membership associations have changed? In what ways are the new groups\ndiverse (and not diverse)?\n- What are the implications for political participation and representation?\n\nInterest Groups II: Business and Labor\n- The discussion last time focused on interest groups in general. This session is on two\ntypes of interest groups that have some of the biggest impacts on social policy: business\nand labor.\n\n- Labor unions: What is their function? What has been the trend in labor unions over\ntime? How do they try to influence policy outcomes?\n- What are the implications for politics of the decline of unions? What other entities\nmobilize working class people?\n- Why are unionization rates higher in other countries? What would cultural or\ninstitutional arguments look like? How does the legal status of unions differ? What is the\nrole of American federalism is shaping the possibilities for the union movement?\n- What are the pros and cons for unions of working mainly through the Democratic party?\nWhat are the implications of \"capture\" by one party? How contrast unions' situation with\nthat of senior citizens, a group in play for both parties?\n- What about the political preferences of individual union members?\n- What are some of the advantages and disadvantages business has as an interest group?\n- What are the major business organizations? How do the preferences of large and small\nbusiness differ?\n- What was the role of business interests in the Clinton health care reform effort of 1993/94\n- Interest group wrap-up: how do interest groups operate in the American policymaking\nsystem? What are their sources of influence and power? What are challenges that interest\ngroups can face as actors trying to influence policy outcomes?\n\nPublic Opinion and Preference Formation: The Case of Universal vs. Targeted Programs\n- Describe the two major views of the nature of public opinion - that the public doesn't\nknow much about politics at all, and alternatively that the public knows enough to be\nmeaningful democratic actors. What kinds of evidence to those who hold each view\npresent?\n- How does knowledge about specific policy areas compare to general political\nknowledge? Do those who know a lot about the political system generally know about\npolicy areas as well?\n- How does knowledge/ignorance vary across issue areas? Why? Why might people know\nabout the deficit and unemployment but not about the environment or foreign aid? What\nare the roles played by the media, personal experience, elite cues?\n- What are the factors that lead someone to have high levels of general political\nknowledge? Policy-specific knowledge?\n- What experiments does Gilens perform? Does having correct political information about\na policy area lead to different opinions? What about among those with a lot of general\npolitical information to begin with?\n- What view of public opinion do Page and Shapiro express? Why might aggregate public\nopinion appear more rational and coherent than individuals' opinions? Given how little\npeople know about politics, how can this be the case?\n- Now we turn to public opinion about social policy, about universal vs. targeted programs\nspecifically\n- Regarding the Gilens book chapter:\n-\nWhy are economic rights more controversial in the U.S. than civil rights?\n-\nWhy did Gilens analyze photographs in poverty-related stories in newsmagazines\nrather than the stories themselves?\n\n-\nWhat is the relationship between media coverage of poverty and the racial\nportrayal of poverty and the actual racial composition of the poor? How does this\nvary over time? When does poverty coverage get racialized?\n-\nWhat is the effect of media coverage on attitudes toward welfare?\n- Regarding the Cook and Barrett book chapter:\n-\nWhat programs are most and least supported by the public?\n-\nWhat is the role of notions of \"deservingness\"?\n-\nWhat is the role of different target populations or different kinds of programs\n(giving cash vs. in-kind goods) on public opinion toward programs?\n-\nWhat about opinion among Congressmen - how does it different from that of the\npublic, and why?\n\nPart III: The Policymaking-Process\n- This portion of the course examines how issues come on the political agenda and how\nseveral of the main policymaking institutions - Congress and the Courts in particular -\nfunction.\n\nProblem Definition and Agenda Setting: The Case of Medicare Prescription Drug\nCoverage\n- There are a lot of conditions out there - how does a condition become perceived a\nproblem? Why do some problems come to public attention? What role can indicators,\nfocusing events, program oversight play? And why would a chronic, ongoing condition\nrise onto the public agenda? Why do problems fade from the public agenda?\n- How does politics shape agendas? How do changes in political conditions affect what\nissues arise on the agenda? What role can be played by elections, the public mood,\ninterest groups?\n- Who devises policy alternatives?\n- The policy stream: when do alternatives arise? What does Kingdon mean by the \"policy\nprimeval soup,\" \"softening up periods,\" and \"pet solutions\"? How is the political history\nof Social Security privatization since the 1980s an example of these concepts?\n- What happens when a window of opportunity opens up? What happens when only two\nof the three streams (problems, policies, politics) come together? Who or what opens\nwindows? What roles can political entrepreneurs play?\n- Consider the case of prescription drug coverage for senior citizens\n-\nWhat was the condition?\n-\nHow did this condition become a problem\n-\nWhat policy alternatives were out there?\n-\nHow did Republicans, who held Congress and the Presidency, craft a solution?\nWhat were their ultimate goals?\n-\nWhat was the roles various interest groups played? Which groups were most\ninfluential?\n-\nWhy did the drug program that was eventually passed have so many\nshortcomings? What were the political risks associated with drug program as\npassed? The potential political benefits?\n\nProblem Definition and Agenda Setting II\n\n- Here we discuss another view of agenda setting, the Baumgartner and Jones book\n- What is a policy image? Can you think of examples? Who can influence the content of\npolicy images, or change images?\n- How does a condition become a problem in B+J's perspective? What are the roles played\nby problem definition and causal stories?\n- What is a policy venue? Why might policy advocates want to change a policy venue?\nWho would want to change a policy venue?\n- What is meant by the \"scope of conflict,\" and who would want to expand it?\n- Under what conditions is nonincremental policy change possible?\n- What is a Schattschneider mobilization? A Downsian mobilization?\n- What role do the media play?\n\nPolicy-Relevant Institutions: Congress\n- Let's say there is a need to reform Social Security. The trust fund in crisis. Need\nimmediate action - you're a congressman who's read Doug Arnold's book - what do you\ndo? What will get constituents most riled up?\n-\nIncrease retirement age\n-\nDecrease benefits\n-\nChange number of years of working life on which benefits are calculated\n-\nIncrease wage ceiling for taxation\n- Let's say there's a bill that would reduce the deficit and help the environment by\nimposing a BTU tax on energy consumption.\n-\nShould I vote for it?\n-\nWhat are the issues here?\n-\nHow could a coalition leader make the bill more palatable?\n- Concepts from Arnold to know:\n-\nattentive vs. inattentive public\n-\nearly order vs. late order effects; costs and benefits\n-\nprobability constituents will notice depends on magnitude, timing, proximity to\nothers similar affected; instigator\n-\nStrategy: wait to cast vote on a bill, esp if freshman. Vote no, because when it\npasses, both people who wanted it will be happy (got what they wanted) and those\nwho didn't wait it will be happy b/c at least you tried. Any problem with this\nstrategy? (challenger bring it up)\n- If lawmakers such good calculators, then why was the 1988 Medicare Catastrophic bill\npassed?\n-\nIncrease in Medicare: cap out of pocket expenses (late order benefit)\n-\nFinanced by new premiums on seniors, surcharge on high income seniors (early\norder cost)\n-\nWhat does the Medicare Modernization Act of 2003 say about what they learned?\nDon't do financing on backs of seniors\nBenefits right away\n- Implication of much of Arnold: lawmakers should be \"delegates\" rather than \"trustees\".\nBut what are strategies Arnold mentions that allow lawmakers to achieve the public good\nrather than particularlized goods?\n\n- What kinds of reforms are implied by Arnold? Eliminate roll call votes? Sunshine laws\nof early 1970s - pernicious consequences. We still see many difficult issues being\nresolved with secret negotiation like 1983 Social Security Amendments\n- Issue of quality of information voters receive\n-\nHow much of Arnold rests on voters receiving quality info (not distorted by\nnegative campaigning, intentional fuzzing of differences btwn parties, etc)?\n-\nOr is Arnold's whole point that info can be manipulated - reduce traceability,\nalter perceptions of costs, etc?\n- Arnold and inequality:\n-\nWho gets info? Who is in info networks that disseminate info on magnitude,\nproximity? Who gets mobilized?\n\nPolicy-Relevant Institutions: Congress II; the Case of the Hidden Welfare State\n- What techniques to politicians use to escape blame?\n- What do we mean by the \"hidden welfare state\" What programs are we talking about?\nWhy are the hidden?\n- In what ways are the hidden and visible welfare states similar and different? How large\nis the hidden welfare state in comparison?\n- What are the incentives for politicians to use the tax code to implement social policy\nrather than regular spending programs? How is the a case of blame avoidance?\n- When did \"hidden welfare state\" programs develop - at the same or different times than\nthe regular welfare state? How have they grown over time?\n- What are the distributional consequences - who benefits from these programs?\n- What are the political consequences? Do hidden welfare state programs have the same\nresource/engagement/mobilization effects as visible welfare state programs? Why or\nwhy not? What might be the consequences for people's feelings about government of\nhiding the benefits people receive?\n- Why has the EITC proven such a successful anti-poverty program both economically and\npolitically? But why are most hidden welfare state benefits directed toward the affluent?\n\nPolicy-Relevant Institutions: The Courts; The Case of Welfare Rights\n- What is statutory interpretation?\n- How is statutory interpretation relevant for social policy, that is, why are we talking about\nthe courts in the context of this course?\n- Why did the courts begin to play this new role, of interpretating laws in a way that\ncreated new \"personal rights\"? What was Congress doing at this time created a situation\nin which the role of the courts changed?\n- How do courts go about doing statutory interpretation? What kinds of evidence do they\nlook at to discern Congress's intent?\n- In what ways was the Civil Rights movement and the Civil Rights Act of 1964 an\nimportant turning point? What were the Warren and Burger courts' stances on statutory\ninterpretation?\n- Why does power shift to lower courts during the 1970s? How does this change interest\ngroups' strategies?\n\n- What are the policy implications for entitlements of statutory interpretation? What view\nof poverty is implicit? Does the court ever say there was a \"right to welfare\"? If not,\nwhat did the courts do that expanded welfare?\n- What are the implications of these trends in statutory interpretation for interbranch\nrelations? For the concept of representation?\n- In the 1980s we get backlash - why, and with what consequences?\n- And the question of the courts' legitimacy. Dahl says \"policy views dominant on the\nCourt will never be out of line for very long with the policy views dominant among the\nlaw-making majorities of the United States\" - do you agree? Are there examples that\nsupport or undermine this assertion?\n\nPart IV: Policy in Practice\n- This part of the course examines a number of policies in practice. We will both employ\nwhat we've learned so far to examine new policy areas as well as learn about new\nconcepts like implementation and the political implications of program design.\n\nImplementation: The Case of Rehabilitation in Prison\n- Today we examine implementation, using a case study of implementing social policy in\nprison settings. This may seem like an unusual case to examine, but it gives insight into\nan important aspect of social policy that we'd otherwise miss, and also shows how\nbureaucratic cultures can have significant impacts on the implementation of policy\n- To begin: What is the goal of incarceration?\n-\nKeep criminals off the street to deter crime\n-\nRehabilitate them (although this not a stated goal of Dept of Justice)\n-\nThis is what interests the author: how are these people going to be reintegrated\ninto society? Any preparation has to come from the prison experience\n- Why is there skepticism among many observers about whether rehabilitation works\n- Definition: Implementation is the \"carrying out or execution of a program that has been\nadopted by legislation or by executive or judicial order.\" Let's say you are charged with\nstudying the implementation of a policy. How would you go about doing that?\n-\ncould look at policy outcomes\n-\ncould look at policy activities\n- Most implementation studies look at policy outcomes and are disappointed. Why?\n- Instead she examines policy activities. What are the potential conflicts between the short\ngoal of the prison - keeping peace among inmates - and the long-term goal of\nrehabilitation?\n- Why does rehabilitation programming work in some prisons but not in others?\n-\nAttitudes of correctional officers\n-\nSocial organization of officers and program staff\n-\nResources\n-\nIncentives for prisoners\n-\nCulture and values\n-\nDifferent values can serve same function, can be functional equivalents\nAppleton: experimentation, professionalism\nBeaverton: policy, excellence\n- Communication as a value\n\n-\nThese programs are threatening to other prisoners, maybe even to other staff (say\nif they don't have college degrees)\n-\nBut if high value is placed on communication, then can see how programs can\nhelp prison's goal of security; can help ease relations among staff; can help ease\nrelations with prisoners who are the adversary\n- Are there incentives in place, and do these match the existing institutional values\n- Bottom line: implementation failures might seem to be a result of incompetence or\ndeliberate resistance, but instead are due to mismatch between programs and their\ninstitutional context\n- And, need to evaluate processes, not just outcomes if want to understand the course of\nimplementation.\n-\nStaff and target groups are policy makers in their own right\n-\nThe policies have to fit their needs and contexts; a policy design that worked in\none context may not work in another\n- This will become relevant for the next two sessions, where we discuss the ramifications\nof policy designs themselves - whether a policy is successful depends on the\nexpectations, orientations, culture of those who implement it and those who receive it.\n\nPolicy Design\n- This session: different ways of thinking about policy design\n-\nSchneider and Ingram: how policies shape how we think about target populations\n-\nSkocpol: whether we should have targeted or universal programs\n-\nPeterson: whether policies should be implemented at the state/local or federal\nlevel\n- What is meant by the \"social construction of target populations\"?\n- Describe the four types, and offer examples:\n-\nStrong/positive (deserving)\n-\nStrong/negative (contenders)\n-\nWeak/positive (dependents)\n-\nWeak/negative (deviants)\n- What's the direction of causality here?\n-\nDo the program designs cause the target group images?\n-\nOr do the pre-existing nature of the target groups determine how popular the\npolicies are?\n- How does the level of benefits vary across the four types?\n- How do policy tools vary across the four groups?\n- What messages are sent to the groups, and with what consequences for both public\nopinion (support of their programs) and their own political participation?\n- Turning to the Skocpol article: what are the pros and cons of universal programs? Of\ntargeted ones?\n- Why did various targeted policies over time fail (poorhouses; mothers' pensions; war on\npoverty)\n- In what ways did various universal policies succeed (Civil War benefits; health education\nservices for mothers and babies; Social Security)\n- How are the poor helped within universal policies?\n\n- Are there other policy areas in which we might try targeting within universalism? What\nare the political prospects?\n- Finally, turning to Peterson we take another consideration in policy design: should the\nfederal or state or local governments be responsible for a given policy?\n- What division of labor does he advocate?\n- Why? What are the dynamics of residential mobility and the implications for policy?\n\nThe Consequences of Policy Design: The Cases of Welfare and the GI Bill\n- So welfare recipients participate in politics at low rates. Why? Don't they have a large\nstake?\n-\nlow resources\n-\nbut even controlling for that, participate less than we would predict\n-\nSoss: the experience of welfare recipiency undermines their participation\n- What is it about getting welfare that undermines participation?\n-\ndemeaning caseworker relationships\n-\nno rules - caseworkers appears to have great discretion over your benefits\n-\nask demeaning questions about your personal situation\n-\nthink whole government is arbitrary; whole govt is like \"the welfare\"\n-\nso undermines participation by\nundermining external political efficacy (how responsive you think govt is\nto people like you)\nemphasizing the demeaning, stigmatizing aspect of welfare - you are not a\nfull citizen with legitimate claims on the government\nyou have to demean yourself to ask the govt for a favor\n- How does SSDI differ in its effects on recipients vs. welfare?\n- Think about other programs we've studied this semester - what effects do their designs\nlikely have on client participation?\n- In what ways are the welfare/SSDI differences a phenomenon of implementation?\n- How does the experience of Head Start clients differ?\n- Can you think of ways to implement welfare so that it did not undermine client political\nefficacy and participation?\n- What are barriers to collective action among welfare recipients?\n- AFDC has a positive effect on recipients' internal political efficacy. Why, and are there\nsome kinds of political activity internal efficacy might feed?\n- Turning to the GI Bill, in what ways was its education benefits \"targeting within\nuniversalism\" as Skocpol advocated?\n- What did affluent recipients get out of the GI Bill? Lower income recipients?\n- What would have happened if benefits had not been the same for all - if lower income\nrecipients had received fewer benefits?\n- In what ways was the GI Bill similar to Social Security\n- Now, the Montgomery GI Bill is available for those in the armed services, but the design\nis quite different from the original GI Bill:\n-\nHave to sign up right away; can't sign up later\n-\nReduce your pay to get it by $100/mo.\n-\nHave to serve 3 years (or two years in Army short enlistment)\n\n-\nDon't get your money back if you don't use it\n-\nMany categories not eligible\n-\nWould today's Montgomery GI Bill have the same participatory effects?\n- both these articles: show political attitudes, participatory orientations by no means set in\nchildhood\n-\npreadult socialization very important\n-\nMettler: parental level of activity huge predictor of activity\n-\nBut on top of that, experiences you have with government as an adult influence\nyour orientations toward govt and your likelihood of participation\n- One final consideration: research design and program effects\n-\nOne pitfall of analysis is selection effects: you're trying to determine whether the\nGI Bill had an effect on veterans' civic memberships and pol participation\nsubsequently\n-\nbut while the GI bill was universal, it was also voluntary\n-\nso there could be a selection effect - those who had the motivation to pursue the\neducational benefits may be predisposed to participate at higher levels. So it's not\nthe program causing the participation, but rather some other factor causing both\ntakeup of the program and the pol participation.\n-\nSoss tries to address this by studying populations that are very similar (say AFDC\nand Head Start) so that the differences he finds can plausibly be attributed to\nprogram experiences rather than preexisting characteristics\n-\nideal design: you randomly assign people to programs. But as with much social\nscience, random assignment is impossible. Try to do it with welfare or Medicaid\nwaivers, school vouchers where randomly assign people to the experimental\ntreatment. But they may not choose to do it, therefore compromising the random\nassignment. So something to keep in mind when reading these kinds of studies.\n\nPublic-Private Relations\n- We've talked about fact US ws unusual in that so much of our welfare state is run\nthrough the tax system. Also (and another aspect of that) is that so much of the welfare\nstate in the US is not public but private.\n- So what do we mean by the private welfare state? Who provides it?\n- What kinds of risks are protected? For whom?\n- How and why did we get this hybrid private-public system?\n-\nWhat was the role of the weak party and labor traditions in the US?\n-\nThe role of the federal structure?\n-\nWhy did companies begin offering such benefits?\n-\nWhat was the role of government in encouraging private provision?\n- What are the ramifications of protecting workers through employers rather than all\ncitizens through the government?\n-\nWhat are the effects on coverage, inequality\n-\nWhat are the political effects?\no On citizen political participation\no On the likelihood of future public provision\n- What are some advantages of market/private provision?\n- There are still many risks still largely outside either the public or private realm\n\n-\nChild care\n-\nElder care\n-\nWhat are prospects for these being addressed more widely?\n\nThe Working Years: Unemployment, Disability Insurance, and the EITC\n- Again our theme is the nature of social policy, or how various risks are met, for working\naged people\n- last time: the private welfare state - what risks employers cover, and what the pros and cons\nare of having employer provided social protections\n- this time: public provision for working aged people - what public programs are in place for\nthe kinds of risks that working aged people face (excl health insur)\n-\nrisk of losing your job: unemployment\n-\nrisk of not being able to perform your job: disability\n-\nrisk of being paid too little: EITC\n- Why is social insurance, government programs, a good idea in these realms (unemployment\nand disability in particular)\n-\nWhy don't people just self-insure?\n-\nWhat about private insurance, either purchased by individuals or provided by\ncompanies? Could there be private unemployment or disability insurance? Who\nwould buy such insurance, and what does this mean from the perspective of the\ninsurer? Also, what happens when people are insured?\n-\nThus adverse selection and moral hazard are two phenomena that make these threats\ndifficult to insure for individually\n-\nWhat about writing insurance for disability?\n-\nWhy might you want the government to insure for disability and unemployment, and\nwhy might this be economically desirable?\n- Based on Peterson's arguments, should unemployment insurance be federally or state run?\n-\nWhy don't we have national unemployment insurance?\n-\nResult: huge variation in coverage, benefits across states\n- Disability insurance: why is the workman's comp system set up the way it is?\n- Why is complete disability the criterion for Social Security disability insurance?\n- Finally, the risk of low wages. How does EITC work? What are its advantages and\ndisadvantages economically and politically compared to welfare\n- What would be the pros and cons of raising the minimum wage as a way to address the risk\nof low wages?\n\nGender in U.S. Social Policy: The Case of Family and Medical Leave\n- This course has discussed the differential treatment of various groups with social policy -\ndifferential treatment by income level, working status, age, race\n- Today we focus on gender: do we treat women the same or differently? How is gender\nthe same or different from race? What do we do in terms of social policy about the fact\nthat only women can have babies? How have notions changed about the arenas in which\nwomen should be treated differently or the same?\n- Why has women's labor force participation increased over time?\n- How did progressive era reforms try to reduce the burdens on the industrial era?\n\n- What happened during the Depression and World War II with women's labor force\nparticipation\n-\nHow did New Deal programs treat women and why?\n-\nWhy different kinds of \"social citizenship\" for men and women, and how were these\ndifferent versions realized in policy?\n-\nHow did the government facilitate women's employment during WWII, and how did\nit also emphasize that such employment would be temporary?\n-\nDuring the 1950s, many women working despite stereotypes of that era. In what\nways does policy enable and undermine women's status? What was the role of\nwomen in the union movement?\n-\nWhat policies during the 1960s and 1970s improved women's status, and what was\nthe impetus behind these changes?\n- What about private employers and women? What kinds of benefits and protections have\nwomen secured in the private realm?\n- With the 1993 Family and Medical Leave Act, why was the push for gender neutral\nlegislation? What are the advantages and limitations of the legislation?\n- What are some of the barriers to adopting the kinds of family-oriented policies that are\ncommon in European countries?\n- Bringing these questions closer to home: what can universities do to increase the number\nof tenured women faculty? Is it best to treat women the same as men or differently?\nWhat are the pros and cons of each approach?\n\nEducation Policy: Vouchers\n- Some preliminaries:\n-\nWhy do countries fund public education?\n-\nIn what ways is education policy similar to or different from other policies we've\nstudied this semester in terms of target population, universality, level of government,\ninequalities\n- A major concern with education is that student achievement is not as high as we'd like it.\nWhat are the factors that go into student achievement? Which of these is amenable to\npublic policy solutions?\n- According to Chubb and Moe, what is wrong with public schools' organization? (too\nbureaucratic; top-down control; reliance on rules and regulations; unions\n- What is their vision? Market rather than democratic/bureaucratic control\n-\nPrivate schools are subject to indirect control through markets - what are the\nmechanisms?\n- What kinds of reforms have been tried traditionally in public schools, and why have they\nfailed in these authors' eyes?\n- What kinds of innovative reforms have been tried, and why have these fallen short?\n- How do vouchers work, and how would they fulfill the authors' vision?\n- The market - vouchers - is supposed to take the politics out of education. Is that likely?\nPossible?\n- Do private schools produce superior results in student achievement? Do Howell and\nPeterson find that test scores are higher for voucher students in private school? If they\n\nonly find differential results for one group of students - African Americans - in one city,\nwhat does that say about the effects of vouchers and private schools?\n- How do they explain differential results across cities? What other factors would you like\nto see measured in their study?\n\nEducation Policy: Federal College Loans\n- Before there was federal financial aid for college - before 1965 - who went to college,\nand how did they pay for it? What were the consequences for inequality?\n- When federal aid began, to whom was it directed? (usually specific groups as with GI\nBill)\n- When was the first generally available federal aid, and what was the rationale? (defense/\nCold War)\n- Why was there such large growth in federal college aid from the late 1960s through early\n1970s?\n- Why does the emphasis change from the poor to the middle class during the 1970s?\n- Why was there a shift from grants to loans, and what were the consequences?\n- Then during 1990s, shift to tax favored education savings plans and tuition tax credits.\nWhy did that become the mode of federal education aid, and what are the consequences\nin terms of access across income groups, etc.?\n- What are the consequences of many colleges and universities giving merit rather than\nneed-based aid?\n- Are state schools the solution when privates become too expensive? What happens with\nstate school tuitions over time?\n- What are the consequences of indebtedness of college grads? Does it affect people's\neducation plans or career choices? How could we design a study to measure that?\n\nConclusion: The Future of American Social Policy\n- Between 1789 and 1934, the size and scope of government was far smaller than it is now.\nMany fewer policy responsibilities, much lower revenues\n- This begins to change in late 19th century - Civil War and mothers' pensions, for\nexample.\n- Then a second era, from 1935 to 1975, the high watermark of government involvement in\npeople's lives. Not just distributive policy but redistributive policy aimed at helping the\npoor, and regulatory policy as well.\n-\ngovt programs touch far more lives than ever before\n-\nmore systematic and routinized - less particularistic and local\n-\nmany more categories of people eligible for govt programs\n-\nThe golden era of big government (some think that's a good thing, some think it's\na bad thing).\n-\nEasy to see role of government in one's life\n-\nEasily half of Americans could see tangible effect\n-\nMettler says \"American governance proved highly redistributive, shifting\nresources toward middle-class and working-class citizens\" and that gap between\nrich and poor smallest of any point in 20th century\no What are all the causes of this shrinking gap?\nDirect govt transfers\n\n- Like means tested and SS, which both redistribute\nIndirect Govt effects on incomes\n- Labor organizing increases incomes\n- Human capital programs, like Education benes (GI Bill,\ngrants, loans) allows poor and mc to earn more, shrinking\ngap\n- Third era: 1975 - on\n-\nPeople treated in different ways depending on their age, employment status, and\nincome\n-\ncontinuation of some benefits, esp for elderly\n-\nshrinking of many govt programs, esp for nonelderly working aged people and the\npoor\n-\ngrowth of hidden welfare benefiting mostly high income\n-\nConsequences of these changes?\n-\non what basis does one get govt benefits?\no Being old\no Being more affluent\no Being a taxpayer\no Less and less:\nBeing a veteran\nBeing a working aged person, esp working class\nBeing poor (except Medicaid if a poor child and EITC, if a\ntaxpaying poor person)\no Not at all:\nBeing a mother (no more mothers' pensions)\n(although do have child and child care benes through tax system;\nsurvivors' benes through SS)\n-\nSo less and less about non-market identities and more on the basis of your market\nidentity (as affluent or taxpayer).\n-\nWhat does this mean for attitudes toward government?\no people less likely to think govt does stuff for them\no hostility to govt\no less trust in govt\n-\nWhat does this mean for political participation?\no resource effect: diminishing govt programs means diminishing resource\nfor participation\no engagement effect: less likely to think govt relevant to your life\no mobilization effect: less identity as recipient of govt program, so less\nlikely to be basis for mobilization\no AND distributional effect: many govt programs had disproportionate\neffects on low-income people. As those wither , likely that political\ninequality will be worse in the future.\no AND generational effect:\nWWII generation: high mark of govt largesse b/c of war then the\nexperience of the 1940s through 1970s.\nSubsequent generations: govt does much less\n\n-\nWhat does it mean for individual people?\no face more risk as individuals (Hacker article)\no financial insecurity\no because less pooling of risk through govt programs\no the pooling of risk that happens through private employers increasingly\nreserved for higher income people\n-\nCould have political consequences: economy supposedly in good shape, but\npeople don't feel it\no Ask students: is the economy in good shape right now or bad shape?\no State of the stock market? Great - last two quarters huge gains. Dow at all\ntime high\no Do you think avg American feels that? No: ironically, consumer\nconfidence very low\n- So social policy is enormous consequential, affecting not only individuals' well-\nbeing, but also through its effects on attitudes toward government and political\nparticipation, the very health of American democracy"
    },
    {
      "category": "Resource",
      "title": "2_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-317-u-s-social-policy-spring-2006/5af2f7d7a10440b40ceda8c1d987daf0_2_3.pdf",
      "content": "Discussion Questions for 17.317, U.S. Social Policy\n\nPart I: American Exceptionalism and a Case: Why No National Health Insurance in the\nUnited States?\n- This section of the course uses a case study of national health insurance in the U.S. as a\nway to introduce the policymaking process in the United States and some of the major\nexplanations for policy outcomes\n\nU.S. Health Policy\n- What are some of the main explanations for the lack of universal health insurance in the\nUS? For the failure of the Clinton health care reform effort of 1993-1994?\n- What are \"cultural\" explanations? What are \"interest\" explanations? What are\n\"institutional\" explanations? What kind of evidence would proponents of one or the\nother put forth?\n- How would you describe the American political culture? What kind of evidence do we\nhave about what the American political culture is? What are the implications for\npolicymaking? What are the shortcomings of cultural arguments as an explanation for\npolicy outcomes - how well do cultural arguments explain cross-national variation?\nTemporal variation?\n- Similarly, how would you describe the institutional set up of American government, and\nwhat are its implications for policymaking? What are the advantages and disadvantages\nof institutional arguments?\n- What are \"interest\" explanations? What interests are we talking about, and why are they\ninfluential? What advantages does this kind of argument have over cultural arguments?\nWhere does this argument fall down?\n- When have the major pushes for national health insurance taken place in the U.S.? How\nwould each of the theories outlined above explain why NHI failed to achieve passage\neach time?\n- What is the state of public opinion around health care? How has it changed, or not, over\ntime? If you were a policymaker, what message would you take from the survey results\nlisted in the Blendon and Benson article?\n- If many Americans say they want universal health insurance (UHI) - as has often been\nthe case in surveys - what does the fact that UHI has repeatedly failed in the US say\nabout the place of public opinion in policymaking? Or about the characteristics of public\nopinion - are those surveys meaningful?"
    },
    {
      "category": "Resource",
      "title": "4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-317-u-s-social-policy-spring-2006/16cd06e59a674e18f380267a7cedbf3c_4.pdf",
      "content": "Discussion Questions for 17.317, U.S. Social Policy\n\nPart II: Preferences, Participation, and Representation\n- This section of the course focuses on the mass public - what does the public want, who\nparticipates in politics, and whose preferences get expressed in public policy. We begin\nby looking at political participation, which is a key way in which citizens voice their\npreferences.\n\nWho Participates?\n- How can an ordinary citizen participate in politics in the US? What are the modes of\nparticipation? Are these similar to or different from other countries?\n- What are the ways in which we can differentiate among these activities?\no some hard, others easy (require more or less inputs)\no some convey more info to policymakers than others\no some more unequal than others\n- If you were an interest group official who wanted to influence policy, which acts would\nyou urge your membership to take part in?\n- Which political acts are the most and least unequal? Why?\n- Protests: are they a \"weapon of the weak\"? Why do affluent engage in disproportionate\nshare of protests?\n- What are the factors in participation? What explains why some people participate more\nthan others?\n- How much do the factors vary across individuals?\n- Where do these factors come from?\n- What is the relevance of education for participation? What are the differences between\nabsolute and relative levels of education?\n- What is the relevance of income for participation? Of free time?\n- What is the relevance of skills, and where can they be gained?\n- What are the sources of political interest, information, and efficacy?\n- What entities mobilize people to politics? How does mobilization vary over time?\n- Compare churches and unions as mobilizing entities\n- How can we explain the low participation rates of the young? The high participation rates\nof the old? Differences by gender and race?\n- What kinds of reforms aimed at increasing participation does this model suggest?\n- Would full participation matter for policy outcomes? How and why?\n- What are the ramifications of political inequality for social policy outcomes?"
    },
    {
      "category": "Resource",
      "title": "5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-317-u-s-social-policy-spring-2006/674eaed0efcfb1160ff9a9ea325a527a_5.pdf",
      "content": "Discussion Questions for 17.317, U.S. Social Policy\n\nPart II: Preferences, Participation, and Representation\n- This section of the course focuses on the mass public - what does the public want, who\nparticipates in politics, and whose preferences get expressed in public policy. We begin\nby looking at political participation, which is a key way in which citizens voice their\npreferences.\n\nWho Gets Represented? The Case of Social Security\n- Senior citizens have low levels of formal education and income - how can they be so\nparticipatory?\n- Old people didn't used to be so participatory - used to be age group least likely to\nparticipate - so what changed?\n- How has Social Security affected the participation rates of senior citizens over time?\nWhat are the mechanisms? What have been the program's effects on resources, political\nengagement, mobilization opportunities?\n- How have these program effects varied across senior subgroups?\n- Seniors participate in politics at higher rates than younger people - does it matter? How\nwould we know?\n- At the same time, there has not been backlash against senior citizens - why not?"
    },
    {
      "category": "Resource",
      "title": "6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-317-u-s-social-policy-spring-2006/8f4ceb47dbe4652dc5e2322595d71cc6_6.pdf",
      "content": "Discussion Questions for 17.317, U.S. Social Policy\n\nPart II: Preferences, Participation, and Representation\n- This section of the course focuses on the mass public - what does the public want, who\nparticipates in politics, and whose preferences get expressed in public policy. We begin\nby looking at political participation, which is a key way in which citizens voice their\npreferences.\n\nWho Gets Represented? The Case of Tax Cuts and Other Policies\n- Introductory questions: Did people want the Bush tax cuts? If not, why did we get them?\nHow do preferences enter pol system, and whose preferences are expressed?\n- Gilens paper:\no Most examinations of relationship between public preferences and public policy\nfind close relationship, esp. on salient issues. But whose preferences get\nrepresented most?\no He collects public opinion polls between 1992 and 1998 and sees whether the\nproposed change is enacted\no Much of the time there is no change - where does this status quo bias come from?\no He finds that the affluent are much more likely to have their preferences fulfilled\nthan the poor. Why would that be? Does it matter? On what issues is this the\ncase, and what are the ramifications?\no Long-time argument in political science that politicians have an incentive to move\nto the middle, to the median voter, to the person at the 50th percentile. What is the\nmedian voter model, and why would politicians have an incentive not to stray too\nfar from the median voter's preferences?\no And why does the median voter model seem to fail here?\n- What the Hacker/Pierson explanations for the ability of politicians to stray from the\nmedian voter without penalty?\no What are the design features of the Bush tax cuts which these authors say helped\nsecure middle class support? What are the future political and economic\nconsequences of these features?\n- On what kinds of policies do you think the public is the most manipulable?"
    },
    {
      "category": "Resource",
      "title": "7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-317-u-s-social-policy-spring-2006/41f3a67a3850c745c3e65e8e450cacf7_7.pdf",
      "content": "Discussion Questions for 17.317, U.S. Social Policy\n\nPart II: Preferences, Participation, and Representation\n- This section of the course focuses on the mass public - what does the public want, who\nparticipates in politics, and whose preferences get expressed in public policy. We begin\nby looking at political participation, which is a key way in which citizens voice their\npreferences.\n\nInterest Groups I\n- What are interest groups? What different kinds of interest groups are there? What is\ntheir role in the policymaking process?\n- What is a subgovernment? What is an issue network? How have political scientists'\nviews of policymaking and the nature of influence changed over time?\n- What factors in the political system changed over time to open up the older policy\nsubsystems?\n- What is the collective action problem in Olson's view? What kinds of groups are subject\nto free rider problems? What are collective goods? How can groups overcome the free\nrider problem?\n- How does Skocpol characterize changes in the nature of citizen interest groups over\ntime? What are the characteristics of old-style membership associations - what groups\nare we talking about, how were they organized, what kinds of activities did they engage\nin, how did they overcome free rider problems, in what ways were their memberships\ndiverse (and not diverse)?\n- What about membership associations now? How do they differ from the old-style\ngroups? What changed in American society and politics that caused these new types orf\norganizations to emerge? What is the nature of their organization, relationships with\nmembers? What are the implications for political mobilization and policymaking of the\nways in which membership associations have changed? In what ways are the new groups\ndiverse (and not diverse)?\n- What are the implications for political participation and representation?"
    },
    {
      "category": "Resource",
      "title": "8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-317-u-s-social-policy-spring-2006/e9aab26c94af24a9c1024e1654003eb6_8.pdf",
      "content": "Discussion Questions for 17.317, U.S. Social Policy\n\nPart II: Preferences, Participation, and Representation\n- This section of the course focuses on the mass public - what does the public want, who\nparticipates in politics, and whose preferences get expressed in public policy. We begin\nby looking at political participation, which is a key way in which citizens voice their\npreferences.\n\nInterest Groups II: Business and Labor\n- The discussion last time focused on interest groups in general. This session is on two\ntypes of interest groups that have some of the biggest impacts on social policy: business\nand labor.\n- Labor unions: What is their function? What has been the trend in labor unions over\ntime? How do they try to influence policy outcomes?\n- What are the implications for politics of the decline of unions? What other entities\nmobilize working class people?\n- Why are unionization rates higher in other countries? What would cultural or\ninstitutional arguments look like? How does the legal status of unions differ? What is the\nrole of American federalism is shaping the possibilities for the union movement?\n- What are the pros and cons for unions of working mainly through the Democratic party?\nWhat are the implications of \"capture\" by one party? How contrast unions' situation with\nthat of senior citizens, a group in play for both parties?\n- What about the political preferences of individual union members?\n- What are some of the advantages and disadvantages business has as an interest group?\n- What are the major business organizations? How do the preferences of large and small\nbusiness differ?\n- What was the role of business interests in the Clinton health care reform effort of 1993/94\n- Interest group wrap-up: how do interest groups operate in the American policymaking\nsystem? What are their sources of influence and power? What are challenges that interest\ngroups can face as actors trying to influence policy outcomes?"
    },
    {
      "category": "Resource",
      "title": "9_10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-317-u-s-social-policy-spring-2006/9c96ee523df1e8300eb2f2b71b33bcdf_9_10.pdf",
      "content": "Discussion Questions for 17.317, U.S. Social Policy\n\nPart II: Preferences, Participation, and Representation\n- This section of the course focuses on the mass public - what does the public want, who\nparticipates in politics, and whose preferences get expressed in public policy. We begin\nby looking at political participation, which is a key way in which citizens voice their\npreferences.\n\nPublic Opinion and Preference Formation: The Case of Universal vs. Targeted Programs\n- Describe the two major views of the nature of public opinion - that the public doesn't\nknow much about politics at all, and alternatively that the public knows enough to be\nmeaningful democratic actors. What kinds of evidence to those who hold each view\npresent?\n- How does knowledge about specific policy areas compare to general political\nknowledge? Do those who know a lot about the political system generally know about\npolicy areas as well?\n- How does knowledge/ignorance vary across issue areas? Why? Why might people know\nabout the deficit and unemployment but not about the environment or foreign aid? What\nare the roles played by the media, personal experience, elite cues?\n- What are the factors that lead someone to have high levels of general political\nknowledge? Policy-specific knowledge?\n- What experiments does Gilens perform? Does having correct political information about\na policy area lead to different opinions? What about among those with a lot of general\npolitical information to begin with?\n- What view of public opinion do Page and Shapiro express? Why might aggregate public\nopinion appear more rational and coherent than individuals' opinions? Given how little\npeople know about politics, how can this be the case?\n- Now we turn to public opinion about social policy, about universal vs. targeted programs\nspecifically\n- Regarding the Gilens book chapter:\n-\nWhy are economic rights more controversial in the U.S. than civil rights?\n-\nWhy did Gilens analyze photographs in poverty-related stories in newsmagazines\nrather than the stories themselves?\n-\nWhat is the relationship between media coverage of poverty and the racial\nportrayal of poverty and the actual racial composition of the poor? How does this\nvary over time? When does poverty coverage get racialized?\n-\nWhat is the effect of media coverage on attitudes toward welfare?\n- Regarding the Cook and Barrett book chapter:\n-\nWhat programs are most and least supported by the public?\n-\nWhat is the role of notions of \"deservingness\"?\n-\nWhat is the role of different target populations or different kinds of programs\n(giving cash vs. in-kind goods) on public opinion toward programs?\n-\nWhat about opinion among Congressmen - how does it different from that of the\npublic, and why?"
    },
    {
      "category": "Resource",
      "title": "11.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-317-u-s-social-policy-spring-2006/63e87c65180a97312a2b8d64af243e4d_11.pdf",
      "content": "Discussion Questions for 17.317, U.S. Social Policy\n\nPart III: The Policymaking-Process\n- This portion of the course examines how issues come on the political agenda and how\nseveral of the main policymaking institutions - Congress and the Courts in particular -\nfunction.\n\nProblem Definition and Agenda Setting: The Case of Medicare Prescription Drug\nCoverage\n- There are a lot of conditions out there - how does a condition become perceived a\nproblem? Why do some problems come to public attention? What role can indicators,\nfocusing events, program oversight play? And why would a chronic, ongoing condition\nrise onto the public agenda? Why do problems fade from the public agenda?\n- How does politics shape agendas? How do changes in political conditions affect what\nissues arise on the agenda? What role can be played by elections, the public mood,\ninterest groups?\n- Who devises policy alternatives?\n- The policy stream: when do alternatives arise? What does Kingdon mean by the \"policy\nprimeval soup,\" \"softening up periods,\" and \"pet solutions\"? How is the political history\nof Social Security privatization since the 1980s an example of these concepts?\n- What happens when a window of opportunity opens up? What happens when only two\nof the three streams (problems, policies, politics) come together? Who or what opens\nwindows? What roles can political entrepreneurs play?\n- Consider the case of prescription drug coverage for senior citizens\n-\nWhat was the condition?\n-\nHow did this condition become a problem\n-\nWhat policy alternatives were out there?\n-\nHow did Republicans, who held Congress and the Presidency, craft a solution?\nWhat were their ultimate goals?\n-\nWhat was the roles various interest groups played? Which groups were most\ninfluential?\n-\nWhy did the drug program that was eventually passed have so many\nshortcomings? What were the political risks associated with drug program as\npassed? The potential political benefits?"
    },
    {
      "category": "Resource",
      "title": "12.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-317-u-s-social-policy-spring-2006/a7419a3ab4028a3c92477ca46b3506bd_12.pdf",
      "content": "Discussion Questions for 17.317, U.S. Social Policy\n\nPart III: The Policymaking-Process\n- This portion of the course examines how issues come on the political agenda and how\nseveral of the main policymaking institutions - Congress and the Courts in particular -\nfunction.\n\nProblem Definition and Agenda Setting II\n- Here we discuss another view of agenda setting, the Baumgartner and Jones book\n- What is a policy image? Can you think of examples? Who can influence the content of\npolicy images, or change images?\n- How does a condition become a problem in B+J's perspective? What are the roles played\nby problem definition and causal stories?\n- What is a policy venue? Why might policy advocates want to change a policy venue?\nWho would want to change a policy venue?\n- What is meant by the \"scope of conflict,\" and who would want to expand it?\n- Under what conditions is nonincremental policy change possible?\n- What is a Schattschneider mobilization? A Downsian mobilization?\n- What role do the media play?"
    }
  ]
}