{
  "course_name": "U.S. National Security Policy",
  "course_description": "This course provides a comprehensive introduction to the making of US foreign and national security policy. It examines the laws that guide policy-making, studies the actors and organizations involved in the inter-agency process, and explores how interaction between the executive, legislative, and judicial branches shapes policy development and implementation. Students acquire practical experience through policy writing and a crisis simulation. This course is designed for students interested in international relations, security, and public policy.",
  "topics": [
    "Social Science",
    "Political Science",
    "International Relations",
    "Public Administration",
    "Security Studies",
    "Social Science",
    "Political Science",
    "International Relations",
    "Public Administration",
    "Security Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Overview\n\nThis undergraduate lecture course provides a comprehensive introduction to the making of U.S. foreign and national security policy. Over the course of the semester, we will examine the laws that guide policymaking, study the actors and organizations involved in the interagency process, and develop a deeper understanding of how the interaction between the executive, legislative, and judicial branches shapes policy development and implementation. The course draws heavily from theories of international relations and security studies. To more deeply explore how the policymaking process plays out, most classes will feature a historical or contemporary case study.\n\nThroughout the semester, students will read primary source documents and analysis written by political\n\nscientists, historians, and policymakers; engage with course materials during class discussions; and acquire hands-on experience in national security policymaking and analysis through writing and a multi-day crisis simulation.\n\nThe seminar is designed for undergraduate students interested in international relations, security studies, and public policy, although no background knowledge in political science is required.\n\nCourse Policies\n\nMutual Respect\n\nAlthough opinions on the topics covered in the course may differ, mutual respect is critical to a successful seminar. Students are expected to arrive to class on time, actively listen to their classmates, and critically (but respectfully) engage with their classmates, instructor, and the assigned readings.\n\nAcademic Integrity\n\nAll students will uphold the highest standards of academic integrity. Presenting the work of others (e.g., ideas, specific phrases, etc.) as your own is considered plagiarism, and will not be tolerated. Moreover, the use of any generative AI is not permitted in this course. Any violations will be handled according to MIT policies, which are outlined at\nAcademic Integrity at MIT: A Handbook for Students\n. The\nMIT Writing and Communication Center\nwebsite has helpful tips on how to avoid plagiarism.\n\nWriting\n\nThe\nMIT Writing and Communication Center\noffers free one-on-one professional advice from communication experts. No matter what department or discipline you are in, the WCC helps you think more deeply into your topic, and helps you see new implications in your data, research, and ideas. The WCC also helps with non-native speaker issues, from writing and grammar to pronunciation and conversation practice.\n\nReadings\n\nOne book is required for this course.\n\nRoger Z. George and Harvey Rishikof, editors,\nThe National Security Enterprise: Navigating the Labyrinth\n, 2nd edition (Washington, D.C.: Georgetown University Press, 2017). ISBN: 9781626164406. [Preview with\nGoogle Books\n]\n\nFor other readings, see the\nReadings\nsection.\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation\n\nAttendance is mandatory. Participation will be evaluated based on attendance and contributions during class discussions and the simulation. (Note: quality is more important than quantity.) The most successful students will attend all classes, demonstrate comprehension of all readings, raise thought-provoking critiques of assigned material, and introduce ideas or arguments that build upon the assigned readings.\n\n25%\n\nQuizzes\n\nTwo short, closed-book quizzes will test students on materials covered in lecture and reading.\n\n10%\n\nWriting Assignments\n\nPolicy Memo [10%]\n\nIn-Class Midterm [20%]\n\nShort Form Analytic Article [35%]\n\nFor further detail on the writing assignments, see the\nAssignments\nsection.\n\n65%",
  "files": [
    {
      "category": "Resource",
      "title": "17.46 Readings: The Road to Crisis",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-46-u-s-national-security-policy-fall-2023/mit17_46_f23_crisis.pdf",
      "content": "The Road to Crisis\nAll events from December 2023 and onward are fictional and for educational purposes only.\nDuring a press conference in mid-December 2023, President Biden announced plans to provide Taiwan with\nadditional Patriot air defense systems, two-dozen new F-16 fighter jets, eight surplus P-3 maritime patrol\naircraft, and five destroyers equipped with Aegis Combat Systems. Biden explained that the arms deal--one of\nthe largest in Taiwan's history--was intended to bolster Taiwan's ability to defend itself and its democratic way\nof life. In response to questions from reporters, President Biden also reiterated a pledge that he had made in\nearly December: \"If China attacks Taiwan, the United States will take steps to defend Taiwan.\"\nChina's Foreign Minister Wang Yi issued an official statement criticizing the arms deal and accused the United\nStates of \"meddling in regional affairs\" and \"dangerously and unnecessarily escalating tensions.\"\nIn the days following Biden's press conference, the People's Liberation Army (PLA) significantly increased\nmilitary flights through Taiwan's Air Defense Identification Zone. In a 72-hour period from December 20\nDecember 23, the PLA Air Force (PLAAF) and PLA Navy (PLAN) flew more than 180 aircraft in the airspace\nsurrounding Taiwan. Taiwan's government responded by scrambling fighter jets to intercept many of these\nPLAAF and PLAN aircraft.\nOn December 24, a PLAAF J-11 fighter jet collided with a Taiwan Air Force F-16 fighter jet, leading to the\ndeaths of both pilots. The domestic public in China takes to the streets demanding harsh action against Taiwan\nto avenge the death of the PLAAF pilot.\nPresident Biden and Secretary of State Blinken urge calm, but also warn China--both privately and publicly--\nto not attempt to forcefully change the status of Taiwan.\nOn December 25, Christmas celebrations in the Taiwanese cities of Taipei and Kaoshiung are interrupted by\nextensive blackouts. More than six million people are left without power, and 279 Taiwanese citizens die as a\nresult of the power outages (e.g., life support failures, etc.).\nRecorded Futures, the Somerville, Massachusetts-based company that identified the Chinese malware behind\npower outages that plagued Indian cities during the Sino-Indian conflict of 2020, make a similar discovery in\nthis case: the Taiwan backouts are almost certainly triggered by Chinese malware. The discovery was made\npossible by advances in machine learning that allowed Recorded Futures to find common patterns between the\ntimings of sequential cyber-intrusion attacks in India and Taiwan. Recorded Futures identified a record of\nattempts to connect to the same network infrastructure registered to Tsinghua University that was implicated\nin the Indian outages. In the China-India incident, analysts believed China was signaling its ability to cause\nsignificant damage if India escalated the border conflict. The U.S. intelligence community has yet to confirm\nthat the blackout is the result of a Chinese cyberattack, and some AI/ML scholars have raised doubts about\nthe accuracy of the Recorded Futures machine learning algorithms.\nPresident Biden schedules an emergency National Security Council Principals Committee meeting for this\nafternoon. You've been called into the office to help your organization prepare for this meeting. You open\nyour email to find President Biden's strategic objectives for dealing with the crisis:\n1. Maintain status quo (i.e., no change to the status of Taiwan).\n2. Protect U.S. citizens and interests in the People's Republic of China (PRC) and Taiwan.\n3. Prevent further escalation between the PRC and Taiwan; deter PRC aggression.\n4. Should the PRC and Taiwan escalate, minimize direct U.S. combat involvement in conflict.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n17.46 U.S. National Security Policy\nFall 2023\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}