{
  "course_name": "Undergraduate Thesis for Course 2-A",
  "course_description": "This course is taken by mechanical engineering majors during their senior year to prepare a detailed thesis proposal under the guidance of staff from the Writing Program. The thesis proposal must bear the endorsement of the thesis supervisor and indicate the number of units planned.\nThis course is offered during the Independent Activities Period (IAP), which is a special 4-week term at MIT that runs from the first week of January until the end of the month.",
  "topics": [
    "Engineering",
    "Mechanical Engineering",
    "Humanities",
    "Literature",
    "Academic Writing",
    "Engineering",
    "Mechanical Engineering",
    "Humanities",
    "Literature",
    "Academic Writing"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 7 sessions for 4 weeks, 2 hours / session\n\nSubject Description\n\n2.ThA focuses on the communication problems encountered in researching and writing a thesis. The class is designed to be 1/3 thesis writers anonymous, 1/3 writing and speaking skills, and 1/3 project organization skills. The writing and speaking assignments culminate in a thesis proposal and an oral presentation.\n\nText and Other Instructional Materials\n\nNo textbook is required; all materials are handed out in class.\n\nTeaching Approach\n\n2.ThA is based on the following premises:\n\nWriting a thesis is a process that requires continual, focused effort.\n\nWriting, presentation, and research reinforce each other and all contribute to excellence in the final product.\n\nWriting and presentations improve with practice; feedback produces better writing and presentations. As a corollary, \"practice\" at thesis writing is difficult to obtain because an individual only writes a few theses, thus the increased need to learn from the experience of others.\n\nGrading\n\nClass attendance and participation lead directly to success in 2.ThA; be sure to attend the classes. Students who miss more than one of the required class sessions will require an excused absence from the dean's office to pass. (Class meets but 7 times.)\n\nGrading is digital. Come to class; write a proposal in a series of drafts; prepare and deliver a series of oral presentations; live long and prosper.\n\nTerm Schedule and Assignments\n\nThis class meets six times as shown below. Deliverables culminate in a written thesis proposal and an oral presentation based on the proposal. The proposal and an appropriately signed cover sheet must be turned in to the 2.ThA instructor. Finally, students are expected to fill out a pair of end-of-term evaluations, one MIT form and one 2.ThA-specific form.\n\n2.ThA Deliverables Timeline (\nPDF\n)\n\nSES #\n\nTOPICS\n\nIntroductions\n\nProposal Specific Writing Issues\n\nIntroduction to Information Sources\n\nProgress Reports\n\nFollow up on Information Sources\n\nInformation Sources \"Hands-on\" Exercise\n\nGraphics\n\nProposal Workshop\n\nGraphics Show and Tell\n\nAbout Oral Presentations\n\nShorter, Less Formal Presentations\n\nReview of Presentations\n\nPossible Additional Topic(s)\n\nWorkshop II\n\n6-7\n\nLonger, More Formal Presentations\n\nSubject Evaluation Forms",
  "files": []
}