{
  "course_name": "Undergraduate Seminar in Discrete Mathematics",
  "course_description": "No description found.",
  "topics": [
    "Mathematics",
    "Algebra and Number Theory",
    "Applied Mathematics",
    "Discrete Mathematics",
    "Mathematics",
    "Algebra and Number Theory",
    "Applied Mathematics",
    "Discrete Mathematics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\n18.310 Principles of Discrete Applied Mathematics\nor\n6.042J / 18.062J Mathematics for Computer Science\n;\n18.06 Linear Algebra\n,\n18.700 Linear Algebra\n, or\n18.701 Algebra I\n; or permission of instructor.\n\nDescription\n\nThis course is a student-presented seminar in combinatorics, graph theory, and discrete mathematics in general. Instruction and practice in written and oral communication is emphasized, with participants reading and presenting papers from recent mathematics literature and writing a final paper in a related topic.\n\nThis course fulfills the Communication Intensive in the Major Requirement\n\nTextbook\n\nMost student lectures will be given from this textbook:\n\nAigner, Martin, Gunter M. Ziegler, and Karl Heinrich Hofmann.\nProofs from THE BOOK\n. Springer, 2014. ISBN: 9783662442043. [Preview with\nGoogle Books\n]\n\nStudents may give other lectures, pending instructor approval.\n\nRequirements\n\nEach student in the course is expected to do the following:\n\nGive three 35 minute lectures.\n\nWrite a short paper on an assigned topic. This will be a 2 to 4 page paper which will be assigned in the beginning of the term.\n\nWrite a final paper on the topic of the last talk. This will include handing in a paper outline, a first draft, a second draft (if necessary) and a final draft. Papers must be written in LaTeX.\n\nAttend all the meetings and give feedback on other students' talks. Students who miss more than one meeting will be required to write a short paper describing the lectures given there.\n\nThere is no final exam.\n\nResources\n\nIn additional to the assistance you will receive from your peers and instructor, help with presenting and writing is available from the department's mathematical communication specialist. A lecturer in\nWriting, Rhetoric, and Professional Communication\nis also available to help you. General help with writing and presenting (not specific to mathematics) is available from\nMIT's Writing Center\n. [\nNote\n: Not available to OCW users.]\n\nSchedule\n\nSES #\n\nACTIVITIES & KEY DATES\n\nIntroduction, Lectures by instructor\n\nStudent lectures start\n\nShort paper due\n\nFinal paper proposal due\n\nFinal paper outline due & Very short paper due\n\nFinal paper first draft due\n\nFinal paper second draft due\n\nFinal paper due\n\nGrading\n\nEach talk will be worth 15%; 7% for the depth and correctness of the mathematics, 7% for communication, and 1% for the audience's performance in the quiz. Any points lost on communication may be regained in subsequent lectures by improving the relevant issues.\n\nThe short paper will be worth 7%.\n\nThe very short paper will be worth 3%.\n\nThe final paper will be worth 25%.\n\nParticipation will count for 20%. Half of these points will be given for correctly solving the quizzes at the ends of the lectures, and half for giving helpful feedback to the speaker.\n\nCollaboration\n\nCollaboration on preparing lectures is encouraged, as is the reading and deciphering of material. However, papers have to be written individually. Students are strongly discouraged to commit plagiarism. It is forbidden to copy any complete sentence from another source, including work submitted in past years or other courses. It is furthermore not acceptable to copy a proof, rewriting each line. A good strategy for writing a proof that appears elsewhere is to read and understand the source, and then write it from scratch the next day.\n\nSome guidelines of what is and isn't allowed are available from\nMath Comm\n, including\nsome examples\n.",
  "files": [
    {
      "category": "Exam",
      "title": "Undergraduate Seminar in Discrete Mathematics, Making Money from Fair Games: Examining the Borel-Cantelli Lemma",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-304-undergraduate-seminar-in-discrete-mathematics-spring-2015/2dc1c9e37d402c000b628ee85e2228d1_MIT18_304S15_project2.pdf",
      "content": "MAKING MONEY FROM FAIR GAMES:\nEXAMINING THE BOREL-CANTELLI LEMMA\nSAM CANNON\nAbstract. In this paper we discuss and prove the Borel-Cantelli\nLemma. We then show two interesting applications of the Borel-\nCantelli Lemma. These include a method by which one can profit\nfrom a series of games that individually have an expected value of\nzero, defying intuition regarding linearity of expectation, as well\nas displaying that a sequence of 100100 straight coin flips of heads\nwill occur with probability one if one flips a fair coin into infinity.\n1. Introduction\nConsider an infinite sequence of games, where in game n one loses 2n\ndollars with probability\nand win a dollar with probability\n2n .\n2n+1\n2n+1\nEven though the expected value is 0, for all n, if we sum over n the\nprobability that a person will lose in game n, we will find the total\nnumber of expected losses. For example, if we take the integral from 0\nto infinity for\ndn, we will find that\n2n+1\ninf\ninf\nlog(2n + 1)\ndn = n -\n\n2n + 1\nlog 2\nlog(2inf + 1)\nlog(20 + 1)\n= inf-\n- 0 +\nlog 2\nlog 2\nlog 2\n= inf - inf - 0 + log 2\n= 1.\nWe expect to lose a single time, even though we play into infinity and\nthere always exists a non-zero probability of losing. We will explore\nthis concept further by proving and utilizing the Borel-Cantelli Lemma,\nwhich states that if the sum of the individual probabilities for an infinite\nnumber of events is not infinite, then the number of events occurring\nas time goes to infinity is finite. For this paper, we mainly source the\nlecture notes of various university mathematics classes.\nDate: May 4, 2015.\n\n2. Borel-Cantelli\nThe Borel-Cantelli Lemma states that if the sum of the probabilities\nof the events An is finite, then the set of all events that occur will also\nbe finite. Note that no assumption of independence is required.\nConversely, the Borel-Cantelli Lemma can be used to show that if\nthe sum of the probabilities of the independent events An is infinite,\nthen the set of all events that will occur that are repeated infinitely\nmany times must occur with probability one. That is, one will achieve\nan infinite number of these events as n moves to infinity. It is impor\ntant to recognize that this converse Lemma requires an assumption of\nindependence.\nFirst, we will prove the finite case, where events only occur a finite\nnumber of times, even as n moves towards infinity. We use the notation\ni.o. to represent \"infinitely often.\"\nIt is also important to understand the concepts of the limit superior\nand the limit inferior. The limit inferior and limit superior of a sequence\ncan be thought of as the limiting bounds of that sequence, typically as\nthat sequence is taken to infinity. The limit inferior is the lower bound\nas the sequence trends to infinity, and the limit superior is the upper\nbound. For example, the limit superior of f(x) = sin(x) as x → inf is\n1, while the limit inferior is -1. For our notation, we will refer to the\nlimit superior as lim sup and the limit inferior as lim inf .\nWe will prove this by showing that the probability of an event oc\ncurring infinite times as n trends to infinity is zero given the initial\nstatement that the sum of the probabilities converges as n goes to in\nfinity, meaning that the sum of the probabilities for discrete events in\nthe sequence of events is less than infinity. If the probability of an event\noccurring ever goes to zero as n increases towards infinity, then we have\nshown that the number of times this event can happen is finite.\nLemma 2.1. Let An be a sequence of events, where an individual event\noccurs at time n with probability P (An). If the sum of the probabilities\nainf\nof An is finite, such that\nn=1 P (An) < inf, then the probability that\ninfinitely many of these events occur is 0. That is, P (lim sup An) = 0.\nn→inf\nProof. Our goal is to prove that if\ninf\nP (An) < inf,\nn=1\nthen\nP (Ani.o.) = 0.\n\nThis states that if the sum of the probabilities is less than infinity for\nan infinite sequence of events, then the number of events is guaranteed\nto be finite. In essence, we are proving that the probability of an event\nhappening infinitely often is zero.\nP (Ani.o.) = P (lim sup An)\nn→inf\n= lim P (∪inf\nk=nAk)\nn→inf\ninf\n≤ lim\nP (Ak).\nn→inf\nk=n\nThe final summation goes to 0 as n goes to infinity because we are\nworking under the assumption that the series converges. Therefore, if\nthe final term goes to zero, then\nP (Ani.o.) ≤ 0.\nand we have proven our Lemma, as the probability of the event hap\npening infinitely often is zero. Probabilities cannot be negative.\nD\nFor this lemma, the sequence of events does not have to be indepen\ndent, a useful fact.\nNow we will show the converse, namely that if the sum of the prob\nabilites of the independent events An is infinite, then the set of all\noutcomes that are repeated infintely many times must occur with prob\nability one. This Lemma differs from the previous in that it only holds\nfor an independent sequence of events.\nLemma 2.2. If the sum of the probabilities of an independent sequence\nainf\nof events An is infinite, such that\nn=1 P r(An) > inf, then the probabil\nity that infinitely many of them occur is 1. That is, P r(limn→infsup An) =\n1.\nProof. The Lemma states that if\ninf\nP (An) = inf,\nn=1\nthen the events will occur infinitely often as n goes to infinity, or\nP (Ani.o.) = 1.\nWe can use the complement of the probability that an event occurs\ninfinitely often, or\n1 - P (Ani.o.),\n\nto prove our Lemma, as well as the laws of independence, the limit infe\nrior of the sequence, and the intersection of all complementary events.\nWe are proving that the probability of an event happening only a finite\nnumber of times is zero. By proving this, we have proven our lemma\nthat an event occurs an infinite number of times as n goes to infinity.\nWe recognize that\n1 - P (Ani.o.) = P (Ani.o.)c\nAc\n= P (lim inf\n)\nn→inf\nn\n= lim P (∩k\ninf\n=nAk\nc ).\nn→inf\nwhere the c superscript represents the complementary probability.\nBecause the events are independent with respect to each other, we\ncan state that the complementary sequence of events are also indepen\ndent. Therefore, because joint probabilities are simply the product of\nindividual event probabilities, we see that for every n,\nP (∩inf Ak\nc ) = lim P (∩N Ac\nk)\nk=n\nk=n\nN→inf\nN\nN\n= lim\nP (Ac\nk)\nN→inf\nk=n\nN\nN\n= lim\n[1 - P (Ak)]\nN→inf\nk=n\nN\nN\n≤ lim\nexp[-P (Ak)]\nN→inf\nk=n\nN\n= lim exp[-\nP (Ak)]\nN→inf\nk=n\n= 0.\nWe know that the penultimate term is equal to 0 because the series\ndiverges, an assumption for this converse Lemma. The exponential\nfunction approaches 0 as the exponent approaches negative infinity,\nwhich the negative summation function does in the penultimate term.\nTherefore, the probability of an event occurring a finite number of\ntimes is zero and we have proven the converse Lemma for an indepen\ndent sequence of events.\nD\nThe result leads to an interesting corollary of these two Lemmas,\nsometimes known as the \"0-1\" law.\n\nCorollary 2.3. If {An}\nis a sequence of independent events in a\nn≥1\nprobability space, then either P (A(i.o.)) = 0, the E(N) < inf case, or\nP (A(i.o.)) = 1, the E(N) = inf case, where N denotes the total number\nof An to occur:\ninf\nN =\nIn\nn=1\nwhere In denotes the indicator random variable for the event An.\nIt is easy to see the reasoning for the name, \"0-1\" law. Either the sum\nof the probabilities associated with the sequence of events is infinite, or\nit is not. Either one can expect the number of times an event happens\nto be infinite as time goes to infinity, or one can expect it to be finite.\nThe outcome is binary; the probability of the event occurring into\ninfinity is either 0 or 1 depending on whether the probability function\nconverges or diverges towards infinity.\n3. Application of the Borel-Cantelli Lemma\nWe can apply the Borel-Cantelli Lemma to an interesting situation\nwhere one can expect to profit from a series of games that, individually,\nhave an expected value of 0. This should be counter-intuitive; because\nof linearity of expectation, the total expectancy of the series of games\nis still zero.\nTake, for example, an infinite sequence of games, where in game\nn one loses 2n dollars with probability\nand wins a dollar with\n2n+1\nprobability\n2n . This implies that one will lose a great deal of money\n2n+1\na little bit of the time, and win a little bit of money most of the time.\nWe can see that the expectation of any individual game is\n-2n\n2n\n+\n= 0.\n2n + 1\n2n + 1\nNo matter which game in the series that one is playing, the expected\nvalue will always be zero. This is where the Borel-Cantelli lemma makes\nthings interesting. We recognize that the expected number of losses is\nthe sum over n of the probability that an individual will lose in game\nn. We showed in the introduction that\ninf\ndn = 1.\n2n + 1\nThe function\nwill be positive and decreasing for any n, 0 ≤ n ≤\n2n+1\ninf. For this reason, the definite integral of the function between 0 and\ninfinity will be greater than the sum for every integer n between 1 and\ninfinity. Therefore,\n\ninf\nn=1\ninf\n≤\ndn ≤ 1 < inf\n2n + 1\n2n + 1\nand accordingly is finite. A numerical approximation of\ninf\n2n + 1\nn=1\nusing java yields a sum of approximately 0.764, which, as we expected,\nis less than 1.\nBecause the sum of the probabilities is finite, it follows that with\nprobability one the person will only lose a finite number of times, as\nshown by the Borel-Cantelli lemma. Therefore, the amount of money\nwon by the player goes to infinity, as they win infinite times and lose\nonly finite times! It is inconsequential that when the player loses, they\nlose a large amount, and that when they win they only win a small\namount.\nThe key to this type of situation is that the probability of losing\nmoney converges as n goes to infinity. In this case, the probability\nsummation of losing money converges, whereas if the denominator con\nsisted of the term n, such as the probability of a loss occurring with\np = n\n1 , then the probability summation does not converge as n goes to\ninfinity, and the player will face a series of games from which they will\nnot be able to profit.\ninf1 = inf\nn\nn=1\nAnd by the Borel-Cantelli lemma, losses will also occur an infinite\nnumber of times as one plays into infinity. Do not be duped into playing\na losing (or fair) game when the probability summation of losing does\nnot converge as n goes to infinity.\n4. Application of the Converse Borel-Cantelli Lemma\nWe can also use the converse Lemma for some nice applications. One\nsuch application involves the possibility of flipping 100100 heads in a\nrow with a fair coin. We want to calculate P(E), where E is defined as\nthe event that a run of 100100 heads, an extremely improbable event,\noccurs in an infinite sequence of independent coin tosses. Because En\nare independent events, we find that the probability of the sequence\noccurring in the nth block of 100100 coin tosses is\ninf\nP (En =\n> 0) ⇒\nP (En) = inf.\n(2100)100\nn=1\n\nBy the converse Borel-Cantelli Lemma, we recognize that if the sum\nof the probabilities of the event sequence is infinite, then\nP (E) = 1.\nTherefore, the probability that a run of 100100 heads occurs in an infi\nnite sequence of independent coin tosses is 1.\n5. Conclusion\nWe have proven the Borel-Cantelli Lemma, showing that if the sum\nof the probabilities of events is not infinite, as we sum over an infi\nnite number of events, then the expected number of times that the\nevent occurs is finite. We then proved the converse Lemma for an in\ndependent sequence of events. We have also displayed how these useful\nLemmas can apply to interesting situations, such as one where we can\nfind a strategy to profit from a series of zero expectation games, or\nrecognize that enough monkeys typing away at enough typewriters will\neventually produce Homer's Odyssey.\nReferences\n[1] Karl Sigman. Borel-Cantelli Lemmas. 2009. Columbia University.\n[2] H. Krieger. The Borel-Cantelli Lemmas. 2007. Claremont Graduate University.\n[3] M3/M4S3 Statistical Theory II. The Borel-Cantelli Lemma. Imperial College\nLondon.\n[4] Gunnar Englund & Timo Koski. Borel-Cantelli Lemmas and the Law of Large\nNumbers. 2008. KTH Royal Institute of Technology.\n[5] E. Borel. Les probabilit es d enombrables et leurs applications arithmetiques.\nRend. Circ. Mat. Palermo (2) 27 (1909) pp. 247-271.\n[6] F.P. Cantelli. Sulla probabilit a come limite della frequenza. Atti Accad. Naz.\nLincei. 26:1 (1917) pp. 39-45.\nDepartment of Mathematics, Massachusetts Institute of Technol\nogy\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.304 Undergraduate Seminar in Discrete Mathematics\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Undergraduate Seminar in Discrete Mathematics, Sperner's Lemma and Fair Division Problems",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-304-undergraduate-seminar-in-discrete-mathematics-spring-2015/4ba52e9fdecead1d55c206ef4abb0ed3_MIT18_304S15_project1.pdf",
      "content": "SPERNER'S LEMMA AND FAIR DIVISION\nPROBLEMS\nSUTHEE RUANGWISES\nAbstract. This paper is a seminar paper that summarizes Fran\ncis Edward Su's paper \"Rental harmony: Sperner's lemma in fair\ndivision\" [1] in 1999. In this paper we introduce and prove Sperner's\nLemma. Then, we introduce the fair division problem and an al\ngorithm based on Sperner's lemma that can solve some variants of\nthe fair division problem.\n1. Introduction\nMany real-life situations require dividing resources and costs among\npeople, such as dividing profit between companies, or paying rent of\na shared apartment. In mathematics, such problems have also been\nstudied since long ago. In particular, mathematicians have developed\nseveral methods to find an envy-free division, which is a division that\nevery person does not envy any other person, i.e. everyone think he/she\ngets the best (or one of the equally best) option among all people.\nWe will introduce one of those methods developed by Forrest Sim\nmons in 1980 that gives an envy-free solution to the cake-cutting prob\nlem, a variant of fair division problem. This method is based on\nSperner's lemma, a famous combinatorial lemma proved by Emanuel\nSperner in 1928.\n2. Sperner's Lemma\nFirst, we will start by stating and proving Sperner's lemma. This\nlemma holds for every dimension, but the most common and simplest\none is the two-dimensional case.\n2.1. Two-dimensional (triangle) Case. In a two-dimensional space\n(plane), a triangulation of a polygon is a subdivision of the polygon into\ndisjoint triangles. We also call these triangles elementary triangles.\nConsider any triangulation of a triangle T . We want to label every\nvertex with one of three colors such that\n(1) The three vertices of T must all have different colors.\nDate: May 9, 2015.\n\nFigure 1. An example of Sperner labeling in a trian\ngle. A cross denotes each room with all vertices having\ndifferent colors.\n(2) Every vertex on the edge of T must have the same color as one\nof the endpoints of that edge.\n(3) The vertices in the interior of T can have any color.\nWe call a label that satisfies those three conditions a Sperner labeling.\nThe Sperners' lemma states that:\nLemma 2.1. Any Sperner-labeled triangulation of a triangle must con\ntain an odd number of elementary triangles having all different labeled\ncolors.\nNote that, in many applications of the lemma, we only use the re\nsult that there is at least one such triangle, as stated in the following\ncorollary.\nCorollary 2.2. Any Sperner-labeled triangulation of a triangle must\ncontain at least one elementary triangle having all different labeled col\nors.\n2.2. General Case. Sperner's lemma also applies to a general case\nin n-dimensional space. First, we define an n-simplex, which is an\nn-dimensional shape in a similar sense to a triangle.\nDefinition 2.3. An n-simplex is an n-dimensional shape that consists\nof n + 1 vertices, and an edge joining every pair of vertices.\n\nFigure 2. An example of Sperner labeling in a tetra\nhedron with labeled color 1, 2, 3, and 4. (This figure is\ntaken from Figure 3 in Su's paper [1].)\nFor example, a 1-simplex is a line segment, a 2-simplex is a triangle,\nand a 3-simplex is a tetrahedron (triangular pyramid).\nDefinition 2.4. In n-dimensional space, a triangulation of an n-dimensional\npolytope is a subdivision of the polytope into disjoint n-simplices. We\ncall these n-simplices elementary n-simplices.\nWe define a Sperner labeling on an n-simplex P to be a label such\nthat\n(1) All of the n vertices of P must have different colors.\n(2) Every vertex on the k-dimensional face of P must have the same\ncolor as one the corners of that face.\n(3) The vertices in the interior of P can have any color.\nFor example, Figure 2 shows an example of the three-dimensional\ncase of a Sperner-labeled tetrahedron. Vertices on the edge with end\npoints labeled 1 and 2 can be labeled by either color 1 or 2, while\nvertices on the triangular face with corners labeled 1, 2, and 3 can be\nlabeled by either color 1, 2, or 3.\nThe general case of Sperners' lemma states that:\nLemma 2.5. Any Sperner-labeled triangulation of an n-simplex must\ncontain an odd number of elementary n-simplices having all different\nlabeled colors.\nLike in the two-dimensional case, we mainly use the result that there\nis at least one such n-simplex, as stated in the following corollary.\nThis image has been removed due to copyright restrictions.\nPlease see Figure 3. Francis Edward Su. Rental harmony:\nSperner's lemma in fair division. American Mathematical\nMonthly, 106(1999), 930-942.\n\nFigure 3. A figure showing the proof of Sperner's\nlemma in one-dimensional case.\nCorollary 2.6. Any Sperner-labeled triangulation of an n-simplex must\ncontain at least one elementary n-simplex having all different labeled\ncolors.\n3. Proof of Sperner's Lemma\nWe will prove by induction on the number of dimensions. To better\nclarifying ideas of the proof, we will show the base cases of both one\nand two-dimension cases, since the ideas of the proof in n-dimensional\ncase is very similar to the two-dimensional case.\n3.1. One-dimensional (line segment) Case.\nProof. Suppose that the left and right endpoint of the segment are\nlabeled red and blue, respectively. By considering the parity of color\nchanging when moving from the leftmost to the rightmost vertex, we\ncan conclude that the total number of color changes is odd. Thus, the\nnumber of edges with endpoints having different colors is also odd. D\n3.2. Two-dimensional (triangle) Case.\nProof of Lemma 2.1. Suppose we have a Sperner-labeled triangulation\nof T . We will call each elementry triangle good if its three vertices all\nhave different colors.\nWe define a door to be an edge having two endpoints green and blue.\nFirst, observe that there is an odd number of doors on the boundary\nof T (because only one side can have doors, and we proved in the one-\ndimensional case that the number of such edges is odd). Moreover,\neach elementary triangle can have at most two doors, and it will be\ngood if and only if it has exactly one door.\nWe consider the planar graph of T , with each elementary triangle as\na vertex (and an outside face as a special vertex v0) and each room as\nan edge. Since the degree of v0 is odd, the number of vertices with odd\ndegree besides v0 must be odd. Thus, the number of good triangles is\nodd.\nD\n\nFigure 4. A figure showing the proof of Sperner's\nlemma in two-dimensional case.\n3.3. n-dimensional (n-simplex) Case. The proof of the general case\nis similar to the two-dimensional case, as follows:\nProof of Lemma 2.5. Suppose we have a Sperner-labeled triangulation\nof an n-dimensional polytope P . Similar to the two-dimensional case,\nwe call each elementry n-simplex good if its vertices all have different\ncolors.\nSuppose we use color 1, 2, ..., n in labeling. We define a door to be\nan (n - 1)-simplex having corners labeled 1, 2, ..., n - 1 in some per\nmutation. From the hypothesis of induction in the (n - 1)-dimensional\ncase, there is an odd number of doors on the boundary of P (because\nonly one face can have doors, and we proved in the (n - 1)-dimensional\ncase that the number of such simplices is odd). Moreover, each ele\nmentary n-simplex can have at most two doors, and it will be good if\nand only if it has exactly one door.\nWe consider a graph of P , with each elementary n-simplex as a\nvertex (and an outside face as a special vertex v0) and each room as\nan edge. Since the degree of v0 is odd, the number of vertices with odd\ndegree besides v0 must be odd. Thus, the number of good n-simplex is\nodd.\nD\n\nFigure 5. An example of a cut-set in the case of three people.\n4. Cake-cutting Problem\nWe now go back to the fair division problem mentioned in the intro\nduction. The cake-cutting problem is a variant of that problem which\nfocuses on finding an envy-free division of a rectangular cake among\nn people. Note that in the case that everyone has exactly the same\nperspective on the size of the cake, we can simply equally divide the\ncake into n equal pieces and give each piece to each person. However,\nthis problem is much more complex because each person may have a\ndifferent perspective on the size of each piece of cake, e.g. one person\nmay prefer piece A to piece B, but an other person may prefer piece B\nto piece A.\n4.1. Simmons' Algorithm. In 1980, Forrest Simmons developed an\nalgorithm to find an envy-free division of the cake-cutting problem. We\nconsider any n-1 vertical cuts parallel to the side of the cake, dividing\nthe cake into n pieces. Such a way of cutting is called a cut-set. First,\nobserve that in a particular cut-set, if we ask all players which part\ndo they prefer and get all different answers, then that cut-set gives an\nenvy-free division (because every one gets the piece he/she prefer the\nmost). We will use Sperner's lemma to prove that there must exists\nsuch cut-set, as well as finding one.\nNote that, in order for Simmons' algorithm to work, the following\ntwo assumptions are required:\n(1) Hungry Players: Every player prefers any non-empty piece\nto an empty piece.\n(2) Closed Preference Set: If a player prefers the convergent\nsequence of cut-set, he/she also prefers the limiting cut-set.\n\nFigure 6. An example of constructing a labeling in a\ntriangle with each vertex representing each cut-set for\nthree people.\nThis assumption can be stated in other words that, for a small\nenough e, moving the cuts by e does not change the preference\nof any player.\nSimmons' Algorithm works as follow:\nConsider every possible cut-set that divides the cake into n (maybe\nempty) pieces. Let xi be the proportion of ith leftmost part. We have\nx1 + x2 + ... + xn = 1 and xi ≥ 0 for every i = 1, 2, ..., n.\nIn the n-dimensional space, consider a polytope formed by linear\nprogrammming x1 + x2 + ... + xn = 1 and xi ≥ 0 and xi ≥ 0 for every\ni = 1, 2, ..., n. The resulted polytope is a regular (n - 1)-simplex.\nThen, we triangulate that simplex into smaller regular (n - 1)\nsimplices with each having side length less than e, for a small enough e,\nas well as writing numbers 1, 2, ..., n on the vertices in a way that every\nelementary (n - 1)-simplex has vertices with all different numbers.\nAn example of construction in the case of three people is shown\nin Figure 6. In that figure, the resulted polytope is a regular triangle\n(regular 2-simplex). We then divide it into k2 smaller regular triangles,\nfor some integer k as big as we want. Then, we write a number on each\nvertex 1, 2, 3 in a cyclic order such that every elementry triangle has\nall three vertices with different numbers.\n\nThen, at each vertex with coordinates (x1, x2, ..., xn) with number i,\nwe ask player i that which piece of cake that he/she prefers if the sizes\nof pieces of cake is x1, x2, ..., xn, respectively. For example, at the top\nvertice in Figure 6, we ask player 1 that if the sizes of three pieces are\n0, 0, and 1, respectively, which piece does he/she prefer. We then color\nthat vertex according to the answer.\nObserve that, in each of the k-dimensional face of the polytope,\none ore more of the coordinates must be zero. For example, the y-\ncoordinate along the left edge of the triangle in Figure 6 is always zero.\nBy the hunger players assumption, no people prefer the piece with size\nzero, so the color of vertices on each face must be the same as one of\nthe corners of that face. Therefore, the color labeling of vertices in the\nsimplex is a Sperner labeling.\nBy Sperners' lemma, there must be at least one elementery (n - 1)\nsimplex that has vertices with different colors. We then divide the cake\nby the cut-set represented by any interior point of that (n-1)-simplex.\nSince the size of each elementry simplex is less than e, by the closed\npreference set assumption, all people will be satisfied with that cut-set.\n5. Rent-Partitioning Problem\nA rent-partitioning problem is another variant of the fair division\nproblem. This problem originated from the situation when n people\nrent a shared apartment with n different bedrooms. The problem is to\ndetermine which bedroom should each person get, and how much rent\neach person should pay.\nOne possible attempt is to consider every possible assignment of\nprice to each bedroom. i.e. set the price of room i to be xi such that\nx1 + x2 + ... + xn = S, when S is the total price of the apartment,\nand xi ≥ 0 for every i = 1, 2, ..., n. Then, we consider the (n - 1)\nsimplex obtained from the linear programming and color it like in the\ncake-cutting problem. However, this problem is different from the cake-\ncutting problem in one aspect. In the cake-cutting problem, the bigger\nthe piece of cake is, the higher chance people will want it; however, in\nthis problem, the higher the price of a room is, the lower chance people\nwill want that room. In fact, the label in the (n-1)-simplex in this case\nshould be the opposite from a Sperner labeling. For example, Figure\n7 shows an example of labeling obtained from the rent-partitioning\nproblem with three people. Vertices on the edge can be labeled with\nonly one color, while the three vertices at the corner of the big triangle\ncan be labeled with one of two colors.\n\nFigure 7. An example of a labeling obtained from the\nrent-partitioning problem with three people.\nFigure 8. An example of the dualization of a triangle.\n(This figure is taken from Figure 10 in Su's paper [1].)\nOne method to solve this issue is to dualize the simplex. Each k-\ndimensional face will become an (n - 1 - k)-dimensional face, as shown\nis figure 8. In fact, Herbert E. Scarf have proven that the dual simplex\nsatisfies Sperner labeling properties.\nThere is another simple way of solving the rent-partitioning problem\nwithout using the complicated dualization. This can be done by each\nperson first paying the full rent price and then assigning to each room\na \"rebate\" price that a person who takes that room will get. Then,\nwe can use Simmons' Algorithm to assign rooms to people in the same\nway as in the cake-cutting problem. However, in some extreme cases\nthat there is a room that nobody wants it even if it is free, someone\nThis image has been removed due to copyright restrictions.\nPlease see Figure 10. Francis Edward Su. Rental harmony:\nSperner's lemma in fair division. American Mathematical\nMonthly, 106(1999), 930-942.\n\nmay end up with that room with a negative price. Such cases should\nnot happen too often, though, in real-world situations.\n6. Conclusion\nWe have proved Sperner's Lemma for the n-dimensional case. Then,\nusing Sperner's lemma, we have proved Simmon's algorithm that can\nfind envy-free division for n people to the cake-cutting problem, a vari\nant of the fair division problem, as well as modifying to solve the rent-\npartitioning problem, another variant of the fair division problem.\nReferences\n(1) Francis Edward Su. Rental harmony: Sperner's lemma in fair\ndivision. American Mathematical Monthly, 106(1999), 930-942.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.304 Undergraduate Seminar in Discrete Mathematics\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}