{
  "course_name": "Universal Random Structures in 2D",
  "course_description": "No description found.",
  "topics": [
    "Mathematics",
    "Mathematical Analysis",
    "Probability and Statistics",
    "Topology and Geometry",
    "Mathematics",
    "Mathematical Analysis",
    "Probability and Statistics",
    "Topology and Geometry"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nBasic probability at the level of an introductory graduate course,\n18.175 Theory of Probability\nor equivalent. Useful background material can also be found in the online\nProbability: Theory and Examples (PDF - 1.9MB)\nnotes by Rick Durrett at Duke University.\n\nDescription\n\nThis graduate-level course introduces students to some fundamental 2D random objects, explains how they are related to each other, and explores some open problems in the field.\n\nTopics include:\n\nA brief review of universal random structures in 1D, including Brownian motion, Bessel processes, stable Levy processes, ranges of stable subordinators, and Ito's formula.\n\nAn introduction to universal random structures that are (at least in some sense) two dimensional or planar, including planar trees, generalized functions on planar domains, Riemannian surfaces, planar growth models, planar loop ensembles, and planar connections.\n\nDiscussion of motivating problems from statistical physics, quantum field theory, conformal field theory, string theory, and early universe cosmology.\n\nTextbook and Notes\n\nThere is no required text; references are assigned in the\nreadings section\n. A set of\nlecture notes\nthat is still in development is also available.\n\nProblem Sets & Final Project\n\nThere will be two problem sets and one final project. The final project may be either expository or original-research based. Several suggested research problems will be presented. Collaborative efforts will be allowed.\n\nGrading\n\nYour grade will be determined by your performance on the problem sets and the final project.",
  "files": [
    {
      "category": "Resource",
      "title": "Open Problems",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-177-universal-random-structures-in-2d-fall-2015/494904252a78e86d7013d8c5a84f39c4_MIT18_177F15_openp.pdf",
      "content": "Mating of trees and space-filling SLE\n1. Consider a stable L evy process Lt (indexed by R, defined modulo\nadditive constant) with only positive jumps and with parameter α ∈\n(0, 1). Let J1, J2, . . . be an enumeration of the jumps. For each vertical\njump line segment Ji, which occurs at a time ti, let Ti denote the next\nsubsequent time after ti at which the process L· reaches the value of L\nbefore the jump (i.e., the left limit of L· at ti). Then denote by Si the\nset of times at which L (restricted to [ti, Ti]) achieves a minimum value.\nThat is,\nSi = {t ∈ [ti, Ti] : s ∈ [ti, t] implies Ls ≤ St}.\nThe collection {Si} is a random countable collection of pairwise disjoint\nclosed subsets of R that are \"nested\" in a certain sense. Now suppose\nthat {S i} is an independent instance of this random collection. Declare\nan element of {Si} and an element of {S i} to be adjacent if they\nintersect. Now we have a random bipartite graph. Is this bipartite\ngraph almost surely connected? This problem is equivalent to a problem\nabout the connectedness of graph of complementary components of\na self-intersecting but not space-filling SLE curve (two components\nconnected if boundaries intersect).\n2. Could we at least prove connectedness if we had k independent instances\nof {Si} (for some sufficiently large finite value k) instead of 2?\n3. Mullin's bijection implies that uniform-spanning-tree-decorated random\nplanar maps scale have a certain scaling limit in the peanosphere\ntopology. Can this be generalized to UST-decorated quadrangulations,\nUST-decorated triangulations, or other types of UST-decorated discrete\ngraphs?\n4. Can one further generalize the peanosphere convergence for FK models\n(as derived via the hamburger-cheeseburger bijection) to triangulations,\nquadrangulations, etc.?\n5. In hamburger cheeseburger setting, suppose we choose independent\ninstances of FK given planar map. Can one show that in limit of the\ncoupling the surface is the same with curves different.\n\n6. Can we actually check that the various flow lines in SLE12 correspond\nto analogous GFF flow lines in the field generated by SLE12 through\nthe imaginary geometry story?\n7. Explain Brownian motion results one obtains as consequence of mating\nof trees (alternating directions, getting coupling of flow line and field,\nwhat path determined by field means on Brownian motion side).\n8. Can one put metric on peanosphere when γ2 = 8/3? First prove that\nan exponent exists where number of t steps needed scales like t to that\npower. How about a sort of KPZ like formulation, where one weights\npaths by length?\n9. Neinhuis conjecture of 6-vertex variance and c.\nLiouville Quantum Gravity Properties\n1. Almost sure commutativity of coordinate change and pass from measure\nto field (over class of all possible coordinate changes).\n2. Understand the torus. The LQG torus defined via resampling. The LQG\ntorus defined in terms of some Laplacian determinant. The Brownian\nmap torus. The peanosphere torus. How are they all defined and how\nare they all related? Can something be said about some of these at\nleast in the γ2 = κ = 2 UST case? Or the γ2 = κ = 8/3 case?\nKPZ growth\n1. Discrete KPZ: another interpolation between (-1)-DBM and 0-DBM\n2. KPZ holds for KPZ: that is, one can consider the SRW measure on\npaths, then weight randomly by white noise to get a new measure, and\nthe new measure satisfies a KPZ. Take distance between two walks to\nbe 2-k where k is last point at which they agree. You can think about\ncovering your random subset of the set of all paths -- either fixed radius\nin this standard metric, or of fixed volume in the random measure.\n3. Can one characterize KPZ growth by scale invariance and local inde\npendence?\n\nOther SLE stories\n1. Consider SLE6 on universal cover of complement of grid of points. This\nprocess has a boundary that looks like SLE6 boundary, but in another\nsense it approximates Brownian motion. What good are these sorts of\n\"in between Brownian motion and SLE6\" objects?\n2. What kind of convergence story is there for the O(n) on a random\nplanar map? Is there any sense (analogous to peanosphere sense, say)\nin which converge is provable?\nOther interesting models\n1. Scaling limits for tricolor percolation\n2. Dynamical triangulations and causal quantum gravity.\n3. Understand the Gaussian field arising from commutative Yang Mills\ntheory (electromagnetism).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.177 Universal Random Structures in 2D\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Universal randomness in 2D",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-177-universal-random-structures-in-2d-fall-2015/fb0adaafb5f38114b0471312c8687de6_MIT18_177F15_LECNOTES.pdf",
      "content": "Universal randomness in 2D\nJason Miller and Scott Sheffield\nAbstract\nWe begin by reviewing one-dimensional random objects that are universal in\nthe sense that they arise in many contexts - in particular as scaling limits of large\nfamilies of discrete models - and canonical in the sense that they are uniquely\ncharacterized by scale invariance and other natural symmetries. Examples include\nBrownian motion, Bessel processes, stable L evy processes and ranges of stable\nsubordinators.\nWe then introduce several universal and canonical random objects that are\n(at least in some sense) two dimensional or planar, along with discrete analogs of\nthese objects. These include trees, distributions, curves, loop ensembles, surfaces,\nand growth trajectories. Keywords include continuum random tree, stable L evy\ntree, stable looptree, Gaussian free field, Schramm-Loewner evolution, percolation,\nuniform spanning tree, loop-erased random walk, Ising model, FK cluster model,\nconformal loop ensemble, Brownian loop soup, random planar map, Liouville\nquantum gravity, Brownian map, Brownian snake, diffusion limited aggregation,\nfirst passage percolation, and dielectric breakdown model.\nFinally, we discuss the intricate and surprising relationships between these\nuniversal objects. We explain how to use generalized functions to construct\ncurves and vice versa; conformally weld a pair of surfaces to produce a surface\ndecorated by a simple curve; topologically and conformally mate pairs of trees to\nobtain surfaces decorated by non-simple curves; and reshuffle these constructions\nto describe random growth trajectories on random surfaces. We present both\ndiscrete and continuum analogs of these relationships. Keywords include imaginary\ngeometry, quantum zipper, peanosphere, and quantum Loewner evolution.\n\nContents\n1 Random processes\n1.1 Brownian motion . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n1.2 Bessel processes . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n1.3 Brownian excursions, meanders, and bridges . . . . . . . . . . . . . . .\n1.4 Stable L evy processes . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n1.5 Ranges of stable subordinators . . . . . . . . . . . . . . . . . . . . . . .\n2 Random trees\n2.1 Galton-Watson trees . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n2.2 Aldous's continuum random tree . . . . . . . . . . . . . . . . . . . . . .\n2.3 L evy trees and stable looptrees . . . . . . . . . . . . . . . . . . . . . .\n2.4 Brownian snakes . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3 Random generalized functions\n3.1 Tempered distributions and Fourier transforms . . . . . . . . . . . . . .\n3.2 Gaussian free fields . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.3 Fractional Gaussian fields and log correlated free fields . . . . . . . . .\n3.4 Dimer models and uniform spanning trees . . . . . . . . . . . . . . . .\n4 Random curves and loop ensembles\n4.1 Schramm-Loewner evolution: basic definitions and phases . . . . . . . .\n4.2 Loop erased random walk and uniform spanning tree . . . . . . . . . .\n4.3 Critical percolation interfaces . . . . . . . . . . . . . . . . . . . . . . .\n4.4 Gaussian free field level lines . . . . . . . . . . . . . . . . . . . . . . . .\n4.5 Ising, Potts, and FK-cluster models . . . . . . . . . . . . . . . . . . . .\n4.6 Bipolar orientations . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n4.7 Restriction measures, self-avoiding walk, and loop soups . . . . . . . . .\n4.8 Conformal loop ensembles . . . . . . . . . . . . . . . . . . . . . . . . .\n5 Random surfaces\n5.1 Planar maps . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n5.2 Decorated surfaces and Laplacian determinants . . . . . . . . . . . . .\n5.3 Mullin-Bernardi bijection . . . . . . . . . . . . . . . . . . . . . . . . . .\n5.4 Cori-Vaquelin-Schaeffer bijection . . . . . . . . . . . . . . . . . . . . . .\n5.5 Hamburger-cheeseburger bijection . . . . . . . . . . . . . . . . . . . . .\n5.6 Bipolar bijection . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n5.7 Brownian map . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n5.8 Liouville quantum gravity . . . . . . . . . . . . . . . . . . . . . . . . .\n5.9 KPZ (Knizhnik-Polyakov-Zamolodchikov)scaling relations\n. . . . . . .\n5.10 Quantum wedges, cones, spheresand disks\n. . . . . . . . . . . . . . . .\n\n6 Random growth trajectories\n6.1 Eden model and first passage percolation . . . . . . . . . . . . . . . . .\n6.2 Diffusion limited aggregation and the dieelectric breakdown model . . .\n6.3 KPZ (Kardar-Parisi-Zhang) growth . . . . . . . . . . . . . . . . . . . .\n6.4 Hastings-Levitov . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n6.5 Internal DLA . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n7 Imaginary geometry\n7.1 Flow lines starting from the boundary . . . . . . . . . . . . . . . . . .\n7.2 Interior flow lines . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n7.3 Counterflow lines and space-filling SLE . . . . . . . . . . . . . . . . . .\n7.4 Time reversal symmetries . . . . . . . . . . . . . . . . . . . . . . . . .\n8 Conformal welding and the quantum zipper\n8.1 Welding simple quantum wedges . . . . . . . . . . . . . . . . . . . . . .\n8.2 Welding more general quantum wedges . . . . . . . . . . . . . . . . . .\n9 Mating trees and the peanosphere\n9.1 Moore's theorem and topological tree mating . . . . . . . . . . . . . . .\n9.2 Matings from complex dynamics . . . . . . . . . . . . . . . . . . . . . .\n9.3 Matings of correlated continuum random trees . . . . . . . . . . . . . .\n9.4 Matings of trees of disks . . . . . . . . . . . . . . . . . . . . . . . . . .\n9.5 Relation to discrete bijections . . . . . . . . . . . . . . . . . . . . . . .\n10 Quantum Loewner evolution\n10.1 Reshuffling in discrete examples . . . . . . . . . . . . . . . . . . . . . .\n10.2 Defining QLE . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . .\n10.3 QLE and the Brownian map . . . . . . . . . . . . . . . . . . . . . . . .\n\nPreface\nThe goals of this book are very simple. We will\n1. introduce a few fundamental random objects, and\n2. explain how they are related to one another.\nThe fundamental random objects include processes, trees, distributions (a.k.a. general\nized functions), curves, loop ensembles, surfaces, and growth trajectories.\nAll of these objects are in some sense universal. That is, they arise as macrosopic limits\nof many different kinds of random systems, which may have very different microscopic\nbehavior. This usage of the term \"universal\" comes from statistical physics. Physicists\ntell us that many phenomena (such as phase transitions) are surprisingly similar from\none material to another. Physical systems -- and mathematical models -- that look\nvery different on the microscopic level (different atoms, molecules, etc.) are declared to\nbelong the same universality class if they behave the same way in some macroscopic\nlimit. The convergence of general random walks to Brownian motion (under only a\nmild second moment condition) is an example of mathematical universality. We will\nencounter many other examples during the course of this book, some proven and some\nconjectural.\nThe random objects introduced in this book are also all in some sense canonical.\nMany fundamental objects in mathematics are singled out by special symmetries. For\nexample, in a universe full of roughly round-ish shapes, the sphere stands out; it is\nuniquely determined by rotational invariance, equidistance of points from a center,\netc. Similarly, among all random variables taking values in the space of continuous\npaths, Brownian motion is (up to multiplicative constant) the only one with reflection\ninvariance, stationarity, and independence of increments. It has a strong claim to be\nthe canonical continuous random path. This book will survey objects that can claim\nwith equal justification to be the canonical random planar tree, the canonical random\nnon-self-crossing curve, the canonical random surface, and so forth.\nAmong the various symmetries that make these objects special, many involve some\nsort of conformal invariance. Recall that the Riemann uniformization theorem implies\nthe existence of a conformal map between any two sphere-homeomorphic surfaces;\nwhen the sphere is replaced by a multi-handled torus or a disk with holes, the space\nof conformal equivalence classes (a.k.a. the moduli space) remains finite dimensional.\nThis remarkable fact is a peculiar feature of two dimensions and seems to be a large\npart of what makes the two dimensional theory interesting. In the 1980's and 1990's a\nbranch of physics called conformal field theory, motivated by both string theory and\ntwo dimensional statistical mechanics, began to discover and explore some surprisingly\nfar reaching consequences of conformal symmetry assumptions in physical models.\n\nMathematicians have more recently expanded these ideas further, building in particular\non the introduction of the so-called Schramm-Loewner evolution in 1999.\nThe focus of this text is on the mathematics, and in particular on a few of the most\nfundamental discrete and continuum mathematical objects in one and two dimensions.\nHowever we will provide some cursory discussion of the motivating problems that link\nthem to physics and to other fields.\nThe first half of this book introduces both discrete and continuum analogs of several uni\nversal random objects: processes, trees, distributions, curves, loop ensembles, surfaces,\nand growth trajectories. The second half explores the intricate and often surprising\nrelationships between these objects. To put this another way, the first half of the book\nintroduces a certain cast of characters, and the second half explores the drama that\ntakes place when these characters interact.\nThis book is intended as a broad introductory overview of this field and as such it\ncovers a good deal of material. With additional detail, each individual chapter could be\n(and in many cases already has been) expanded into an entire book of its own. We do\nnot provide fully detailed proofs of every result cited in this text. However, we aim to\nprovide enough rigor and detail to enable the reader to appreciate the overall narrative\nand to begin further research in this field.\nAcknowledgments. J.M.'s work was partially supported by DMS-1204894 and S.S.'s\nwork was partially supported by DMS-1209044, a fellowship from the Simons Foundation,\nand EPSRC grants EP/L018896/1 and EP/I03372X/1. S.S. presented this material\nas a graduate topics course at MIT in Fall 2015 and would like to thank the students\nthere for feedback and support.\nRandom processes\n1.1\nBrownian motion\nWe recall the basic construction, Itˆo's formula, martingale representation theorem, local\nmartingales, and quadratic variation. More detailed accounts of this material can be\nfound in basic probability texts like [Dur10], the book on Brownian motion by M orters\nand Peres [MP10], and the stochastic calculus texts [KS91, RY99].\n1.2\nBessel processes\nAn introduction to Bessel process can be founded for example in [RY99, Chapter 11].\nThe idea is to construct a solution to the stochastic differential equation\nδ - 1 X-1\ndXt = dBt +\nt dt,\n\nwhere Bt is standard Brownian motion and δ is a fixed real constant. The interesting\nquestion is how to extend this definition beyond times at which Xt reaches zero. One\napproach is to have the process jump up by f each time it hits 0, and take a limit as\nf → 0. Another is to define the square of the process Bessel process (which turns out to\nfit more neatly into the framework of some general theorems in SDE theory, and allows\nus to show that the process is adapted to the Brownian motion). A simple application\nof Itˆo's formula allows us to check which power of Xt (depending on δ) is a martingale,\nand also to prove that summing independnet δ1 and δ2 Bessel processes produces a\nδ1 + δ2 Bessel process.\n1.3\nBrownian excursions, meanders, and bridges\nOne may define a Brownian excursion indexed by [0, 1] by conditioning a Brownian\nmotion, started at f, to end in [0, f], and then taking the f → 0 limit. Brownian motion\nconditioned to stay in a cone (starting from the apex) is explained in [Shi85] along with\nthe relationship to Bessel processes.\n1.4\nStable L evy processes\nWe recall Lamperti's classic work on continuous state branching processes [Lam67] and\ntextbooks on L e'vy processes by Sato, by Bertoin and by Barndoff-Nielson, Mikosch,\nand Resnick [Sat99, Ber96, BNMR01]\n1.5\nRanges of stable subordinators\nThe range of a stable subordinator is a random closed subset of R+. it can be understood\nas the zero set of a Bessel process. If we condition the endpoints of the Bessel process to\nbe zero at 1, we can also define a random closed subset of [0, 1]. These random sets can\nbe characterized by renewal and scale invariance properties, which are similar to the\nproperties we will later use to characterize conformal loop ensembles (the complement\nof the union of the interiors of these loops will turn out to be a random subset of R2).\nRandom trees\n2.1\nGalton-Watson trees\nGalton-Watson trees and their scaling limits are described by Duquesne and Le Gall\nin [DLG05]. See also [LGLJ98, DLG06, DLG09]. One of the interesting features of\n\nGalton-Watson trees is the phase transition: when the expected number of children is\nless than one, the tree is easily seen to be finite almost surely. (The expected number of\nchildren at level k decays exponentially in k.) When the expected number of children\nis greater than one, the tree has a positive probability of being infinite.\nWhen the expected number of children is equal to 1, one may observe offspring sets of\nvertices one at a time, exploring tree boundary in a clockwise way, so that the number\nof live vertices is a martingale. This martingale is closely related to the contour function\nof the tree (but not exactly the same; see L evy tree story below).\n2.2\nAldous's continuum random tree\nThe continuum random tree was introduced in a series of papers by Aldous in 1991\n[Ald91a, Ald91b, Ald93]. It can be understood as a scaling limit of Galton-Watson\ntrees.\n2.3\nL evy trees and stable looptrees\nThere are some very simple analogs of the CRT in which stable L evy excursions play\nthe role of the Brownian excursion [DLG05]. These can also be understood as scaling\nlimits of Galton-Watson trees, when the number of children has a power law tail (finite\nmean but infinite variance).\nThere is a closely related construction in which each of the countably many big branch\npoints is replaced with a loop; the resulting \"tree of loops\" called a looptree. See the\nwork by Curien and Korchemski on stable looptrees [CK13], as well as the exposition in\n[DMS14].\n2.4\nBrownian snakes\nA Brownian snake is essentially a Brownian motion indexed by a CRT. It will play a role\nlater in the construction of a certain canonical random surface called the Brownian map,\nbut it was actually studied independently before its relationship to random surfaces\nwas discovered [DLG05].\nRandom generalized functions\n3.1\nTempered distributions and Fourier transforms\nThe Schwartz space on Rd is the space of Cinf functions φ such that for any multi-indices\nα and β in which each of the seminorms sup Dαφ(x)xβ is bounded. These seminorms\n\ninduce a topology on the Schwartz space; continuous linear functionals on the Schwartz\nspace are called tempered distributions. The space of tempered distributions is the\nsmallest space which includes the bounded continuous functions and is closed under\nboth differentiation and the Fourier transform.\nIn the exposition on Gaussian free fields, we will often find it convenient to limit attention\nto compactly supported test functions (instead of test functions in the Schwartz space)\nas this will allow us to more easily isolate the effects of boundary conditions.\n3.2\nGaussian free fields\nGaussian Hilbert spaces are introduced in [Jan97]. Surveys of the Gaussian free field\ncan be found in [She07, Ber].\n3.3\nFractional Gaussian fields and log correlated free fields\nThe GFF can be generalized in several ways. See the survey articles [DRSV14b,\nLSSW14] for more on fractional Gaussian fields and log correlated Gaussian fields in\ngeneral d-dimensional spaces. These are obtained by applying powers of the Laplacian\nto white noise. The Gaussian free field can be understood as the restriction to two\ndimensions of log correlated fields defined in higher dimensions.\n3.4\nDimer models and uniform spanning trees\nThe UST height function is arguably the simplest discrete analog of the GFF. See\nKenyon's scaling limit proof [Ken00b, Ken01], which makes use of the equivalent\nformulation of the model in terms of dimers.\nRandom curves and loop ensembles\n4.1\nSchramm-Loewner evolution: basic definitions and phases\nMuch of the work on Schramm-Loewner evolution is prefigured in the physics literature\non conformal field theory [DFMS97]. Schramm's original paper [Sch00] has been followed\nby many excellent survey articles and textbooks [Wer03, KN04, Car06, Law09, BN11].\nThe so-called natural parameterization is described in [LS11, LR12, LZ13].\n\n4.2\nLoop erased random walk and uniform spanning tree\nSee Wilson's algorithm [Wil96, PW98] and the original UST/LERW convergence paper\n[LSW04].\n4.3\nCritical percolation interfaces\nPercolation interface scaling limits are tractable thanks to a fundamental discovery by\nStanislav Smirnov [Smi01].\n4.4\nGaussian free field level lines\nSee [SS05, SS09, SS13] and the universality theorem in [Mil10].\n4.5\nIsing, Potts, and FK-cluster models\nSome of these \"next simplest after percolation\" models are also tractable [CS]\n4.6\nBipolar orientations\nThis is another simple model conjectured to scale to SLE12. The conjecture is easy to\nstate, but the motivation behind the conjecture will not be explained until the sections\non imaginary geometry and the peanosphere.\n4.7\nRestriction measures, self-avoiding walk, and loop soups\nThe relationship between SLE8/3 and Brownian motion is especially beautiful and has\nan especially beautiful history. See the account in the early work by Lawler, Schramm,\nand Werner [LSW03].\n4.8\nConformal loop ensembles\nGiven that the discrete interfaces that scale to SLE have \"loop ensemble\" variants,\none would expect there to be a natural \"loop ensemble\" variant of SLE itself. See the\nintroduction in [She09, SW12].\n\nRandom surfaces\n5.1\nPlanar maps\nA planar map is a planar map together with an embedding in the plane (defined\nup to topological equivalence). Enumeration work was done by Tutte in the 1960's\n[Tut62, Tut68].\n5.2\nDecorated surfaces and Laplacian determinants\nThe Laplacian determinant and its inverse are related to partition functions for the\nGFF and UST models in surprisingly simple ways. See Kenyon's work on scaling limits\nof determinant Laplacians on grids [Ken00a] and the broad survey by Merris [Mer94]\nwhich describes Kirchhoff's matrix tree theorem, among other things.\nGiven any finite connected graph (V, E) the Laplacian on the graph can be defined as\na linear operator Δ from RV itself. Its matrix is given by\nMi,j =\n⎧\n⎪\n⎨\n⎪\n⎩\ni =\nj, (vi, vj ) ∈ E\ni =\nj, (vi, vj ) ∈ E .\n-deg(vi) i = j.\nLet R ⊂ RV be the set of functions with mean zero. Then -Δ : R → R is invertible,\nand Kirchhoff's matrix tree theorem states that if α is the determinant of this invertible\noperator on R then α is the number of spanning trees of V . The quantity α is also the\nproduct of all of the non-zero eigenvalues of the matrix M.\n\nThe DGFF partition function can be be written\n-tx2/2dt = t-1/2, we find that quantity is\nR(2π)-|V -1|/2e-(f,-Δf)/2df. Expanding\n√1\nover eigenbases, and using the fact the\ne\n2π\nα-1/2 .\n5.3\nMullin-Bernardi bijection\nThere is a very simple bijection between discrete lattice walks in Z2 starting and ending\n+\nat zero and rooted planar maps with distinguished spanning trees. See [Mul67, Ber07]\nas well as the exposition in [She11].\n5.4\nCori-Vaquelin-Schaeffer bijection\nThe Cori-Vaquelin-Schaeffer bijection gives a way to bijectively count undecorated planar\nmaps [CV81, JS98, Sch99]. Every quadrangulation with a root can be decorated by a\n\ndirected breadth first spanning tree spannign all of the edges. When multiple incoming\nedges come into the same vertex, each outgoing edge is connected to only one of them\nin this tree namely, the next one over in clockwise ordering.\n5.5\nHamburger-cheeseburger bijection\nThere is a generalization of the Mullin-Bernardi bijection in which the rooted planar\nmap comes with an arbitrary distinguished edge subset, instead of a distinguished\nspanning tree [She11].\n5.6\nBipolar bijection\nThe scaling limit of the pair of trees can be easily described in this case, as it can in\neach of the other cases described above.\n5.7\nBrownian map\nThe idea behind the Cori-Vaquelin-Schaeffer bijection can be used to define a continuum\nrandom metric space [MM06, LG13, Mie13, LG14], which has a natural infinite volume\nanalog [CL12]. See Le Gall's ICM notes [Le 14] or the survey by Miermont and Le\nGall [LGM+12]. An axiomatic characterization of the Brownian map in terms of it\nsymmetries appears in [MS15a].\n5.8\nLiouville quantum gravity\nPolaykov conceived of a random surface model based on an action closely related to the\nGaussian free field [Pol81]. If h is an instance of the Gaussian free field, one attempts\nto define a meausre of the form eγh(z)dz, which in turn encodes the volume form of a\nrandom surface after a conformal map back to a fixed parameter space (say, a disk in the\nplane). The rigorous construction of this random measure was given by Høegh-Krohn in\n√\n1971 [HK71], for the range γ ∈ [0, 2), and the full range [0, 2) was treated by Kahane\n(who used the term multiplicative chaos) in 1985 [Kah85], see also the survey [RV14].\nThe construction of the measure as a measure-valued function on the space of instances\nh of the GFF was done in [DS11]. The case γ = 2 is different but one can make sense\nof the measure by different means [DRSV14a, DRSV14c].\n\n5.9 KPZ (Knizhnik-Polyakov-Zamolodchikov) scaling relations\nA relationship between scaling dimensions was discovered by Knizhnik, Polyakov, and\nZamolodchikov in [KPZ88]. In a recent memoir [Pol08] Polyakov explains how the\ndiscover of this relationship cemented the belief that the discrete planar map models\nwere (in some sense) equivalent to Liouville quantum gravity. See [DS11] and the\nreferences therein. See the Hausdorff variant in [RV08].\nSee the derivation of the d = 26 value for the bosonic string by Lovelace in 1971 in\n[Lov71].\n5.10\nQuantum wedges, cones, spheres and disks\nThere are natural ways to define quantum surfaces using Bessel process excursions.\nThere are some natural probability measures on the space of infinite volume surfaces.\nThere are also some natural infinite measures on the space of finite volume surfaces.\nSee the introduction to [DMS14].\nRandom growth trajectories\n6.1 Eden model and first passage percolation\nThere are a number of natural growth trajectories. The Eden model, introduced by\nEdein in 1961 [Ede61], is the simplest to describe. Here, every edge has an exponential\nclock, and when it rings the edge is added to the growing edge cluster (if it is incident\nto the existing cluster). A generalization of this story known as first-passage percolation\nwas introduced by Hammersley and Welsh in 1965 [HW65].\n6.2 Diffusion limited aggregation and the dieelectric break\ndown model\nDiffusion limited aggregation, as introduced by Witten and Sander in 1981 [WJS81,\nWS83], is a model for growth in which new particle locations on the boundary are\nchosen from harmonic measure instead of uniform measure. See early conjectures in\n[Mea86] and the theorem of Kesten [Kes87].\n\n6.3\nKPZ (Kardar-Parisi-Zhang) growth\nThe KPZ growth model is the logarithm of the stochastic heat equation with geometric\nnoise. It was introduced in a slightly different form, and without a rigorous construction,\nKarder, Parisi, and Zhang in [KPZ86]. It does not itself describe the conjectural scaling\nlimit of Eden model fluctuations; rather, it describes what amounts to a sort of \"off\ncritical\" variant, which is believed to converge to a fixed point as a certain parameter\ntends to zero. These models can be viewed as interesting in their right, or interesting\nas approximations to the (still conjectural) KPZ fixed point, which is in turn the\nconjectural scaling limit of Eden model fluctuations. The fixed point conjecture is\ndescribed by Corwin and Quastel in [CQ11]. See also Corwin's survey article [Cor12].\n6.4\nHastings-Levitov\nThe Hastings-Levitov model was designed as an approximation of what should be\na continuum DLA theory. The hope was that one could prove the existence of an\nisotropic scaling limits of this model, and that would be easier than establishing the\nanalogous result for (an isotropic form of) ordinary DLA. While this goal has not yet\nbeen achieved, there has been some recent progress in understanding Hastings-Levitov;\nsee, e.g., [JVST12].\n6.5\nInternal DLA\nInternal DLA is a growth model introduced by Meakin and Deuthch in 1986 [MD86].\nInternal DLA growth seems to be much smoother than Eden model, with logarithmic\nfluctuations [LBG92, JLS12, JLS13, AG13b, AG13a]. Unlike ordinary (external) DLA\nand most of the other growth models presented in this section, fluctuations of internal\nDLA on the grid have a well understood scaling limit, which can be described by a\nvariant of the Gaussian free field [JLS+14].\nImaginary geometry\n7.1\nFlow lines starting from the boundary\nThe results in this section are detailed in a series of imaginary geometry papers by the\ncurrent authors [MS12a, MS12b, MS12c, MS13a]. The idea is to try to define flow lines\nof eih(z)/χ where χ > 0 is a fixed parameter and h is an instance of the Gaussian free\nfield. We begin by discussing paths that originate at the boundary, and are related to\nforms of chordal SLE.\n\n7.2\nInterior flow lines\nIt is similarly possible to make sense of flow lines of eih(z)/χ starting from interior points\nof a planar domain.\n7.3\nCounterflow lines and space-filling SLE\nThe tree and dual tree of flow lines have an interface that can be described as a\nspace-filling curve.\n7.4\nTime reversal symmetries\nImaginary geometry can be used to prove several basic facts about SLE, including time\nreversal symmetry for several forms of SLEκ with κ < 4 and SLEκ! with κ' > 4.\nConformal welding and the quantum zipper\n8.1\nWelding simple quantum wedges\nOne can \"conformally weld\" two quantum wedges to each other to obtain a new thicker\nquantum wedge. The first version of this story (which applies to two wedges of a\nparticular thickness) was described in [She10]\n8.2\nWelding more general quantum wedges\nAdditional welding constructions are described in [DMS14]. These allow one to weld\ntogether two wedges of weights W1 and W2 to produce a new wedge of weight W1 + W2.\nOne can also weld the left and right sides of a single quantum wedge to each other, to\nproduce a quantum cone.\nMating trees and the peanosphere\n9.1\nMoore's theorem and topological tree mating\nThere is a simple way to see that gluing two continuum random trees produces a\ntopological sphere decorated by a space-filling path [DMS14].\n\n9.2\nMatings from complex dynamics\nThe idea of topologically mating Julia sets is given an overview in [Mil04, Mil06] and\nthe references therein.\n9.3\nMatings of correlated continuum random trees\nThe peanosphere theorem is proved in [DMS14].\n9.4\nMatings of trees of disks\nThe \"tree of disk\" analog of the peanosphere theorem is also proved in [DMS14].\n9.5\nRelation to discrete bijections\nThe tree mating construction has discrete analogs in the planar maps decorated by FK\nmodels, uniform spanning trees, and bipolar orientations, as detailed in the various\nbijections described in Section 5.\nQuantum Loewner evolution\n10.1\nReshuffling in discrete examples\nDiscrete and continuum analogs of the quantum Loewner evolution are introduced in\n[MS13b]. We begin with an account of the discrete models.\nThe recurrence of random walk on the infinite tree decorated map is a special case of\nthe result in [GGN13].\nDLA and the Eden model (and more generally DBM) can be defined on random planar\nmaps. They are related, respectively, to loop erased random walk and a Bernoulli\npercolation interface via a certain \"reshuffling\" construction.\nIn the case of the Eden model, some relevant work on exploring triangulations by Angel\nand Schramm appears in [Ang03, AS03]\n10.2\nDefining QLE\nThis reshuffling has a continuum analog that can be shown to converge (at least\nsubsequentially) [MS13b].\n\ni\n10.3\nQLE and the Brownian map\nThis continuum exploration introduced in [MS13b] can be used to prove the equivalence\nof\n8/3-Liouville quantum gravity and the Brownian map. This is accomplished in a\nseries of papers [MS15b, MS15c, MS15d].\nIt remains an open problem to endow γ-LQG with a metric space structure for general\nγ. A famous calculation of Watabiki describes what can be conjectured to be the\nHausdorff dimension of general γ-LQG surfaces [Wat93].\nReferences\n[AG13a]\nAmine Asselah and Alexandre Gaudilli`ere. From logarithmic to subdiffusive\npolynomial fluctuations for internal DLA and related growth models. Ann.\nProbab., 41(3A):1115-1159, 2013. 1009.2838.\n[AG13b]\nAmine Asselah and Alexandre Gaudilli`ere. Sublogarithmic fluctuations for\ninternal DLA. Ann. Probab., 41(3A):1160-1179, 2013. 1011.4592.\n[Ald91a]\nDavid Aldous. The continuum random tree. I. Ann. Probab., 19(1):1-28,\n1991.\n[Ald91b]\nDavid Aldous. The continuum random tree. II. An overview. In Stochastic\nanalysis (Durham, 1990), volume 167 of London Math. Soc. Lecture Note\nSer., pages 23-70. Cambridge Univ. Press, Cambridge, 1991.\n[Ald93]\nDavid Aldous. The continuum random tree. III. Ann. Probab., 21(1):248-\n289, 1993.\n[Ang03]\nO. Angel. Growth and percolation on the uniform infinite planar triangula\ntion. Geom. Funct. Anal., 13(5):935-974, 2003. math/0208123.\n[AS03]\nOmer Angel and Oded Schramm. Uniform infinite planar triangulations.\nComm. Math. Phys., 241(2-3):191-213, 2003. math/0207153.\n[Ber]\nNathana el Berestycki. Introduction to the gaussian free field and liouville\nquantum gravity.\n[Ber96]\nJean Bertoin. L evy processes, volume 121 of Cambridge Tracts in Mathe\nmatics. Cambridge University Press, Cambridge, 1996.\n[Ber07]\nOlivier Bernardi. Bijective counting of tree-rooted maps and shuffles of\nparenthesis systems. Electron. J. Combin., 14(1):Research Paper 9, 36 pp.\n(electronic), 2007. math/0601684.\n\n[BN11]\nN Berestycki and JR Norris. Lectures on schramm-loewner evolution. 2011.\n[BNMR01] Ole E. Barndorff-Nielsen, Thomas Mikosch, and Sidney I. Resnick, editors.\nL evy processes. Birkh auser Boston Inc., Boston, MA, 2001. Theory and\napplications.\n[Car06]\nJ. Cardy. Lectures on Stochastic Loewner Evolution and other growth\nprocesses in two dimensions, March 2006.\n[CK13]\nN. Curien and I. Kortchemski. Random stable looptrees. ArXiv e-prints,\nApril 2013.\n[CL12]\nN. Curien and J.-F. Le Gall. The Brownian plane. ArXiv e-prints, April\n2012.\n[Cor12]\nIvan Corwin. The Kardar-Parisi-Zhang equation and universality class.\nRandom Matrices Theory Appl., 1(1):1130001, 76, 2012. 1106.1596.\n[CQ11]\nI. Corwin and J. Quastel. Renormalization fixed point of the KPZ univer\nsality class. ArXiv e-prints, March 2011.\n[CS]\nD. Chelkak and S. Smirnov. Universality in the 2D Ising model and\nconformal invariance of fermionic observables. Invent. Math.\n[CV81]\nRobert Cori and Bernard Vauquelin. Planar maps are well labeled trees.\nCanad. J. Math., 33(5):1023-1042, 1981.\n[DFMS97] Philippe Di Francesco, Pierre Mathieu, and David S en echal. Conformal\nfield theory. Graduate Texts in Contemporary Physics. Springer-Verlag,\nNew York, 1997.\n[DLG05]\nThomas Duquesne and Jean-Fran cois Le Gall. Probabilistic and fractal\naspects of L evy trees. Probab. Theory Related Fields, 131(4):553-603, 2005.\n[DLG06]\nThomas Duquesne and Jean-Fran cois Le Gall. The Hausdorff measure of\nstable trees. ALEA Lat. Am. J. Probab. Math. Stat., 1:393-415, 2006.\n[DLG09]\nThomas Duquesne and Jean-Fran cois Le Gall. On the re-rooting invariance\nproperty of L evy trees. Electron. Commun. Probab., 14:317-326, 2009.\n[DMS14]\nB. Duplantier, J. Miller, and S. Sheffield. Liouville quantum gravity as a\nmating of trees. ArXiv e-prints, September 2014.\n[DRSV14a] Bertrand Duplantier, R emi Rhodes, Scott Sheffield, and Vincent Vargas.\nCritical gaussian multiplicative chaos: Convergence of the derivative mar\ntingale. The Annals of Probability, 42(5):1769-1808, 09 2014.\n\n[DRSV14b] Bertrand Duplantier, R emi Rhodes, Scott Sheffield, and Vincent Vargas.\nLog-correlated gaussian fields: an overview. arXiv preprint arXiv:1407.5605,\n2014.\n[DRSV14c] Bertrand Duplantier, R emi Rhodes, Scott Sheffield, and Vincent Vargas.\nRenormalization of Critical Gaussian Multiplicative Chaos and KPZ Rela\ntion. Comm. Math. Phys., 330(1):283-330, 2014.\n[DS11]\nBertrand Duplantier and Scott Sheffield. Liouville quantum gravity and\nKPZ. Invent. Math., 185(2):333-393, 2011. 0808.1560.\n[Dur10]\nRick Durrett. Probability: theory and examples. Cambridge Series in\nStatistical and Probabilistic Mathematics. Cambridge University Press,\nCambridge, fourth edition, 2010.\n[Ede61]\nMurray Eden. A two-dimensional growth process. In Proc. 4th Berkeley\nSympos. Math. Statist. and Prob., Vol. IV, pages 223-239. Univ. California\nPress, Berkeley, Calif., 1961.\n[GGN13]\nOri Gurel-Gurevich and Asaf Nachmias. Recurrence of planar graph limits.\nAnn. of Math. (2), 177(2):761-781, 2013. 1206.0707.\n[HK71]\nRaphael Høegh-Krohn. A general class of quantum fields without cut-offs\nin two space-time dimensions. Communications in Mathematical Physics,\n21(3):244-255, 1971.\n[HW65]\nJ. M. Hammersley and D. J. A. Welsh. First-passage percolation, sub-\nadditive processes, stochastic networks, and generalized renewal theory.\nIn Proc. Internat. Res. Semin., Statist. Lab., Univ. California, Berkeley,\nCalif, pages 61-110. Springer-Verlag, New York, 1965.\n[Jan97]\nSvante Janson. Gaussian Hilbert spaces, volume 129 of Cambridge Tracts\nin Mathematics. Cambridge University Press, Cambridge, 1997.\n[JLS12]\nDavid Jerison, Lionel Levine, and Scott Sheffield. Logarithmic fluctuations\nfor internal DLA. J. Amer. Math. Soc., 25(1):271-301, 2012. 1010.2483.\n[JLS13]\nDavid Jerison, Lionel Levine, and Scott Sheffield. Internal dla in higher\ndimensions. Electron. J. Probab, 18(98):1-14, 2013.\n[JLS+14]\nDavid Jerison, Lionel Levine, Scott Sheffield, et al. Internal dla and the\ngaussian free field. Duke Mathematical Journal, 163(2):267-308, 2014.\n[JS98]\nBenjamin Jacquard and Gilles Schaeffer. A bijective census of nonseparable\nplanar maps. J. Combin. Theory Ser. A, 83(1):1-20, 1998.\n\n[JVST12]\nFredrik Johansson Viklund, Alan Sola, and Amanda Turner. Scaling limits\nof anisotropic Hastings-Levitov clusters. volume 48, pages 235-257, 2012.\n0908.0086.\n[Kah85]\nJ-P Kahane. Le chaos multiplicatif. Comptes rendus de l'Acad emie des\nsciences. S erie 1, Math ematique, 301(6):329-332, 1985.\n[Ken00a]\nRichard Kenyon. The asymptotic determinant of the discrete laplacian.\nActa Mathematica, 185(2):239-286, 2000.\n[Ken00b]\nRichard Kenyon. Conformal invariance of domino tiling.\n28(2):759-795, 2000.\nAnn. Probab.,\n[Ken01]\nR. Kenyon. Dominos and the Gaussian free field. Annals of Probability,\n29:1128-1137, 2001.\n[Kes87]\nHarry Kesten. Hitting probabilities of random walks on Zd .\nProcess. Appl., 25(2):165-184, 1987.\nStochastic\n[KN04]\nWouter Kager and Bernard Nienhuis. A guide to stochastic l owner evolution\nand its applications. Journal of statistical physics, 115(5-6):1149-1229,\n2004.\n[KPZ86]\nMehran Kardar, Giorgio Parisi, and Yi-Cheng Zhang. Dynamic scaling of\ngrowing interfaces. Phys. Rev. Lett., 56:889-892, Mar 1986.\n[KPZ88]\nV. G. Knizhnik, A. M. Polyakov, and A. B. Zamolodchikov. Fractal\nstructure of 2D-quantum gravity. Modern Phys. Lett. A, 3(8):819-826,\n1988.\n[KS91]\nIoannis Karatzas and Steven E. Shreve. Brownian motion and stochastic\ncalculus, volume 113 of Graduate Texts in Mathematics. Springer-Verlag,\nNew York, second edition, 1991.\n[Lam67]\nJohn Lamperti. Continuous state branching processes. Bull. Amer. Math.\nSoc., 73:382-386, 1967.\n[Law09]\nG. Lawler. Conformal invariance and 2D statistical physics. Bull. AMS,\n46:25-54, 2009.\n[LBG92]\nGregory F. Lawler, Maury Bramson, and David Griffeath. Internal diffusion\nlimited aggregation. Ann. Probab., 20(4):2117-2140, 1992.\n[Le 14]\nJ.-F. Le Gall. Random geometry on the sphere. ArXiv e-prints, March\n2014.\n[LG13]\nJean-Fran cois Le Gall. Uniqueness and universality of the Brownian map.\nAnn. Probab., 41(4):2880-2960, 2013. 1105.4842.\n\n[LG14]\nJ.-F. Le Gall. The Brownian map: a universal limit for random planar\nmaps. In XVIIth International Congress on Mathematical Physics, pages\n420-428. World Sci. Publ., Hackensack, NJ, 2014.\n[LGLJ98]\nJean-Francois Le Gall and Yves Le Jan. Branching processes in L evy\nprocesses: the exploration process. Ann. Probab., 26(1):213-252, 1998.\n[LGM+12] Jean-Fran cois Le Gall, Gr egory Miermont, et al. Scaling limits of random\ntrees and planar maps. Probability and statistical physics in two and more\ndimensions, 15:155-211, 2012.\n[Lov71]\nC Lovelace. Pomeron form factors and dual regge cuts. Physics Letters B,\n34(6):500-506, 1971.\n[LR12]\nG. F. Lawler and M. A. Rezaei. Minkowski content and natural parame\nterization for the Schramm-Loewner evolution. ArXiv e-prints, November\n2012.\n[LS11]\nGregory F. Lawler and Scott Sheffield. A natural parametrization for\nthe Schramm-Loewner evolution. Ann. Probab., 39(5):1896-1937, 2011.\n0906.3804.\n[LSSW14]\nAsad Lodhia, Scott Sheffield, Xin Sun, and Samuel S Watson. Fractional\ngaussian fields: a survey. arXiv preprint arXiv:1407.5598, 2014.\n[LSW03]\nGregory Lawler, Oded Schramm, and Wendelin Werner. Conformal restric\ntion: the chordal case. J. Amer. Math. Soc., 16(4):917-955 (electronic),\n2003. math/0209343.\n[LSW04]\nGregory F. Lawler, Oded Schramm, and Wendelin Werner. Conformal\ninvariance of planar loop-erased random walks and uniform spanning trees.\nAnn. Probab., 32(1B):939-995, 2004. math/0112234.\n[LZ13]\nGregory F. Lawler and Wang Zhou. SLE curves and natural parametrization.\nAnn. Probab., 41(3A):1556-1584, 2013. 1006.4936.\n[MD86]\nPaul Meakin and JM Deutch. The formation of surfaces by diffusion limited\nannihilation. The Journal of chemical physics, 85:2320, 1986.\n[Mea86]\nPaul Meakin. Universality, nonuniversality, and the effects of anisotropy\non diffusion-limited aggregation. Physical Review A, 33(5):3371, 1986.\n[Mer94]\nRussell Merris. Laplacian matrices of graphs: a survey. Linear algebra and\nits applications, 197:143-176, 1994.\n[Mie13]\nGr egory Miermont. The Brownian map is the scaling limit of uniform\nrandom plane quadrangulations. Acta Math., 210(2):319-401, 2013.\n\n[Mil04]\nJohn Milnor. Pasting together Julia sets: a worked out example of mating.\nExperiment. Math., 13(1):55-92, 2004.\n[Mil06]\nJohn Milnor. Dynamics in one complex variable, volume 160 of Annals\nof Mathematics Studies. Princeton University Press, Princeton, NJ, third\nedition, 2006.\n[Mil10]\nJ. Miller. Universality for SLE(4). ArXiv e-prints, October 2010.\n[MM06]\nJean-Fran cois Marckert and Abdelkader Mokkadem. Limit of normalized\nquadrangulations: the Brownian map. Ann. Probab., 34(6):2144-2202,\n2006.\n[MP10]\nPeter M orters and Yuval Peres. Brownian motion. Cambridge Series in\nStatistical and Probabilistic Mathematics. Cambridge University Press,\nCambridge, 2010. With an appendix by Oded Schramm and Wendelin\nWerner.\n[MS12a]\nJ. Miller and S. Sheffield. Imaginary Geometry I: Interacting SLEs. ArXiv\ne-prints, January 2012.\n[MS12b]\nJ. Miller and S. Sheffield.\nImaginary geometry II: reversibility\nSLEκ(ρ1; ρ2) for κ ∈ (0, 4). ArXiv e-prints, January 2012.\nof\n[MS12c]\nJ. Miller and S. Sheffield. Imaginary geometry III: reversibility of SLEκ for\nκ ∈ (4, 8). ArXiv e-prints, January 2012.\n[MS13a]\nJ. Miller and S. Sheffield. Imaginary geometry IV: interior rays, whole-plane\nreversibility, and space-filling trees. ArXiv e-prints, February 2013.\n[MS13b]\nJ. Miller and S. Sheffield. Quantum Loewner Evolution. ArXiv e-prints,\nDecember 2013.\n[MS15a]\nJ. Miller and S. Sheffield. An axiomatic characterization of the Brownian\nmap. ArXiv e-prints, June 2015.\n[MS15b]\nJ. Miller and S. Sheffield. Liouville quantum gravity and the Brownian\nmap I: The QLE(8/3,0) metric. ArXiv e-prints, July 2015.\n[MS15c]\nJason Miller and Scott Sheffield. Liouville quantum gravity and the Brown\nian map II: geodesics and continuity of the embedding. 2015. In preparation.\n[MS15d]\nJason Miller and Scott Sheffield. Liouville quantum gravity and the Brow\nnian map III: the conformal structure is determined. 2015. In preparation.\n[Mul67]\nR. C. Mullin. On the enumeration of tree-rooted maps. Canad. J. Math.,\n19:174-183, 1967.\n\n[Pol81]\nA. M. Polyakov. Quantum geometry of bosonic strings. Phys. Lett. B,\n103(3):207-210, 1981.\n[Pol08]\nA. M. Polyakov. From Quarks to Strings. ArXiv e-prints, November 2008.\n[PW98]\nJames Gary Propp and David Bruce Wilson. How to get a perfectly random\nsample from a generic markov chain and generate a random spanning tree\nof a directed graph. Journal of Algorithms, 27(2):170-217, 1998.\n[RV08]\nR. Rhodes and V. Vargas. KPZ formula for log-infinitely divisible multi-\nfractal random measures. ArXiv e-prints:0807.1036, 2008. To appear in\nESAIM P&S.\n[RV14]\nR emi Rhodes and Vincent Vargas. Gaussian multiplicative chaos and\napplications: a review. Probab. Surv., 11:315-392, 2014. 1305.6221.\n[RY99]\nDaniel Revuz and Marc Yor. Continuous martingales and Brownian motion,\nvolume 293 of Grundlehren der Mathematischen Wissenschaften [Funda\nmental Principles of Mathematical Sciences]. Springer-Verlag, Berlin, third\nedition, 1999.\n[Sat99]\nKen-iti Sato. L evy processes and infinitely divisible distributions, volume 68\nof Cambridge Studies in Advanced Mathematics. Cambridge University\nPress, Cambridge, 1999. Translated from the 1990 Japanese original,\nRevised by the author.\n[Sch99]\nGilles Schaeffer. Random sampling of large planar maps and convex\npolyhedra. In Annual ACM Symposium on Theory of Computing (Atlanta,\nGA, 1999), pages 760-769 (electronic). ACM, New York, 1999.\n[Sch00]\nOded Schramm. Scaling limits of loop-erased random walks and uniform\nspanning trees. Israel J. Math., 118:221-288, 2000. math/9904022.\n[She07]\nScott Sheffield. Gaussian free fields for mathematicians. Probab. Theory\nRelated Fields, 139(3-4):521-541, 2007. math/0312099.\n[She09]\nScott Sheffield. Exploration trees and conformal loop ensembles.\nMath. J., 147(1):79-129, 2009. math/0609167.\nDuke\n[She10]\nS. Sheffield. Conformal weldings of random surfaces: SLE and the quantum\ngravity zipper. ArXiv e-prints, December 2010.\n[She11]\nS. Sheffield. Quantum gravity and inventory accumulation. ArXiv e-prints,\nAugust 2011.\n[Shi85]\nMichio Shimura. Excursions in a cone for two-dimensional Brownian motion.\nJ. Math. Kyoto Univ., 25(3):433-443, 1985.\n\n[Smi01]\nStanislav Smirnov. Critical percolation in the plane: conformal invariance,\nCardy's formula, scaling limits. C. R. Acad. Sci. Paris S er. I Math.,\n333(3):239-244, 2001.\n[SS05]\nOded Schramm and Scott Sheffield. Harmonic explorer and its convergence\nto SLE4. Ann. Probab., 33(6):2127-2148, 2005.\n[SS09]\nOded Schramm and Scott Sheffield. Contour lines of the two-dimensional\ndiscrete Gaussian free field. Acta Math., 202(1):21-137, 2009.\n[SS13]\nOded Schramm and Scott Sheffield. A contour line of the continuum\nGaussian free field. Probab. Theory Related Fields, 157(1-2):47-80, 2013.\n1008.2447.\n[SW12]\nScott Sheffield and Wendelin Werner. Conformal loop ensembles: the\nMarkovian characterization and the loop-soup construction. Ann. of Math.\n(2), 176(3):1827-1917, 2012. 1006.2374.\n[Tut62]\nW. T. Tutte. A census of planar triangulations. Canad. J. Math., 14:21-38,\n1962.\n[Tut68]\nW. T. Tutte. On the enumeration of planar maps. Bull. Amer. Math. Soc.,\n74:64-74, 1968.\n[Wat93]\nYoshiyuki Watabiki. Analytic study of fractal structure of quantized\nsurface in two-dimensional quantum gravity. Progr. Theoret. Phys. Suppl.,\n(114):1-17, 1993. Quantum gravity (Kyoto, 1992).\n[Wer03]\nWendelin Werner. Random planar curves and schramm-loewner evolutions.\narXiv preprint math/0303354, 2003.\n[Wil96]\nDavid Bruce Wilson. Generating random spanning trees fmore quickly\nthan the cover time. In Proceedings of the twenty-eighth annual ACM\nsymposium on Theory of computing, pages 296-303. ACM, 1996.\n[WJS81]\nTA Witten Jr and Leonard M Sander. Diffusion-limited aggregation, a\nkinetic critical phenomenon. Physical review letters, 47(19):1400, 1981.\n[WS83]\nT. A. Witten and L. M. Sander. Diffusion-limited aggregation. Phys. Rev.\nB (3), 27(9):5686-5697, 1983.\nDepartment of Mathematics\nMassachusetts Institute of Technology\nCambridge, MA, USA\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.177 Universal Random Structures in 2D\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Universal random structures in 2D",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-177-universal-random-structures-in-2d-fall-2015/bbe0bf635099428fb0a1d6265c3273f8_MIT18_177F15_Intro.pdf",
      "content": "Universal random structures in 2D\nIntroduction to 18.177, Fall 2015\nScott Sheffield\nMassachusetts Institute of Technology\nSeptember 15, 2015\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n1 / 67\n\nTHE NUMBERS\n24 lectures (after this one)\n3 problem sets (to be assigned)\n1 written project (research or expository) of about\n5 pages per student, collaboration allowed\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n2 / 67\n\nTHE GOALS\nIntroduce some fundamental objects\nExplain how they are related to each other\nExplore some open problems\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n3 / 67\n\nTHE GOAL TODAY\nColloquium-style overview of\nmajor objects and relationships\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n4 / 67\n\nOverview\nPrologue:\n1. Universality: physics intuition, examples\n2. Discrete-continuum interplay: scaling limits, discretizations\n3. Fractals and complex dynamics: Julia sets, fractal dimensions, Mandelbrot, etc.\nPart I: Cast of Characters: What are the most fundamental 2D random objects?\n1. Universal random trees: Brownian motion, continuum random tree\n2. Universal random surfaces: quantum gravity, planar maps, string theory, CFT\n3. Universal random paths: walks, interfaces, Schramm-Loewner evolution, CFT\n4. Universal random growth: Eden model, DLA, DBM\nPart II: Drama: How are the characters related to each other?\n1. Welding random surfaces: a calculus of random surfaces and SLE seams\n2. Mating random trees: tree plus tree (conformally mated) equals surface plus path\n3. Random growth on random surfaces: dendrites, dragons, surprising tractability\n4. Mating random trees produced by a snake: metric spaces and the Brownian map\n5. Two \"universal random surfaces\" are the same: Brownian map equals Liouville\nr\nquantum gravity with parameter γ =\n8/3 (a.k.a. \"pure quantum gravity\").\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n5 / 67\n\nPROLOGUE:\nUNIVERSALITY\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n6 / 67\n\nUniversality in physics (per Wikipedia)\nIn statistical mechanics, universality is the observation that there are properties\nfor a large class of systems that are independent of the dynamical details of the\nsystem. Systems display universality in a scaling limit, when a large number of\ninteracting parts come together. The modern meaning of the term was introduced\nby Leo Kadanoff in the 1960s, but a simpler version of the concept was already\nimplicit in the van der Waals equation and in the earlier Landau theory of phase\ntransitions, which did not incorporate scaling correctly. The term is slowly gaining\na broader usage in several fields of mathematics, including combinatorics and\nprobability theory, whenever the quantitative features of a structure (such as\nasymptotic behaviour) can be deduced from a few global parameters appearing in\nthe definition, without requiring knowledge of the details of the system. The\nrenormalization group explains universality. It classifies operators in a statistical\nfield theory into relevant and irrelevant. Relevant operators are those responsible\nfor perturbations to the free energy, the imaginary time Lagrangian, that will affect\nthe continuum limit, and can be seen at long distances. Irrelevant operators are\nthose that only change the short-distance details. The collection of scale-invariant\nstatistical theories define the universality classes, and the finite-dimensional list\nof coefficients of relevant operators parametrize the near critical behavior.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n7 / 67\n\nStories\nI Physicists tell us that empirically many phenomena (such as phase transition\nexponents) are surprisingly similar from one material to another. Different\nmicroscopic setup, same \"universality class.\"\nI Sometimes simple toy mathematical models (percolation, Ising model, etc.)\nare said to belong to the same universality class as real world statistical\nphysical systems.\nI Mathematical physics game: try to identify the very simplest members of a\ngiven universality class and prove theorems about them. Maybe try tweaking\nthe model and proving the theorems are still true.\nI Example: Gaussian random variables (central limit theorem).\nI Example: Brownian motion.\nI Example: Brownian motion outer boundary (Mandelbrot 1982; Lawler,\nSchramm, Werner 2000).\nI Example: percolation (Cardy 1992; Smirnov 2001).\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n8 / 67\n\nPROLOGUE:\nDISCRETE-CONTINUUM\nINTERPLAY\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n10 / 67\n\nI\nI\nI\nI\nI\nI\nI\nI\nDiscrete world vs. continuum world: more stories\nStatistical physics: argue that your (simple) continuum theory approximates\nyour (not so simple) atomic model when the number of atoms is very large.\nParticle physics: argue that your (well defined) discrete lattice models\napproximate your (maybe complicated, maybe ill defined) continuum field\ntheory when the lattice is very fine.\nOne mathematical goal: develop continuum theories to help you\nunderstand scaling limits of beloved discrete models.\nAnother mathematical goal: develop discrete approximations to help you\nunderstand beloved continuum theories (like Navier-Stokes and Yang-Mills).\nInterplay between the discrete and continuum is at the heart of many fields\nwithin physics and mathematics.\nMathematically rigorous connections between discrete and continuum are\nsometimes hard to prove, which leads to....\nNon-rigorous approach: (common in physics) just assume you can pass\nfrom discrete to continuum and back whenever you need to. Then check\nwhether end result seems to match experiments or simulations.\nConformal symmetry: plays special role in 2D, following work by Belavin,\nPolyakov, Zamolodchikov and others in 1980's.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n11 / 67\n▶\n▶\n▶\n▶\n▶\n▶\n▶\n▶\n\nPROLOGUE:\nNON-RANDOM FRACTALS\nFROM COMPLEX DYNAMICS\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n12 / 67\n\nI\nI\nI\nI\nI\nI\nI\nFRACTALS FROM COMPLEX DYNAMICS\nPublished 1989, by Roger T. Stevens\nJulia sets (Julia, 1918), popularized in 1980's\nConsider map φ(z) = z 2 .\nMaps C \\ D conformally to self (2 to 1) where\nD is unit disc. Repeated iteration takes points\nin C \\ D to inf, leaves others bounded.\nIf K is another compact set with connected\nhull, can construct a similar (2 to 1) conformal\nmap φK from C \\ K to itself.\nMight expect more intricate sets K to yield\nmore intricate maps. But suppose we take\nφK (z) = z 2 + c and let K be set of points\nremaining bounded under repeated iteration.\nK is a (filled) Julia set. Can \"mate\" Julia sets\nto form sphere (Douady 1983, Milnor 1994, see\nArnaud Ch eritat's animations).\nPopular lexicon: chaos theory, butterly effect,\nfractal, self-similar. What about random\nfractals, only self similar in law?\nScott Sheffield (MIT)\nUniversal structure\n▶\n▶\n▶\n▶\n▶\n▶\n(c) M & T Books. All rights reserved. This content is excluded\nfrom our Creative Commons license. For more information,\n▶\nsee http://ocw.mit.edu/help/faq-fair-use/.\n\nPart I:\nCAST OF CHARACTERS\nA Trees\nB Simple curves, non-simple\ncurves, space-filling curves\nC Surfaces\nD Growth\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n15 / 67\n\nI\nI\nI\nI\nI\nRANDOM TREES\nt\nXt\nThis is the easiest \"universal\" random fractal to explain.\nAldous (1993) constructs continuum random tree (CRT) from a Brownian\nexcursion. To produce tree, start with graph of Brownian excursion and then\nidentify points connected by horizontal line segment that lies below graph except at\nendpoints. Result is a random matric space.\nDiscrete analog: Consider a tree embedded in the plane with n edges and a\ndistinguished root. As one traces the outer boundary of the tree clockwise, distance\nfrom root performs a simple walk on Z+ with 2n steps, starting and ending at 0.\nSimple bijection between rooted planar trees and walks of this type.\nCRT is in some sense the \"uniformly random planar tree\" of a given size.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n16 / 67\n▶\n▶\n▶\n▶\n▶\n\nRANDOM PATHS\nGiven a simply connected planar domain D with boundary points a and b and a\nparameter κ ∈ [0, inf), the Schramm-Loewner evolution SLEκ is a random\nnon-self-crossing path in D from a to b.\nb\na\nη\nD\nThe parameter κ roughly indicates how \"windy\" the path is. Would like to argue\nthat SLE is in some sense the \"canonical\" random non-self-crossing path. What\nsymmetries characterize SLE?\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n17 / 67\n\nConformal Markov property of SLE\nb\na\nη\nD\nφ\nD\nφ *η\nφ(a)\nφ(b)\n\nIf φ conformally maps D to D and η is an SLEκ from a to b in D, then φ * η is an\n\nSLEκ from φ(a) to φ(b) in D.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n18 / 67\n\nMarkov Property\nb\na\nη\nD\nb\nD\nGiven η up to a\nstopping time t...\nlaw of remainder is SLE in\nD \\ η[0, t] from η(t) to b.\nη(t)\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n19 / 67\n\nI\nI\nChordal Schramm-Loewner evolution (SLE)\nTHEOREM [Oded Schramm]: Conformal invariance and the Markov\nproperty completely determine the law of SLE, up to a single parameter\nwhich we denote by κ ≥ 0.\nExplicit construction: An SLE path γ from 0 to inf in the complex upper\nhalf plane H can be defined in an interesting way: given path γ one can\nconstruct conformal maps gt : H \\ γ([0, t]) → H (normalized to look like\nidentity near infinity, i.e., limz→inf gt (z) - z = 0). In SLEκ, one defines gt via\nan ODE (which makes sense for each fixed z):\n∂t gt (z) =\n,\ng0(z) = z,\ngt (z) - Wt\n√\nwhere Wt =\nκBt = LAW Bκt and Bt is ordinary Brownian motion.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n20 / 67\n▶\n▶\n\nSLE phases [Rohde, Schramm]\nκ ≤4\nκ ∈(4, 8)\nκ ≥8\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n21 / 67\n\nI\nI\nI\nI\nI\nRadial Schramm-Loewner evolution (SLE)\nIn radial SLE path grows from boundary of domain to center.\nModified version allow growth from multiple boundary points (or a\ncontinuum of points) at once.\nThis will be important when we think about continuum growth models.\n√\nξt +gt (z)\ni κBt\nRadial SLE: ∂t gt (z) = gt (z)\nwhere ξt = e\n.\nξt -gt (z)\n\nRadial measure-driven Loewner evolution: ∂t gt (z)=\ngt (z) x+gt (z) dmt (x)\nx-gt (z)\nwhere, for each g, mt is a measure on the complex unit circle.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n22 / 67\n▶\n▶\n▶\n▶\n▶\n\nContinuum space-filling path\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n23 / 67\n\nRANDOM SURFACES\nStart out with a sheet of paper\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n25 / 67\n\nRANDOM SURFACES\nP\nE\nN\nGet out pen and ruler\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n25 / 67\n\nRANDOM SURFACES\nP\nE\nN\nMeasure and mark squares squares of equal size\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n25 / 67\n\nRANDOM SURFACES\nGet out scissors\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n25 / 67\n\nRANDOM SURFACES\nCut into squares\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n25 / 67\n\nRANDOM SURFACES\nGLUE\nGet out bottle of glue\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n25 / 67\n\nRANDOM SURFACES\nGLUE\nAttach squares along boundaries with glue to form a surface \"without holes.\"\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n25 / 67\n\nRandom quadrangulation\n(Simulation due to J.F. Marckert)\n1. First studied by Tutte in 1960s while working\non the four color theorem.\n2. Many variants (triangulations,\nquadrangulations, etc.) Some come equipped\nwith extra statistical physics structure (a\ndistinguished spanning tree, a general\ndistinguished edge subset, a \"spin\" function on\nvertices, etc.)\n3. Can be interpreted as Riemannian manifolds\nwith conical singularities.\n4. Converges in law in Gromov-Hausdorff sense to\nrandom metric space called Brownian map,\nhomeomorphic to the 2-sphere, Hausdorff\ndimension 4 (established in several works by\nsubsets of Chaissang, Schaefer, Le Gall, Paulin,\nMiermont)\n5. Important tool: Bijections encoding surface via\npair of trees.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n28 / 67\nImage removed due to copyright restrictions. See\nhttp://www.labri.fr/perso/marckert/simulations.html.\n\nRandom quadrangulation\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n29 / 67\n\nRed tree\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n29 / 67\n\nRed and blue trees\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n29 / 67\n\nRed and blue trees alone do not determine the map structure\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n29 / 67\n\nRandom quadrangulation with red and blue trees\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n29 / 67\n\nPath snaking between the trees. Encodes the trees and how they are glued together.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n29 / 67\n\nHow was the graph embedded into R2?\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n29 / 67\n\nCan subivide each quadrilateral to obtain a triangulation without multiple edges.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n29 / 67\n\nCircle pack the resulting triangulation.\nPacked with Stephenson's CirclePack.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n29 / 67\n\nCircle pack the resulting triangulation.\nPacked with Stephenson's CirclePack.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n29 / 67\n\nCircle pack the resulting triangulation.\nPacked with Stephenson's CirclePack.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n29 / 67\n\nWhat is the \"limit\" of this embedding? Circle packings are related to conformal maps.\nPacked with Stephenson's CirclePack.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n29 / 67\n\nConformal maps (from David Gu's web gallery)\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n30 / 67\n\nPicking a surface at random in the continuum\nUniformization theorem: every simply connected Riemannian surface can be\nconformally mapped to either the unit disk, the plane, or the sphere S2 in R3\nψ\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n31 / 67\n\nI\nI\nPicking a surface at random in the continuum\nUniformization theorem: every simply connected Riemannian surface can be\nconformally mapped to either the unit disk, the plane, or the sphere S2 in R3\nψ\nA\nψ(A)\nIsothermal coordinates: Metric for the surface takes the form e ρ(z)dz for some smooth\nfunction ρ where dz is the Euclidean metric.\n⇒ Can parameterize the space of surfaces with smooth functions.\nIf ρ = 0, get the same surface\nIf Δρ = 0, i.e. if ρ is harmonic, the surface described is flat\nQuestion: Which measure on ρ? If we want our surface to be a perturbation of a flat\nmetric, natural to choose ρ as the canonical perturbation of a harmonic function.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n31 / 67\n▶\n▶\n\nI\nI\nI\nI\nI\nThe Gaussian free field\nThe discrete Gaussian free field (DGFF) is a\nGaussian random surface model.\nMeasure on functions h : D → R for D ⊆ Z2 and\nh|∂D = ψ with density respect to Lebesgue\nmeasure on R|D|:\n\n1 exp\n- 1\n(h(x) - h(y))2\nZ\n2 x∼y\nNatural perturbation of a harmonic function\nFine mesh limit: converges to the continuum GFF,\ni.e. the standard Gaussian wrt the Dirichlet inner\nproduct\n\n(f , g)v =\nVf (x) · Vg(x)dx.\n2π\nContinuum GFF not a function -- only a\ngeneralized function\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n32 / 67\n▶\n▶\n▶\n▶\n▶\n\nLiouville quantum gravity\nγ = 0.5\nLiouville quantum gravity: e γh(z)dz\nwhere h is a GFF and γ ∈ [0, 2)\nRandom surface model: Polyakov,\n1980. Motivated by string theory.\nRigorous construction of measure:\n√\nHøegh-Krohn, 1971, γ ∈ [0, 2).\nKahane, 1985, γ ∈ [0, 2).\nDoes not make literal sense since h\ntakes values in the space of\ndistributions.\nCan make sense of random area\nmeasure using a regularization\nprocedure.\n(Number of subdivisions)\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n33 / 67\n▶\n▶\n▶\n▶\n▶\n\nLiouville quantum gravity\nγ = 1.0\nLiouville quantum gravity: e γh(z)dz\nwhere h is a GFF and γ ∈ [0, 2)\nRandom surface model: Polyakov,\n1980. Motivated by string theory.\nRigorous construction of measure:\n√\nHøegh-Krohn, 1971, γ ∈ [0, 2).\nKahane, 1985, γ ∈ [0, 2).\nDoes not make literal sense since h\ntakes values in the space of\ndistributions.\nCan make sense of random area\nmeasure using a regularization\nprocedure.\nAreas of regions and lengths of curves\nare well defined.\n(Number of subdivisions)\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n33 / 67\n▶\n▶\n▶\n▶\n▶\n▶\n\nLiouville quantum gravity\nγ = 1.5\nLiouville quantum gravity: e γh(z)dz\nwhere h is a GFF and γ ∈ [0, 2)\nRandom surface model: Polyakov,\n1980. Motivated by string theory.\nRigorous construction of measure:\n√\nHøegh-Krohn, 1971, γ ∈ [0, 2).\nKahane, 1985, γ ∈ [0, 2).\nDoes not make literal sense since h\ntakes values in the space of\ndistributions.\nCan make sense of random area\nmeasure using a regularization\nprocedure.\nAreas of regions and lengths of curves\nare well defined.\n(Number of subdivisions)\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n33 / 67\n▶\n▶\n▶\n▶\n▶\n▶\n\nLiouville quantum gravity\nγ = 2.0\nLiouville quantum gravity: e γh(z)dz\nwhere h is a GFF and γ ∈ [0, 2)\nRandom surface model: Polyakov,\n1980. Motivated by string theory.\nRigorous construction of measure:\n√\nHøegh-Krohn, 1971, γ ∈ [0, 2).\nKahane, 1985, γ ∈ [0, 2).\nDoes not make literal sense since h\ntakes values in the space of\ndistributions.\nCan make sense of random area\nmeasure using a regularization\nprocedure.\nAreas of regions and lengths of curves\nare well defined.\n(Number of subdivisions)\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n33 / 67\n▶\n▶\n▶\n▶\n▶\n▶\n\nRANDOM GROWTH\nFPP/Eden model growth, introduced by\nEden (1961) and Hammersley and Welsh\n(1965)\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n34 / 67\n▶\n\nI\nI\nRANDOM GROWTH\nFPP/Eden model growth, introduced by\nEden (1961) and Hammersley and Welsh\n(1965)\nAssociate with a graph (V , E ) i.i.d. exp(1)\nedge weights\n0.75\n1.36\n4.61\n0.32\n0.16\n1.27\n1.84\n0.47\n0.42\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n34 / 67\n▶\n▶\n\nI\nI\nI\nRANDOM GROWTH\nFPP/Eden model growth, introduced by\nEden (1961) and Hammersley and Welsh\n(1965)\nAssociate with a graph (V , E ) i.i.d. exp(1)\nedge weights\nConsider case that graph is Z2 .\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n34 / 67\n▶\n▶\n▶\n\nI\nI\nI\nI\nRANDOM GROWTH\nFPP/Eden model growth, introduced by\nEden (1961) and Hammersley and Welsh\n(1965)\nAssociate with a graph (V , E ) i.i.d. exp(1)\nedge weights\nConsider case that graph is Z2 .\nQuestion: Large scale behavior of shape of\nball wrt perturbed metric?\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n34 / 67\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nI\nI\nI\nRANDOM GROWTH\nFPP/Eden model growth, introduced by\nEden (1961) and Hammersley and Welsh\n(1965)\nAssociate with a graph (V , E ) i.i.d. exp(1)\nedge weights\nConsider case that graph is Z2 .\nQuestion: Large scale behavior of shape of\nball wrt perturbed metric?\nCox and Durrett (1981) showed that the\nmacroscopic shape is convex\nComputer simulations show that it is not a\nEuclidean disk\nZ2 is not isotropic enough\nVahidi-Asl and Weirmann (1990) showed\nthat the rescaled ball converges to a disk if\nZ2 is replaced by the Voronoi tesselation\nassociated with a Poisson process\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n34 / 67\n▶\n▶\n▶\n▶\n▶\n▶\n▶\n▶\n\nMarkovian formulation\nEden exploration\nC0\nSample the cluster Cn+1 from Cn by selecting an edge uniformly at random on ∂Cn, and\nthen adding the vertex which is attached to it. VARIANT: Choose locations from\nharmonic measure (DLA) or harmonic measure to η power (η-DBM).\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n35 / 67\n\nMarkovian formulation\nEden exploration\nC1\nSample the cluster Cn+1 from Cn by selecting an edge uniformly at random on ∂Cn, and\nthen adding the vertex which is attached to it. VARIANT: Choose locations from\nharmonic measure (DLA) or harmonic measure to η power (η-DBM).\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n35 / 67\n\nMarkovian formulation\nEden exploration\nC2\nSample the cluster Cn+1 from Cn by selecting an edge uniformly at random on ∂Cn, and\nthen adding the vertex which is attached to it. VARIANT: Choose locations from\nharmonic measure (DLA) or harmonic measure to η power (η-DBM).\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n35 / 67\n\nMarkovian formulation\nEden exploration\nC3\nSample the cluster Cn+1 from Cn by selecting an edge uniformly at random on ∂Cn, and\nthen adding the vertex which is attached to it. VARIANT: Choose locations from\nharmonic measure (DLA) or harmonic measure to η power (η-DBM).\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n35 / 67\n\nMarkovian formulation\nEden exploration\nC4\nSample the cluster Cn+1 from Cn by selecting an edge uniformly at random on ∂Cn, and\nthen adding the vertex which is attached to it. VARIANT: Choose locations from\nharmonic measure (DLA) or harmonic measure to η power (η-DBM).\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n35 / 67\n\nMarkovian formulation\nEden exploration\nC5\nSample the cluster Cn+1 from Cn by selecting an edge uniformly at random on ∂Cn, and\nthen adding the vertex which is attached to it. VARIANT: Choose locations from\nharmonic measure (DLA) or harmonic measure to η power (η-DBM).\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n35 / 67\n\nMarkovian formulation\nEden exploration\nC6\nSample the cluster Cn+1 from Cn by selecting an edge uniformly at random on ∂Cn, and\nthen adding the vertex which is attached to it. VARIANT: Choose locations from\nharmonic measure (DLA) or harmonic measure to η power (η-DBM).\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n35 / 67\n\nMarkovian formulation\nEden exploration\nC7\nSample the cluster Cn+1 from Cn by selecting an edge uniformly at random on ∂Cn, and\nthen adding the vertex which is attached to it. VARIANT: Choose locations from\nharmonic measure (DLA) or harmonic measure to η power (η-DBM).\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n35 / 67\n\nMarkovian formulation\nEden exploration\nC8\nSample the cluster Cn+1 from Cn by selecting an edge uniformly at random on ∂Cn, and\nthen adding the vertex which is attached to it. VARIANT: Choose locations from\nharmonic measure (DLA) or harmonic measure to η power (η-DBM).\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n35 / 67\n\nMarkovian formulation\nEden exploration\nC9\nSample the cluster Cn+1 from Cn by selecting an edge uniformly at random on ∂Cn, and\nthen adding the vertex which is attached to it. VARIANT: Choose locations from\nharmonic measure (DLA) or harmonic measure to η power (η-DBM).\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n35 / 67\n\nMarkovian formulation\nEden exploration\nC10\nSample the cluster Cn+1 from Cn by selecting an edge uniformly at random on ∂Cn, and\nthen adding the vertex which is attached to it. VARIANT: Choose locations from\nharmonic measure (DLA) or harmonic measure to η power (η-DBM).\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n35 / 67\n\nMarkovian formulation\nEden exploration\nC11\nSample the cluster Cn+1 from Cn by selecting an edge uniformly at random on ∂Cn, and\nthen adding the vertex which is attached to it. VARIANT: Choose locations from\nharmonic measure (DLA) or harmonic measure to η power (η-DBM).\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n35 / 67\n\nMarkovian formulation\nEden exploration\nC12\nSample the cluster Cn+1 from Cn by selecting an edge uniformly at random on ∂Cn, and\nthen adding the vertex which is attached to it. VARIANT: Choose locations from\nharmonic measure (DLA) or harmonic measure to η power (η-DBM).\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n35 / 67\n\nEuclidean Diffusion Limited Aggregation (DLA) introduced by Witten-Sander 1981.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n36 / 67\n\nDLA in nature: \"A DLA cluster grown from a copper sulfate solution in an electrodeposition\ncell\" (from Wikipedia)\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n37 / 67\n\nDLA in nature: Magnese oxide patterns on the surface of a rock. (Halsey, Physics Today 2000)\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n38 / 67\n\nDLA in nature: Magnese oxide patterns on the surface of a rock.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n39 / 67\n\nDLA in art: \"High-voltage dielectric breakdown within a block of plexiglas\" (from Wikipedia)\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n40 / 67\n\nDLA in physics\nIntroduced by Witten and Sander in 1981 as a model for crystal growth. (Mineral\ndeposits, Hele-Shaw flow, electrodeposition, lichen growth, lightning paths, coral, etc.)\nAn active area of research in physics for the last 33 years:\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n41 / 67\n\nI\nI\nI\nI\nI\nDLA in math?\nNot a lot of progress. (A related process called internal DLA is mathematically\nmuch more well understood.) Expected that (as with Eden model) lattice versions\nmay have anisotropic features in limit.\nOpen questions\nDoes DLA have a \"scaling limit\"?\nIs the shape random at large scales?\nDoes the macroscopic shape look like a tree?\nWhat is its asymptotic dimension? Simulation prediction: ≈ 1.71 on Z2\nIs there a universal isotropic continuum analog of DLA?\nWhat about DLA on random planar maps and Liouville quantum gravity surfaces?\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n42 / 67\n▶\n▶\n▶\n▶\n▶\n\nPart II:\nDRAMA\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n43 / 67\n\nSTORY A:\nSURFACE PLUS SURFACE =\nSURFACE PLUS CURVE\nindependence on both sides\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n44 / 67\n\nI\nI\nI\nWELDING RANDOM SURFACES\nCan \"weld\" and \"slice\" special quantum surfaces called quantum wedges (with \"weight\"\nparameters indicating thickness) to obtain wedges (with other weights).\nWeight parameter W = γ(γ + γ\n2 - α) is additive under the welding operation.\nInterface between welding of independent wedges W1, W2 of weight W1 and W2 is\nan SLEκ(W1 - 2; W2 - 2) on combined surface.\nGlue canonical random surfaces, seam becomes canonical random path.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n45 / 67\n▶\n▶\n▶\n\nSTORY B:\nTREE PLUS TREE =\nSURFACE PLUS\nSPACE-FILLING CURVE\nLHS independent or correlated,\nRHS independent\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n46 / 67\n\nMATING RANDOM TREES\nX , Y independent Brownian excursions on [0, 1]. Pick C > 0 large so that the graphs of\nX and C - Y are disjoint.\nt\nXt\nC-Yt\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n47 / 67\n\nI\nMATING RANDOM TREES\nX , Y independent Brownian excursions on [0, 1]. Pick C > 0 large so that the graphs of\nX and C - Y are disjoint.\nt\nXt\nC-Yt\nIdentify points on the graph of X if they are connected by a horizontal line which is\nbelow the graph; yields a continuum random tree (CRT)\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n47 / 67\n▶\n\nI\nI\nMATING RANDOM TREES\nX , Y independent Brownian excursions on [0, 1]. Pick C > 0 large so that the graphs of\nX and C - Y are disjoint.\nt\nXt\nC-Yt\nIdentify points on the graph of X if they are connected by a horizontal line which is\nbelow the graph; yields a continuum random tree (CRT)\nSame for C - Yt yields an independent CRT\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n47 / 67\n▶\n▶\n\nI\nI\nI\nMATING RANDOM TREES\nX , Y independent Brownian excursions on [0, 1]. Pick C > 0 large so that the graphs of\nX and C - Y are disjoint.\nt\nXt\nC-Yt\nIdentify points on the graph of X if they are connected by a horizontal line which is\nbelow the graph; yields a continuum random tree (CRT)\nSame for C - Yt yields an independent CRT\nGlue the CRTs together by declaring points on the vertical lines to be equivalent\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n47 / 67\n▶\n▶\n▶\n\nI\nI\nI\nMATING RANDOM TREES\nX , Y independent Brownian excursions on [0, 1]. Pick C > 0 large so that the graphs of\nX and C - Y are disjoint.\nt\nXt\nC-Yt\nIdentify points on the graph of X if they are connected by a horizontal line which is\nbelow the graph; yields a continuum random tree (CRT)\nSame for C - Yt yields an independent CRT\nGlue the CRTs together by declaring points on the vertical lines to be equivalent\nQ: What is the resulting structure?\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n47 / 67\n▶\n▶\n▶\n\nI\nI\nI\nMATING RANDOM TREES\nX , Y independent Brownian excursions on [0, 1]. Pick C > 0 large so that the graphs of\nX and C - Y are disjoint.\nt\nXt\nC-Yt\nIdentify points on the graph of X if they are connected by a horizontal line which is\nbelow the graph; yields a continuum random tree (CRT)\nSame for C - Yt yields an independent CRT\nGlue the CRTs together by declaring points on the vertical lines to be equivalent\nQ: What is the resulting structure? A: Sphere with a space-filling path.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n47 / 67\n▶\n▶\n▶\n\nI\nI\nI\nMATING RANDOM TREES\nX , Y independent Brownian excursions on [0, 1]. Pick C > 0 large so that the graphs of\nX and C - Y are disjoint.\nt\nXt\nC-Yt\nIdentify points on the graph of X if they are connected by a horizontal line which is\nbelow the graph; yields a continuum random tree (CRT)\nSame for C - Yt yields an independent CRT\nGlue the CRTs together by declaring points on the vertical lines to be equivalent\nQ: What is the resulting structure? A: Sphere with a space-filling path. A peanosphere.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n47 / 67\n▶\n▶\n▶\n\nI\nSurface is topologically a sphere by Moore's theorem\nTheorem (Moore 1925)\nLet ∼be any topologically closed equivalence relation on the sphere S2 . Assume\n=\nthat each equivalence class is connected and not equal to all of S2 . Then the\nquotient space S2/ ∼is homeomorphic to S2 if and only if no equivalence class\n=\nseparates the sphere into two or more connected components.\nAn equivalence relation is topologically closed iff for any two sequences (xn)\nand (yn) with\n∼\nI xn = yn for all n\nI xn → x and yn → y\n∼\nwe have that x = y.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n48 / 67\n▶\n▶\n\nSTORY C:\nSURFACE TREE PLUS\nSURFACE TREE =\nSURFACE PLUS\nSELF-HITTING CURVE\nindependence on both sides\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n49 / 67\n\nGluing independent L evy trees\nf\nCan view SLEκf process, κ' ∈ (4, 8) as a gluing of two κ\n4 -stable L evy trees.\nt\nXt\nC-Yt\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n50 / 67\n\nGluing independent L evy trees\nCan view SLEκf process, κ ' ∈ (4, 8) as a gluing of two κ\nf -stable L evy trees.\nt\nXt\nC-Yt\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n50 / 67\n\nGluing independent L evy trees\nCan view SLEκf process, κ ' ∈ (4, 8) as a gluing of two κ\nf -stable L evy trees.\nt\nXt\nC-Yt\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n50 / 67\n\nI\nI\nI\nGluing independent L evy trees\nCan view SLEκf process, κ ' ∈ (4, 8) as a gluing of two κ\nf -stable L evy trees.\nt\nXt\nC-Yt\nThe two trees of quantum disks almost surely determine both the SLEκf and the\nLQG surface on which it is drawn\nCan convert questions about SLEκf into questions about κ\nf -stable processes.\nScaling limit of \"exploration path\" on random planar map should be SLE6 on a\nr\n8/3-LQG. Using welding machinery, we can understand well the \"bubbles\" cut\nout by such an exploration process. We can understand conditional law of\nunexplored region given what we have seen.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n50 / 67\n▶\n▶\n▶\n\nSTORY D:\nGROWTH ON SURFACE =\n\"RESHUFFLED\" CURVE\nON SURFACE\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n51 / 67\n\nI\nI\nI\nI\nI\nRANDOM GROWTH ON RANDOM SURFACES\nCan we make sense of η-DBM on a γ-LQG? We have shown how to tile an\nLQG surface with diadic squares of \"about the same size\" so we could run a\nDLA on this set of squares and try to take a fine mesh limit.\nOr we could try η-DBM on corresponding RPM, which one would expect to\nbehave similarly....\nQuestion: Are there coral reefs, snowflakes, lichen, crystals, plants, lightning\nbolts, etc. whose growth rates are affected by a random medium (something\nlike LQG)? The simulations look similar but have a bit more personality when\nγ is larger (as we will see). They look like Chinese dragons.\nWe will ultimately want to construct a candidate for the scaling limit, which\nwe will call (for reasons explained later) quantum Loewner evolution:\nQLE(γ2, η).\nBut first let's look at some computer generated images (and some\nanimations), starting with an Eden exploration.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n52 / 67\n▶\n▶\n▶\n▶\n▶\n\nEden model on\n8/3-LQG\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n53 / 67\n\n√\nDLA on a\n2-LQG\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n54 / 67\n\nI\nEden model on planar map\nRandom planar map, random vertex x. Perform FPP from x.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n55 / 67\n▶\n\nI\nEden model on planar map\nRandom planar map, random vertex x. Perform FPP from x.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n55 / 67\n▶\n\nI\nEden model on planar map\nRandom planar map, random vertex x. Perform FPP from x.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n55 / 67\n▶\n\nI\nEden model on planar map\nRandom planar map, random vertex x. Perform FPP from x.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n55 / 67\n▶\n\nI\nEden model on planar map\nRandom planar map, random vertex x. Perform FPP from x.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n55 / 67\n▶\n\nI\nEden model on planar map\nRandom planar map, random vertex x. Perform FPP from x.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n55 / 67\n▶\n\nI\nEden model on planar map\nRandom planar map, random vertex x. Perform FPP from x.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n55 / 67\n▶\n\nI\nEden model on planar map\nRandom planar map, random vertex x. Perform FPP from x.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n55 / 67\n▶\n\nI\nEden model on planar map\nRandom planar map, random vertex x. Perform FPP from x.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n55 / 67\n▶\n\nI\nEden model on planar map\nRandom planar map, random vertex x. Perform FPP from x.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n55 / 67\n▶\n\nI\nEden model on planar map\nRandom planar map, random vertex x. Perform FPP from x.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n55 / 67\n▶\n\nI\nI\nI\nEden model on planar map\nRandom planar map, random vertex x. Perform FPP from x.\nImportant observations:\nConditional law of map given ball at time n only depends on the boundary lengths of\nthe outside components. Exploration respects the Markovian structure of the map.\nIf we work on an \"infinite\" planar map, the conditional law of the map in the\nunbounded component only depends on the boundary length\nBelief: Isotropic enough so that at large scales this is close to a ball in the graph metric\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n55 / 67\n▶\n▶\n▶\n\nI\nFirst passage percolation on random planar maps III\nVariant:\nPick two edges on outer boundary\nof cluster\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n56 / 67\n▶\n\nI\nI\nFirst passage percolation on random planar maps III\nVariant:\nPick two edges on outer boundary\nof cluster\nColor vertices between edges blue\nand yellow\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n56 / 67\n▶\n▶\n\nI\nI\nI\nFirst passage percolation on random planar maps III\nVariant:\nPick two edges on outer boundary\nof cluster\nColor vertices between edges blue\nand yellow\nColor vertices on rest of map blue\nor yellow with prob. 2\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n56 / 67\n▶\n▶\n▶\n\nI\nI\nI\nI\nFirst passage percolation on random planar maps III\nVariant:\nPick two edges on outer boundary\nof cluster\nColor vertices between edges blue\nand yellow\nColor vertices on rest of map blue\nor yellow with prob. 2\nExplore percolation (blue/yellow)\ninterface\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n56 / 67\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nFirst passage percolation on random planar maps III\nVariant:\nPick two edges on outer boundary\nof cluster\nColor vertices between edges blue\nand yellow\nColor vertices on rest of map blue\nor yellow with prob. 2\nExplore percolation (blue/yellow)\ninterface\nForget colors\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n56 / 67\n▶\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nI\nFirst passage percolation on random planar maps III\nVariant:\nPick two edges on outer boundary\nof cluster\nColor vertices between edges blue\nand yellow\nColor vertices on rest of map blue\nor yellow with prob. 1\nExplore percolation (blue/yellow)\ninterface\nForget colors\nRepeat\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n56 / 67\n▶\n▶\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nI\nFirst passage percolation on random planar maps III\nVariant:\nPick two edges on outer boundary\nof cluster\nColor vertices between edges blue\nand yellow\nColor vertices on rest of map blue\nor yellow with prob. 1\nExplore percolation (blue/yellow)\ninterface\nForget colors\nRepeat\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n56 / 67\n▶\n▶\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nI\nFirst passage percolation on random planar maps III\nVariant:\nPick two edges on outer boundary\nof cluster\nColor vertices between edges blue\nand yellow\nColor vertices on rest of map blue\nor yellow with prob. 1\nExplore percolation (blue/yellow)\ninterface\nForget colors\nRepeat\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n56 / 67\n▶\n▶\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nI\nFirst passage percolation on random planar maps III\nVariant:\nPick two edges on outer boundary\nof cluster\nColor vertices between edges blue\nand yellow\nColor vertices on rest of map blue\nor yellow with prob. 1\nExplore percolation (blue/yellow)\ninterface\nForget colors\nRepeat\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n56 / 67\n▶\n▶\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nI\nFirst passage percolation on random planar maps III\nVariant:\nPick two edges on outer boundary\nof cluster\nColor vertices between edges blue\nand yellow\nColor vertices on rest of map blue\nor yellow with prob. 1\nExplore percolation (blue/yellow)\ninterface\nForget colors\nRepeat\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n56 / 67\n▶\n▶\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nI\nFirst passage percolation on random planar maps III\nVariant:\nPick two edges on outer boundary\nof cluster\nColor vertices between edges blue\nand yellow\nColor vertices on rest of map blue\nor yellow with prob. 1\nExplore percolation (blue/yellow)\ninterface\nForget colors\nRepeat\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n56 / 67\n▶\n▶\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nI\nFirst passage percolation on random planar maps III\nVariant:\nPick two edges on outer boundary\nof cluster\nColor vertices between edges blue\nand yellow\nColor vertices on rest of map blue\nor yellow with prob. 1\nExplore percolation (blue/yellow)\ninterface\nForget colors\nRepeat\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n56 / 67\n▶\n▶\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nI\nI\nI\nI\nFirst passage percolation on random planar maps III\nVariant:\nPick two edges on outer boundary\nof cluster\nColor vertices between edges blue\nand yellow\nColor vertices on rest of map blue\nor yellow with prob. 1\nExplore percolation (blue/yellow)\ninterface\nForget colors\nRepeat\nThis exploration also respects the Markovian structure of the map.\nIf we work on an \"infinite\" planar map, the conditional law of the map in the\nunbounded component only depends on the boundary length.\nExpect that at large scales this growth process looks the same as FPP, hence the\nsame as the graph metric ball\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n56 / 67\n▶\n▶\n▶\n▶\n▶\n▶\n▶\n▶\n▶\n\nI\nContinuum limit ansatz\nSample a random planar map\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n57 / 67\n▶\n\nI\nContinuum limit ansatz\nSample a random planar map and two edges uniformly at random\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n57 / 67\n▶\n\nI\nI\nContinuum limit ansatz\nSample a random planar map and two edges uniformly at random\nColor vertices blue/yellow with probability 1/2\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n57 / 67\n▶\n▶\n\nI\nI\nContinuum limit ansatz\nSample a random planar map and two edges uniformly at random\nColor vertices blue/yellow with probability 1/2 and draw percolation interface\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n57 / 67\n▶\n▶\n\nI\nI\nI\nContinuum limit ansatz\nψ\nSample a random planar map and two edges uniformly at random\nColor vertices blue/yellow with probability 1/2 and draw percolation interface\nConformally map to the sphere\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n57 / 67\n▶\n▶\n▶\n\nI\nI\nI\nContinuum limit ansatz\nψ\nSample a random planar map and two edges uniformly at random\nColor vertices blue/yellow with probability 1/2 and draw percolation interface\nConformally map to the sphere\nr\nAnsatz Image of random map converges to a\n8/3-LQG surface and the image of the\ninterface converges to an independent SLE6.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n57 / 67\n▶\n▶\n▶\n\nI\nI\nContinuum analog of first passage percolation on LQG\nr\nStart off with\n8/3-LQG surface\nFix δ > 0 small and a starting point x\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n58 / 67\n▶\n▶\n\nI\nI\nI\nContinuum analog of first passage percolation on LQG\nr\nStart off with\n8/3-LQG surface\nFix δ > 0 small and a starting point x\nDraw δ units of SLE6\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n58 / 67\n▶\n▶\n▶\n\nI\nI\nI\nI\nContinuum analog of first passage percolation on LQG\nr\nStart off with\n8/3-LQG surface\nFix δ > 0 small and a starting point x\nDraw δ units of SLE6\nResample the tip according to\nboundary length\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n58 / 67\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nContinuum analog of first passage percolation on LQG\nr\nStart off with\n8/3-LQG surface\nFix δ > 0 small and a starting point x\nDraw δ units of SLE6\nResample the tip according to\nboundary length\nRepeat\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n58 / 67\n▶\n▶\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nContinuum analog of first passage percolation on LQG\nr\nStart off with\n8/3-LQG surface\nFix δ > 0 small and a starting point x\nDraw δ units of SLE6\nResample the tip according to\nboundary length\nRepeat\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n58 / 67\n▶\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nContinuum analog of first passage percolation on LQG\nr\nStart off with\n8/3-LQG surface\nFix δ > 0 small and a starting point x\nDraw δ units of SLE6\nResample the tip according to\nboundary length\nRepeat\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n58 / 67\n▶\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nContinuum analog of first passage percolation on LQG\nr\nStart off with\n8/3-LQG surface\nFix δ > 0 small and a starting point x\nDraw δ units of SLE6\nResample the tip according to\nboundary length\nRepeat\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n58 / 67\n▶\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nContinuum analog of first passage percolation on LQG\nr\nStart off with\n8/3-LQG surface\nFix δ > 0 small and a starting point x\nDraw δ units of SLE6\nResample the tip according to\nboundary length\nRepeat\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n58 / 67\n▶\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nContinuum analog of first passage percolation on LQG\nr\nStart off with\n8/3-LQG surface\nFix δ > 0 small and a starting point x\nDraw δ units of SLE6\nResample the tip according to\nboundary length\nRepeat\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n58 / 67\n▶\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nI\nContinuum analog of first passage percolation on LQG\nr\nStart off with\n8/3-LQG surface\nFix δ > 0 small and a starting point x\nDraw δ units of SLE6\nResample the tip according to\nboundary length\nRepeat\nKnow the conditional law of the LQG\nsurface at each stage, using\nexploration results\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n58 / 67\n▶\n▶\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nI\nContinuum analog of first passage percolation on LQG\nr\nStart off with\n8/3-LQG surface\nFix δ > 0 small and a starting point x\nDraw δ units of SLE6\nResample the tip according to\nboundary length\nRepeat\nKnow the conditional law of the LQG\nsurface at each stage, using\nexploration results\nQLE(8/3, 0) is the limit as δ → 0 of this growth process. It is described in terms of a\nradial Loewner evolution which is driven by a measure valued diffusion.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n58 / 67\n▶\n▶\n▶\n▶\n▶\n▶\n\nI\nI\nI\nI\nI\nI\nContinuum analog of first passage percolation on LQG\nr\nStart off with\n8/3-LQG surface\nFix δ > 0 small and a starting point x\nDraw δ units of SLE6\nResample the tip according to\nboundary length\nRepeat\nKnow the conditional law of the LQG\nsurface at each stage, using\nexploration results\nQLE(8/3, 0) is the limit as δ → 0 of this growth process. It is described in terms of a\nradial Loewner evolution which is driven by a measure valued diffusion.\nQLE(8/3, 0) is SLE6 with tip re-randomization. It can be understood as a\n\"reshuffling\" of the exploration procedure associated to the peanosphere.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n58 / 67\n▶\n▶\n▶\n▶\n▶\n▶\n\nI\nI\nI\nWhat is QLE(γ2, η)?\nQLE(8/3, 0) is a member of a two-parameter family of processes called QLE(γ2, η)\nγ is the type of LQG surface on which the process grows\nη determines the manner in which it grows\nLet μHARM (resp. μLEN) be harmonic (resp. length) measure on a γ-LQG surface. The\nrate of growth (i.e., rate at which microscopic particles are added) is proportional to\n\nη\ndμHARM\ndμLEN.\ndμLEN\nFirst passage percolation: η = 0\nDiffusion limited aggregation: η = 1\nη-dieletric breakdown model: general values of η\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n59 / 67\n▶\n▶\n▶\n▶\n▶\n\nDiscrete approximation of QLE(8/3, 0). Metric ball on a\n8/3-LQG\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n60 / 67\np\n\n√\nDiscrete approximation of QLE(2, 1). DLA on a\n2-LQG\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n61 / 67\n\nQLE(γ2, η) processes we can construct\nγ2\nη\n-1\n(2, 1)\n(8/3, 0)\n(4, 1/4)\nEach of the QLE(γ2, η) processes with (γ2, η) on the orange curves is built from an\nSLEκ process using tip re-randomization.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n62 / 67\n\np\nSTORY E:\nBROWNIAN MAP =\n8/3-LIOUVILLE QUANTUM\nGRAVITY\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n63 / 67\n\nDancing snake: a natural random walk on the space of discrete \"snakes.\"\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n64 / 67\n\n(Xt, Yt)\n(0, 0)\n(Xt, Yt)\n(0, 0)\n(0, 0)\n(a, 0)\n(a, 0)\n(inf{X·}, 0)\n1. The dancing snake has a scaling limit called the Brownian snake.\n2. The x and y coordinates of the Brownian snake's head are two functions.\n3. Each of these describes a tree (via the same construction we used to make\nCRT from Brownian motion).\n4. Gluing these two trees together gives a random surface called the Brownian\nmap.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n65 / 67\n\nSome QLE-based results\nExistence of QLE(γ2, η) on the orange curves as a Markovian exploration of\na γ-LQG surface.\nA proof that when γ2 = 8/3 and η = 0, QLE describes the growth of metric\nballs in Liouville quantum gravity.\nA proof that, under the metric defined by QLE, Liouville quantum gravity is\nequivalent (as a random metric measure space) to the Brownian map.\nAn understanding of a continuum analog of DLA on a random surface\ncorresponding to γ2 = 2.\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n66 / 67\n▶\n▶\n▶\n▶\n\nψ\nThanks!\nScott Sheffield (MIT)\nUniversal structure\nSeptember 15, 2015\n67 / 67\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.177 Universal Random Structures in 2D\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}