{
  "course_name": "Urban Design Policy and Action",
  "course_description": "In this course we examine the relationship between public policy and urban design through readings, discussions, presentations, and papers. We also analyze the ways in which policies shape cities, and investigate how governments implement urban design. Students gain a critical understanding of both the complex system of governance within which urban design occurs and the effective tools available for creative intervention.",
  "topics": [
    "Fine Arts",
    "Architecture",
    "Environmental Design",
    "Social Science",
    "Public Administration",
    "Public Policy",
    "Urban Studies",
    "Urban Planning",
    "Fine Arts",
    "Architecture",
    "Environmental Design",
    "Social Science",
    "Public Administration",
    "Public Policy",
    "Urban Studies",
    "Urban Planning"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nPrerequisites\n\n11.301J Introduction to Urban Design and Development\n\nOverview\n\nHow does urban design get done, and what is the role of democratically-elected local government in this process? While there has been a lot of attention paid recently to American and European urban designers crafting spectacular projects in the autocratic regions of the world (e.g. China, Dubai, Abu Dhabi), we will focus on the majority of the democratic world's struggles with the public policy and implementation of urban design at the local level. The seminar is designed to be a collective and interactive inquiry into critical questions:\n\nHow does government influence urban design, and why?\n\nHow should governments shape cities in a representative democracy and be a steward of the public interest?\n\nWhat have been the outcomes of urban design policy in the past, and how do they interact with the interests of private developers and community groups?\n\nWhere does the power of shaping cities actually reside?\n\nWhat is the range of the local government tools for urban design and what are their consequences?\n\nWhat is the effectiveness of policy tools for designing specific districts of a city, such as theater districts or residential neighborhoods?\n\nHow have policy tools been deployed by local government to design the transformation a city?\n\nWhat is at the cutting edge of urban design, public policy, and implementation? What are the strengths and weaknesses of this cutting edge work?\n\nWhat are some future possibilities for public policy and urban design?\n\nIn order to address these questions, the seminar is structured around a series of thematic investigations around specific readings, as described in the following section.\n\nCalendar\n\nLEC #\n\nTOPICS\n\nIntroductions and overview of seminar\n\nOverview of policy and urban design\n\nHistorical insights on public policy and urban design outcomes\n\nExercising local and regional power on the design of cities\n\nLocal government toolkits for urban design\n\nEffectiveness of policy tools for district and neighborhood design\n\nDeploying the urban design policy toolkit to transform a city\n\nAt the cutting edge of urban design policy and action: part I\n\nAt the cutting edge of urban design policy and action: part II\n\nFuture directions?\n\nReview",
  "files": []
}