{
  "course_name": "Urban Housing: Paris, London, New York",
  "course_description": "This class presents an analysis of the development of housing models and their urban implications in Paris, London, and New York City from the seventeenth century to the present. The focus will be on three models: the French hotel, the London row house, and the New York City tenement and apartment building. Other topics covered will include twentieth-century housing reform movements and work by the London County Council, CIAM, and American public housing agencies.",
  "topics": [
    "Social Science",
    "Urban Studies",
    "Housing Development",
    "Urban Planning",
    "Social Science",
    "Urban Studies",
    "Housing Development",
    "Urban Planning"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Description\n\nThis course explores urban housing. In the last few years, housing - especially urban housing - has suffered from a crisis of confidence on the part of architects and theorists. Belief in modernist models has waned as urban problems have increased and decentralization has continued. In America urban housing has traditionally been regarded with suspicion. As the rest of the world moves towards a predominately urban population with at least 50% of the population now living in cities, America appears to be moving in the opposite direction with at least 50% of the people not living in cities. Despite this trend, and enormous socio-economic problems, American cities have demonstrated remarkable staying power. Indeed, some are thriving. But to be truly livable a city requires a rich repertoire of urban housing. This course will examine the topic in terms of both traditional and modern models.\n\nThe seminar will analyze the development of housing models and their urban implications in Paris, London, and New York. Included in the discussion will be the French\nHotel\nand\nApartment Building\n, the Georgian\nTownhouse\n, and the New York\nRow House\n,\nTenement\n, and\nApartment Building\n. Modern housing projects in each city will be covered. By bringing the survey to the present, the seminar will present revisions of architectural modernism's urban housing principles in the work of contemporary designers.\n\nThe course is structured as a research seminar and will meet once per week. Presentations by the instructor will bring the seminar to 1975.\n\nStudent research and presentations will focus on urban housing in a selected city, and will be submitted as research papers at the end of the course.\n\nIn addition to a presentation and report, class attendance and participation are required.",
  "files": []
}