{
  "course_name": "Victorian Literature and Culture",
  "course_description": "The course covers British literature and culture during Queen Victoria’s long reign, 1837-1901. This was the brilliant age of Charles Dickens, the Brontës, Lewis Carroll, George Eliot, Robert Browning, Oscar Wilde, Arthur Conan Doyle, Rudyard Kipling, Alfred, Lord Tennyson – and many others. It was also the age of urbanization, steam power, class conflict, Darwin, religious crisis, imperial expansion, information explosion, bureaucratization – and much more.",
  "topics": [
    "Humanities",
    "History",
    "European History",
    "Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Humanities",
    "History",
    "European History",
    "Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nOverview\n\nThe course covers British literature and culture during Queen Victoria's long reign, 1837-1901. This was the brilliant age of Charles Dickens, the Brontes, Lewis Carroll, George Eliot, Robert Browning, Oscar Wilde, Arthur Conan Doyle, Rudyard Kipling, Alfred, Lord Tennyson - and many others. It was also the age of urbanization, steam power, class conflict, Darwin, religious crisis, imperial expansion, information explosion, bureaucratization - and much more.\n\nFiction, nonfiction, and poetry are included. The syllabus may vary depending on the faculty member teaching the course.\n\nCourse Requirements\n\nUse the editions specified above and bring appropriate book(s) to class.\n\nNo more than two unexcused absences.\n\nEither\ntwo papers (midterm and final) totaling approximately 15-20 pages,\nor\nmidterm paper (approximately 6-8 pp.) and cumulative final exam. Along with the first paper topic, I will distribute a list of guidelines for the format of your papers.\n\nAll your papers must conform to these guidelines or I won't accept them. Any papers turned in late will receive an F, unless prior arrangements have been made.",
  "files": [
    {
      "category": "Resource",
      "title": "481_paper_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-481-victorian-literature-and-culture-spring-2003/d7ec6062bb29c025ceb4d52ed5c8b322_481_paper_1.pdf",
      "content": "21L481 Victorian Literature and Culture\nPaper #1\n\nSuggested paper topics. Paper due by 5 p.m., Friday, March 17 (or sooner) at my office.\nPlease contact me if you'd like to discuss your topic at any stage of the process.\n\nGuidelines for acceptable papers (not acceptable without these):\n1. double-space\n2. one-inch margins all around\n3. number your pages\n4. staple your pages\n5. use a title - a good, descriptive one\n6. use 12-point font (Courier, Times New Roman are OK)\n7. On a cover page giving the title of the paper and your name, type out the following: \"I\npledge that this paper is my own work and does not rely on secondary sources, except\nwhere noted.\" Sign your name.\n\nAdvice for a successful paper:\n1. Don't write exclusively for the professor; write for an imaginary audience somewhat\nfamiliar with the books, but in need of helpful reminders. Take time to provide\nnecessary contexts, without overdoing it.\n2. Your paper needs to argue for a point of view, not just summarize the plot.\n3. Work with specific aspects of the texts - don't just generalize. Use quotations and\nparaphrases to support your argument.\n4. It is not necessary to begin your paper with a grandiose opening (e.g. \"Since the dawn\nof time, humankind has . . .\" or \"Throughout the history of literature . . .\"). Use a\nbeginning appropriate to the scope of your subject.\n5. Secondary sources are not necessary; work from your course notes and your\nimagination.\n6. Write like a person, not a bureaucratic committee! (By which I mean: try to be clear\nand direct; avoid unnecessary uses of the passive voice; take care to be in control\nof the structure of your sentences. Make sure you know what your writing is\nsaying.)\n\nSuggested Topics:\n1. Write about how Ruskin (in \"The Nature of Gothic\" and \"Traffic\") and Gaskell\ncomplicate our usual idea of what \"ornament\" or \"decoration\" is and what kind of\nrelationship it has to \"the necessary\" or \"essential.\"\n\n2. Write about the function of the author's footnotes in Gaskell's Mary Barton. How do\nthey relate to Gaskell's stated purpose of giving utterance to the experiences of the\n\"dumb people\" of the working class?\n\n3. Write about the gestures Ruskin (in \"The Nature of Gothic\") and/or Gaskell (in Mary\nBarton) make toward \"cultural relativism.\" How far do they go in this direction, and\nwhat prevents them from asserting a completely relativist perspective?\n\n4. Write about the critique of \"universalism\" that emerges from the installments of Bleak\nHouse we have read so far.\n\n5. Write about the \"interlacing\" of Bleak House's two narrative voices, as characters\nintroduced in one account resurface in the other. Survey specific examples and note the\nimportant effect of these shifts of perspective.\n\n6. In Mary Barton, a couple of documents travel in a very striking way throughout the\nsociety that novel describes. Look at what becomes of the Samuel Bamford poem which\nJob Legh reads to John Barton (pp. 111-13), and of the drawing Harry Carson makes\nduring the employers' meeting with the workers (p. 184ff.). How do the original\nintentions behind these documents get altered as they are transferred from one context to\nanother? How do these traveling documents relate to Gaskell's attempt to achieve a\nperspective capable of embracing the whole of her culture?"
    },
    {
      "category": "Resource",
      "title": "481_paper_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-481-victorian-literature-and-culture-spring-2003/010ab708dab25668605bfd442a96dd48_481_paper_2.pdf",
      "content": "21L481 Victorian Literature and Culture\nTopics for paper #2\nDue by the end of term\n\nRemember to observe the all-important guidelines I included with assignment\n#1; I won't accept papers not following these guidelines.\n\nReview the \"Advice for a Successful Paper\" and my comments on your first\npaper while working on your second.\n\nSuggested topics:\n\n1. Mayhew, Beeton, Tennyson, Carroll (choose any combination): write about\nthe alluring, alarming idea of an amoral and uncontainable desire or hunger\nthat emerges from these works - sometimes against the writer's apparent\nintentions. (For example: Mayhew on the \"locomotive stomach,\" Beeton on\nfish, Tennyson's \"Ulysses\" or In Memoriam #56, Carroll's Cheshire Cat, etc.)\n\n2. Tennyson's In Memoriam: choose one early poem in the series and one late\none that \"answers\" it. Use a close analysis of these two poems to\nillustrate the structure of In Memoriam as a whole. Make sure to consider\nnot just what the poems say, but also the way that technical aspects (rhyme\nscheme, stanza form, enjambment, etc.) contribute to our experience of the\npoems.\n\n3. Mill: write about how Mill tries in On Liberty to develop an ideal of\nculture that balances the competing attractions and limitations he sees in\nstrict Benthamism and in \"the East\" (i.e. the Orient, non-Western societies\nlike China or India).\n\n4. Mayhew, Beeton, Dickens and the Victorian sense of \"information crisis\":\nwrite about how these authors use their huge, detail-packed books to stage\nthe contest between information (which may amount to nothing more than an\noverwhelming, chaotic pile of facts) and knowledge (which involves the\nsuccessful management of information). If you've read the Sherlock Holmes\nexcerpts before you start writing, you may wish to bring those into the\ndiscussion, too."
    },
    {
      "category": "Resource",
      "title": "baud_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-481-victorian-literature-and-culture-spring-2003/8ccedd00c7a5e7b1b9cd741c0ae89dae_baud_notes.pdf",
      "content": "FROM CHAS. BAUDELAIRE, THE PAINTER OF MODERN LIFE - on the relationship\nbetween detail and total form in art:\n\nIn this way a struggle is launched between the will to see all and forget nothing and the faculty\nof memory, which has formed the habit of a lively absorption of general colour and silhouette,\nthe arabesque of contour. An artist with a perfect sense of form but one accustomed to relying\nabove all on his memory and his imagination will find himself at the mercy of a riot of details all\nclamouring for justice with the fury of a mob in love with absolute equality. All justice is\ntrampled underfoot; all harmony sacrificed and destroyed; many a trifle assumes vast\nproportions; many a triviality usurps the attention. The more our artist turns an impartial eye on\ndetail, the greater is the state of anarchy. Whether he be long-sighted or short-sighted [i.e.\nlacking the proper perspective], all hierarchy and all subordination vanishes."
    },
    {
      "category": "Resource",
      "title": "beetonreadings.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-481-victorian-literature-and-culture-spring-2003/a9ddce357bf88a5845a29413cfcd30b9_beetonreadings.pdf",
      "content": "Buzard, 21L481: Victorian Literature and Culture\nSpring 2003\nGuide to readings from Beeton's Book of Household Management (in coursepack)\n\nPreface\nChap. 1, \"The Mistress\" (pp. 1-20)\nfrom Chap. 4, \"Introduction to Cookery\" (pp. 39-43)\nsection \"Soup, Broth, and Bouillon\" (pp. 49-51)\nentry on \"Prince of Wales's Soup\" (pp. 77-78)\nfrom Chap. 7, \"Fish: The Natural History of Fishes\" (pp. 105-110)\nfrom Chap 11, \"Various Modes of Cooking Meat: General Remarks\" (pp. 257-259)\nsection on \"The General Mode of Slaughtering Oxen\" (p. 275)\nsections 680-681, on \"The Great Object of the Grazier\" and \"The More Removed . . .\"\n\n(pp. 320-321)\nsection 697, on \"The Value of the Sheep\" (p. 329)\nsmall-print paragraphs on \"Names of Animals Saxon . . .\" and \"Shepherds and their\n\nFlocks,\" (pp. 334-335)\nsection on \"Boiled Neck of Mutton\" (including small-print paragraph \"The Poets on\n\nSheep\") (pp. 344-345)\nsections 770-773, beginning with \"In the Mosaical Law\" (pp. 362-363)\nsmall-print paragraph on \"English Mode of Hunting . . .\" (pp. 375-376)\nsmall-print paragraph on \"The Wild and Domestic Hog\" (p. 388)\nsmall-print paragraph on \"Antiquity of the Hog\" (p. 389)\nsmall-print paragraph on \"How Roast Pig was Discovered\" (pp. 398-399)\nbeginning of Chap. 20, \"General Observations on Birds\" (p. 437)\nsection 925, \"Birds, However . . .\" (p. 442)\nsmall-print paragraphs on \"Varieties in Rabbits\" and Fecundity of the Rabbit\" (pp. 488-\n\n489)\nsection 1070, \"Whilst it is Thus . . .\" (p. 544)\nsmall-print paragraph \"Cheese . . .\" (p. 816)\nfrom Chap. 40 (XL), \"Dinners and Dining,\" sections 1879-1886 (pp. 905-908)\nsections 2435-2444, on \"The Wet Nurse\" (pp. 1022-1024)\nfrom Chap. 42 (XLII), \"The Rearing, Management, and Diseases of Infancy and\n\nChildhood\" (pp. 1025-1027)\nsections 2472-2475, on \"The Milk\" (pp. 1034-1035)\nsection 2643, on \"Hysterics\" (pp. 1078-1079)\nsection 2662, on \"Opium\" (pp. 1086-1087)"
    },
    {
      "category": "Resource",
      "title": "ben_mill_expts.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-481-victorian-literature-and-culture-spring-2003/343a47ad4ebb71b351672e7bbbee632a_ben_mill_expts.pdf",
      "content": "Excerpts to go with readings from John Stuart Mill\n\n1. Opening sentences from Jeremy Bentham, An Introduction to the Principles of Morals\nand Legislation (1789):\n\nNature has placed mankind under the governance of two sovereign masters, pain and\npleasure. It is for them alone to point out what we ought to do, as well as to determine\nwhat we shall do. On the one hand the standard of right and wrong, on the other the\nchain of causes and effects, are fastened to their throne. They govern us in all we do, in\nall we say, in all we think: every effort we can make to throw off our subjection, will\nserve but to demonstrate and confirm it. In words a man may pretend to abjure their\nempire; but in reality he will remain subject to it all the while. The principle of utility\nrecognizes this subjection, and assumes it for the foundation of that system, the object of\nwhich is to rear the fabric of felicity by the hands of reason and law. Systems which\nattempt to question it, deal in sounds instead of sense, in caprice instead of reason, in\ndarkness instead of light.\n\n2. From John Stuart Mill's essay on Jeremy Bentham:\n\nWho, before Bentham (whatever controversies might exist on points of detail, dared to\nspeak disrespectfully, in express terms, of the British Constitution, or the English Law?\nHe did so; and his arguments and his example encouraged others. We do not mean that\nhis writings cause the Reform Bill [of 1832] .... But ... until Bentham spoke out, those\nwho found our institutions unsuited to them did not dare to say so, did not dare\nconsciously to think so; they had never heard the excellence of those institutions\nquestioned by cultivated men, by men of acknowledged intellect; and it is not in the\nnature of uninstructed minds to resist the united authority of the instructed. Bentham\nbroke the spell. ... [I]f the hardiest innovation is no longer scouted because it is an\ninnovation - establishments no longer considered sacred because they are establishments\n- it will be found that those who have accustomed the public mind to these ideas have\nlearnt them in Bentham's school, and that the assault on ancient institutions has been, and\nis, carried on for the most part with his weapons.\n\n3. From Mill's Autobiography, ch. 5, \"A Crisis in my Mental History\":\n\nFrom the winter of 1821, when I first read Bentham, and especially from the\ncommencement of the Westminster Review, I had what truly might be called an object in\nlife; to be a reformer of the world. My conception of my own happiness was entirely\nidentified with this object. The personal sympathies which I wished for were those of\nfellow labourers in this enterprise. ... I was accustomed to felicitate myself on the\ncertainty of a happy life which I enjoyed, through placing my happiness in something\ndurable and distant, in which some progress might be always making, which it could\nnever be exhausted by complete attainment. This did very well for several years,\nduring which the general improvement going on in the world and the idea of myself as\nengaged with others in struggling to promote it, seemed enough to fill up an interesting\nand animated existence. But the time came when I awakened from this as from a dream.\n\nIt was in the autumn of 1826 [i.e. when he was 20]. I was in a dull state of nerves, such\nas everybody is occasionally liable to; unsuceptible to enjoyment or pleasurable\nexcitement; one of those moods when what is pleasure at other times, becomes insipid or\nindifferent .... In this frame of mind it occurred to me to put the question directly to\nmyself, \"Suppose that all your objects in life were realized; that all the changes in\ninstitutions and opinions which you are looking forward to, could be completely effected\nat this very instant: would this be a great joy and happiness to you?\" And an irrepressible\nself-consciousness distinctly answered, \"No!\" At this my heart sank within me: the\nwhole foundation on which my life was constructed fell down. All my happiness was\nto have been found in the continual pursuit of this end. The end has ceased to charm, and\nhow could there ever again be any interest in the means? I seemed to have nothing left to\nlive for. ... My father, to whom it would have been natural to me to have recourse in any\npractical difficulties, was the last person to whom, in such a case as this, I looked for\nhelp. ... My education, which was wholly his work, had been conducted without any\nregard to the possibility of its ending in this result; and I saw no use in giving him the\npain of thinking that his plans had failed .... Of other friends, I had at that time none to\nwhom I had any hope of making my condition intelligible. It was however abundantly\nintelligible to myself; and the more I dwelt upon it, the more hopeless it appeared.\n\nMy course of study had led me to believe, that all mental and moral feelings and\nqualities, whether of a good or of a bad kind, were the results of association; that we love\none thing and hate another, take pleasure in one sort of action or contemplation, and pain\nin another sort, through the clinging of pleasurable or painful ideas to those things, from\nthe effect of education or of experience. As a corollary from this, I had always heard it\nmaintained by my father, and was myself convinced, that the object of education should\nbe to form the strongest possible associations of the salutary class; associations of\npleasure with all things beneficial to the great whole, and of pain with all things hurtful to\nit. This doctrine appeared inexpugnable; but it now seemed to me on retrospect, that my\nteachers had occupied themselves but superficially with the means of forming and\nkeeping up these salutary associations. They seemed to have trusted altogether to the old\nfamiliar instruments, praise and blame, reward and punishment. Now I did not doubt that\nby these means, begun early and applied unremittingly, intense associations of pain and\npleasure, especially of pain, might be created, and might produce desires and aversions\ncapable of lasting undiminished to the end of life. But there must always be\nsomething artificial and casual in associations thus produced. The pains and pleasures\nthus forcibly associated with things, are not connected with them by any natural tie; and it\nis therefor, I thought, essentially to the durability of these associations, that they should\nhave become so intense and inveterate as to be practically indissoluble, before the\nhabitual exercise of the power of analysis had commenced. For I now saw, or thought\nI saw, what I had always before received with incredulity - that the habit of analysis has a\ntendency to wear away the feelings: as indeed it has when no other mental habit is\ncultivated, and the analysing spirit remains without its natural complements and\ncorrectives. The very excellence of analysis (I argued) is that it tends to weaken and\nundermine whatever is the result of prejudice; that it enables us mentally to separate ideas\nwhich have only casually clung together; and no associations whatever could\nultimately resist this dissolving force, were it not that we owe to analysis our clearest\nknowledge of the permanent sequences in nature; the real connexions between Things,\n\nnot dependent on our will and feelings; natural laws, by virtue of which, in many cases,\none thing is inseparable from another in fact; which laws, in proportion as they are clearly\nperceived and imaginatively realized, cause our ideas of things which are always joined\ntogether in Nature, to cohere more and more closely in our thoughts. Analytic habits may\nthus even strengthen the associations between causes and effects, means and ends, but\ntend altogether to weaken those which are, to speak familiarly, a mere matter of feeling.\nThey are therefore (I thought) favourable to prudence and clearsightedness, but a\nperpetual worm at the root both of the passions and of the virtues; and above all, fearfully\nundermine all desires, and all pleasures, which are the effects of association, that is,\naccording to the theory I held, all except the purely physical and organic; of the entire\ninsufficiency of which to make life desirable, no one had a stronger conviction than I had."
    },
    {
      "category": "Resource",
      "title": "bleakhou_rev.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-481-victorian-literature-and-culture-spring-2003/d973f58402edfd3befcbe7fa9f1b77b0_bleakhou_rev.pdf",
      "content": "Some contemporaries' comments on Bleak House:\n\n1. John Forster (Dickens's friend and first biographer):\n\"The great Chancery suit ... is worked into every part of the book ... Nothing is\nintroduced at random, everything tends to the catastrophe, the various lines of the plot\nconverge and fit to its centre, and to the larger interest all the rest is irresistably drawn.\"\n\n2. Henry Fothergill Chorley (Athenaeum):\n\"Not a point is missed - not a person left without share in the gradual disclosure - not a\npin dropped that is not to be picked up for help or harm to somebody.\"\n\n3. George Brimley (Spectator):\n\"[The book suffers from an] absolute want of construction ... [A large number of\ncharacters] might be eliminated from the book without damage to the great Chancery\nsuit, or perceptible effect upon the remaining characters. So crowded is the canvas which\nMr. Dickens has stretched, and so casual the connexion that gives to his composition\nwhatever unity it has, that a daguerrotype of Fleet Street at noon-day would be the aptest\nsymbol for it.\"\n\n4. John Ruskin, in \"Fiction, Fair and Foul\":\n\"The monotony of life in the central streets of any great modern city, but especially those\nof London, ... leaves the craving of the heart for a sincere, yet changeful, interest, to be\nfed from one source only. Under natural conditions the degree of mental excitement\nnecessary to bodily health is provided by the course of the seasons, and the various skill\nand fortune of agriculture. ... What though can enough comprehend the contrast between\nsuch life, and that in the streets where summer and winter are only alternations of heat\nand cold; where the ground is only a pavement, and the sky no more than the glass roof\nof an arcade; where the utmost power of a storm is to choke the gutters, and the finest\nmagic of spring, to change mud into dust; where - chief and most fatal difference in state\n- there is no interest of occupation for any of the inhabitants but the routine of counter or\ndesk within doors, and the effort to pass each other without collision outside; so that from\nmorning to evening the only possible variation of the monotony of the hours, and\nlightening of the penalty of existence, must be some kind of mischief ....\n\"It might have been thought ... that the denial of their natural food to human feelings\nwould have provoked a reactionary desire for it; and that the dreariness of the street\nwould have been gilded by dreams of pastoral felicity. Experience has shown the fact to\nbe otherwise: the thoroughly trained Londoner can enjoy no other excitement than that to\nwhich he has been accustomed, but asks for that in continually more ardent or more\nvirulent concentration; and the ultimate power of fiction to entertain him is by varying to\nhis fancy the modes, and defining for his dulness the horrors, of Death. In the single\nnovel of Bleak House there are nine deaths ... carefully wrought out or led up to, either\nby way of pleasing surprise, as the baby's at the brickmaker's, or finished in the\nthreatenings and sufferings, with as much enjoyment as can be contrived in the\nanticipation, and as much pathology as can be concentrated in the description. Under the\nfollowing varieties of method:\n\nOne by assassination . . . . . . . . . . . . . Mr. Tulkinghorn\nOne by starvation, with phthisis . . . . . Jo\nOne by chagrin . . . . . . . . . . . . . . . . . Richard\nOne by spontaneous combustion . . . . Mr. Krook\nOne by sorrow . . . . . . . . . . . . . . . . . . Lady Dedlock's lover\nOne by remorse . . . . . . . . . . . . . . . . . Lady Dedlock\nOne by insanity . . . . . . . . . . . . . . . . . . Miss Flite\nOne by paralysis . . . . . . . . . . . . . . . . . Sir Leicester\n\nBesides the baby, by fever, and a lively young Frenchwoman left to be hanged. [Not to\nmention Gridley, Miss Barbary - and others?]\n\"And all this, observe, not in a tragic, adventurous, or military story, but merely as the\nfurther enlivenment of a narrative intended to be amusing; and as a properly\nrepresentative average of the statistics of civilian mortality in the centre of London.\""
    },
    {
      "category": "Resource",
      "title": "dur_expts.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-481-victorian-literature-and-culture-spring-2003/0674759241fc4794a3f83918be58b3bd_dur_expts.pdf",
      "content": "Excerpts from Emile Durkheim's The Elementary Forms of the Religious Life (1915)\n\nBefore all, [religion] is a system of ideas with which the individuals represent to\nthemselves the society of which they are members, and the obscure but intimate relations which\nthey have with it. This is its primary function; and though metaphorical and symbolic, this\nrepresentation is not unfaithful. Quite on the contrary, it translates everything essential in the\nrelations which are to be explained: for it is an eternal truth that outside of us there exists\nsomething greater than us, with which we enter into communion.\n\nThat is why we can rest assured in advance that the practices of the cult, whatever they\nmay be, are something more than movements without importance and gestures without efficacy.\nBy the mere fact that their apparent function is to strengthen the bonds attaching the believer to\nhis god, they at the same time really strengthen the bonds attaching the individual to the society\nof which he is a member, since the god is only a figurative expression of the society. (257-58)\n\nIf, as we have attempted to establish, the sacred principle is nothing more nor less than\nsociety transfigured and personified, it should be possible to interpret the ritual in lay and social\nterms. And, as a matter of fact, social life, just like the ritual, moves in a circle. On the one\nhand, the individual gets from society the best part of himself, all that gives him a distinct\ncharacter and a special place among other beings, his intellectual and moral culture. If we\nshould withdraw from men their language, sciences, arts and moral beliefs, they would drop to\nthe rank of animals. So the characteristic attributes of human nature come from society. But, on\nthe other hand, society exists and lives only in and through individuals. (388-89)\n\nIf we are to see in the efficacy attributed to [religious] rites anything more than the\nproduct of a chronic delirium with which humanity has abused itself, we must show that the\neffect of the cult really is to recreate periodically a moral being upon which we depend as it\ndepends upon us. Now this being does exist: it is society.\n\nHowsoever little importance the religious ceremonies may have, they put the group into\naction; the groups assemble to celebrate them. So their first effect is to bring individuals\ntogether, to multiply the relations between them and to make them more intimate with one\nanother. By this very fact, the content of their consciousness is changed. On ordinary days, it is\nutilitarian and individual avocations which take the greater part of the attention. Every one\nattends to his own personal business; for most men, this primarily consists in satisfying the\nexigencies of material life, and the principal incentive to economic activity has always been\nprivate interest. . . . On feast days, on the contrary, these preoccupations are necessarily eclipsed\n. . . At this time, their thoughts are centred upon their common beliefs, their common traditions,\nthe memory of their great ancestors, the collective ideal of which they are the incarnation; in a\nword, upon social things. . . . So it is society that is in the foreground of every consciousness; it\ndominates and directs all conduct; this is equivalent to saying that it is more living and active,\nand consequently more real, than in profane times. So men do not deceive themselves when they\nfeel at this time that there is something outside of them which is born again, that there are forces\nwhich are reanimated and a life which reawakens. This renewal is in no way imaginary and the\nindividuals themselves profit from it. For the spark of a social being which each bears within\nhim necessarily participates in this collective renovation. The individual soul is regenerated too,\nby being dipped again in the source from which its life comes . . . . (389-90)\n\n[on \"the preponderating role of the cult in all religions:] [S]ociety cannot make its\ninfluence felt unless it is in action, and it is not in action unless the individuals who compose it\nare assembled together and act in common. It is by common action that it takes consciousness of\nitself and realizes its position; it is before all else an active co-operation. The collective ideas\nand sentiments are even possible only owing to these exterior movements which symbolize\nthem . . . . (465-66)\n\nFor a society is not made up merely of the mass of individuals who compose it, the\nground which they occupy, the things which they use and the movements which they perform,\nbut above all is the idea which it forms of itself. (470)"
    },
    {
      "category": "Resource",
      "title": "dutyquote.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-481-victorian-literature-and-culture-spring-2003/38f484ac3be62028e35b2715329913d1_dutyquote.pdf",
      "content": "The Victorians on Duty: a few examples, to be contrasted with the behavior of Tom\nJarndyce, Mr. Gridley, Nemo (presumably), and - perhaps - Jeremy Bentham and John\nStuart Mill.\n\n1. Dialogue between John Jarndyce and Esther:\n\"Esther, my dear, do you wish to ask me anything?\"\nHe looked so attentively at me, that I looked attentively at him, and felt sure I\nunderstood him.\n\"About myself, sir?\" said I.\n\"Yes.\"\n\"Guardian,\" said I, venturing to put my hand, which was suddenly colder than I\ncould have wished, in his, \"nothing! I am quite sure that if there were anything I\nought to know, or had any need to know, I should not have to ask you to tell it to\nme. If my whole reliance and confidence were not placed in you, I must have a\nhard heart indeed. I have nothing to ask you; nothing at all.\" (BH 112)\n\n2. The lesson Esther derives from her exposure to the \"philanthropists\" Mrs. Jellyby and\nMrs. Pardiggle:\nI thought it best to be as useful as I could, and to render what kind services I\ncould, to those immediately about me; and to try to let that circle of duty\ngradually and naturally expand itself (BH 117).\n\n2. Captain Swosser's advice:\n\"It was a maxim of Captain Swosser's,\" said Mrs. Badger, \"speaking in his\nfigurative naval manner, that when you make pitch hot, you cannot make it too\nhot; and that if you only have to swab a plank, you should swab it as if Davy\nJones were after you. It appears to me that this maxim is applicable to the\nmedical, as well as to the nautical profession.\" (BH 247)\n\n3. Thomas Carlyle, from Sartor Resartus:\nDo the duty which lies nearest thee.\nAnd:\nWhatsoever thy hand findeth to do, do it with thy whole might.\n\n4. Tennyson, from \"The Charge of the Light Brigade\":\nTheirs not to reason why,\nTheirs but to do and die.\n\n5. Matthew Arnold, from Culture and Anarchy:\nNow does any one, if he simply and naturally reads his consciousness, discover\nthat he has any rights at all? For my part, the deeper I go in my own\nconsciousness, and the more simply I abandon myself to it, the more it seems to\nme that I have no rights at all, only duties; and that men get this notion of rights\nfrom a process of abstract reasoning, inferring that the obligations they are\nconscious of towards others, others must be conscious of towards them, and not\nfrom any direct witness of consciousness at all. But it is obvious that the notion\n\nof a right, arrived at in this way, is likely to stand as a formal and petrified thing,\ndeceiving and misleading us; and that the notions got directly from our\nconsciousness ought to be brought to bear upon it, and to control it. So it unsafe\nand misleading to say that our children have rights against us; what is true and\nsafe to say is, that we have duties towards our children. (175-76)"
    },
    {
      "category": "Resource",
      "title": "holm_dick_quot.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-481-victorian-literature-and-culture-spring-2003/e2777ede85eb7dd235db8290464da37e_holm_dick_quot.pdf",
      "content": "Sherlock Holmes and Charles Dickens\n\n1. Oh for a good spirit who would take the house-tops off, with a more potent and\nbenignant hand than the lame demon in the tale, and show a Christian people what dark\nshapes issue from amidst their homes, to swell the retinue of the Destroying Angel as he\nmoves forth among them! For only one night's view of the pale phantoms rising from the\nscenes of our too-long neglect; and from the thick and sullen air where Vice and Fever\npropagate together, raining the tremendous social retributions which are ever pouring\ndown, and ever coming thicker! Bright and blest the morning that should rise on such a\nnight,: for men, delayed no more by stumbling blocks of their own making, which are but\nspecks of dust upon the path between them and eternity, would then apply themselves,\nlike creatures of one common origin, owing one duty to the Father of one family, and\ntending to one common end, to make the world a better place!\nNot the less bright and blest would that day be for rousing some who never have\nlooked out upon the world of human life around them, to a knowledge of their own\nrelation to it, and for making them acquainted with a perversion of nature in their own\ncontracted sympathies and estimates; as great, and yet as natural in its development when\nonce begun, as the lowest degradation known.\n\n--Dickens, Dombey and Son (1848)\n\n2. \"You have seen the literary articles which have appeared at intervals in the Eatanswill\nGazette in the course of the last three months, and which have excited such general - I\nmay such universal - attention and admiration?\"\n\"Why,\" replied Mr. Pickwick, slightly embarrassed by the question, \"the fact is, I have\nbeen so much engaged in other ways, that I really have not had an opportunity of\nperusing them.\"\n\"You should do so, sir,\" said Pott, with a severe countenance.\n\"I will,\" said Mr. Pickwick.\n\"They appeared in the form of a copious review of a work on Chinese metaphysics,\nsir,\" said Pott.\n\"Oh,\" observed Mr. Pickwick; \"from your pen, I hope?\"\n\"From the pen of my critic, sir,\" rejoined Pott with dignity.\n\"An abstruse subject I should conceive,\" said Mr. Pickwick.\n\"Very, sir,\" responded Pott, looking intensely sage. \"He crammed for it, to use a\ntechnical but expressive term; he read up for the subject, at my desire, in the\nEncyclopedia Britannica.\"\n\"Indeed!\" said Mr. Pickwick; \"I was not aware that that valuable work contained any\ninformation respecting Chinese metaphysics.\"\n\"He read, sir,\" rejoined Pott, laying his hand on Mr. Pickwick's knee, and looking\nround with a smile of intellectual superiority, \"he read for metaphysics under the letter\nM, and for China under the letter C, and combined his information, sir!\"\n\n--Dickens, Pickwick Papers (1837)"
    },
    {
      "category": "Resource",
      "title": "millsub_quot.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-481-victorian-literature-and-culture-spring-2003/5474b13f8853bf88f8975463c6226d8b_millsub_quot.pdf",
      "content": "John Stuart Mill, from The Subjection of Women (1869):\n\nIt is one of the characteristic prejudices of the reaction of the nineteenth century against\nthe eighteenth, to accord to the unreasoning elements in human nature the infallibility\nwhich the eighteenth century is supposed to have ascribed to the reasoning elements. For\nthe apotheosis of Reason we have substituted that of Instinct; and we call everything\ninstinct which we find in ourselves and for which we cannot trace any rational\nfoundation. This idolatry, infinitely more degrading than the other, and the most\npernicious of the false worships of the present day, of all of which it is now the main\nsupport, will probably hold its ground until it gives way before a sound psychology,\nlaying bare the real root of much that is bowed down to as the intention of Nature and the\nordinance of God. (ESE p. 128)\n\nIf people are mostly so little aware how completely, during the greater part of the\nduration of our species, the law of force was the avowed rule of general conduct, any\nother being only a special and exceptional consequence of peculiar ties - and from how\nvery recent a date it is that the affairs of society in general have been even pretended to\nbe regulated according to any moral law; as little do people remember or consider, how\ninstitutions and customs which never had any ground but the law of force, last on into\nages and states of general opinion which never would have permitted their first\nestablishment. (ESE p. 134)\n\nFor, what is the peculiar character of the modern world - the difference which chiefly\ndistinguished modern institutions, modern social ideas, modern life itself, from those of\ntimes long past? It is, that human beings are no longer born to their place in life, and\nchained down by an inexorable bond to the place they are born to, but are free to employ\ntheir faculties, and such favourable chances as offer, to achieve the lot which may appear\nto them most desirable. Human society of old was constituted on a very different\nprinciple. All were born to a fixed social position, and were mostly kept in it by law, or\ninterdicted from any means by which they could emerge from it."
    },
    {
      "category": "Resource",
      "title": "nat_alleg_quot.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-481-victorian-literature-and-culture-spring-2003/3c7d1b054ee48a679804b95b348ab846_nat_alleg_quot.pdf",
      "content": "NATIONAL ALLEGORY IN BLEAK HOUSE\n\nLocation of Bleak House at St. Albans: 1st English martyr. (303 A.D.)\n\nRouncewell's \"strong Saxon face\" (p. 417); \"Norman house\" (654). Norman conquest,\n1066.\n\nWatt Rouncewell + Wat Tyler: Peasant Rebellion (1381).\n\nRichard as Dick Whittington - pp. 73, 75 (and Jo as Whittington - p. 457). Whittington\ndied 1523.\n\nSmallweed as Guy Fawkes puppet - pp. 389-90: refers to 1605 plot against Parliament.\n\nDedlocks - Ghost's Walk and English Civil War (1640s).\n\nGeorge vs. Smallweeds: Hanoverians vs. Jacobites in 1745 (\"Charley over the water\" - p.\n310)\n\nCaddy and Prince: Caroline and Prince Regent (later King George IV) - their disastrous\nmarriage, national controversy over it (early 19th century).\n\nBagnets: identified with defense of Empire (children's names). Praise of Woolwich:\n\"He's a Briton\" (p. 406)\n\nRosa: English rose\n\nLord Chancellor - highest legal representative, presides over British \"law and order\"\n\nChancery Court and Sir Leicester as spider - webs of negative relationship spreading out\nto whole nation.\n\nKenge: Jarndyce and Jarndyce \"a case that could not exist, out of this free and great\ncountry\" - nationally definitive.\n\nRole of Gridley as counterpart to Jarndyce: rural periphery and urban center both\naffected. Gridley and Wordsworthian nationalism (cf. Wordsworth's \"Michael\").\n\n\"Esther\" - Biblical: national heroine, savior of her people\n\nraised at Windsor - p. 31\n\nWoodcourt: half Welsh, half Highland Scot: if he marries Esther, union of Saxon and\nCeltic peoples of Britain."
    },
    {
      "category": "Resource",
      "title": "sher_holm_read.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-481-victorian-literature-and-culture-spring-2003/ffb8d9928c57251c866d62a5a8a44aa2_sher_holm_read.pdf",
      "content": "21L481 Victorian Literature and Culture\n\nSherlock Holmes readings (stories read in entirety appear in bold):\n\n1. Excerpt from A Study in Scarlet (novel), 1887\n\nWatson's situation when he first meets Holmes (15)\nStamford: Holmes is \"too scientific\" (17)\nHolmes's knowledge and ignorance (21)\n\"The Book of Life\" [cf. \"The Five Orange Pips\"]\n\n2. Excerpt from The Sign of Four (novel), 1889 (beginning and end)\n\nHolmes's use of cocaine: \"mental exaltation\"\nWatson and Holmes as authors (90-91)\nWatson had a brother (92)\nWatson's engagement and Holmes's opposition to marriage (157-58)\n\n3. \"The Red-Headed League,\" 1891\n\nHolmes reads Jabez Wilson's history from his appearance (177)\nCopying out the Encyclopedia Britannica: an image of writing and knowledge\nHolmes memorizes city blocks, \"to have an exact knowledge of London\"\nWatson on Holmes's doubleness (185)\nJohn Clay as warm-up for Moriarty?\n\n4. Excerpt from \"A Case of Identity,\" 1891\n\nFantasy of flying over London (191) [cf. Dickens, Dombey and Son]\nSelection and discretion required for literary realism\n\n5. Excerpt from \"The Five Orange Pips,\" 1891\n\nHolmes on the ideal reasoner (224-25) [link to Study in Scarlet]\nThe mind and the encyclopedia [link to \"Red-Headed League\"]\n\n6. \"The Man with the Twisted Lip,\" 1891\n\nOpium addiction (vs. Holmes's cocaine)\nSinister Orientals (\"Malay,\" \"Lascar\") in E. London: reverse colonization\nHolmes working undercover (participant observation)\nCity vs. suburb\nMrs. St. Clair's form of knowledge (\"sympathy\") vs. Holmes's (239)\nNeville St. Clair's journalism (participant observation and \"going native\")\n\n7. \"The Adventure of the Speckled Band,\" 1892\n\nDecline of an ancient family; Dr. Roylott's resentment\nRoylott's bond with gypsies (260): mobility and criminality [cf. Mayhew]\nSnake: deadly thing brought back from empire, recoils on its user\n\n8. Excerpt from \"The Resident Patient,\" 1893\n\nHolmes's love for London: spider in web (423; cf. Moriarty, 471)\nReading Watson's mind [link to Study in Scarlet, \"Five Orange Pips\"]\n\n9. Excerpt from \"The Final Problem,\" 1893\nProfessor Moriarty (470-71; cf. Holmes, \"filaments,\" 423)\nHolmes's sense of public duty [contrast with end of \"Red-Headed\" (190);\nalso with Holmes's complaints about there not being enough good crime]\nHolmes and Moriarty face to face: Doppelganger (472)\n\n10. Excerpt from \"The Adventure of the Norwood Builder,\" 1903\n\nHolmes's lament for Moriarty (496)\nWatson back at 221B Baker St. (what happened to his wife?)\nHolmes's need for Watson\n\n11. Excerpt from \"The Adventure of the Solitary Cyclist,\" 1904\n\nWatson's and Holmes's different reactions to Miss Smith\nHolmes reads her\n\n12. Excerpt from \"The Adventure of the Bruce-Partington Plans,\" 1908\n\nLondon fog: opportunity for criminals, wasted\nHolmes's brother Mycroft, \"the most indispensable man in the country\" (914)\n\n13. Excerpt from \"His Last Bow,\" 1917\n[subtitled \"The War Service of Sherlock Holmes\"]\n\nNot narrated by Watson (detached 3rd person)\nHolmes as patriot, Christian: counter-espionage\n\n14. \"The Adventure of the Creeping Man,\" 1923\n\nCrime against nature; Holmes as defender of natural order (1082-83)"
    }
  ]
}