{
  "course_name": "Vocal Repertoire and Performance: Women Composers",
  "course_description": "This course is for the singer and/or pianist interested in collaborative study of solo vocal performance. This term we will focus upon the works of Women Composers. Students will gather biographical data and explore art songs, operatic arias, choral masterpieces, and arrangements employing sacred and secular texts. Additionally, students will conduct inquiry into works indicative of their own heritage.",
  "topics": [
    "Fine Arts",
    "Music",
    "Music History",
    "Music Performance",
    "Society",
    "Women's Studies",
    "Fine Arts",
    "Music",
    "Music History",
    "Music Performance",
    "Society",
    "Women's Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Content\n\nExploration of Concert Repertoire for the Solo Artist.\n\nThis term we will focus upon the works of Women Composers. Students will gather biographical data and explore art songs, operatic arias, choral masterpieces, and arrangements employing sacred and secular texts. Additionally, students will conduct inquiry into works indicative of their own heritage.\n\nRequirements\n\nLove of singing\n\nGood sight-reading skills\n\nFamiliarity with the keyboard\n\nDaily vocalizing and practice of assigned repertoire\n\nRegular attendance and performance in class\n\nRehearsals with chosen accompanist\n\nPerformance in the culminating recital\n\nThe singer should always be prepared to provide sheet music for instructor and accompanist.\n\nTimeline\n\nA Timeline of the Women Composers Studied (\nPDF\n)\n\nCalendar\n\nKey Dates\n\nWeek 1: Perform songs of your choosing\n\nWeek 2: Choose and begin to perform songs from the recommended repertoire\n\nWeek 7: Mid-term paper due\n\nWeek 10: Heritage paper due\n\nWeek 15: Culminating performance",
  "files": [
    {
      "category": "Resource",
      "title": "es_bhatt_chamina.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-410-vocal-repertoire-and-performance-women-composers-spring-2007/a4a9ecfda8a80ff1c92f0315484e5f8c_es_bhatt_chamina.pdf",
      "content": "Koyel Bhattacharyya\n4 April 07\n21M.410, Wood\nMidterm paper\n\nCecile Chaminade\n\"This is not a woman who composes,\" French composer and writer Ambroise\nThomas once said of Cecile Chaminade, \"but a composer who is a woman.\"\nChaminade, a composer and pianist born in 1857, was a talented young artist born to\na family of amateur musicians in suburban Paris. She displayed great aptitude for\nmusic from childhood, but was prevented from joining the Paris Conservatoire by her\nfather, who felt that the proper role of a middle class girl was that of wife or mother.\nHowever, because her family hosted a musical salon in their home, Cecile was\nexposed to great composers such as Thomas, Gounod, Massenet, Saint-Saens, and\nChabrier. A lucky acquaintance with Georges Bizet, the famed composer of Carmen,\nkept her father's wishes from taking too strong a hold. He encouraged young Cecile\nto study privately with important musicians of the time, learning piano from Felix le\nCouppey, harmony from Augustin Savard, and composition from Benjamin Godard.\nBizet, endearingly calling the young prodigy his \"little Mozart,\" ensured that Cecile's\neducation was as good as any at the Conservatoire.\nAfter her father's death, her career as a concert pianist boomed, and she\nperformed regularly in England, supported greatly by Queen Victoria. She composed\ncopiously, writing about 400 works over her lifetime. Her works are diverse,\n\nincluding an opera, a ballet, a piano concerto, and hundreds of pieces for piano or\nvoice, the latter primarily in French. Following her husband's death, she toured\nthrough Europe and America, and though she never remarried, she had the misfortune\nof falling in love with a flautist, for whom she composed a flute concertino. Her work\nearned her the Legion d'Honneur in 1913, the first given to a female composer. She\ndied in 1944 at the age of 86, leaving behind a long career of compositions and\nconcerts.\nThe music of Cecile Chaminade is notable for its lyrical style, archetypical of\nher time. Indeed, it is often criticized as being too homogeneous and unimaginative.\nThis may be traced back to her lack of formal training. Though Bizet made sure that\nCecile trained under the best teachers, Cecile was never able to experience a\nclassroom setting, where she might interact with other students to exchange ideas.\nShe also learned from a very small number of teachers, preventing her from creating\nher own style from a wide and varied base. Such a background would necessarily\nconstrict her compositional style.\nHer music is also frequently criticized for being too simple. Their lack of\ntechnical demand is reflective of the audience for which she wrote. Her greatest\nsupporters were women, mostly those without much formal training, and her works\nwere primarily salon pieces, easy music that might be picked up with little practice.\nHer emphasis on straight-forward melodies and her placement of enjoyment above\nskill accurately served the purposes to which she catered. Similarly, many of the texts\n\nto which she set music were of \"dubious literary quality,\" meant not to be examined\nfor virtue but merely to entertain. The exotic titles that her pieces were given and the\nattractive packaging in which her works were sold added to the appeal they held for\nless advanced audiences, and these too were criticized for their lack of high\nseriousness. Indeed, her music was often simply a pleasant alternative to the\notherwise-heavy music popular in her day, and was frequently separated from the\ncategory of classical music and placed in that of popular music.\nThough her composition and performance set her apart, she was constantly\ninsecure about her own talents, perhaps because of the societal atmosphere in which\nshe worked. Few women were so prolific or so famous, and this may have forced\nCecile to question whether this was due to a natural deficiency in women. Surely her\nfather's assertion that women were meant to be wives and mothers fed into this\nmentality. She ultimately concludes, however, \"Life has been hard on women....\nShe has been handicapped, and only the few, through force of circumstances or\ninherent strength, have been able to get the better of that handicap.\" Nonetheless, her\nbase of admirers was sizeable. Mostly female, her fans had created one hundred\nChaminade clubs by 1904, and well over a hundred more would follow. Even before\nshe began touring the world, her fame spread before her, particularly to America. She\nserved as a female role model at a time when women's rights were being lobbied for\nmore enthusiastically than ever. Her ability both to serve as a member of high society\n\nand to perform and publish compositions on a grand scale helped women everywhere\nunderstand the attainability of both a professional and social life.\nCecile Chaminade was one of the most published female composers of her\ntime, though she established herself not simply as a female composer, but simply as a\ncomposer. Her works were prolific and varied in type, and though they have been\ncriticized for a quality of sameness, they are consistently charming. She has been\ncriticized equally for failing to demand rigorous expertise and talent of those\nperforming most of her works, but she served her purpose--to entertain--with\nexquisite grace. Her stance as a woman who could both write for the salons and\nattend the salons at which such works might be casually performed turned her into a\nfemale role model with none of the harsh, unfeminine nature of most feminists. The\naccolades she earned were well deserved. Despite the restraints placed upon her by\nsociety and by her father, she attained a stature that many, who are given greater\nprivileges and a better chance, never do.\n\nReferences\nCitron, Marcia. 1988. Cecile Chaminade: A Bio-Bibliography. Connecticut:\nGreenwood Press, Inc.\nDemuth, Norman. 1959. French Piano Music. A Survey with Notes on its\nPerformance. London: Museum Press Ltd.\nKIMBALL BOOK THINGIE\nSmith, Richard Langham. 1994. Sister of Perpetual Indulgence. The Musical\nTimes 135, 1822 (December): 740-4.\nTardif, Cecile. 1993. Portrait de Cecile Chaminade. Montreal: Louise Courteau."
    },
    {
      "category": "Resource",
      "title": "es_bhatt_mirabai.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-410-vocal-repertoire-and-performance-women-composers-spring-2007/9f177132dde81fb1f19c065f7b6623d7_es_bhatt_mirabai.pdf",
      "content": "Koyel Bhattacharyya\n21M.410\n11 April 07\nHeritage composer\n\nMirabai\nDespite the increasing prevalence of Western culture throughout the world,\ncertain aspects of culture resist the mixing that naturally comes with ease of\naccessibility to every corner of the world. Though music from wildly disparate\nbackgrounds is constantly being fused together now to create fascinating new sounds\nand styles, and although composers of various nationalities have begun crossing over to\ndifferent styles, some more conservative cultures resist such melanges.\nIndian music has a rich history of its own, a tale of the gradual layering of the\nmusic of different peoples inhabiting the Indian subcontinent. In itself, it varies region\nby region, as different immediate lifestyles have molded particular branches. One thing\nis clear, however: that the Indian style is distinctive from its Western congeners, and\nthat while crossovers are not impossible, the resulting style is recognizably neither\nIndian nor Western in nature.\nComposers of Indian classical music often do not receive the kind of credit\ngiven to Western composers. The simplest reason for this lies in the manner of\nperforming such music. The composer rarely lends great genius to a classical work,\nwhich is almost entirely improvised. Artists begin from a theme--a phrase, a few bars\nby a Western manner of accounting--that is written by a composer, and from such a\n\nhumble base, they build towers of melody related to the opening thematically or in\nmelodic mode (raga). Classical pieces may last hours, as the artist explores the limits\nof harmonic interplay and of his own physical stamina. Because the true beauty of a\nwork lies in its performance, then, and not in the base on which it is built, performers\nare more important and more widely known than composers.\nCompositional fame is, however, ample in the writing of poetry on which vocal\nmusic is built. These lyricists frequently set their words to music, though the music is\nmalleable and performers are given some degree of freedom to adjust the music to their\nvoices and styles. Entire categories of Indian music are built around such composers,\nleading to branches such as Rabindra sangeet (the songs of Nobel laureate\nRabindranath Tagore) and Nazrul geeti (those of Kazi Nazrul Islam).\nGiven the limited range of compositional feats that lend to fame, the tiny\nnumber of well-known female composers is unsurprising. While in many ways, the\nattitude of India toward women has been forward-thinking and liberating--families are\nhistorically matriarchal, and India's first female Prime Minister, Indira Gandhi, served\nfour decades ago--in many other ways, it has been oppressive. Less extreme than the\npractices of sati (self-immolation of a widow, particularly one of high class), there exist\nmore everyday barriers for women. As in Western society, women performing outside\nof the home were looked upon as dirty, and a woman's primary role was in the house,\ncaring for her children, her husband, and their parents. As such, the proportion of\n\nfemale composers in Indian music is at least as small as that in Western music. One of\nthe most famous and timeless of these is the poet-queen, Mirabai (Meera).\nBorn in Merta in the early sixteenth century, Mirabai's life is as much pieced\ntogether from legend and song as from fact. Her father was the ruler of Merta, and as a\ndaughter of the privileged class, she was given a good education by her grandparents\nupon her mother's death when Mirabai was four. Her education strongly stressed\nmusic, particularly--as per the tradition of the time--religious music. Though the\nfamily worshipped Vishnu as the primary deity, Mirabai quickly shifted her devotions\nto Krishna, the mischievous child-god avatar (incarnation) of Vishnu. According to\nlegend, her devotion sprang from an idol given to her by a traveling beggar, in\nconjunction with her observation, in a previous life, of a great feat of strength and\nprotection by Krishna.\nAt the age of thirteen, she wed the ruler of Mewar, the highest of the kings of\nIndia at the time. Despite her social stature, Mirabai did not always follow the norms of\nher day. Her extreme devotion to Krishna led her to neglect many of her social\nresponsibilities, and she rejected the family god, Durga, while dancing and singing in\npublic temples. She also rejected the caste system, which was very much in place at the\ntime and remnants of which still linger in Indian society today, and mingled with people\nof all castes and backgrounds. To these offences, she added one even greater: when her\nhusband died a few years after their marriage, she refused to perform sati.\n\nWhen both her father and her dead husband's father were killed in a war, the\nnew ruling family of Mewar made Mirabai's life miserable. After several attempts on\nher life, Mirabai left the palace and became a traveling mendicant, though she was\nrejected by male spiritual leaders and healers for being a woman. Her journey became a\npilgrimage, and she is not said to have died so much as to have disappeared in a temple\nof Krishna. According to legend, she entered a Krishna temple singing in ecstasy,\nwhereupon the doors shut behind her. Later, her sari was found entwined about the\nfigure of Lord Krishna, a final testament to her oneness with her deity.\nThough Mirabai's devotion lasted her entire life, she composed most prolifically\nafter being forced out of her deceased husband's palace. As many as 1300 pieces are\nattributed to her, though her original texts have since been translated into various\nlanguages, primarily Hindi. She wrote mostly of her love for Krishna and of her\ngratefulness for his graces, and during her lifetime, she frequently performed her own\nworks, accompanying herself on a sitar given to her by a member of the \"untouchable\"\ncaste whom she held in high esteem as an enlightened fellow devotee of Krishna. Her\nfame spread throughout India, not only for her compositions, but also for her skill at\nsinging, as well as for her strange history. Her scandals in court of abandoning the\nways of royals in order to be closer to Krishna were looked upon more favorably by the\npeople, with whom she mingled regardless of caste or wealth. Indeed, she did much to\nerase caste boundaries and to defy the roles set for women, by refusing to commit sati\n\nand by refusing to obey the rules of propriety. Her work to advance social norms\nthrough her own actions and through her music has endured until today.\nHer music is typically simple of rhythm, its power lying in the support of the\ntext by the music. Like most Indian vocal music, the composer pays little attention to\naccompaniment, with the instrument (typically, sitar or harmonium) and tabla (drums)\nimprovising in a way that lends the strongest foundation to the vocalist. The voice itself\nis given great flexibility, and ornamentation and undisruptive text painting are frequent.\nMirabai's melodies are repetitive, coming in the form of a refrain intercalated between\nshort verses, and the meaning of the text in each verse lends different parts of her songs\ntheir disparate feelings. Again as in most Indian music, her melodies are modal (in\nvarious ragas), often lending them a mystical air.\nHer pieces have been remarkably preserved, and are collectively known as\nPadavali. One of her most popular pieces, transliterated to \"Payoji Maine\" (\"I have\nfound\") runs as follows:\n\nPayo ji maine Rama-ratana dhana payo.\n(refrain)\n\nVastu amolika di mere sataguru,\nkirpa kara apanayo, payo ji maine...\n\nJanama janama ki puji pai,\njaga me sabhi khovayo, payo ji maine...\n\nKharaca na khute, cora na lute,\ndina dina barhata savayo, payo ji maine...\n\nSata ki nava khevatiya sataguru,\nI have found, yes, I have found the wealth\nof the Divine Name's gem.\n\nMy true guru gave me a priceless thing.\nWith his grace, I accepted it.\n\nI found the capital of my several births;\nI have lost the whole rest of the world.\n\nNo one can spend it, no one can steal it.\nDay by day it increases one and a quarter\ntimes.\n\nOn the boat of truth, the boatman was my\n\nbhava-sagara tara ayo, payo ji maine...\n\nMira ke Prabhu Ghiridhara Nagara,\nharasha harasha jasa gayo, payo ji maine...\n\ntrue guru.\nI came across the ocean of existence.\n\nMira's Lord is the Mountain-Holder,\nthe suave lover, of whom I merrily,\nmerrily sing.\n\nThis piece is characteristic of Mirabai's pieces. Again an artifact of most Indian\nvocal music, particularly of the older variety, Mirabai inserts herself into the final verse\nof the song (Mira ke Prabhu...), much as an artist signs a canvas. She emphasizes in\nthat final verse her devotion to Krishna (the Mountain-Holder, as per legend), and\nthough much of the beauty is lost in translation, one can still understand the innocent\nlove of a disciple for her master.\nMirabai's stature and fame preserved her name and her works through the\ncenturies, making her one of the best-documented and most widely-renowned Indian\ncomposers of either gender. That she, as a woman, accomplished so much makes her an\neven greater anomaly, a stand-out among stand-outs. The purity of her devotion caused\nher great troubles and pain throughout her life, as she was persecuted for her love for\nher deity and his other disciples, regardless of caste. At the same time, it allowed her an\noutlet for the beauty we see in her pieces, and made her one of the greatest composers\nof Indian music.\n\nReferences\nBehari, Bankey. 1971. Bhakta Mira, 2nd ed. Bombay, Bharatiya Vidya Bhavan.\nHarlan, Lindsey. 1992. Religion and Rajput Women: The Ethics of Protection in\nContemporary Narratives. University of California Press, Berkeley.\nHawley, John Stratton; Wulff, Donna Marie, ed. 1986. The Divine consort: Radha and\nthe goddesses of India. Boston: Beacon Press.\nRosen, Steven J. 1996. Vaisnavi: Women and the Worship of Krishna. Delhi: Motilal\nBanarsidass Publishers."
    },
    {
      "category": "Resource",
      "title": "es_cherry_boulan.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-410-vocal-repertoire-and-performance-women-composers-spring-2007/2c6ddf00692b9a764fe646e8063031be_es_cherry_boulan.pdf",
      "content": "Elaina Cherry\nNadia Boulanger\nHistory is full of eminent musicians who shaped the course of western classical music.\nOf these, there are a handful of composers who's influence is perhaps beyond measure. But one\ncomposition teacher was so influential that her students rank among the most prominent\nmusicians of the twentieth century in modern classical music, jazz, and popular music. In the\nmiddle of the 20th century, any composer wanting to be taken seriously made the trip to study\nin Paris with Mademoiselle at the Boulangerie. Nadia Boulanger was a great teacher in part\nbecause of her distinguished teachers and colleagues who taught her about compositional\ntechnique and style. Additionally, her own experiences as a young composer, though her career\nended abruptly in 1922, contributed to her immense teaching capacity. Nadia Boulanger is well\nknown for her contributions as a pedagogue, but her own compositional career is often\noverlooked.\nOn September 16, 1887, Raissa Myschetsky and Ernest Boulanger welcomed a\nnew daughter, Juliette Nadia Boulanger. Ernest Boulanger, a composer, musician, and professor,\nshared Nadia's birthday and turned 72 the day his daughter was born (Spycket). Six years later,\nRaissa gave birth to Marie Juliette, better known as Lili, on August 24, 1893. Lili was never a\nhealthy child, and suffered her first bout of pneumonia at age 3 (Spycket). Raissa was 42 years\nyounger than her husband, and the couple had separate bedrooms, according to middle-class\nconvention of the time (Rosenstiel). She was a strict and protective mother for Nadia and Lili,\noverseeing every aspect of their lives and education.\nAs a young child, Nadia reviled every form of music, hiding in her mothers skirts or\nshrieking when she couldn't get away from it. It was, perhaps, a simple and effective way of\ngetting her parents' attention. But when Raissa was pregnant with Lili, Nadia's distaste for\n\nmusic changed overnight into an all-consuming passion for it. She began listening in on all the\nmusic lessons her father gave, and dedicating herself to mastering the traditional French\nmusicianship courses (Rosenstiel). Nadia's musical ability progressed very quickly, and at age\nnine she entered the Paris Conservatoire to study solfege, organ, and composition (Spycket). Her\nthen retired father supervised her musical studies until his death on April 14, 1900. Nadia was\ntwelve, and Lili just six when their father died at age 84. In 1904 Raissa moved the family to 36\nrue Ballu where Nadia lived until her death on October 22, 1979 (Spycket).\nThe Conservatoire brought Nadia in contact with the French elite in the world of music.\nThere she met teachers, classmates, and, later, students who greatly affected her musical career.\nOne of Nadia's earliest compositional influences was Gabriel Faure. She began studying with\nFaure in 1901, and his quintessential French style shows heavily in her works. In particular, the\ntwelve songs or melodies published in 1909 are highly evocative of Faure's works (Kendall).\nRavel and Boulanger took classes together while Ravel was already an established composer, and\nboth competed for the Prix de Rome (Rosenstiel). Nadia was also a great admirer of Stravinsky,\nand saw many of his works which first premiered in Paris. Stravinsky's Octet for Winds, which\npremiered in 1923 was panned by critics after the first hearing. But Nadia was deeply impressed\nby what she perceived as a new style for Stravinsky and believed it would serve as a new\ncompositional model, though she agknowledged the piece was difficult to understand at first\nlistening (Rosenstiel).\nAnother mentor was Raoul Pugno, a figure of extreme importance in Nadia's life. They\nmet at the Conservatoire, and Pugno, 25 years her senior, took a keen interest in her studies and\nperformances. The Boulanger apartment on rue Ballu was only a short distance from Pugno's\napartment, and Madame Boulanger rented, and later bought, a summer retreat near Pugno's\nsummer home in Gargenville (Spycket). Raoul Pugno was a lifelong friend and supporter of\nNadia's, and their close relationship generated gossip about a possible affair between the young\n\nmusician and her mentor, a notorious womanizer (Spycket). Pugno started out primarily as an\norganist and composer, but he is most well-known for his later years as a concert pianist. Over\nthe years, he and Nadia gave many concerts together, and he often referred students to her.\nPugno sent Nadia her the first American students, who became an important part of her later\nteaching career (Spycket). The two collaborated on La Ville Morte, an opera based on a\nD'Annunzio novel which the author personally adapted for the libretto (Rosenstiel). Though\nwritten in 1910, the opera received little interest until 1914, after Pugno's death in January of\nthat year. La Ville Morte was set to premiere in November at the Opera-Comique, but the\noutbreak of the Great War in August terminated all efforts in that direction (Rosenstiel).\nMadame Boulanger pushed Nadia into a musical career at an early age after the death of\nErnest Boulanger in 1900. With Ernest's death, the family's main source of income vanished, and\nthe Boulangers struggled through a few years. Nadia received her first paycheck in July of 1904\nfor playing organ accompaniaments at a primary class presentation att he Trocadero Palace\n(Spycket). In 1906, she made her compositional debut with the premiere of Versailles. Nadia\nalso taught piano lessons during this time for extra income. The majority of Nadia's works were\nwritten, published, or premiered between 1906 and 1910. It was in this time period that she\ncompeted in the Prix de Rome competition three times. She competed in 1906 and 1907, and in\n1908 was awarded a Second Grand Prize, which did not carry with it the trip to Rome\n(Rosenstiel). Nadia set the required vocal fugue for instruments, an act which angered some of\nthe competitions judges, including Saint-Saens.\nThe upset of the 1908 competition also handicapped her during her next Prix de Rome\nattempt in 1909. Many of her supporters were no longer acting as judges and advisors to the\ncompetition. Due to politics and sexism, Nadia lost the 1909 Prix de Rome entirely (Rosenstiel).\nHowever, she rewrote the 1909 Roussalka and premiered it as Dnegouchka. No prior Prix de\nRome cantata had been publicly performed, as the libretto and musical theme technically\n\nbelonged to the competition. The work received mixed reviews, and prompted the Menestrel's\ncritic to observe \"As for the cantata of Mlle Nadia Boulanger, Dnegouchka, assuredly an\ninteresting but convoluted work, I admit that I need to hear it a second time in order to appreciate\nit fully.\" An old friend of Ernest Boulanger's, Hillemacher, wrote Nadia to congratulate her,\nsaying \"my two hands added, with all their power, to your beautiful success\" (Rosenstiel).\nNadia's 1908 Second Grand Prize was the highest honor a woman had yet achieved in the Prix de\nRome. But just five years later, Lili Boulanger won First Grand Prize, becoming the first woman\nin any category to be awarded that distinction. Nadia shared in her sister's triumph, as she had\ntutored Lili in music and composition since Lili's poor health prohibited her from entering the\nConservatoire until 1912 (Spycket).\nNadia Boulanger's compositional career lasted approximately from 1906 until 1922, with\na collection of songs set to poems by Camille Mauclair. These songs were her last published\nworks (Spycket). Nadia's earlier compositions were generally tonal, featuring essentially tonal\nchords but with many suspended dissonances. She pushed the boundaries of tonality as far as\nthey could go, but her rhythmic vocabulary was rather conservative, especially in comparison to\ncontemporaries like Stravinsky (Irvin). Her later pieces, particularly the set of Mauclair songs,\nwere more austere, and her tonal vocabulary even more remote, featuring prominent neomodal\nand atonal elements (Irvin). However, Nadia considered her own compositions lacking in\ngreatness, and her own perfectionism drove her to give up composing and instead focus on\nteaching. Others saw the value and beauty in her compositions, as Faure told her late in his life\n\"I'm not sure you did the right thing in giving up composition.\" Nadia demurred, and Faure\nresponded by playing from memory and exercise she had written at age 14, commenting \"still,\nthere was something in that\" (Monsaingeon).\nAfter 1922, Nadia focused on what she felt to be her true gift: teaching. Every\nWednesday until her death she held classes in her apartment at 36 rue Ballu in Paris (Spycket).\n\nNadia's students include Aaron Copland, Leonard Bernstein, Virgil Thomson, and countless\nothers. Though Nadia spent nearly sixty years of her life focused on teaching, she did not give\nup her own musical career entirely. She continued to conduct and perform, and was the first\nwoman to successfully conduct many major orchestras, including the New York Philharmonic\nand Boston Symphony Orchestra (Rosenstiel). Nadia Boulanger's music is still performed,\nthough her work does not receive the same interest as that of her sister, Lili. Nadia's decision to\nstop composing early in life surely diminished the output of a great female composer of the 20th\ncentury.\n\nBibliography\nIrvin, Marjory. Introduction to Nadia Boulanger's Songs. New York: Da Capo Press 1985.\nKendall, Alan. The Tender Tyrant, Nadia Boulanger. London: Macdonald and Jane's, 1976.\nMonsaingeon, Bruno. Mademoiselle. Trans. Robyn Marsack. Manchester: Carcanet, 1985.\nRosenstiel, Leonie. Nadia Boulanger. New York: W. W. Norton & Company, 1982.\nSpycket, Jerome. Nadia Boulanger. Trans. M. M. Shriver. Stuyvesant, New York: Pendragon\nPress, 1992."
    },
    {
      "category": "Resource",
      "title": "es_fernan_hensel.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-410-vocal-repertoire-and-performance-women-composers-spring-2007/c5e4cb272f4505f8b505f3b1717df5e8_es_fernan_hensel.pdf",
      "content": "Jodie-Marie Fernandes\n21M.410 - Vocal Repertoire and Performance\nMidterm Paper - The Life of Fanny Mendelssohn Hensel\n\nThe life of Fanny Cacillie Mendelssohn Hensel was a short one, spanning just\nforty-two years. But they were forty-two years steeped in passionate, vibrant and awe-\ninspiring musical creativity that manifested itself in her performances and\ncompositions, which number among the hundreds. She was born just after the turn\nof the nineteenth century and during the evolution of the romantic era in music, to a\nwealthy family of the Jewish intelligentsia in Hamburg, Germany, on November 14th,\n1805. Granddaughter of the eminent philosopher, Moses Mendelssohn and daughter\nof successful, educated and accomplished parents, Abraham and Lea Mendelssohn,\nHensel was born into a family of intellectuals whose focus on learning brought about\nan early beginning to her musical education. She was first taught piano by her mother\nand as her incredible talent was discovered, she was sent to study under the tutelage\nof some of the most reputed instructors of the time, including Marie Bigot de\nMorogues, Ludwig Berger and Carl Friedrich Zelter. At the age of thirteen, she\nmemorized and performed twenty-four Bach preludes from the \"Well-Tempered\nClavier\", and at nineteen, had composed thirty-two fugues. Her fellow musical\nscholar and prodigy was none other than her younger brother, the revered romantic\ncomposer, Felix Mendelssohn, with whom she shared a strong bond. The two studied\nunder the same teachers, both displaying unmistakable musical genius which was\nnurtured carefully and responsibly by their parents.\nThrough their insight and efforts, the family's circle of friends became quite\nfamiliar and enamored with the music produced by Hensel and her brother through\nthe well-known \"Sonntagmusiken\" events, which were private weekly concerts held\nat the family mansion. During her teenage years, Hensel had the opportunity every\nSunday to showcase her talent for the piano and for composition, before an audience\nof Hamburg's elite. Amongst her repertoire were a great number of pieces by J. S.\n\nBach and Beethoven as well as those of her Felix her brother, although the majority\nwas her own. Abraham Mendelssohn certainly recognized the value of the family\nsalons and enlisted several prominent vocalists and instrumentalists from the\nHofkapelle to perform in them alongside his children. It is important to note,\nhowever, that these salons represented the vast majority of performance\nopportunities for Fanny Hensel, for whom they must have been bittersweet. The only\npublic performance she ever gave was at a charity event in 1838, for which she played\nher brother's Piano Concerto No. 1.\nThe reason for this was rooted in the prevailing expectations of a woman in\nher circumstances. Even before her father had instituted \"Sonntagmusiken\", he had\nrevealed his sentiments regarding her future. She was never intended to have a career\nin music. Rather, she was to be a loyal wife and mother, whose artistic and intellectual\nambitions would come a distant second to her husband and family. Abraham\nMendelssohn frowned upon the notion of having his daughter's works published\nalthough he never ignored her undeniable musical genius. There exists a quote from a\npiece of correspondence in which he conveyed to her this view. In it he says, \"Music\nwill perhaps become his (Felix's) profession, but for you, it can and must only be an\nornament.\"\nFanny Hensel's response to this was admirable to say the least. Rather than\nbeing deterred by the wishes of her parents, but without flouting her father's\nauthority, she continued to compose, to study and to perform, even though her scope\nwas limited to the few concert-goers and family friends who attended the\nMendelssohn salons. Her brother was her intimate companion, and provided support\nand inspiration during their studies. However, she had to contend with an extended\nperiod of separation from him during his trip to England with his father, during\nwhich he began to showcase his talents to prominent figures in music in Europe. Due\nto the absence of the two, the family salons were discontinued. At this time however,\nFanny Hensel also embarked on a different course in life, and married the reputable\npainter, Wilhelm Hensel. She maintained an avid correspondence with her brother,\n\nwhom she missed dearly during his travels, but also cultivated a notably happy\nmarriage with her husband. Their union came at the end of a nine-year long courtship\nand was seemingly a perfect match, since Wilhelm proved to be a great supporter of\nhis wife's musical abilities and later pushed for her to begin actively publishing her\nworks. Between 1840 and 1846, only six of her songs had been published, but under\nFelix Mendelssohn's name, in a collection of twenty-four songs. According to one\nparticular anecdote, one of these songs was the favourite of Queen Victoria of\nEngland, who in a private audience with Felix proclaimed it to be so, and after which\nhe informed her that it was not his composition, but his sister's.\nThis song was entitled \"Italien\" and is assumed to be the product of a year-\nlong and very inspirational trip for Fanny which she spent with the family in Italy in\n1839/1840. It was during this time that she began to perform for wider circles of\npeople and became acquainted with the young Charles Gounod who remarked that\nshe played with \"the grace and simplicity of those who make music because they love\nit\". Over the following years she also began a friendship with Clara Schumann, who\neventually performed in one of the Mendelssohn salons which Fanny Hensel had\nreinstated with increased fervour in 1831, two years after her marriage. From then on,\nthe Sunday concerts were graced with the presence and performances of Berlin's best\nvocalists and intrumentalists, as well as Fanny's own choir of twenty singers, whom\nshe conducted in works of Bach, Beethoven, Weber and Felix Mendelssohn as well as\nher own works. These included lieder, works for piano solo, chorus and orchestra.\nSome examples of her compositions include the setting of Hero and Leander\nfor soprano and piano or orchestra, her piano trio, her orchestral overture which was\nwritten in 1830, and larger works for soloists, chorus and orchestra such as the Hiob\ncantatas, Lobgesang, and Musik fur die Toten der Cholera-Epidemie (Oratorium\nNach Bildern Der Bibel). One of the most significant characteristics of a large\nportion of her work would be that of great number of piano pieces which she wrote\nin the style of the Lied. She entitled several of these \"Song without words\" which\ntruly display her engaging melodic genius. This feature is witnessed also in various\n\nsettings of poetic texts, and demonstrates the beautiful romantic qualities of her\nmusic.\nDuring her last year, Fanny Hensel began actively publishing some of her\nworks with the solid support and encouragement of her husband. It is unknown\nwhether her brother endorsed this decision, and there are conflicting accounts of his\nsentiments. Some report that he was merely concerned that she may not be able to\nmaintain a continuous flow of new compositions, and might be viewed as a failure by\nthe public, but that she eventually received his blessing. Others state he opposed it\nuntil the end. During that year, she published Opus 1-7, which included lieder, a\ncappella, songs and piano pieces. Before any more of her extensive collection could\nbe published, on May 14th, 1847, she passed away from a stroke during a rehearsal for\none of the \"Sonntagmusiken\" concerts she had continued for sixteen years and which\nhad given her an outlet for her immense talent.\nMany persons are of the opinion that her death was premature, but this can\ncertainly be said of many other widely admired and talented composers of the last few\ncenturies. However, it is my belief that Hensel produced music fraught with beauty\nand intimacy, and quite a large amount thereof, but passed away only after she had\nachieved a great deal, and carried out her purpose in life. It might be said that she\nproduced the same quantity and quality of any other composer of comparable ability\nwho lived twice as long. Not only do her works place her amongst the most revered\nfemale composers in history, but also rank among those of the greatest composers of\nboth genders in the entire history of classical music. It is fortunate that, in the face of\nsociety's expectations of women, her parents educated her and gave her the tools to\nproduce the art that she did. It is admirable that she proceeded to defy the social\nnorm thereafter, and a blessing that at least some of her brilliant work remained for\nthe world to appreciate and to revere as that of a great woman composer.\n\nBibliography:\n\nhttp://www.fannyhensel.de/hensel_eng/biografie01.html\n\nhttp://www2.wwnorton.com/college/music/enj9/shorter/composers/hensel.htm#bio\n\nhttp://en.wikipedia.org/wiki/Fanny_Mendelssohn\n_________________________________________________________\nhttp://www.creativekeyboard.com/backissues/feb05/tribute.html"
    },
    {
      "category": "Resource",
      "title": "es_fernan_price.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-410-vocal-repertoire-and-performance-women-composers-spring-2007/3ff7cb23cb603a286ccebd155951f953_es_fernan_price.pdf",
      "content": "Jodie-Marie Fernandes\n21M.410 - Vocal Repertoire and Performance\nHeritage Paper - Florence Beatrice Price\n\nFlorence Beatrice Price was certainly a woman to be admired and esteemed. A\nfemale composer and performer in the classical style yet rooted in her culture, her works\nabound in the different facets of classical music, most significantly in piano, vocal and\norchestral work, and have been recognized publicly several times over. She began her prolific\ncareer in music at a tender age. Price was a child prodigy born to well-educated and\nprofessional parents in Little Rock, Arkansas. Her mother, Nee Florence Irene Gulliver, had\nat different times been a school teacher, a restaurant owner and realtor, and her father, James\nH. Smith, the first Black dentist in the area, whose services were sought by many, including a\ngovernor of the state. Price's mother took a keen interest in her education from a very early\nage, and since at the time Florence Irene Gulliver Smith went to school, music education\nwas mandatory up to eighth grade, she knew enough music to begin nurturing her child's\nunmistakable musical talent. At the age of four, Price's mother showcased her daughter's\nability for the first time through a recital performance on the piano. This amazing feat\nhowever was certainly not her last as a young, growing musician. At the age of eleven, Price\npublished her first work, which is unfortunately no longer in print, and by age sixteen had\nreceived a commission for another.\nDuring elementary school, she was taught by one of the most recognized African\nAmerican school teachers, Charlotte A. Stephens, whose seventy-year long career earned her\nquite a high level of esteem. Little Rock Elementary was named for her soon after. Under\nher charge, Price excelled and eventually graduated as valedictorian of her class at fourteen\n\nyears old from Capitol High School. She enrolled two years later at the New England\nConservatory in Boston and began study with Frederick S. Converse and George Whitefield\nChadwick who taught music theory, and with Henry M. Dunham, in organ performance.\nPrice graduated in 1906 with a Bachelor's degree in organ performance and music education\n(piano). During her three years at the conservatory, she performed publicly as a pianist on\ntwo known occasions, the dates and programs for which have been recorded. They included\nSchumann's Variations, Opus 5, which Price played when she was seventeen, and Allegro by\nReinecke which she presented at the age of nineteen. According to some surviving\ndocumentation, she also performed organ works of Dubois, Merkel, Lemmens and H. M.\nDunham, her teacher. Typically, it is assumed that she gave various other concerts while in\nBoston, the records of which are no longer available. There also exists an account which\nsuggests the possibility of the existence of a symphony which she wrote and which was\nperformed during this period. However, if this work was indeed written, it is not available\noutside of the family files.\nPrice returned to Little Rock, Arkansas at the end of her undergraduate years and\nbegan teaching at Shorter College in the North of the town, while keeping house for her\nfather who had since separated from his wife. Four years later, she accepted the position of\nmusical director at Clark University in Atlanta, but returned to Little Rock two years hence\nto wed Thomas J. Price, who was a flourishing young attorney. The couple lived there\ncomfortably for fifteen years during which time Thomas had established his own office, and\nFlorence had borne three children, two girls and a boy who died in infancy. However, her\ninvolvement in music was not abandoned as she continued to teach privately and to\ncompose. In 1925 and 1927, her pieces won second place in the Holstein Prize competition\nof Opportunity magazine.\n\nAt this time however, the racial climate of Little Rock and of the south in general\nhad been gradually declining, and the Price family moved to Chicago. There Florence began\nher graduate study in music, attending six different colleges at different times and studying\nunder the instruction of Carl Busche, Wesley La Violette and Arthur Olaf Anderson, among\nothers. Some of her compositions had been published by G. Schirmer Ltd. McKinley\npublishing company also became interested in her work on beginner's piano pieces, the\nproduct of which would become increasingly important in her life. In 1932 came her most\nsignificant achievement up to that point, when her \"Symphony in E minor\", soon after\nplayed by the Chicago Symphony Orchestra, won the acclaimed Wanamaker Prize and made\nher famous. In addition to that remarkable accomplishment, her piano sonata in E minor\ntopped its category in the same competition and her student and friend Margaret Bonds,\nclaimed first prize for her song entitled, \"The Sea Ghost\". Indeed during this period, the\nGreat Depression was affecting the lives of all Americans. Her earnings from teaching and\nwriting for radio commercials as well her competition winnings, of $750, were certainly a\nlarge help. One existing quote of Florence Price gives some insight into her life at the time.\nShe writes: \"I found it possible to snatch a few precious days in the month of January in\nwhich to write undisturbed. But, oh dear me, when shall I ever be so fortunate again as to\nbreak a foot!\" It turns out that this misfortune produced the symphony in E minor that\nearned her the Wanamaker Prize.\nAfter her graduation in 1934, she continued to compose. Unfortunately, her marriage\nhad slowly deteriorated and, around this time, she separated from her husband. This put her\nin even more financial difficulty, and forced her and her two daughters to move in with her\nstudent, Margaret Bonds, whom they lived with for years to come. During this difficult time,\nPrice continued to compose extensively. She supported her family as a composer of didactic\n\npiano works in addition to her more involved, large-scale pieces, an organist for silent films\nand an orchestrator for WGN radio. Her third and last symphony was written in 1940 and\nshe passed away from a stroke the very next year.\nFlorence Price composed over three hundreds songs, piano pieces and orchestral\nworks. Many of these songs were her arrangements of Negro folk songs and African\nAmerican spirituals and art songs, which display clearly the character of black culture and\nmusic. Her professor at the New England Conservatory, George Chadwick, was a composer\nwith great interest in African musical styles and motifs, many of his pieces eventually\nshowing this influence. Indeed, Price also followed this course, and allowed the culture in\nwhich she was raised to impact her music. One of the most significant instances of this\noccurs in the last movement of her E minor symphony, which makes use of the rhythms of\nthe juba dance, which was of African origin, and quite common during the nineteenth\ncentury among the black residents of the southern states. Very few of her actual large works\nuse folk melodies directly, but a sense of the pathos of southern life, as well as the rhythmic\nnature of all aspects of black culture is certainly evident throughout. This, coupled with her\noverflowing musical brilliance, made Florence Price one of the most renowned composers in\nthe United States. And this recognition is augmented still by her resilience as a black female\ncomposer, at a time when such a profession was hardly viable. Her genius, uniqueness and\nstrength are admirable in the highest sense, and the esteem in which her name is held, is\ncertainly truly deserved.\n\nBibliography:\nhttp://www.jstor.org\nhttp://www.ambache.co.uk\nhttp://en.wikipedia.org/wiki/Florence_Price\n\n_________________________________________________________\nhttp://www.aaregistry.com/african_american_history/799/Pianist_and_composer_Florence_S_Price\n______________________"
    },
    {
      "category": "Resource",
      "title": "es_judd_bosmans.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-410-vocal-repertoire-and-performance-women-composers-spring-2007/8f7ec070091dd5fbbbd7c458de3201e5_es_judd_bosmans.pdf",
      "content": "Henriette Bosmans\nDutch composer and pianist\nTilke Judd\nHeritage project - MIT Vocal Performance - April 2007\n\n!\nHenriette Bosmans was born in Amsterdam on December 6, 1895. Her father, Henri\nBosmans, had been the principal cellist of the Concertgebouw Orchestra, but he died when\nBosmans was a few months old. Her mother, Sara Benedicts, taught piano at the Amsterdam\nConservatory for 40 years and was a thriving concert pianist. Bosmans studied piano solely with\nher mother, and at the age of 17 gained a piano teaching certificate cum laude from the Maat-\nschappij tot Bevordering der Toonkunst. By the 1920's she had a solid career as a piano soloist\nand performed with leading European conductors such as Monteux, Mengelberg and Ansermet.\nShe performed 22 times as a soloist with the Concertgebouw Orchestra between 1929 and 1949\nand was also an active member of chamber music ensembles.\n!\nImage removed due to copyright restrictions.\nBook cover of Metzelaar, Helen. Zonder muziek\nis het leven onnodig: Henriette Bosmans\n[1895-1952], een biografie\n\n. Zutphen,\nNL: Walburg Pers, 2002. ISBN: 9057302217.\n\nBosmans began composing in her teens and studied harmony and counterpoint with Jan Willem\nKersbergen and, later, instrumentation with Cornelis Dopper. She wrote her earliest known\ncompositions, the two sets of Drie Klavierstukken (Three piano pieces), in 1914. Her friendships\nwith cellists Marix Loevensohn and Frieda Belinfante inspired her several works for cello, includ-\ning two concertos and Poeme for cello and orchestra. Up until 1927, her music had Romantic\ninfluences and was characterized by broad, lyrical lines.\nFrom 1923-1927 she maintained a thriving career as a concert pianist, and this lead to long breaks\nof compositional productivity simply because performing took up all her time. In addition, she\nfelt like she had come to a dead-end as a composer and was unable to free herself from the lan-\nguage of the romantic training of her youth. To develop herself as a composer, she turned to-\nwards Willem Pipjer who urged her to concentrate on contemporary problems. Subsequently,\nher music became more concise and logical, and she started experimenting with polymeters and\npolytonality it her work. Overall, her work became less romantic and more suggestive of the\ntechniques and atmosphere of Debussy and Ravel.\nDuring these years, Bosmans gained more independence from her mother who was very domi-\nneering and businesslike. Bosmans typically spent her earnings with little thought for the future.\nShe never owned a piano, preferring to rent, and her financial state was in disarray. She spent\nmuch of her life living with roommates who managed the housekeeping, financial and administra-\ntive affairs. She first lived with Frieda Belinfante until Belinfante married the flautist Johan Fel-\nkamp. Later in life Magda Swat served as Bosmans' factotum. Out of pure admiration for the\ncomposer, Swat arranged thousands of things that Bosmans did not care to be bothered with be-\ncause she was so busy playing piano and composing.\nAn important work of this time was the Concertino voor piano en orkest (Concertino for piano\nand orchestra) written in 1928. According to the critic Paul Sanders, the Concertino became one\nof her most successful compositions. This is in part due to the fact that Bosmans, as a formidable\npianist, promoted it herself through many successful performances. Another work of note was\nthe Concertstuk voor fluite en kamerorkest (Concert piece for flute and chamber orchestra) from\n1929 which was dedicated to the flutist that Frieda Belinfante married. In 1932 this piece won the\nsecond prize of the major Concertgebouw Prize Competition.\n!\n\nDuring the years 1933-34, Bosmans often accompanied the violinist Koene, to whom she became\nengaged in 1934. Koene was a violin prodigy from Batavia, the then capitol of Indonesia, and he\nhad come to Europe in 1910 and played as the concertmaster of orchestras in Utrecht and Dres-\nden. Unfortunately, Koene suffered from a brain tumor and died in January of 1935 shortly after\ntheir engagement. He was never able to perform the work which Bosmans wrote for and dedi-\ncated to him, the Concertstuk voor viool en orkest (Concert piece for violin and orchestra). The\nwork was premiered by Louis Zimmerman in 1935 instead. It received many performances at\nhome and abroad, including the USA.\nKoene's death and the impending war were probably the main reasons that Bosmans stopped\ncomposing for a long while until after the war. During the war Bosmans refused to become a\nmember of the Kultuurkamer, which was required of all Dutch musicians. Because she was half-\njewish, performance of her music was banned in August 1942. However, she continued to earn\nan income playing in private concerts. Her financial situation was not strong though: she refused\nto join any music faculty partly because of her Jewish origins and partly because of her strong de-\nsire to remain independent.\nAfter the war, Bosmans regained momentum as a composer and concert pianist. She concen-\ntrated almost solely on composing vocal songs, the first two on texts of Fedde Schurer which\nwere sung by the Dutch singer Jo Vincent. Other works included the passionate Doodenmars\n('March of the Dead') to a text by Clara Eggink, and a more hopeful orchestral song, Lead, kindly\nlight (1945), to a poem by Cardinal John Henry Newman.\nIn the last years of her life Bosmans found inspiration for vocal compositions in the voice of the\nFrench singer Noemie Perugia. Because Perugia refused to sing in Dutch, Bosmans arranged\nmost of her work on French texts. The artistic collaboration between the two inspired Bosmans\nto dedicate eleven of the twenty-five vocal works that she composed between 1948 and 1951. Af-\nter her mother's death in 1949, Bosmans wrote four songs on texts of Paul Fort. Each of these\ndealt with the tension between life and death and they were among the songs dedicated to Peru-\ngia. Her songs vary quite remarkably in character and are quite expressive. Many are narrative\nand ballad-like, the music artfully underlining the text. She was quite skilled in setting both\nFrench and German poetry, such as Heine's Das macht den Menschen glucklich. Though the\nBosmans-Perugia duo was quite successful in concerts, the relationship was not without chal-\nlenges. In addition to living in different cities, they had several personality conflicts.\n!\n\nIn 1947 Bosmans joined the Donemus Review Committee for New Music whose purpose was to\npromote contemporary Dutch music. Through this work, she met associates who stimulated her\nto write articles for Dutch newspapers and journals. Another motivation for Bosmans' articles\nwas her negative view of music critics. She was appalled that they could review professional mu-\nsicians without and training and proposed a competency exam for reviewers.\nNear the end of 1950s Bosmans suffered from intestinal difficulties. Her doctors misdiagnosed\nher stomach cancer as an ulcer and operated on her. Her health wavered in the following years\nallowing her only occasional time to compose and perform. On April 30, 1952 Bosmans accom-\npanied Perugia in their final performance together, and then collapsed at the end of the recital.\nBosmans died on July 2, 1952 at 56 years of age. She received a posthumous knighthood.\nSome characteristics of Bosmans composition remain constant throughout her life and her vary-\ning compositional styles. In instrumental works with several movements, she often weaves the-\nmatic material from the first movement into the last movement. She was fond of using alternating\nmeters to create a sense of rhythmical excitement. She was interested in tone color and thus util-\nized the very upper and lower registers of the piano. Her vocal works often evoke the mood of\nthe text. For the most part her music is very tonal and melodic, flowing from a source deep inside\nher.\nThe Dutch continue to honor Henriette Bosmans through the Henriette Bosmans Prize. The\nprize is an encouragement prize for young Dutch composers consisting of money and a perform-\nance, and has been awarded since 1994 by the Society of Dutch Composers each year.\n!\n\nBibliography\nBecker, Juanita: Henriette Bosmans: Pianist and Composer, PhD dissertation, Florida State Uni-\nversity, 1998.\nA I Cohen: International Encyclopedia of Women Composers (Books and Music (USA) Inc) Sec-\nond Edition.\nSadie, Stanley, ed. The Norton Grove Dictionary of Women Composers. New York: W.W. Nor-\nton & Co., 1988.\n!\nPhoto of Henriette Bosmans removed due to copyright restrictions.\nSee http://www.donemus.nl/componist.php?id=100&lang=EN"
    },
    {
      "category": "Resource",
      "title": "es_judd_chaminad.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-410-vocal-repertoire-and-performance-women-composers-spring-2007/4fc94fcbb3f2ec4d769f6e5f4185e563_es_judd_chaminad.pdf",
      "content": "Cecile Chaminade\nFrench composer and pianist\nTilke Judd\nMid-term project - MIT Vocal Performance - April 4, 2007\n\nCecile Chaminade. The photograph on the left by H.S. Mendelssohn.\n!\nCecile Loise Stephanie Chaminade was born in Paris on Aug 8, 1857 and was the third of\nfour surviving children. She received her initial musical training from her mother who was a pi-\nanist and singer. A fiend of the family, George Bizet advised her parents to give her a sound mu-\nsical education. Since her father refused to let her study at the Paris Conservatoire, saying it did\nnot fit the decorum of young women of her class, she studied privately from members of the fac-\nulty: Felix Le Couppey (piano), Antoine Marmontel, M G A Savard (counterpoint, harmony and\nfugue) and Benjamin Goddard (composition). She made her debut as a pianist at the age of 18.\nBut her true entree into composition came with a recital in 1978 devoted to her own works. It\ntook place at the family's house in Le Vesinet, a village west of Paris. Widely viewed and well\nreceived, the program served as a model for the typical Chaminade recital some twenty years\n!\n\nlater: repertoire consisting entirely of her works, a mixture of piano solos and vocal songs, and\nChaminade at the piano. She wrote composed over 350 pieces in almost every musical form and\nenjoyed amazing popularity during her lifetime. In 1901 Chaminade married Louis-Mathieu\nCarbonel, a music publisher from Marseilles more than twenty years her elder. in what may have\nbeen a platonic arrangement. He died seven years later and she never remarried. Her niece later\nwrote that Cecile avoided romantic relationships in general because she did not want to be sub-\nject to male authority and wanted to preserve her professional independence. While her compo-\nsitional activity subsided because of World War 1 and deteriorating health, she made several mu-\nsical recordings between 1901-1914 that were mostly piano rolls. Chaminade received many pres-\ntigious awards, culminating in the admission to the Legion d'Honneur in 1913 - the first time it\nwas granted to a female composer. However, the award was belated and ironic since her music\nhad largely been ignored in France for the previous 20 years. In her later years, her niece An-\ntoinette Lorel, tended to her and attempted to promote Chaminade's music after her death in\n1944. Lorel wrote a posthumous biography of Chaminade but it was never published.\nMajor compositions\nChaminade began to compose in earnest in the early 1880s. Her major works included the first\npiano trio op.11 (1880) and Suite d'orchestre op. 20 (1881). She created an opera comique, La\nSevillane, which had a private performance on February 23 1882. Other works included the ballet\nsymphonique Callirhoe op 37, performed at Marseilles on 16 March 1888 and Les amazones, her\nonly symphony which had aspects reminiscent of Wagner. Arguably her greatest artistic triumph\nwas the popular Concertstuck op 40 for piano and orchestra which premiered at Antwerp on 18\nApril 1888. It would boast a number of performances and take on a life of its own. It was pre-\nsented in Paris and in Marseille and throughout Europe and the United States. Chaminade also\nperformed the Concertstuck in a two-piano version in London, making it possible to perform the\npiece if an orchestra were not available. In her later years, Chaminade composed mainly smaller\npieces, with the one exception being her Concertino, Op. 107 for flute and orchestra of 1902\nwhich she wrote on commission from the Conservatoire. The piece demands great technical skill\nand has remained a staple of the flute repertoire.\nAfter 1890 Chaminade composed mainly character pieces and melodies, mainly due to financial,\naesthetic and discriminatory reasons. Her father died in 1887, rendering it a necessity for\nChaminade to make a living from publishing her music. She moved away from the music in the\n!\n\nlarge forms, such as symphony, opera and concerto, to more popular character pieces which\nsuited the majority of her female fan base. This music became very popular, especially in Eng-\nland and the United States, and she helped to promote sales through extensive concert tours.\nShe became a regular visitor of Queen Victoria in England, and she visited Chaminade clubs in\n12 different cities in a very financially successful tour of the US in 1908. These Chaminade clubs\nsprouted during the heyday of women's clubs and by 1904 there were more than 100 clubs listed\nin the magazine L'Echo Musical. Chaminade's French nationality was a great attraction - adding\nto her exotic appeal, and her music was very well packaged. The cover was usually quite elabo-\nrate and sometimes included Chaminade's picture. For Smith, the amateur is \"seduced\" by the\npicturesque covers. The piece is \"neo-Chopin, a nocturne but easier to play, full of repeated\nbars, thus offering him a quicker chance to get through\". Chaminade composed almost 200\npiano works, most of them character pieces (eg. Scarf Dance, 1888) and more than 125 melodies\n(e.g her signature piece L'anneau d'argent 1891); these two forms were the basis for her popular-\nity.\nHer music is tuneful and accessible, with easy to remember melodies, mild chromatic passages,\nand clear textures. It is described as emphasizing wit and color and is typically French. Her mu-\nsic is often inspired by dance. The melodies are very appropriate for voice and are expressively\nand poetically well-suited to the salon - or recital hall - the likely sites for such work. While these\nsweet and charming pieces gave her immense popularity, they were also criticized for being too\nfeminine. Her works that emphasize thematic development, such as the Concertstuck, were con-\nsidered too virile or masculine and hence unsuited to the womanly nature of the composer.\nChaminade was a very prolific composer and he enjoyed great success around 1900 but gradually\nfell into oblivion. Some of the reasons for this were that her reputation rested on her piano\npieces and songs, which were relegated to the category of salon music and thereby trivialized.\nNow however, heightened respect for French music and serious exploration of female composers\nbrings renewed interest into her music.\n!\n\nBibliography\nM.J.Citron: Cecile Chaminade: a Bio-Bibiliography (Westport, CT, 1988)\nA I Cohen: International Encyclopedia of Women Composers (Books and Music (USA) Inc) Sec-\nond Edition.\nSadie, Stanley, ed. The Norton Grove Dictionary of Women Composers. New York: W.W. Nor-\nton & Co., 1988.\nSmith, Richard Langham. 1994. Sister of Perpetual Indulgence. The Musical Times 135, no. 1822\n(December): 740-4.\n!"
    },
    {
      "category": "Resource",
      "title": "es_park_colbran.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-410-vocal-repertoire-and-performance-women-composers-spring-2007/33beadd92de25aba3773113d0940eae7_es_park_colbran.pdf",
      "content": "Barratt Park\nVocal Repertory and Performance\nApril 4, 2007\n\nThe Trials and Triumphs of Isabella Colbran\n\nAlthough public criticism, disease, and the stresses of courtesan life plagued Isabella\nColbran throughout her life, she had a substantial influence on music composition in the\nnineteenth century. Heralded as one of the greatest European sopranos during her prime,\nColbran's voice declined early in her career, and she became an object of ridicule from her\naudiences. Colbran's courtesan lifestyle also took a heavy toll; her vocal afflictions and failed\nmarriage to Gioacchino Rossini may have arisen partly as a result of sexually transmitted\ndiseases and poor vocal hygiene. However, through her influences on Rossini's music as well as\nher own works, she made important contributions to composition.\n\nColbran was born in 1784 to a musical family in Madrid, Spain. Her father was a\ntrumpeter for the royal court of king Charles IV of Spain, and she had her first voice lessons\nfrom the Neapolitan composer Marinelli. She later studied with the castrato Girolamo\nCrescentini (Servadio, 23). Colbran made her concert debut in Paris in 1801 and her opera debut\nin Spain in 1806. Audiences praised her dramatic coloratura soprano voice for its remarkable\nflexibility and range, which spanned almost three octaves from g to e''' (Celletti). She also\nbecame famous for her brilliant delivery and commanding stage presence (Servadio, 23).\n\nIn 1811, Colbran became the prima donna and mistress of the Neapolitan impresario\nDomenico Barbaja. Although Barbaja became extremely wealthy as a result of his successful\ntheaters and gambling casinos, he started his career as a kitchen helper in cafes and bars, and he\nwas known for his rough manners and poor education. Nevertheless, Barbaja was remarkably\n\nsuccessful at identifying young talents including Mercadante, Pacini, Donizetti, and Rossini\n(Pironti). When Rossini signed a six-year contract to produce operas for Barbaja in 1815,\nColbran was luxuriously rich and famous, and \"must have fascinated the young maestro\"\n(Servadio, 23). It soon became public knowledge that Rossini had fallen in love with the prima\ndonna. This caused considerable tension with Barbaja and damaged Colbran's public reputation.\n\"Barbaja, Colbran and Rossini seemed to have set up a menage a trois\" and Colbran was seen\nquarreling publicly with Barbaja's daughter (Servadio, 50). Colbran eventually left the wealthy\nBarbaja for the then penniless but romantically charming Rossini (Servadio, 23-24 50).\n\nIn the meanwhile, Rossini produced ten operas specifically for Colbran, including\nElisabetta (1815), Otello (1816), Armida (1817), Mose in Egitto, Ricciardo e Zoraide (1818),\nErmione (1819), and Semiramide (1823). For several years, Colbran and Rossini remained in an\nopen relationship. According to Servadio, sex among theatrical circles was \"completely open in\nthose days.... Falling in love, love-making and courting were central to any social and artistic\nendeavor\" (68). Most likely, the onset of Rossini's gonorrhea, which he passed on to Colbran,\nand which plagued her from the 1820's until her death, occurred during these days. In those\ndays, there was no cure for gohorrhea and \"the treatments available were often worse than the\nactual disease\" (Servadio, 135). Colbran's poor health and poor vocal hygiene may have\ncontributed to the decline of her voice, which began around the year 1816 and continued until\nher retirement from singing in 1824. Colbran and Rossini were married in 1822, but were\nseparated in 1827 and divorced in 1836 after Rossini left her for Olympe Pelisier. Rossini's own\nsuffering, which included periods of persecution mania and phobia, likely contributed to his\nseparation from Colbran (Servadio, 135).\n\nNot only did Colbran suffer hardships from disease and an unsuccessful marriage--\nduring the later period of her career, Colbran endured biting criticism from her audiences,\nincluding the biographers of her husband, the most notable of which is Stendahl (Marie-Henri\nBeyle). Stendhal refuses to discuss Colbran's vocal health in a serious tone, resorting to sarcasm\ninstead: \"She began to 'suffer from a strained voice', an affliction which, in singers of lesser\ndistinction, would have been vulgarly termed singing off key\" (Stendhal, 150). The biographer\nrecounts his numerous experiences of Colbran's less successful performances. \"I have sat a\nscore of times, and listened to Signorina Colbran embark upon an aria, which after the first few\nbars, would tail off into the most excruciating, the most insupportable cacophony\" (Stendhal,\n150). \"We used to wait eagerly, until the critical moment arrived ... then if we found that she\nwas firmly resolved to sing out of key, we likewise took a firm resolve, and chatted away\nostentatiously among ourselves until it was all over, or else escaped outside into a coffee-house\nand ate ices\" (Stendhal, 165).\n\nHowever, not only does Stendhal poke fun at Colbran's failed vocal performances--he\nalso paints her influence as manipulative and encumbering. He claims that Colbran remained at\nthe San Carlo theater only because the impresario Barbaja was \"under the thumb of his mistress\"\n(Stendahl, 150). Stendhal also writes of Rossini that Colbran used to \"plague him incessantly to\ndecorate his arias with the type of embellishment to which her voice was accustomed\"\n(Stendhal, 166). The biographer claims that Colbran held Rossini back in his compositional\ncareer. After Rossini was \"no longer able to rely\" on Colbran's voice, he resorted to German-\nstyle harmonies which \"retreated ... from the true art of dramatic expression\" (Stendhal, 166).\nStendhal also believes that Rossini would have been more successful and more in his own\nelement writing opera buffo, but he was unable to actualize his career in this way because he\n\nwrote for Colbran, who performed only opera seria. To support his claim about Rossini's\nunrealized talent, Stendhal cites his successes with opera buffo, such as the Barber, and he\ndiscusses Rossini's uninhibited personality, which is exemplified by the phrase with which\nRossini began letters to his mother: \"All' ornatissima signora Rossini, madre del celebre\nmaestro, in Bologna\" (Stendhal, 95 186-87).\n\nIn addition to the intimidating words written by Stendhal and others, Colbran also faced\nsevere criticism from her audiences. After the debut of Semiramide--the last opera written for\nColbran by Rossini, in 1823--the Venetian public put up mourning posters reading \"requiescat\nin pacem.\" Italian families commonly announced the deaths of relatives with fly posters, and in\nthis case, they were \"cruelly announcing the artistic death of Isabella Colbran\" (Servadio, 109).\n\nHowever, despite these hardships, Colbran managed to lead a tremendously successful\nand productive career. She was a major influence on the works of Rossini. Many of Rossini's\nfamous soprano arias are written specifically for Colbran's voice, which had unusual flexibility\nand wide range. According to Stendhal, in order that his lover was not overshadowed by any\nother singer, Rossini deliberately infused his opera with ornamentation that was easy for\nColbran's voice but difficult for her rivals. For example, Colbran had easy mastery of ascending\nscales, while certain other singers, such as Velluti, did not, so Rossini tended to sprinkle his\ncompositions with ascending figures (Stendhal, 332). Rossini's relationship to Colbran may\nhave also contributed to his decision to depart from the tradition of allowing the singer to\nimprovise extensively. Early in his career, Rossini was faithful to the style of his predecessors,\nwhich featured minimal accompaniment during vocal melismas, allowing the singer to improvise\nas he or she chooses. However, Rossini later started writing his ornamentations explicitly and\nincreased the robustness of the accompaniment, removing some of the freedom of the singer to\n\nimprovise. This allowed him to personalize his arias more for specific vocal types (Stendhal,\n328-33).\n\nColbran may have also made very direct contributions to Rossini's works. For example,\nColbran is thought to have been critically involved with the composition of the opera Armida in\n1817. She signed her name under Rossini's on the score \"as if to emphasize the extent to which\nshe was involved in the composition of the masterpiece\" (Servadio, 73). The brilliant sensuality\nof Rossini's prima donna roles might have resulted from his passion for Colbran, and her active\nparticipation in his compositions. Colbran was also a composer in her own right. She published\nfour volumes of song with piano or harp accompaniment: one dedicated to her voice teacher\nGirolamo Crescentini, one to the Queen of Spain, one to the Empress of Russia, and one to the\nPrince of Beaumarchais (). She also wrote songs dedicated to her father, which those are now\nlost (Servadio, 68).\n\nEarly in her career, Isabella Colbran became one of the most famous sopranos in Europe.\nHowever, she later encountered many challenges that plagued her for the remainder of her life.\nWhile her relationship to Gioacchino Rossini allowed her to become a major influence on his\ncompositions, it also may have contributed to the decline of her voice and her general health.\n\nWorks Cited\n\nCelletti, R.: 'Isabella Colbran', The New Grove Dictionary of Music and Musicians ed. S. Sadie\n\nand J. Tyrrell. London: Macmillan, 2001.\n\nPironti, A.: 'Domenico Barbaja', The New Grove Dictionary of Music and Musicians ed. S.\n\nSadie and J. Tyrrell. London: Macmillan, 2001.\n\nMarrazzo, Randi, ed. The First Solos: Songs by Women Composers, Bryn Mawr, PA:\n\nHildegard Publishing Company, 2000.\n\nServadio, Gaia. Rossini. New York: Carroll and Graf, 2003.\n\nStendhal. Life of Rossini. Trans. Richard N. Coe. Great Britain: Criterion Books, 1957."
    },
    {
      "category": "Resource",
      "title": "outline_park_col.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-410-vocal-repertoire-and-performance-women-composers-spring-2007/f6e99ca9b127a561ce45d8e22b229c24_outline_park_col.pdf",
      "content": "Isabella Colbran\nBarratt Park, Vocal Rep and Performance\nApril 23, 2007\n\nTimeline\n\nFebruary 2, 1785\n\"Isabel Colbrandt\" is born in Madrid, Spain. Her father Juan (later\nGiovanni) was a trumpeter for the royal court of Charles IV of Spain.\n\nFirst singing lessons from Pareja in Madrid at age 6.\n\nBegins studies with Neapolitan composer Marinelli (age 9). She later\nstudied with the castrato Girolamo Crescentini.\n\nConcert debut in Paris at age 16.\n\nOpera debut in Madrid. (age 21)\n\nColbran spends a year at the opera theater in Bologna.\n\n1811-\nAfter performing a series of premieres at Milan's La Scala Theater,\nColbran comes to the attention of Domenico Barbaja, famed impresario of\nthe Teatro San Carlo in Naples. She accepts a permanent position at the\nSan Carlo and becomes Barbaja's mistress.\n\n1815-21\nRossini signs a six-year contract to produce operas for Barbaja. Colbran\nstars in a series of Rossini's operas, including: Elisabetta Regina\nd'Inghilterra (1815), Otello (1816), Armida (1817), Mose in Egitto\n(1818), Riccairdo e Zoraide (1818), Ermione (1819), Semiramide (1823).\n\nMarch 22, 1822\nColbran marries Rossini in Bologna.\n\nColbran retires from the stage at age 39 as a result of vocal problems.\nSome say her voice began its decline as early as 1916.\n\nRossini divorces Colbran after becoming involved in an affair with\nsoprano Olympe Pelissier.\n\n1836-1845\nColbran lives in Castenaso (near Bologna) with Rossini's father.\n\nOctober 7, 1845\nColbran dies in Castenaso at age 60.\n\nCompositions:\nColbran left behind four collections of original songs: one dedicated to her voice teacher\nGirolamo Crescentini, one to the Queen of Spain, one to the Empress of Russia, and one to the\nPrince of Beaumarchais. One of these works--Sei Canzoncine--is found in the MIT library.\nThe poet of the texts, the city of premiere and the year of composition are all unknown. She is\nalso believed to have composed songs dedicated to her father, but these are lost. Finally,\nColbran probably played an extensive role in Rossini's compositions. Many of his\nornamentations were written specifically for her voice, which had exceptional flexibility and\nwide range. Colbran signed her name under Rossini's on the score of Armida to emphasize the\nextent of her involvement in the composition.\n\n1804 Portrait. Artist unknown. (Age 19)\n\n1830, oil on canvas. Artist unknown. (Age 45)\n\nPovero cor tu palpiti\n\nMy poor heart you flutter\n\nPovero cor tu palpiti\n\nMy poor heart, you palpitate so,\nne a torto in questo di\n\nHow right you are to tremble.\ntu palpiti cosi povero core\n\nYou throb so, poor heart\nsi tratta o dio di perdere\n\nFor fear of losing forever\nper sempre il caro ben\n\nOf losing forever that beloved image\nche di sua mano\n\nThat love's hand\nin sen m'inpresse amore.\n\nHas engraved in my heart."
    },
    {
      "category": "Resource",
      "title": "recital_program.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-410-vocal-repertoire-and-performance-women-composers-spring-2007/b1b59ccc7e65f4248c0141eabda1cd38_recital_program.pdf",
      "content": "Seven Singers\nSudeep Agarwala, Baritone\nKoyel Bhattacharyya, Soprano\nElaina Cherry, Soprano\nJodie-Marie Fernandes, Soprano\nTilke Judd, Mezzo-Soprano\nBarratt Park, Baritone\nGustavo Setrini, Tenor\n&\nOne Piano Player\nLindy Blackburn, Piano\nperform art songs of (mostly)\nWomen Composers\nPamela Wood, Senior Lecturer\nVocal Repertoire & Performance\nFriday May 11, 2007 5:30pm Killian Hall\nCover design by Tilke Judd.\n\nMIT 21M410/515 VOCAL REPERTOIRE & PERFORMANCE CLASS RECITAL\nPamela Wood, Senior Lecturer in Music\nKillian Hall\nMay 11, 2007\n5:30 P. M.\nPROGRAM\nPer la piu vaga e bella (Fernando Saracinelli)\nFrancesca Caccini (1587-1645)\nSie liebten sich beide (Heinrich Heine)\nClara Wieck Schumann (1819-1896)\nTheology (Paul Laurence Dunbar)\nBetty Jackson King (1928-1994)\nSudeep Agarwala, G, Baritone\nBei dir ist es traut (Rainer Maria Rilke)\nAlma Schindler Mahler (1879-1964)\nI'll Not Forget (Max Ellison)\nJeraldine Saunders Herbison (1941- )\nMots d'amour (Charles Fuster)\nCecile Chaminade (1857-1944)\nKoyel Bhattacharyya, '09, Soprano\nWho Has Seen the Wind? (Christina Rosetti)\nDenise Bacon\nLaue Sommernacht (Gustav Falke)\nAlma Schindler Mahler (1879-1964)\nElegie (Albert Samain)\nNadia Boulanger (1887-1979)\nElaina Cherry, '07, Soprano\nSchwanenlied (Heinrich Heine)\nFanny Mendelssohn Hensel (1805-1847)\nLa speranza al cor mi dice (Metastasio)\nIsabella Colbran (1785-1845)\nNight (Louise Wallace)\nFlorence Price (1887-1953)\nJodie-Marie Fernandes, '09, Soprano\nMignonne (Pierre Ronsard)\nCecile Chaminade (1857-1944)\nIn the Springtime (William Shakespeare)\nBetty Jackson King (1928-1994)\nIt's Me, O Lord (Traditional)\nArr., Betty Jackson King (1928-1994)\nTilke Judd, G, Mezzo-Soprano\nBeautiful Dreamer (Stephen Foster)\nStephen C. Foster (1826-1864)\nPovero Cor (Unknown)\nIsabella Colbran (1785-1845)\nOh Were My Love (Robert Burns)\nAmy Beach (1867-1944)\nBarratt Park, G, Baritone\nLejania (Herminio Gimenez)\nHerminio Gimenez (1905-1991)\nCon male nuove, non si puo cantare (Unknown)\nBarbara Strozzi (1619-1677)\nMein Stern (Fredericke Serre)\nClara Wieck Schumann (1819-1896)\nGustavo Setrini, G, Tenor\nLindy Blackburn, G\nPianist\n\nMIT 21M410/515 VOCAL REPERTOIRE & PERFORMANCE CLASS RECITAL\nPROGRAM NOTES\nThe focus of this semester's Vocal Repertoire & Performance study has been upon the works of women\ncomposers. The students gathered biographical data and explored art songs, operatic arias, choral\nmasterpieces, and arrangements employing sacred and secular texts. Additionally, students conducted\ninquiry into works indicative of their own heritage. The following notes prepared on the occasion of the\nculminating Class Recital offer a sampling of the students' findings.\n***\nFrancesca Caccini was born into a musical family on 18 September 1587 in modern day Florence, Italy.\nHer father was Giulio Caccini, a famed member and proponent of the monody school of music which\nflourished in Florence in the sixteenth and early seventeenth centuries. As a child, Francesca was\neducated not only in composition, but also in singing, guitar, harp, and keyboard. Interestingly, she also\nreceived literary training: she is known to have written poetry in both Italian and Latin.\nFrancesca ultimately worked for the Medici as a teacher and composer, and soon became the\nhighest paid musician on their payroll. Here, she wrote a song book, Il primo libro delle musiche, which\nremains one of the earliest written examples of the monodic style of composition prevalent in Florence.\nShe also composed multiple operas in the service of the Medici, and only one, La liberazione di Ruggerio\ndall'isola d'Alcina, survives.\nThe details of Francesca Caccini's final years are unclear. She left the service of the Medici late in\nher career. Tomaso, her son, was delivered to his uncle, Girolamo Rafaelli in February 1645, when it is\nthought that Francesca either remarried or died.\nPer la piu vaga e bella\nFor the most charming and beautiful\nPer la piu vaga e bella\nFor the most charming and beautiful\nTerrena stella,\nEarthly star,\nChe oggi oscuri di Febo I raggi d'oro\nThat today hides Phoebus' golden rays,\nMia core ardeva;\nMy heart once burned;\nVago di rimirare il mio martoro.\nLonging to tell of my anguish.\nMa d'avermi schernito,\nBut having been scoffed at,\nTosto pentito\nDeeply repentant,\nCon la pieta di lei mi sana il petto.\nYour devotion healed my heart\nOnd' io fo fede,\nTherefore I keep the faith\nA chi nol crede,\nWith whoever does not believe\nChe Amore e solo il dio d'ogni diletto.\nThat Love is the only god of all delights.\nClara Josephine Wieck Schumann was born in modern day Leipzig, Germany. She was known\nprimarily for her talent as a pianist. Considered a piano genius, she had performed the virtuosic works of\nher predecessors and contemporaries, Bach, Mozart, Beethoven, Brahms and her future husband, Robert\nSchumann, since the age of thirteen. She also composed and premiered her own works.\nAfter her marriage to Robert Schumann, she was asked to discontinue her compositions, choosing\nto keep track of the household, instead. She was mother to seven children (an eighth child died during\ninfancy). She was also in charge of the finances of the Schumann household.\nHer husband's death marked a return to composition for Clara, who was encouraged by her friend\nJohannes Brahms. Many of these works and performances, however, were often met with harsh\ndisapproval from her contemporaries. Clara died in 1896, due to complications arising from a stroke.\n\nSie liebten sich beide\nThey loved each other\nSie liebten sich beide, doch keiner\nThey once loved each other, but neither\nwollt' es dem andern gestehn;\nwould to the other confess;\nsie sahen sich an so feindlich,\nthey saw each other as hostile,\nund wollten vor Liebe vergehn.\nyet wanted to perish from love.\nSie trennten sich endlich und sah'n sich\nThey finally parted and sometimes sighted\nnur noch zuweilen im Traum;\nthe other in dreams;\nsie waren langst gestorben\nthey had been dead so long now\nund wuten es selber kaum.\nand hardly known it themselves.\nBetty Jackson King was born in Chicago, Illinois in 1928, to a musician mother. She moved briefly to\nVicksburg, Mississippi and returned to Chicago later. In Chicago, she attended Roosevelt University\nwhere she received her Bachelor of Arts in piano and a Masters Degree in Composition. She studied\nfurther at the Peabody Conservatory of Music in Baltimore and the Westminster Choir College in\nPrinceton, New Jersey.\nAfter earning her degrees, Betty Jackson King taught at the University of Chicago Laboratory\nSchools, her alma mater, Roosevelt University, at Dillard University in New Orleans, Louisiana and\nWildwood High School in Wildwood, New Jersey. Ms. King was much sought after as lecturer and\nclinician of choral music. She won multiple awards not only for her compositions but also for excellence\nas a teacher, being honored by the Chicago Umbrian Glee Club and the National Association of Negro\nMusicians, of which Ms. King was also president. Ms. King passed away in 1994 at the age of sixty-six.\n\n--Sudeep Agarwala\n***\nAlma Schindler Mahler (1879-1964), married at one point to composer Gustav Mahler, was lauded as\n\"the most beautiful woman in Vienna\" and educated to be a composer. She had a propensity for marrying\nfamous men, including architect Gropius and writer Werfel, and believed that she nurtured her partners'\ntalents by actively participating in the creative process. Though she composed in many forms, her only\nremaining compositions are lieder. \"Bei dir ist es traut,\" from a collection known simply as Funf Lieder,\nis set to a text by Rainer Maria Rilke, who is commonly considered the greatest German poet of the\ntwentieth century, and whose poetry often focuses on anxiety and solitude.\nBei dir ist es traut\nWith you it is safe\nBei dir ist es traut\nWith you it is safe\nZage Uhren schlagen\nTimid clocks strike\nWie aus alten Tagen,\nAs in days of old,\nKann mir ein Liebes sagen,\nSay something sweet to me,\nAber nur nicht laut!\nBut not too loudly!\nEin Tor geht irgendwo\nA gate squeaks somewhere outside\nDraussen im Blutentreiben,\nOut there in the blossoming flowers,\nDer Abend horcht an den Scheiben,\nThe evening listens at the window panes,\nLass uns leise bleiben,\nLet us keep quiet,\nKeiner weiss uns so!\nSo no one knows we're here!\n\nJeraldine Saunders Herbison (1941- ), of Richmond, Virginia, studied violin, voice, and piano at\nVirginia State College, and studied compositional techniques with Undine Smith Moore and Thomas\nClark. She taught and directed string orchestra music in public schools for thirty years, and was elected\nHonorary Composer at the National Music Camp at Interlochen. Herbison's works have been widely\nperformed by various groups, and her cello pieces have been performed at the Kennedy Center for the\nPerforming Arts. She currently performs with several orchestras, and continues to compose. Her piece\n\"I'll Not Forget,\" from a cycle of five art songs for voice and piano, was composed in 1978 on a text by\nMax Ellison (twentieth century), former poet laureate of Michigan, who inhabited a makeshift wooden\nhouse known as Frog Holler and published four books of poetry.\nCecile Chaminade (1857 - 1944) was a composer born to a musical family of the French bourgeoisie.\nHer father discouraged her from formal musical training, because he felt it would be inappropriate for her,\nas a woman. Her pianistic skills caught the attention of composer Georges Bizet, who introduced her to\nother important composers and musicians of the time and encouraged her to study privately. When her\nfather's death forced her to support her family, she turned to composition as a source of income. Her\nworks, mostly simple vocal and piano pieces, were targeted toward women with little training, and her\nobjective was to charm rather than challenge the performers and their audiences. \"Mots d'amour,\" a sweet\nart song that captured the zeitgeist of her day, follows a text of \"dubious literary quality\" by Charles\nFuster (1866 - 1929), a French poet.\nMots d'amour\nWords of Love\nQuand jet e dis des mots lasses,\nWhen I speak to you with weary words,\nC'est leur douleur qui fait leurs charmes!\nIt is their sadness that gives them charm!\nIls balbutient, et c'est assez,\nThey hesitate, and it is enough\nLes mots ont des larmes.\nThe words have tears.\nQuand je te dis des mots fougueux,\nWhen I speak to you with fiery words,\nIls brulent mon coeur et mes levres,\nThey burn my heart and lips,\nTon etre s'embrase avec eux,\nYour being is caught in their blaze,\nLes mots ont des fievres.\nThe words have passion.\nMais quells qu'ils soient, les divins mots,\nBut whatever they may be, the divine words,\nLes seuls mots ecoutes des femmes,\nThe only words that women hear,\nDans leurs soupirs ou leurs sanglots,\nIn their sighs or in their sobs,\nLes mots ont des ames.\nThe words have souls.\n--Koyel Bhattacharyya\n***\nDenise Bacon is an accomplished living composer whose works include choral, instrumental, and solo\nvocal pieces. Her experiences studying the Kodaly method and folk songs of Hungary led her to apply\nthe same concepts to American folk music, working within both folk and art song traditions. She has\nreceived two awards from the Hungarian government, and is an Honorary Member of the International\nKodaly Society. \"Who Has Seen the Wind?\" employs a text by Christina Rosetti. This short composition\nis filled with complex harmonies and an evocative vocal line.\n\nKnown as the most beautiful woman in Vienna, Alma Schindler Mahler had a habit of marrying\ninfluential and artistic men. Her father was a landscape painter and she received extensive training in\nliterature, music, and art from an early age. She first tried composing at the age of 6, but gave it up at the\nrequest of Gustav Mahler early in their marriage. Laue Sommernacht comes from her Funf Lieder, with\ntext by Gustav Falke. The piece, rich with harmonic interest throughout, ends on the dominant which\ncommunicates the unresolved yearning felt in the last verse.\nLaue Sommernacht\nBalmy Summer Night\nLaue Sommernacht\nBalmy summer night,\nAm Himmel stand kein Stern\nIn Heaven there are no stars,\nIm weiten Walde suchten wir uns\nIn the wide forests we searched ourselves\nTief im Dunkel, und wir fanden uns.\nDeep in darkness, and we found ourselves.\nFanden uns im weiten Walde\nFound ourselves in the wide forests\nIn der Nacht, der sternenlosen\nIn the night, saviours of the stars,\nHielten staunend uns im Arme\nHeld ourselves in wonder in each other's arms\nIn der dunklen Nacht.\nIn the dark night.\nWar nicht unser ganzes Leben\nWas not our whole life\nNur ein Tappen, nur ein Suchen,\nJust a groping, just a seeking,\nDa in deine Finsternisse.\nThere in its darkness\nLiebe, fiel dein Licht!\nLove, your light shone.\nNadia Boulanger is well known for her immense contributions to classical music as a teacher of\ncomposition, but her own compositional career is often overlooked. She began composing at a young\nage, but her last compositions, a set of songs on poems of Mauclair, were published in 1922 when\nBoulanger was still only 35. Elegie is a poem written by Albert Samain, of the French Symbolist school.\nThe nature of the poetry is reflected in Boulanger's remote tonality and suspended dissonances.\nBoulanger's pianistic skill is reflected in the virtuosic character of the accompaniment.\nElegie\nElegy\nUne douceur splendide et somber\nA splendid and somber softness\nFlotte sous le ciel etoile\nFloats under the starry sky.\nOn dirait que la haut dans l'ombre\nOne might say that high in the shadows\nUn paradis s'est ecroule.\nA paradise is collapsing.\nEt c'est comme l'odeur ardente\nAnd like the burning aroma,\nL'odeur fievreuse dans l'air noir\nA feverish scent in the night\nD'une chevelure d'amante\nFrom the hair of a lover\nDenouee a travers le soir.\nDestitute in the twilight.\nTout l'espace languit de fievres\nAll space languishes from fever\nDu fond des coeurs mysterieux\nAt the bottom of mysterious hearts\nS'en viennent mourir sur les levres\nComing to die on the lips,\nDes mots qui font fermes les yeux.\nThese words that come to close the eyes.\n\nEt de ma bouche ou s'evapore\nAnd from my mouth where emanates\nLe parfum des bonheurs derniers\nThe perfume of last happiness.\nEt de mon coeur vibrant encore\nAnd from my still beating heart\nS'elevent de vagues pities\n\nRise vague pities.\n\nPour tous ceux-la, qui, sur la terre\nFor all those on the earth\nPar un tel soir tendant les bras\nBy evening reach out their arms.\nN'ont point dans leur coeur solitaire\nIn their lonely hearts they don't have\nUn nom a sangloter tout bas.\nA name to cry out.\n\n--Elaina Cherry\n***\nFanny Mendelssohn was born in Hamburg, Germany, in November 1805. Her brother was the renowned\ncomposer, Felix Mendelssohn, who studied music alongside her and under whose name, her many works\nbegan to be published. A child prodigy in piano performance and composition, Fanny Mendelssohn\nHensel wrote hundreds of pieces for piano, voice (solo and ensemble) and orchestra.\nHeinrich Heine was born in 1797 in Dusseldorf, Germany. Before he began to write poetry actively, he\nwas a businessman and studied law. However, his passion for literature led him to become one of the\nmost famous composers of lyric poetry, a large portion of which was set to music by many composers,\nincluding Robert Schumann, Franz Schubert, Johannes Brahms, and the Mendelssohn siblings.\nSchwanenlied\nSwan Song\nEs fallt ein Stern herunter\nA star is falling down\nAus seiner funkelnden Hoh,\nFrom a sparkling height\nDas ist der Stern der Liebe,\nIt is a star of love,\nDen ich dort fallen seh.\nWhich I see falling there.\nEs fallen von Apfelbaume\nThey fall from apple trees\nDer weissen Blatter so viel,\nWhose white flowers are so plentiful.\nEs kommen die neckenden Lufte\nThe teasing winds are coming\nUnd treiben damit ihr Spiel.\nAnd play their game.\nEs Singt der Schwan im Weiher,\nA swan is singing in a pond,\nUnd rudert auf und ab,\nPaddling up and down,\nUnd immer leiser singend,\nAnd sings quieter and quieter,\nTaucht er ins Fluthengrab.\nPeeks down into a watery grave.\nEs ist so still und dunkel,\nIt is so quiet and dark,\nVerweht ist Blatt und Bluth',\nThe leaves and blossoms blow away,\nDer Stern ist knisternd zerstoben.\nThe star vanishes in smoke\nVerklungen das Schwanenlied.\nThe swan song fades away.\nIsabella Colbran was one of the most well-known singers of her age. Her powerful voice and dramatic\nstage presence made quite a name for her, through the Teatro San Carlo, in Naples, Italy. She was the\nwife of Giachino Rossini for fifteen years, and it is said he wrote several famous operas especially for her,\nincluding Otello and Semiramide. Many of her vocal pieces reflect her affinity for high, virtuosic\nmelodies.\n\nPietro Metastasio, born in 1698, was an Italian writer and poet, and was recognized at a young age to have\nunmistakable improvisational literary talent. He studied law until his twenties, but was then\ncommissioned to write only for musical composers of the day. Many of his poems and dramas were thus\nset to music by the likes of Pergolesi, Scarlatti and Durante, but undeservedly fell into neglect after his\ndeath in 1782.\nLa speranza al cor mi dice\nHope tells my heart\nLa speranza al cor mi dice\nHope tells my heart\nChe saro felice ancor.\nThat I will know joy again.\nMa la speme inganna trice\nBut love's deceit appears, and with it, fears.\nPoimi dice il mio timor.\nYet hope comes again and foretells joy to come.\nFlorence Price was born in Arkansas, USA, and was performing by the age of four. She became a\nrenowned African American composer by the 1920s and composed over 300 works for voice, symphony\norchestra and piano. Many of her pieces reflect her African American heritage in their style and rhythm.\nHer vocal pieces consist mainly of arrangements of African American spirituals, and art songs, into which\ngroup \"Night\" falls.\n\n--Jodie-Marie Fernandes\n***\nCecile Chaminade was born in Paris to a very musical family. Though her father prevented her from\nstudying in the Paris Conservatoire because he felt it did not fit with the proper role of a woman, she\nstudied piano and composition privately with members of the faculty. Chaminade was an extremely\nprolific composer, and wrote over 400 compositions which she published to earn a living. Her most\npopular pieces were staples of the elegant salon concerts during the turn of the century and included many\ncharacter pieces and melodies.\nThe text for this melodie is one of Pierre de Ronsard's best-known poems \"Mignonne, allons voir\nsi rose\" which contains his most prevalent themes: the passage of time, the fragility of life and the\ninvitation to live in the moment.\nMignonne\nBeloved\nMignonne, allons voir si la rose\nBeloved, come let us see if the rose\nQui ce matin avoit desclose\nThat had this morning unveiled\nSa robe de pourpre au Soleil,\nHer robe of scarlet to the sun,\nA point perdu ceste vespree\nHas lost, this evening\nLes plis de sa robe pourpree,\nAny of the folds of her scarlet robe\nEt son teint au vostre pareil.\nAnd her blush, so like yours.\nLas! voyez comme en peu d'espace,\nAlas! See how in so short a time,\nMignonne, elle a dessus la place\nAlas! Alas! See how in this place\nLas! las ses beautez laisse cheoir !\nIts beauties have all faded\nO vraiment marastre Nature,\nOh truly Nature is a cruel stepmother\nPuis qu'une telle fleur ne dure\nWhen such a flower lives\nQue du matin jusques au soir !\nOnly from morning until evening.\n\nDonc, si vous me croyez, mignonne,\nSo, if you believe me, my darling\nTandis que vostre age fleuronne\nWhile your age still flowers\nEn sa plus verte nouveaute,\nIn its most verdant freshness\nCueillez, cueillez vostre jeunesse :\nGather, gather your youth\nComme a ceste fleur la vieillesse\nFor, just as this flower has faded,\nFera ternir vostre beaute.\nOld age will wither your beauty.\nThe childhood of Betty Jackson King (1928-1994) was enriched musically and spiritually by her father,\nwho was a Pastor of a community church in Chicago, and her mother, who founded the Imperial Opera\nCompany which fostered vocal development of young singers. She received her advanced musical\ndegrees from the Chicago Music College in 1950 and 1952. Her professional career included teaching,\nconducting and composing.\nAmong King's compositions were two operas, a cantata, a requiem and a ballet; organ and piano\nworks; instrumental works for violin and piano; many choral compositions; and art songs (including In\nthe Springtime, written in 1976) and arrangements of spirituals (including It's Me, O Lord).\nShe was elected the president of the National Association of Negro Musicians in 1979 and she\noften lectured on the musical and historical importance of preserving African-American spirituals. She\nencouraged African-American composers to utilize Negro folk themes in composition.\n--Tilke Judd\n***\nStephen Collins Foster (1826-64) was a prolific composer of American songs. Foster grew up in a\nScots-Irish family in Pittsburgh, then a fledgling town not far removed from the frontier. He received\nlittle or no formal training in music and did not see a piano until he was in his twenties. Nevertheless, his\nlove of music propelled him to become the most popular American songwriter of his day. His primary\ngenres included love songs, minstrel songs, and songs about the American Civil War. \"Beautiful\nDreamer\" was one of his last songs and was published posthumously.\nIsabella Colbran (1784-1845) became one of the most famous dramatic coloratura sopranos in Europe\nduring her residency at the Neapolitan Teatro San Carlo. Known for her remarkable range, flexibility,\nand dramatic stage presence, she attracted the attention of both the famed impresario Domenico Barbaja\nand composer Gioacchino Rossini, whom she married in 1822. Colbran retired from the stage in 1822\nafter she suffered a decline in her voice. In addition to her influence on Rossini's composition, Colbran\nleft behind four collections of song. \"Povero Cor\" is from the collection Sei Canzoncine. The time and\nplace of composition and the source of the poetry is unknown.\nPovero Cor\nPoor Heart\nPovero cor tu palpiti\nMy poor heart, you palpitate so,\nne a torto in questo di\nHow right you are to tremble.\ntu palpiti cosi povero core\nYou throb so, poor heart\nsi tratta o dio di perdere\nFor fear of losing forever,\nper sempre il caro ben\nOf losing forever that beloved image\nche di sua mano\nThat love's hand\nin sen m'inpresse amore.\nHas engraved in my heart.\n\nAmy Cheney Beach (1867-1944) was one of the most important American composers during the late\nnineteenth century. She started her musical career as a concert pianist but changed her focus to\ncomposition after her marriage to Dr. H.H.A. Beach in 1885. Her most important works include her Mass\n(1890), Eilende Wolken (1892), and \"Gaelic\" Symphony in e-minor (1896). \"Oh Were My Love\" is from\na collection of songs set to the poetry of Robert Burns.\n\n--Barratt Park\n****\nHerminio Gimenez was one of the most important composers of Paraguayan music. He was born in the\ntown of Caballero, Paraguay on February 20, 1905, and began his musical career at the age of 10 in the\nmilitary band of the village of Paraguari. He continued his musical studies at the Paraguayan Institute of\nmusic and eventually became director of music for the armed forces during the Chaco war with Bolivia\n(1932-1935), profoundly influencing the national style of music. He spent the latter half of his life in\npolitical exile in Argentina, as a member of the opposition during Paraguay's 40-year dictatorship.\nLejania, perhaps the most famous of Gimenez's vocal compositions, was written in 1937. It was\npublished in 1958, after it appeared in the film Codicia. The piece is a guarania, a song form\ncharacterized by slow and melancholic rhythms and typically composed with orchestral accompaniment.\nThe guarania originated in Paraguay and, along with Polka, Galopa, and Chamame, now represents an\nimportant genre in Paraguayan music. The text, written by Gimenez himself, is the song of a lover calling\nout to his lost love; it is written in both Spanish and Guarani, the indigenous language that is spoken by a\nmajority of Paraguayans and that is especially utilized for music, poetry, humor, and culture. The\nexpressiveness, sensibility, and wit of the Guarani language is difficult to capture in translation, and the\nresult can often make the text seem overly sentimental and trite. I have done my best to convey the\nmeaning of the poem, but, not a poet myself, I can only hope to better portray the poets and composers\nintentions in performance.\nLejania\nDistance\nLejano amor primero de mi ninez\nFar away first love of my childhood,\nRohechaga'u.\nHow I want to see you.\nLejano amor sublime en sueno azul\nFar away, sublime love of a blue dream,\nMamopa reime?\nWhere are you now?\nDistante queda el recuerdo\nDistant remains the memory\nDe aqeullas tardes de mborayhu.\nOf those afternoons of love,\nQue acuden a mi memoria\nThat return to my thoughts\nComo bandadas de pykasu.\nLike flocks of doves.\nRecuredos que queman mi alma\nMemories that burn my soul\nPorque es hoy triste Che rekove.\nBecause, today, my existence is empty.\nPor eso voy entonando\nThat is why I now intone\nEste triste canto guarani ete.\nThis sad song to you in pure guarani.\nRohechaga'u\nHow I want to see you\nChe mborayhumi.\nMy love.\nMamopa reho\nWhere have you gone\nChe reja guive?\nSince you left me?\nAni ne nana\nDon't be cruel,\nMitakunami.\nYoung love.\n\nEjumi jevy\nReturn to me\nNa che konsola!\nAnd console me.\nAko ka'aru\nIn the afternoon,\nChe reja guive,\nsince you left me,\nChe ano tyre'y\nin utter loneliness\nAipykui tape.\nI walk my path.\nNuati che kutu.\nThorns pierce my feet.\nChe piru che ka.\nI am wasting away.\nChe py'a okai,\nAnd my heart burns.\nChe reja guive\nSince you left me . . .\nAko ka'aru.\nIn the afternoon.\nBarbara Strozzi was a 17th century Venetian composer, singer, and lutenist, and a student of Francesco\nCavalli, the foremost opera composer of the time. She was the daughter of a prominent poet and librettist\nand was active in Venetian intellectual and literary circles, particularly within the Accademia degli\nUnisoni, a society founded by her father for musical discussion and experimentation. \"Con male nuove,\nnon si puo cantare,\" was published in 1654 with 10 other secular cantate in the collection Cantate, ariete\na una, due e tre voci, Opus 3. It is typical of much of the period's music for its rapid alternation of meter,\nmixture of vocal styles, and for its choice of text, which focuses on the dangers of romantic love.\nCon male nuove, non si puo cantare\nWith new ills, one cannot sing\nQuesta, questa e la nuova\nThis is the new one\nch'io v'ho da dire amanti,\nThat I wish to call my lover,\nch'amando non si trova\nWho in loving one finds\naltro che pene e pianti.\nNothing but pain and weeping.\nBen il mio cor il prova\nWell, my heart will attempt it\ne volete ch'io canti.\nAnd you wish me to sing.\nAmong the most well-known and celebrated female composers, Clara Wieck Schumann achieved fame\nprimarily from her virtuosic career as a pianist. Clara's life is often invoked to illustrate the historical\nplight of women composers; as wife to Robert Schumann, Clara's domestic duties and eight pregnancies\ntook their toll on her professional life and her confidence in her abilities as a composer. Her husband,\nthough consistently supportive wrote, \"children, and a husband . . . do not go well with composition.\nClara cannot work at it regularly and I am often disturbed to think how many tender ideas are lost because\nshe cannot work them out.\" Mein Stern (1848) was published in London in the English translation but\nnever published in Germany during Clara's lifetime. The melody's slow-moving step-wise motion and\nthe 'rippling' accompaniment give the sense of the movement of the night sky over the ocean's waves, as\ndescribed by the poet, Friedericke Serre.\nMein Stern\nMy Star\nO du mein Stern, schau dich so gern,\nO star of mine, I gladly watch,\nWenn still im Meere die Sonne sinket,\nWhen the sun still sinks quietly into the sea,\nDein goldnes Auge so trostend winket\nYour golden eye winking comfortingly\nIn meiner Nacht!\nIn my dark night!\n\nO du mein Stern, aus weiter Fern,\nBist du ein Bote mit Liebesgruen,\nLa deine Strahlen mich durstig kussen\nIn banger Nacht!\nO du mein Stern, verweile gern,\nUnd lachelnd fuhr' auf des Lichts Gefieder\nDer Traume Engel dem Freunde wieder\nIn seine Nacht.\nO star of mine, from far away,\nYou are a herald of loving greetings,\nO let your beams give me thirsty kisses\nIn the yearning night!\nO star of mine, please linger awhile,\nAnd smiling travel on starlight's feathers,\nIn dreams appear as my friend's bright angel\nIn his dark night.\n\n--Gustavo Setrini"
    }
  ]
}