{
  "course_name": "Weight Training",
  "course_description": "No description found.",
  "topics": [
    "Health and Medicine",
    "Health and Exercise Science",
    "Physical Education and Recreation",
    "Health and Medicine",
    "Health and Exercise Science",
    "Physical Education and Recreation"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week for 6 weeks, 1 hour / session\n\nCourse Description\n\nThis 12 session course is designed for the beginning or novice weight lifter, or for those who have experience lifting but lack proper instruction. We will provide an understanding of the biomechanics involved, muscles used for a given exercise, and program development.\n\nFour days of lecture, demonstration, and hands-on learning will provide the student with the basics in lifting and spotting technique, safety, the benefits of weight training, weight room etiquette, and the ability to develop a basic weight training program.\n\nSessions five through ten& will be a practical application of what they have learned in alternating upper and lower body workouts. Supervision and constant feedback regarding technique and overall approach will be given.\n\nThe final two sessions will be dedicated to maximum effort testing in three lifts: the squat, the press, and the pull-down. Careful instruction will be given on proper technique and safety for maximum effort lifts. Once completed, the student will have a much better idea of their strength in each lift, and then can choose a heavier and more appropriate weight for each exercise.\n\nObjectives\n\nTo encourage students to incorporate weight training into their lives as a part of their overall fitness regimen.\n\nTo instruct the students in the proper and safe way to lift and spot weight training.\n\nTo build the students' confidence in the weight room with the hope of reducing or eliminating the air of intimidation that is present in some weight rooms.\n\nTo provide the students with sufficient information and knowledge to allow them to develop a weight training program that can be incorporated into their fitness needs.\n\nAbout the Instructor\n\nHalston Taylor's cross country coaching career began at MIT in 1982 and since that time, the squad has become one of the most successful programs at the Institute. Coach Taylor has led Tech through 10 undefeated seasons and three others marred by one loss. The Engineers are also a perfect seven-for-seven at the NEWMAC Cross Country Championships under his watch.\n\nDuring Halston's tenure, the cross country team has been ranked as high as fifth nationally. He has been on the receiving end of numerous postseason coaching accolades, including a streak of five-straight Constitution Athletic Conference Coach of the Year awards in the 1990's; replaced by a current run of seven consecutive awards from the NEWMAC citing Taylor's coaching excellence.\n\nIn track, Halston begins his 14th season as head coach of the men's track and field team at MIT as one of the premier recruiters and coaches in the nation. With a combined coaching record of 215-21, Taylor has solidified MIT's position as one of the most dominant track and field programs in the region. In 2005, Taylor copped his sixth NEWMAC Coach of the Year citation. He guided the Engineers through an unblemished year in 2003 (15-0 indoors, 8-0 outdoors), leading to two New England Division III Championships. Taylor's teams have also captured six of the last seven NEWMAC Championships.\n\nThe indoor and outdoor teams regularly qualify individuals for the NCAA Championships, and under Taylor's guidance, MIT has elicited 122 All-Americans and 12 National champions.\n\nBefore arriving at MIT, Taylor coached the women's track club at South Carolina and was the boy's track coach at both Granby and Mohawk Regional high schools in Massachusetts.\n\nA native of Columbia, S.C., Taylor is a graduate of the University of South Carolina where he was a four-year letter winner and a 4:05-miler. After receiving his undergraduate degree in Physical Education, Taylor entered UMass-Amherst to study and receive his Masters in Exercise Science.",
  "files": [
    {
      "category": "Resource",
      "title": "Day 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-720-weight-training-spring-2006/2e80ce4afcc2495afe8b7126981cd0e6_day1.pdf",
      "content": "DAY 1\nI. PRELIMINARY INFORMATION--CLASS POLICIES AND WEIGHT ROOM\nPOLICIES\nA. Time of Class -- 10 minutes after hour until 10\nminutes before the hour.\nB. Number of classes -- Only one absence is allowed\nif one wishes physical education credit. Everyone\nmust attend the first four classes.\nC. Make-ups can only be made on the opposite days of\nyour class.\nFor example, if students are in a\nMonday/ Wednesday class, they can only make up an\nabsence on Tuesday or Thursday at 10:00, 11:00,\n1:00, or 2:00, if classes are being conducted at\nthose times.\nD. Attire -- Students must wear shoes, elastic or\ndrawstring waist shorts or sweats, shirt or sweat\ntop that covers midriff.\nZippers, buttons,\nbuckles or any other objects that can damage the\nupholstery are not acceptable.\nE. All weights should be put back on trees or racks\nwhen you are finished with an exercise.\nWeights\nshould never be left on the floor or lifting bars.\nF.\nPhilosophy:\n\n- To teach students the proper technique of\nlifting and spotting.\n- To provide information for students to be\nable to put together their own program.\n- To attempt to eliminate intimidation in the\ngym.\n- To teach the course as a lifetime activity\nand as a necessary part of fitness.\nG. Etiquette -- Proper gym etiquette is expected.\nWhoever is using the apparatus \"owns it\".\nOne\nmust ask for permission to work-in on an exercise.\nH. Progress -- Once all sets of an exercise have been\nachieved successfully, without the help of a\nspotter, the weight should be moved up minimally\nthe next time you lift.\nThere are 1/4 and 1/2\nplates\nfor\nthe\nmachines\nto\nassist\nin\nthe\n\ntransition to a heavier weight.\nI. Warmup -- A warmup is designed to prepare a\nspecific muscle or set of muscles for intense\nexercise. The specific purpose of a warmup is to\n\nincrease the temperature of the muscle and joint\ngradually by dilating the blood vessels in the\nmuscle and joint area, which allows for a greater\nflow of oxygenated blood.\nThe way the routines are set up, you should only\nhave to warmup for the first exercise. A general\nguideline for warming up is to first spend 5-10\nminutes of general movement, such as jogging, but\ninvolving those muscles about to be exercised as\nmuch as possible.\nThis can be accomplished by\nperforming the specific movement to be done with a\nvery light (20%) load and then some light\nstretching.\nMove up to a 50% load and do some\nmore stretching.\nThis should be sufficient to\nprepare the muscle(s) for the lift.\nJ. Stretching -- Flexibility is a major component of\nfitness and in itself is beyond the scope of this\nclass. However, beyond the light stretching done\nto\nwarmup\na\nmuscle\nfor\nexercise,\nfurther\n\nstretching should be done at the conclusion of\nyour workout when your muscles are at their peak\ntemperature.\nThis will permit adequate and safe\nstretching to optimize long term flexibility.\nII. COMPLEX LIFTS - An exercise incorporating three or more\nmuscle groups for a single movement.\nDue to the\nnecessity to get the nervous system to work efficiently\ntowards synchronous firing and total recruitment a goal\nweight in the area of 80% should be sought.\nHowever,\nin the beginning of a program one should start\nrelatively light.\nWorking towards this 80% goal\ndictates that repetitions be kept between 5-8.\nA. Squats (glutes, quadriceps, lower back)\nMay be done on squat racks with bar or dumbbells,\nor Smith Machine or front squats (only if unable\nto\ndo\nsquats\non\nrack\nand\nif\napproved\nby\n\ninstructor)\n1. Test class's Achilles tendon flexibility.\na. If not able to squat all the way down\nwith heels on floor and back straight\nwith no bar, they must use 5 or 10 lb.\nplates under heels.\n2. Stress joint alignment.\na. Knees must follow wide path over toes.\nb. Bottom of neck (bar) should be directly\nover center of mass with a reasonably\nstraight, flat back (bar on trapezius --\n1-2\nfingers\nbelow\ntop\nprotruding\n\nvertebrate).\n3. Head back and eyes up\n\n4. Wide bar grip to help spotter\n5. Angle of back does not change -- do not raise\nbutt.\n6.\nSpotting\n\na.\nSquat\nwith\nperson\n(directly\nbehind\n\nthem).\nb. Arms underneath squatter's armpits and\nhands in front of squatter's shoulders.\nc. Counter any downward movement after\ninitial upward movement has begun.\nd. Counter any forward movement.\nB. Bench Press (Chest, triceps, anterior deltoid)\nMay be done on bench presses, (Smith Machine, or\nHammer\nStrength\nMachine\nwith\ninstructor\n\npermission).\n1. Technique should be stressed before strength.\na. Wide grip is necessary (90 degrees for\nelbow joint when upper arm is parallel\nto the floor) to increase triceps and\nchest productivity and efficiency.\nb. Bar should follow path from nipple line\nto bottom of deltoid in order to keep\nbar within (cog) of the three muscle\ngroups involved.\nc. Thumbs should be behind bar to ensure\nthat bar stays over, not in front of\nelbow.\n2. Symmetry should also be stressed to avoid\ninjury.\n3. Spotting should be from behind with both\nhands under the bar. (If spotting on the\nHammerStrength equipment, stand in front and\nhelp if possible)\n4. Do not work through failure on the pressing\nexercises.\nC. Incline Press (Chest, triceps, anterior deltoid)\nMay be done on bench presses, (Smith Machine, or\nHammer\nStrength\nMachine\nwith\ninstructor\n\npermission).\n1. Same technique as on bench press except path\nof bar--in this lift the bar should travel\nfrom the top of the chest to top of shoulder.\n2.\nStrength\nwill\ndrop\nproportionately\nwith\n\nincrease in incline. You can expect to lift\n10% less in the incline press.\n3.\nSpotting\nmust\nbe\ndone\nfrom\nbehind--on\n\nplatform. (If spotting on the HammerStrength\nequipment,\nstand\nin\nfront\nand\nhelp\nif\npossible)\n\nD. Decline Press (Chest, triceps, anterior deltoid)\nMay be done on decline press only.\n1. Same technique as on bench press except path\nof bar--in this lift the bar should travel\nfrom the bottom of the chest to top of\nshoulder.\n2. Strength will increase proportionately with\nincrease in decline. You can expect to lift\n10% more in the decline press.\n3. Spotting must be done from behind.\nNOTE: One can expect to lift about 10% more on the decline\npress than the bench press, and 10% less on the incline\npress than the bench press."
    },
    {
      "category": "Resource",
      "title": "Day 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-720-weight-training-spring-2006/e14ea1f012c44cef7c3ead5770ee1f74_day2.pdf",
      "content": "DAY 2\nIII. WORKOUT RULES\nA. Order of Exercise\n1. Largest amount of muscle mass to smallest\namount of muscle mass, eg., squats -- calf\nraises\n2. Complex exercise to assisting, eg., squats --\nleg ext.\n3. Agonist to antagonist, eg., leg ext. --\nhamstring curls\nB. Sets, reps, and rest\n1. Once starting exercise, finish all sets\nbefore moving on to next exercise unless\ninstructor dictates pairing exercises.\n2. On complex lifts (those involving 3 or more\nmuscle groups), do 5-6 reps.\n(Bench press\nand squats).\na. Due to necessity of nervous system to\nwork towards synchronous firing and\nrecruitment near 100% in order to get\nsignificant strength gains, one must\nwork at a high percentage of their max.,\nthus low reps.\n3.\nOn isolation lifts, do 8-15 reps.\na.\nObject\nof\nexercise\nis\nfatigue\nnot\n\nstrength, thus high reps.\nb. Maximize range of motion.\nc. Keep momentum to a minimum.\n4. Rest intervals vary from 3-5 minutes on\ncomplex lifts and 1:00 to 2:00 on isolation\nlifts (with a minimum of 72 hours between\nrepeating a workout).\nC.\nPrograms\n\n1.\n4 days/wk\n\na. 2 days upper and 2 days lower, 3-6\nsets/muscle group (all novice lifters\nwill be on this program or the 3 day\nprogram listed below - instructor to\ndetermine)\n2.\n3 days/wk\n\na.\nAlternating\nupper\nand\nlower\nbody\n\nworkouts, Monday, Wednesday and Friday,\n3-6\nsets/muscle\ngroup\n(all\nnovice\n\nlifters will be on this program)\n3. 6 days/wk (advanced)\na. day 1 -- chest, triceps, shoulders; day\n2 -- back, biceps; day 3 -- legs, lower\nback; repeat order (6-12 sets/muscle\ngroup)\n\n4. 3 days on, 1 day off (advanced)\na. day 1 -- chest, triceps, shoulder; day 2\n-- legs, lower back; day 3 -- back and\nbiceps; day 4 -- off; repeat order (6-15\nsets/muscle group)\n5.\n3 days lifting in 5 days (advanced)\na.\nday 1 --- chest and back; day 2 ---\nlegs,\nlower back and abs.; day 3 --- off; day\n4 -\nshoulders and arms; day 5 --- off. (6-15\n\nsets/muscle group)\n\nIV. Proper Exercise Machine Use (Does Not Necessarily Apply\nto Free Weight Exercises):\nA.\nPosture - when using any of the machines in the\nfitness center one always wants to maintain good\nposture. As a general rule the lifter should\nalways try to maintain alignment of the spine. It\nis important never to have the head or body\nleaning more in one direction than another. When\nin a seated position the body should always be\nflush against the seat with the head resting\nagainst the back of the chair.\nB.\nJoint alignment on machine - always align your\njoint with the axis of rotation of the machine.\nMachines that do not have such parts may vary from\npiece to piece. Ask the instructor if assistance\nis needed.\nC.\nPositive Contractions - these are also known as\nconcentric movements. This is the part of a\nrepetition where you are exerting force. We like\nto call it the raising of the weight. This applies\nto both pulling and pressing exercises. When\nexecuting the positive contraction, it is\nimportant to stop just short of locking out the\njoint.\nD.\nNegative Contractions - these are also known as\neccentric movements. This is the lowering of the\nweight. Generally, one should go slower on this\nportion of the lift. Work at always having\ncontrol of the motion of the weight. Together the\npositive and negative make up one complete\nrepetition.\nE.\nFull Range of Motion - when lifting or doing a rep\nwe always want to use a full range of motion. We\nmust get a full stretch on each repetition while\n\nalways maintaining tension in the muscle\nthroughout the set. This means never letting the\nweights rest at the bottom so that the muscles\nrelax.\nF.\nBreathing - Exhale as you exert force during the\npositive movement and inhale on the negative\nmovement. Do not hold your breath at point during\nthe lift.\nG.\nMomentum - keep momentum to a minimum,\nparticularly at the beginning of the movement, to\nforce the muscle to work on the weakest area in\nthe range of motion.\nV.\nLOWER\nBODY\nDEMONSTRATION--ISOLATION\nLIFTS\n-\nBy\n\ndefinition, isolation lifts are those exercises using\none muscle group to achieve the lift.\nDepending on\nwhether the muscle is predominantly slow twitch or fast\ntwitch, the repetitions would range from 10-15.\nA. Quadriceps (Leg Press)\n1. Stress feet on end of platform and close\ntogether.\na. Feet should be well in front of center\nof gravity in order to emphasize quads.\n2. Stress back flat and heels down for safety.\n3.\nSpotting\n\na. Hold onto weight holder and counter any\ndownward movement after initial upward\nmovement.\nb. Do not allow carriage to stop at the\nbottom.\nB. Quadriceps (Leg Extensions)\n1.\nPosition seat so that axis of knee is lined-\nup with\nthe center of the axis of the machine.\n2. Stress minimal momentum.\n3. Concentrate on muscle doing the lift.\n4. Spotting should be done under heels.\nC.\nQuadriceps (Leg Extensions - Hammerstrength)\n1. Same as above except weights are plate loaded\nand\nmay be different for each leg.\nD. Glutes (Hip Extensions -- machine)\n1. Line up joints (hips) with center of cam.\n2. Maximize range of motion.\n3. Keep momentum to a minimum\n4. Do not spot.\n\nE. Glutes (Hip Extensions - floor or bench)\n1. Lying face down or on two hands and one knee\n2. Raise and extend straight leg as far back as\npossible with toe pointing towards floor;\nmust raise knee above hip.\n3.\n\nNo spotting\n\nF. Hamstrings (Leg Curls - seated)\n1.\nPosition seat so that axis of knee is lined-\nup with the center of the axis of the\nmachine.\n2.\nBring leg brace down as tight as possible\n3.\nPush against the handles in order to keep\nbutt back against the pad\n4. Dorsi-flex foot so that calf is stretched.\n5. Being a flexion exercise, the range of motion\nshould be checked and monitored.\n6. Keep momentum to a minimum.\n7.\nNo spotting.\nG. Hamstrings (Leg Curls - kneeling)\n1.\nPosition pads so that knees line up with\npivot\npoint on machine.\n2.\nKneel on pad, bring heels to butt, return to\nfull extension.\n3.\nWeights may differ on each arm as they are\nIndependent of one another.\nH. Erector Spinae--lower back (Straight Leg Dead\nLifts)\n1.\nTest flexibility\n\na. If able to grab toes, perform the\nexercise from dead lift platform.\n2. Stress fully extended legs.\n3. Do not flex neck in any direction.\n4. One hand under, one hand over the bar for\nbetter grip\n5. Start light, work on flexibility; stretch at\nbottom.\n6.\nNo spotting\n\nI. Erector Spinae, hamstrings (Semi-Stiff Legged\nDeadlift)\n1.\nStand\nin\nfront\nof\nthe\nbarbell,\nfeet\n\npositioned hip-width apart.\n2. Grasp the barbell with hands just outside of\nyour\nthighs.\n3. Keep your back arched throughout the ROM\n4. Knees stay bent at about 15 degrees.\n\nJ.\nGastroc-Soleus--calf (Calf Raise Machine)\n1. Position feet halfway on platform, place pad\non top of thigh as tightly as possible.\n2. Lift up heels and release safety holder to\nthe right.\n3.\nLower\nheels\nuntil\ncalves\nare\nstretched\n\ncompletely, and raise up on toes, maximizing\nrange of motion.\n4. Keep momentum to a minimum\n5.\nNo spotting\n\nK. Gastroc-Soleus--calf (Leg Press)\n1.\nOnce legs are fully extended position feet at\nthe\nbottom of the platform, foot about half-way\non\n\nthe platform.\n\n2.\nAllow weight to drop to the point of pushing\ntoes\nBack, stretching the calf area.\n3.\nExtend toes in a plantar flexion of the\nankle,\nUsing full range of motion.\n4.\nKeep momentum to a minimum.\n5.\nNo spotting\nL. Standing Uni-lateral Calf Raise\n1. Perform all reps on one foot before switching\nto the other foot.\n2. If possible, perform these standing on the\nhandle of a large hexagonal dumbbell (allows\nfor a better conformity to the gastroc's\nstrength curve). If not, use a step.\n3. Lower heels until calves are stretched\ncompletely, and raise up on toes, maximizing\n\nrange of motion.\n\n4. Balance by holding on with opposite hand"
    },
    {
      "category": "Resource",
      "title": "Day 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-720-weight-training-spring-2006/dd3006772cb01ea4166c9e9e94a8bfbb_day3.pdf",
      "content": "DAY 3\nV. UPPER BODY DEMONSTRATION--ISOLATION EXERCISES\nA. Anterior Deltoid, Triceps (Seated Dumbbell Press)\n1. 8-10 reps due to high stress on shoulder\njoint\n2. Set starting position so that minimum effort\nis required for liftoff.\n3. Same technique as other presses\n4. With head bent forward and back against pad,\ntake bar from base of head in a slight\nbackwards angle from front of shoulder to\nrear of shoulder.\n5. Spotting is same as with incline press.\nB.\nLateral Deltoid (Lateral Raises -- machine)\n1. Stand facing machine with feet shoulder width\napart.\n2. With elbows slightly flexed, raise arms until\nthey are parallel to the floor.\n3. Do not use your legs\n4. Go through full range of motion, keeping\nmomentum to a minimum.\n5. Spotting must be done from behind with hands\nunder lifter's elbows.\nC.\nLateral Deltoid (Lateral Raises -- dumbells)\n1. In seated position, extend are completely by\nside\nWith dumbbell.\n2.\nWith index knuckle at a lower position than\nthe\nlittle\nknuckle\n(relative\nto\nbeing\n\nparallel to the floor), raise the fully\nextended arm slowly to just above parallel\nposition (hand should finish slightly higher\nthan shoulder.\n3.\nReturn to bottom, and complete all reps for\nthat arm before switching to other arm.\n4.\nSpotting can be done by assisting to raise\nthe extended arm.\nD. Lateral Deltoid, Trapezius (Upright Row)\n1. In front of a mirror, standing position,\nknees slight flexed, narrow grip (3 to 4\ninches apart); rotate shoulders forward, flex\nat waist.\n2. Keep head up and raise bar to front of chin\nwith elbows being the highest point.\n3. Using the 30 lb. bar, is more practical for\nmost.\n4. Spot by stepping in front of lifter and\nassist in lifting the bar.\n\nE. Pectoralis Group (Dumbbell Flies)\n1. Lying down on back of a bench\n2. Start with pair of dumbbells directly over\nshoulders with arms extended, dumbbell heads\nfacing each other.\n3. Flex elbows to about 160 degrees and bring\narms down towards floor with dumbbells still\nin\nline\nwith\nshoulders\nwhile\nrotating\n\ndumbbells\noutward\nso\nthat\nthey\nare\n\nperpendicular to the arm.\n4. When dumbbells reach chest level, return to\nstarting position.\nDo not change elbow\nangle.\n5. Difficult to spot due while avoiding changing\nthe elbow angle.\nF. Pectoralis Group (Flies -- machine)\n1. Adjust seat so that upper arms are parallel\nto floor while doing exercise.\n2.\nConcentrate on:\n\na.\n\nMinimum momentum\n\nb. Keep head and neck against pads.\nc.\nKeeping wrists, and elbows even with\nshoulders so that arms are parallel to the\nfloor.\n3. Go through full range of motion.\n4. Spot by standing in front of lifter and\nassisting in bringing the handles together.\nG. Pectoralis Group (Cable-Crossover Flies)\n1.\nStanding\nposition,\nknees\nflexed,\nflexed\n\nforward\nat\nthe waist. Use the top attachments\non the\ninside of the multi-purpose unit.\n2. Bring hands (holding the handles) together by\nmoving arms in a path that are perpendicular\nto\nthe torso.\n3.\nIt is best to keep the arms flexed slightly\nat\nthe elbow.\n4. In order to get maximum contraction the\nelbows\nmust come as close together as possible.\nThus, the hands should actually cross.\nH. Triceps (Triceps Extensions -- Cable-standing)\n1. Feet shoulder width apart, knees slightly\nflexed, or one foot behind the other. Flex\nslightly at waist. Use the top attachment on\nthe side of the multi-purpose unit.\n2. Starting position is with elbows at side and\nback of hands as close to chest as possible.\n3. While keeping elbows in place, pull bar down\nuntil arms are fully extended--return to\nstarting position.\n4.\nMinimize momentum.\n\n5. Stress full range of motion.\n6. To spot, step in front of lifter and assist\nin pulling bar down.\nI. Triceps (Triceps Extensions -- Cable-standing)\n1. Standing position, feet close together, knees\nslightly flexed.\nUse the top attachment on\nthe side of the multi-purpose unit.\n2.\nOne arm at a time, elbow at side and in line\nwith\nshoulder, forming a line perpendicular\nto the\nfloor.\n3.\nStart with maximum flexion at the elbow\njoint, palm\nup. (can be done with palm down as\nwell)\n4.\nBring the handle down by pivoting around the\nelbow\nwithout moving the elbow.\n5.\nMinimize momentum.\n\n6. Stress full range of motion.\n7.\nTo spot, step in front of lifter and assist\nin\npulling handle down.\nJ. Triceps (Triceps Extensions -- Cable-kneeling)\n1. Brace feet against machine.\n2. Do not allow elbow to go beyond edge of\nbench, flatten arm-pits to the back of bench.\n3. Pull bar around and over head to gain\nstarting position.\n4.\nMinimize momentum.\n\n5. Stress full range of motion.\n6. To spot, step in front of lifter and assist\nin pulling bar down.\nK. Triceps (Triceps Extensions -- Dumbbell-sitting)\n1. Use either one arm or both by putting thumb\nand\nforefinger around dumbbell.\n2. With arms overhead, form a line perpindicular\nto the floor with your elbow to shoulder.\n3. Allowing maximum range of motion, extend arm\nfrom being bent at elbow to fully extended.\nDo not allow elbow to change position.\nL. Triceps (Triceps Extensions -- Dumbbell-kneeling)\n1. Kneeling on a bench or leaning over, flex\nelbow with dumbbell so that the dumbbell is\nat chest level.\n2. Raise elbow so that it is stays higher than\nshoulder,\nallowing\nwork\nagainst\ngravity\n\nthroughout range of motion.\nM. Triceps (Triceps Extensions - Dumbbell-Lying)\n1.\nLying on a bench, lift the dumbbells overhead\nin\na bench press fashion (grip = palms facing\neach\nother)\n\n2.\nKeep your elbows pointed directly upward,\nlower\nthe dumbbells until your forearms make\ncontact\nwith your shoulders. Lift dumbbells to\nstarting position by extending your elbows.\n3.\nKeep your shoulders fixed"
    },
    {
      "category": "Resource",
      "title": "Day 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-720-weight-training-spring-2006/30b609904d451532d9c4dcd8d60ce4c7_day4.pdf",
      "content": "DAY 4\nA. Latissimus Dorsi (Pulldown - machine)\n1. Adjust seat so that the elbows will go\nthrough a complete range of motion\n2. Adjust leg supports to the top position.\n3. Grab the handles with palms up, pull down\nwithout flexing arms until comfortably seated\nwith legs in position. Knee the leg support\nto allow it to come down on the legs and hold\nthem in position.\n4. Pull handles down in a complete range of\nmotion so that the elbows pass beside and\nbehind torso. Return to starting position\nunder control.\n5. Keep momentum to a minimum.\n6. Do not spot.\nB. Latissimus Dorsi, Biceps (Pulldown - Multi Unit)\n1. Adjust seat so that legs are snug against\npads when as close to the machine as\npossible.\n2. Grab handle, bend head forward, pull bar down\nto base of head, or under chin, return to\nstarting position, and repeat.\n3. Do not jerk bar or let body weight assist\nyou.\n4. To spot, help lifter pull bar down from\nbehind.\nC. Chin-ups (parallel, supinated, pronated grips)\n1.\nGrasp the bar with either a parallel grip\n(palms\nfacing\neach\nother),\nsupinated\ngrip\n\n(palms facing you) or pronated grip (palms facing\naway).\n2. Use a full range of motion: arms straight to\nchin\nabove bar (clavicle to the bar).\nD. Latissimus Dorsi (Rows - machine)\n1.\nAdjust seat so that hands will pass along\nbottom of rib cage and elbows will not flex much\nbeyond 90 degrees.\n2.\nPosition chest pad so that at full arm\nextension the weight does not come to rest.\n3. While keeping chest against pad, pull handles\nso that hands come back to a plane in line with\nfront of shoulders.\n4. Maintain control of weight while returning to\n\nstarting position.\n\n5. Keep momentum to a minimum.\n6. To spot, stand behind lifter and assist in\nbringing elbows back.\n\nE. Latissimus Dorsi, Biceps (Long Rows - Multi Unit)\n1. Grab handle and position body so that knees\nare flexed, back perpendicular to floor,\nchest out, and shoulders back.\n2.\nPull\nbar\ninto\nlower\nabdomen\nwhile\nnot\nchanging any starting position, and repeat.\n3. Minimize momentum.\n4. Concentrate on pulling bar all the way into\nbody\n(elbows\nbehind\nshoulders)\nwithout\n\ncheating.\n5. To spot, stand behind lifter and assist in\nbringing elbows back while possibly bracing\nlower leg against lifters back to enforce\nstraight back.\nF.\nLatissimus\nDorsi,\nBiceps\n(Bent\nOver\nRows -\nDumbbell)\n1. If working left side, place right knee and\nright hand on bench so that back is parallel\nto the floor.\n2. Place left foot about one foot behind left\nhip. Start with left arm holding dumbbell in\nfront of shoulder, fully extended toward\nground.\n3. Bring the dumbbell to hip in a straight line\nwithout jerking it or twisting the back.\n4. Return to starting position, repeat movement.\n5. Do the other arm.\n6.\nNo spotting.\n\nG. Biceps (Bicep Curls - sitting)\n1. Sit on a bench, elevate leg of lifting arm by\nplacing foot on a dumbbell.\n2.\nFlex at waist so that entire upper arm of\nlifting\narm is pressed against lower leg.\n3.\nFoot should be elevated so that weight does\nnot drag on floor at complete extension.\n4.\nWhile\nkeeping\nelbow-shoulder\nline\n\nperpendicular to\nfloor,\ncurl\ndumbbell\nup\n\nthrough full range of\nmotion.\n5. Spot with free hand.\nH. Biceps (Bicep Curls - cable-standing)\n1. Using either of the attachments on the side\nof multi-purpose unit, stand with knees flexed,\nelbow at side.\n2. One arm at a time, curl weight using bottom\nattachment.\n\n3.\nBe sure to pivot the movement around the\nelbow,\nbut do not allow the elbow to move away\nfrom\nyour sides.\n4.\nUse full range of motion by bringing the arm\nall the way up and when returning to lower\nposition, allow the arm to reach full extension."
    },
    {
      "category": "Resource",
      "title": "Day 5-12",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/pe-720-weight-training-spring-2006/99b21c54d3bf10f1cdf38d6c9c4bf212_day5.pdf",
      "content": "DAY 5-12\nVI. STARTING THE CLASS\nA.\nPartners\n\n1. For the sake of safety and adequate workouts,\nas well as learning to work with others in a\ngym, everyone should have a partner or\nspotter.\n2. This can be in groups of two or three.\nB. Weights and increases\n1. Everyone should start light.\n2. When you are successful for all of your sets\nof a particular exercise, move up minimally\nthe next time.\na. Minimally means 2-1/2 lbs. on each side\nfor free weights, and a 1/4 or 1/2 plate\non machines.\nC. Maximum efforts on final two days in order to find\nout what level students should be lifting, and to\nteach people how to correctly go about doing a\nmaximum effort.\n1.\nThere is an option on the final two days to\ndo\nmaximum\nefforts\ninvolving\nbench\npress,\n\nsquats,\nand pulldowns.\n2. If this option is taken, individuals should\nexpect to be able to do either bench and\npulldown on day 1\nor squats only.\nDay 2\nwould\nbe squats if you did bench and pulldown\non day 1.\n3.\nRest and warmup are even more important for\nthis\neffort than for a normal warmup.\n4. A normal warmup should be followed, then do 3\nreps at the weight you normally work out with\n(assuming you are doing 3 sets of 6) (for\npulldown you may want to do 5-6 reps). After\nat least 3-4 minutes\nrest, do another set of\n1-2 at 10% above your\nprevious set. With the\nassistance of your instructor, decide if you\nshould attempt another\nset\nof\n5-10lb.\nincrease.\na.\nEvery effort should be made not to be\nfatigued during a set or effort until you\nactually go for your max.\nb.\nWith squats, expect to have to make\nlarge\nincrement leaps as most students\nworkout far\nbelow\ntheir\nability.\nBe\n\ncertain to have the\ninstructor\npresent\nand\nspotting when going for\nmaximum efforts.\nc.\nYou can generally expect pulldown max.\nto be\nwithin 10-20lbs. of your bench max.\n\nVII. FOLLOW-UP\nA. Regardless of how well you listened, there will be\na breakdown in form and communication.\nThe most\ncommon areas:\n1.\nSquats\n\na. Knees not passing over toes\nb. Heels not squarely on the floor or plate\nc. Butt comes up first\nd. Head not back\n2.\nBench press\n\na. Grip not wide enough\nb. Too many reps\nc. Too heavy a weight\nd.\nImproper warm-up\n\ne. Not enough rest\nf. Too much help spotting\ng. Too much failure\n3.\nIsolation machines\n\na. Too concerned about success instead of\ntechnique.\nb. More than two people working out on one\nmachine (too much rest).\nc. Spotter not paying attention\nd. Wrong order of exercise"
    }
  ]
}