{
  "course_name": "Women's Novels: A Weekly Book Club",
  "course_description": "This pass/fail seminar should be a fun setting where we can all enjoy a love of good books together. Students will read approximately one novel every two weeks, and the class will discuss each novel in a relaxed and interactive setting, with attention to whatever themes and issues interest them most about each book. We will read a wide mixture of classic and contemporary novels written by women, including: Edith Wharton, The House of Mirth; Toni Morrison, Jazz; Virginia Woolf, Mrs. Dalloway; Alice Walker, The Color Purple; Charlotte Brontë, Jane Eyre; Sheri Reynolds, The Rapture of Canaan; Jane Austen, Pride and Prejudice; and Sylvia Plath, The Bell Jar. Recurrent issues likely to be discussed include: gender, race, and class; romance, love, and marriage; depression and suicide; and conception, childbirth, and parenthood.",
  "topics": [
    "Humanities",
    "Literature",
    "Fiction",
    "Society",
    "Gender Studies",
    "Women's Studies",
    "Humanities",
    "Literature",
    "Fiction",
    "Society",
    "Gender Studies",
    "Women's Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nFormat\n\nThis course, as part of the\nExperimental Study Group\nSeminar Series, offers students the opportunity to participate in a small discussion-based class taught by an MIT upperclassman under the guidance of a faculty supervisor. Students Faye Kasemset (B.S. 05 Electrical Engineering and Computer Science, Literature) and Jocelyn Rodal (B.S. 06 Literature) taught this seminar in cooperation with Dr. Holly Sweet, Lecturer and Associate Director in the Experimental Study Group. Seminars taught in this format are all graded Pass/Fail and receive 1/2 of the academic credit assigned to regular academic classes.\n\nClass Summary\n\nThis pass/fail seminar should be a fun setting where we can all enjoy a love of good books together. Students will read around one novel every two weeks (or one a week for the shorter novels). We'll be reading a wide range of classic and contemporary novels written by women, and we'll discuss each novel in a relaxed and interactive setting, with attention to whatever themes and problems interest students most about each book. According to student interest, there will also be occasional film showings, as well as field trips to museums and Boston landmarks that are related to these books.\n\nAssignments and Grading\n\nThe only requirement for this course is that you read the novels in time for each discussion. This should be a fun and relaxed class, and the\nreadings\nare meant to be thought-provoking and pleasurable. It is absolutely necessary, however, that students come to class able to discuss that week's novel and demonstrate that they have done the reading. We reserve the right to require additional writing in exchange for a passing grade if a student misses more than two classes or regularly comes to class unprepared.\n\nWe adore these books (would probably drag them with us to a desert island), and we hope you enjoy them too!\n\nCalendar\n\nSES #\n\nTOPICS\n\nEVENTS*\n\nSet up, Poetry by Margaret Atwood and Sylvia Plath\n\nToni Morrison:\nJazz\n\nToni Morrison:\nJazz\n(cont.)\n\nJane Austen:\nPride and Prejudice\n\nJane Austen:\nPride and Prejudice\n(cont.)\n\nVirginia Woolf:\nMrs. Dalloway\n\nVirginia Woolf:\nMrs. Dalloway\n(cont.)\n\nFilm: Daldry, Stephen.\nThe Hours\n. 2002.\n\nEdith Wharton:\nThe House of Mirth\n\nTrip:\nThe Isabella Stewart Gardner Museum\n\nEdith Wharton:\nThe House of Mirth\n(cont.)\n\nFilm: Davies, Terence.\nThe House of Mirth\n. 2000.\n\nSheri Reynolds:\nThe Rapture of Canaan\n\nCharlotte Bronte:\nJane Eyre\n\nCharlotte Bronte:\nJane Eyre\n(cont.)\n\nAlice Walker:\nThe Color Purple\n\nFilm: Spielberg, Steven.\nThe Color Purple\n. 1985.\n\nSylvia Plath:\nThe Bell Jar\n\nTrip: The Boston Public Gardens\n\n* These events were chosen and voted on by the students. Films were viewed at additional meetings outside of class.",
  "files": []
}