{
  "course_name": "Women in South Asia from 1800 to Present",
  "course_description": "This course is designed to introduce and help students understand the changes and continuities in the lives of women in South Asia from a historical perspective. Using gender as a lens of examining the past, we will examine how politics of race, class, caste and religion affected and continue to impact women in South Asian countries, primarily in India, Pakistan, Bangladesh and Sri Lanka. We will reflect upon current debates within South Asian women’s history in order to examine some of the issues and problems that arise in re-writing the past from a gendered perspective and these are found in primary documents, secondary readings, films, newspaper articles, and the Internet.",
  "topics": [
    "Humanities",
    "History",
    "Asian History",
    "Social Science",
    "Anthropology",
    "Social Anthropology",
    "Society",
    "Asian Studies",
    "Gender Studies",
    "Women's Studies",
    "Humanities",
    "History",
    "Asian History",
    "Social Science",
    "Anthropology",
    "Social Anthropology",
    "Society",
    "Asian Studies",
    "Gender Studies",
    "Women's Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description and Goals\n\nThis course is designed to introduce and help students understand the changes and continuities in the lives of women in South Asia from a historical perspective. Using gender as a lens of examining the past, we will examine how politics of race, class, caste and religion affected and continue to impact women in South Asian countries, primarily in India, Pakistan, Bangladesh and Sri Lanka. We will reflect upon current debates within South Asian women's history in order to examine some of the issues and problems that arise in re-writing the past from a gendered perspective.\n\nThe chronological focus of this course is on the condition of women in the subcontinent from the 1800s till the present day. Students are required to have some knowledge about South Asia. However it is not a necessary pre-requisite and I will suggest some basic texts to provide those with no previous courses on South Asia. To help us evaluate the different historical and temporal experiences of South Asian women, this course will extensively use primary documents, secondary readings, films, and contemporary newspaper and Internet articles. Students will be required to actively engage and participate in class discussions and group debates, which will form a substantial part of individual evaluations.\n\nCourse Requirements and Grading\n\nREQUIREMENTS\n\nPERCENTAGES\n\nTwo short essays (20% each)\n\n40%\n\nResearch paper and presentation\n\n30%\n\nInternet assignment\n\n10%\n\nClass participation\n\n20%\n\nPlease see\nassignments\nfor more detailed descriptions of the above.\n\nClass Participation and Preparation\n\nAttendance\nin class is\nmandatory\n. Only legitimate excuses supported by evidence will be entertained.\n\nThe two classes per week will involve lectures and scheduled and unscheduled discussions and debates. You are required to read the assigned pages of the textbook and the primary and secondary readings\nbefore\nyou come to class. Students are required to participate in discussions. There are no wrong answers as long as you support your dialogue with evidence from your readings or general knowledge on the topic.\n\nLate Submission Policy\n\nStudents are required to submit papers on time. Late submission will result in lowering of grades. This will be calculated in the following way:\n\nOne-day late means 1 grade lower. E.g. An A- paper will become a B+ paper.\n\nTwo days late means 2 grades lower. E.g. An A- paper becomes a B paper.\n\nA paper, which is four or more days late, will be given an instant\nF\n.\n\nAcademic Dishonesty\n\nStudents should familiarize themselves with the Student Code of the University and its sections on academic dishonesty, especially on plagiarism. Plagiarism, which is the unacknowledged use of the ideas or works of another on a paper, will result in an F grade for the paper. Cheating on an examination will result in an F grade for the course and the notification of the Dean of the student's college.\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\n1. Introduction: Studying women in cross cultural perspective\n\nWriting South Asian women's history\n\nIndia: The historical and social context\n\nLibrary tour\n\n2. Prescriptive literature and gendered roles\n\nWomen as mothers, daughters, and daughters in law\n\nWives, courtesans and concubines\n\nSign up for individual meetings\n\nDivinities and devotees\n\n3. Defining Indian women in the 19th century\n\nDefining women: Social reforms\n\nComparison between men and women in the 19th century\n\nClass discussion on\nComparison Between Men and Women\n\nIndividual meetings to report on research progress due one day after Ses #8\n\nReforms in education and religion\n\nCritical essay on\nComparison Between Men and Women\ndue\n\nGender and law in colonial India\n\n4. Becoming \"mothers\" of the nation\n\nThe good wife and mother\n\nInside out:\nAndarmahal\n,\nharem\nand political participation\n\nWomen's work and working women\n\n5. Empowering women: Gandhi, birth control and the franchise\n\nGandhi and women\n\nBirth control and public health\n\nOrganizations and activism in colonial India\n\nIndividual meetings to report on research progress due two days after Ses #16\n\n6. Identities and social realities in post-1947 South Asia\n\nPartitioned nations, partitioned bodies\n\nClass discussion on\nThe River Churning\n\nCampaigns against dowry, rape and sati\n\nPersonal law vs. uniform civil code\n\nCritical essay on\nThe River Churning\ndue\n\n7. Women and their nations\n\nEra of women leader\n\nDangerous liaisons: Religious fundamentalisms\n\nInternet assignment due\n\nIconic representations: Sexuality and gender in popular culture\n\n8. Tracking progress: South Asian women in the 21st century\n\nStudent presentations\n\nContemporary debates on feminism\n\nGlobalization and South Asian women\n\nConclusions\n\nFinal research paper due one day after Ses #26",
  "files": []
}