{
  "course_name": "Workshop I",
  "course_description": "This course fulfills the first half of the Comparative Media Studies workshop sequence requirement for entering graduate students. The workshop sequence provides an opportunity for a creative, hands-on project development experience and emphasizes intellectual growth as well as the acquisition of technical skills. The course is designed to provide practical, hands-on experience to complement students’ theoretical studies.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Fine Arts",
    "Media Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nClass Description\n\nCMS.950 fulfills the first half of the CMS workshop sequence requirement for entering graduate students. The workshop sequence provides an opportunity for a creative, hands-on project development experience and emphasizes intellectual growth as well as the acquisition of technical skills. In the fall semester, first-year students enroll in CMS.950; students fulfill the second part of the workshop requirement through independent study or approved courses.\n\nCMS.950 is designed to provide practical, hands-on experience to complement students' theoretical studies. Workshop classes meet for two hours each week throughout the fall semester. Class sessions include presentations by guest lecturers, tutorials (when needed) and - most importantly - workshop discussion of projects created by members of the class working individually or in small collaborative groups. Collaboration and sharing of technical expertise is a key element of this class.\n\nGrading\n\nStudents develop a portfolio of work throughout the semester. Each assigned project is assessed through in-class presentation and discussion and reviewed as part of the final portfolio, which also includes a substantial end-of-semester project presentation. Final projects are usually collaborative efforts. Since workshop discussion is central to this class, attendance is mandatory. Students are encouraged to lead tutorials in their particular areas of technical expertise.",
  "files": []
}