{
  "course_name": "Workshop on Deliberative Democracy and Dispute Resolution",
  "course_description": "No description found.",
  "topics": [
    "Humanities",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Political Science",
    "Public Administration",
    "Public Policy",
    "Humanities",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Political Science",
    "Public Administration",
    "Public Policy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: Four sessions / day, 1.5 hours / session\n\nCourse Description\n\nThe Workshop on Deliberative Democracy and Dispute Resolution, sponsored by the Program on Negotiation at Harvard Law School and\nThe Flora and William Hewlett Foundation\n, is a two-day conference that brings together dispute resolution professionals and political theorists in the field of deliberative democracy. Invited guests will participate in one of four panel discussions built around a hypothetical scenario depicting a difficult moment in democratic practice. The panels will be comprised of three dispute resolution professionals and three political theorists. One of the five co-organizers will moderate. The participants will submit two pages of reactions to the workshop, which will be compiled and bound with selected readings on the topics discussed. The two-day workshop will be filmed and a summary video will be made available through the Program on Negotiation Clearinghouse.",
  "files": [
    {
      "category": "Resource",
      "title": "presenter_bios.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-969-workshop-on-deliberative-democracy-and-dispute-resolution-summer-2005/26d65673efb196b8f077cdfc6008892f_presenter_bios.pdf",
      "content": "Participant Bios\n\nPeter S. Adler, President of The Keystone Center, specializes in\nmulti-party negotiation and problem solving. Under his\nleadership, The Keystone Center applies consensus-building and\nscientific information to energy, environmental, and health-\nrelated policy problems. He has worked extensively on water\nmanagement and resource planning problems and mediates, writes,\ntrains, and teaches in diverse areas of conflict management. He\nhas worked on cases ranging from the citing of a 25-megawatt\ngeothermal energy production facility to the resolution of\nconstruction and product liability claims involving a multi-\nmillion dollar stadium. Adler has served as a Peace Corps\nvolunteer in India, President of the Society of Professionals in\nDispute Resolution and is a former consultant to the U.S.\nInstitute for Environmental Conflict Resolution.\n\nDavid Booher, Senior Policy Advisor at the Center for\nCollaborative Policy at California State University, Sacramento\nprovides strategic consulting to the Center on research,\neducation, and policy issues. He is a planner and policy\nconsultant in many of the content areas for collaborative policy\nand has authored and co-authored numerous scholarly articles and\nbook chapters on governance, public participation, collaborative\npolicy, and consensus building. Booher is the former Co-Chair of\nthe California Governance Consensus Project and Chair of the\nCalifornia Environmental and Economic Recovery Coalition. He is\ncurrently assisting the City of San Francisco in a collaborative\nprocess to establish an assessment program for health impacts of\nland use planning decisions in three neighborhoods.\n\nJoshua Cohen, Goldberg Professor of the Humanities and Professor\nof Philosophy and Political Science at MIT, is a political\ntheorist, trained in philosophy, with a special interest in\nissues that lie at the intersection of democratic norms and\ninstitutions. He has written extensively on issues of democratic\ntheory, particularly on the theory of deliberative democracy,\nand the implications of that idea for issues of personal\nliberty, freedom of expression, electoral finance, and new forms\nof associative and direct-democratic participation. He is\ncurrently working on issues of global justice, including the\nfoundations of human rights, distributive fairness, and supra-\nnational democratic governance. Cohen is also editor of Boston\nReview, a bi-monthly magazine of political, cultural, and\nliterary ideas, and has edited 20 books that have grown out of\nforums that initially appeared in Boston Review.\n\nJohn Dryzek, Professor of Political Science at Australian\nNational University, works mostly in the areas of democratic\ntheory and practice and environmental politics, though his\ninterests extend to comparative politics and international\nrelations. His most recent book is Green States and Social\nMovements: Environmentalism in the United States, United\nKingdom, Germany, and Norway. He is co-editing the Oxford\nHandbook of Political Theory. He is former Head of the Political\nScience Departments at the Universities of Oregon and Melbourne,\nand former editor of the Australian Journal of Political\nScience.\n\nMichael Elliott, Associate Professor of Planning and Public\nPolicy at Georgia Institute of Technology, has worked in public\npolicy conflict management and environmental planning and policy\nfor 25 years. His particular expertise is in the design and\nevaluation of environmental dispute resolution and public\nparticipation processes, and in the mediation of public policy\ndisputes. Elliott is also the co-founder and former Director of\nResearch for the Consortium on Negotiation and Conflict\nResolution, and the Director of the Southeast Negotiation\nNetwork.\n\nDavid Fairman, Managing Director at the Consensus Building\nInstitute and Associate Director of the MIT-Harvard Public\nDisputes Program, facilitates consensus building and mediates\nresolution of complex public and organizational issues\ninternationally and in the United States. His areas of focus\ninclude economic development; human services; environment,\nenergy and land use regulation and policy; and intergroup\nconflict. He also teaches negotiation, consensus building and\nmediation skills. He has authored numerous scholarly articles,\nconsulting reports and negotiation simulations. He is a senior\nmediator on the rosters of the U.S. EPA and the U.S. Institute\nfor Environmental Conflict Resolution, and a founding board\nember of the Alliance for International Conflict Resolution.\nm\n\nFrank Fischer, Professor of Political Science at Rutgers\nUniversity, teaches politics and public policy in the Ph.D.\nProgram in Public Administration and the Bloustein School of\nPlanning and Public Policy. At the Center for Global Change and\nGovernance, he serves as the head of the research committee on\ncomparative public policy and administration. His research\ninterests include public policy analysis, environmental policy\n\nand administration, and democratic political theory and the\nstate. Currently, he is working on a comparative study of\nenvironmental policy in Germany and the United States. He has\ntaught and lectured in a variety of countries and is on the\neditorial boards of multiple academic journals, including\nOrganization and Environment and the International Journal of\nPublic Administration. Fischer is the winner of the 1999 Harold\nLasswell Award of the Policy Studies Organization. His most\nrecent book is Social Science in Public Policymaking (Oxford,\n2001).\n\nJames Fishkin, Director of the Center for Deliberative Democracy\nand Janet M. Peck Professor at Stanford University, works on the\ntheory and practice of deliberative democracy as well as\ntheories of distributive justice. He is best known for\ndeveloping Deliberative Polling, a practice of public\nconsultation that employs random samples of the citizenry to\nexplore how opinions would change if they were more informed.\nFishkin and his collaborators have conducted Deliberative Polls\nin the US, Britain, Australia, Denmark, Bulgaria, China and\nother countries. While Deliberative Polling events are typically\ntelevised, face-to-face discussions, he has recently conducted\nonline versions in collaboration with the Political\nCommunication Lab at Stanford and MacNeil/Lehrer Productions.\nFishkin is the author of a number of books including Democracy\nand Deliberation (Yale University, 1991), and (with Bruce\nckerman) Deliberation Day (Yale University, 2004).\nA\n\nJohn Forester, Professor of Urban and Regional Planning at\nCornell University, has served as chair of the Department of\nCity and Regional Planning and as associate dean of the College\nof Architecture, Art, and Planning. His research into the\nmicropolitics of the planning process, ethics, and political\ndeliberation assesses the ways planners shape participatory\nprocesses and manage public disputes in diverse settings. He is\na mediator for the Community Dispute Resolution Center of\nTompkins County, has consulted for the Consensus Building\nInstitute, and has lectured in Cambridge, Vancouver, Seattle,\nChapel Hill, Sydney, Melbourne, Helsinki, and Aix en Provence.\nOne of his recent books is The Deliberative Practitioner (MIT\nPress, 1999).\n\nArchon Fung, Associate Professor of Public Policy at The Kennedy\nSchool of Government, examines how public and private governance\ncan be improved through civic participation, public\n\ndeliberation, and transparency. His current projects also\nexamine participatory initiatives in ecosystem management,\ntoxics reduction, endangered species protection, local\ngovernance, and international labor standards. His most recent\nbooks and edited collections include Deepening Democracy:\nInstitutional Innovations in Empowered Participatory Governance\n(Verso, 2003), Can We Eliminate Sweatshops? (Beacon Press, 2001)\nand Working Capital: The Power of Labor's Pensions (Cornell\nUniversity Press, 2001).\n\nMaarten Hajer, Head of the Department of Political Science and\nChair in Public Policy at the University of Amsterdam, is\ninterested in new practices of democratic governance,\nenvironmental politics, and urban politics. Currently he is\nworking on transnational policy-discourse formations in several\nresearch projects on food safety in Europe and the role of\nexperts in policy making, which materialized from major projects\non the role of designers (architects, urban planners, urban\ndesigners, landscape architects) in regional planning.\nTheoretically he seeks to develop new methods of interpretive\npublic policy analysis. Hajer is currently working on two books,\none on the politics of design, and one on politics as\nperformance, in which he seeks to combine his previous work on\ndiscourse with two new dimensions of politics: dramaturgy and\nliberation.\nde\n\nJudith Innes, Professor of City and Regional Planning at\nUniversity of California, Berkeley, is interested in planning\nand policy making processes in a variety of arenas, including\nwater policy, land use and growth management, habitat\nconservation, economic policy, and transportation planning. Her\nfocus in recent years has been on consensus building and\ncollaborative policy making. She has studied the use of\ninformation and indicators in public policy. She is the author\nof numerous articles and books on planning, public policy, and a\nvariety of other fields. Innes teaches on research methods,\nplanning theory, and the urban community.\n\nWilliam Isaacs, Founder and President of Dialogos, works on\ncollective leadership, the design and development of\norganizational learning, and the practice and theory of\ndialogue. Isaacs serves as Chairman of the Board of the Dialogos\nInstitute, a not-for-profit action research organization, and is\nalso a Senior Lecturer at Massachusetts Institute of\n\nTechnology's Sloan School of Management. In 1990, Isaacs co-\nfounded the Center for Organizational Learning at MIT, a\nconsortium of 25 leading companies dedicated to cross-\norganizational learning and change. Isaacs has consulted to\nsenior leaders of organizations around the world. His work\nfocuses on producing generative change that can engage large\nnumbers of people, leading to \"learning at scale\" integration of\nfunctional organizations into business leadership, transforming\nmanagement/union relationships, and \"organic growth\" by creating\ncross-boundary and cross-functional transformation and action.\nIsaacs is the author of Dialogue and the Art of Thinking\nTogether (Doubleday, 1999).\n\nDavid Kahane, Associate Professor of Philosophy at the\nUniversity of Alberta, researches theories and practices of\ndemocratic deliberation, focusing on how to justly include\nmarginalized groups in public deliberations, and on dialogue\nmechanisms that can make such inclusion meaningful. Kahane is\nthe co-editor of Intercultural Dispute Resolution in Aboriginal\nContexts (with Cathy Bell, UBC Press, 2002); and is currently\nputting together a volume called Realizing Deliberative\nDemocracy (co-edited with Dominique Leydet, Daniel Weinstock and\nMelissa Williams). Over the past year, Kahane's thinking about\ndeliberative democracy has been energized by rich dialogues\naround cases and practice in the 'Invited Spaces' group of the\nDevelopment Research Centre on Citizenship, Participation and\nAccountability and the Researchers and Practitioners group of\nthe Deliberative Democracy Consortium.\n\nDavid Laws, Lecturer and Research Scientist at MIT, specializes\nin ethics, public policy, and alternative dispute resolution.\nHis research focuses on institutional development in\nenvironmental regulation and democratic governance. Laws was the\nrecipient of the Martin Environmental Fellowship and MIT's\nGoodwin Medal for teaching in 1995. He is co-director of the\nEnvironmental Technology and Public Policy Program at MIT. He\nhas recently published \"Talking With The Future: Sustainability\nas Intergenerational Dialogue\" (in National Forum, coauthored\nwith Lawrence Susskind).\n\nJudith Layzer, Associate Professor of Urban Studies and Planning\nat MIT, is concerned with how Americans make environmental\npolicy decisions. She is particularly interested in the impact\nof science and values on land use and natural resource\npolicymaking. Layzer is currently investigating whether and how\ncollaborative, ecosystem-scale planning and management yields\nenvironmentally protective water and land-use policies. A second\n\nproject involves analyzing the role of business in environmental\npolicy decisions made by the U.S. Congress. Her book, The\nEnvironmental Case: Translating Values Into Policy (CQ Press,\n2002), explores the relationship between how environmental\nissues are framed and the kinds of policy decisions governments\nmake.\n\nCarolyn J. Lukensmeyer, Founder and President of AmericaSpeaks,\nworks in deliberative democracy, public administration, and\norganizational development. In founding AmericaSpeaks,\nLukensmeyer's goal was to develop new democratic practices that\nwould strengthen citizen voice in public decision-making. Prior\nto founding AmericaSpeaks, Lukensmeyer served as Consultant to\nthe White House Chief of Staff, Deputy Project Director for\nManagement of the National Performance, and Chief of Staff to\nthe Governor of Ohio. Lukensmeyer also led her own\norganizational development and management consulting firm for 14\nyears.\n\nJane Mansbridge, the Adams Professor at the Kennedy School of\nGovernment, came to the Kennedy School from the Department of\nPolitical Science at Northwestern University, where she was also\na faculty fellow at the Center for Urban Affairs and Policy\nResearch. Her current research includes work on representation,\nthe relation between coercion and deliberation in democracy, the\npublic understanding of collective action problems, and the\ninteraction between \"everyday activists\" and organized activists\nin social movements. Mansbridge also serves as the Faculty Chair\nof the Ash Institute for Democratic Governance and Innovation at\nthe Kennedy School. She is the author of Beyond Adversary\nDemocracy (University of Chicago Press, 1983) and editor of\nBeyond Self-Interest (University of Chicago Press, 1990)\n\nCarrie Menkel-Meadow, A.B. Chettle, Jr. Chair in Dispute\nResolution and Civil Procedure at Georgetown University,\nspecializes in alternative dispute resolution, the legal\nprofession and legal ethics, clinical legal education, feminist\nlegal theory, and women in the legal profession. In addition to\nher teaching and research, Menkel-Meadow is currently the\ndirector of the Georgetown Hewlett Fellowship Program in\nConflict Resolution and Problem-Solving and serves on the\nExecutive Committee of the Board of Directors of the American\nBar Foundation. As a professor at UCLA before coming to\nGeorgetown, Menkel-Meadow served in a variety of capacities,\nincluding Acting Director of the Center for the Study of Women\nand Co-Director of UCLA's Center on Conflict Resolution. Menkel-\n\nMeadow has been recognized for excellence in teaching and has\nwritten and lectured extensively on the study of dispute\nresolution. She often serves as a mediator and arbitrator in\npublic and private settings and has trained lawyers and\nmediators in the United States and abroad.\n\nSusan L. Podziba, Principal and Public Policy Mediator at Susan\nPodziba & Associates, is known for designing processes to fit\nthe unique characteristics of given conflicts. Since 1984, she\nhas mediated cases involving international relations,\ngovernance, environmental disputes, land use and development\ndecisions, transportation planning, public health, worker\nsafety, and education policy. Podziba has served as a Visiting\nLecturer and Lecturer at the Massachusetts Institute of\nTechnology's Department of Urban Studies and Planning and a\nFaculty Associate of the Program On Negotiation at Harvard Law\nSchool. Her recent projects have included facilitated negotiated\nrulemakings for the U.S. Department of Transportation on\nsecuring state-issued drivers' licenses and personal\nidentification cards and establishing worker safety standards\nfor the use of cranes in construction for the U.S. Department of\nLabor. Podziba is also working with Dutch and Finnish academics\nand government officials to introduce consensus building and\nmediation tools into their land use planning processes.\n\nRichard C. Reuben, Editor of Dispute Resolution Magazine, is a\nlawyer and journalist who has been nominated for a Pulitzer\nPrize for his coverage of the U.S. Supreme Court and other legal\nmatters. Reuben is also an Associate Professor of Law at the\nUniversity of Missouri-Columbia School of Law, and co-director\nof the University of Missouri Center for the Study of Conflict,\nLaw and the Media, a partnership with the Missouri School of\nJournalism. Reuben has written extensively on dispute resolution\nand American law, and most recently is publishing a series of\narticles on the relationship between dispute resolution and\ndemocratic governance. He is also a Senior Fellow at Missouri's\nCenter for the Study of Dispute Resolution, Vice-Chair of the\nOmbuds Committee of the ABA Section of Administrative Law and\nRegulatory Practice, a board member of the Conflict Resolution\nInformation Project, and formerly served as the former Associate\nDirector of the Stanford Center for Conflict and Negotiation,\nand as a Reporter for the Uniform Mediation Act.\n\nNancy Roberts, Professor of Strategic Management and Professor\nof National Security Affairs in the Graduate School of Business\nand Public Policy at The Naval Postgraduate School, is\n\ninterested in strategic planning and management, policy\nentrepreneurship and innovation, and public management. Roberts\nis a former assistant professor of Organization Behavior at the\nUniversity of Minnesota and has been a visiting professor of\nOrganization Behavior at the Graduate School of Business at\nStanford University and Santa Clara University. Her research\nspans a wide range of topics, including leadership,\norganizational change, public management, strategic planning and\nmanagement, and policy entrepreneurship and innovation.\n\nJay Rothman, President of the ARIA Group, Inc., does conflict\nresolution training and consulting and evaluation. Appointed as\nSpecial Master for the Cincinnati Collaborative in Spring 2001,\nRothman served as the conductor of a large scale collaborative\nmediation process, sponsored by a US Federal Court judge, to\naddress a deteriorating state of police-community relations.\nRothman is a former Assistant Professor at Haverford and Bryn\nMawr Colleges, where he was the Coordinator of the Peace and\nConflict Studies Program. He has also been a Visiting Professor\nat The Hebrew University of Jerusalem, where he was also\nDirector of the Jerusalem Peace Initiative at the Leonard Davis\nInstitute. He is the author of three books, including Resolving\nIdentity-Based Conflict: in Nations, Organizations and\nCommunities (Jossey-Bass, 1997). He has published extensively on\nIdentity-Based Conflict, Conflict Resolution, and Evaluation. He\nhas consulted, led workshops, and conducted interventions in\nmore than a dozen countries including Cyprus, Israel, Northern\nIreland and Sri Lanka.\n\nMarianella Sclavi, Professor of Sociology at Politecnico di\nMilano, is particularly interested in the way people\ncommunicate, particularly across cultures. She investigates the\nmodes of communication employed in tense, complex situations,\nand works to bring together communities with high potential or\nrecord of conflict. Sclavi is widely published on these topics.\n\nSusan Sherry, Founder and Executive Director of the Center for\nCollaborative Policy at California State University, Sacramento,\npioneered the use of multi-party stakeholder efforts in and\naround the State Capitol region of California to address highly\n\ncomplex and controversial public policy issues. Sherry has\nserved as a public policy mediator and facilitator for the\nCalifornia State Legislature, state agencies as well as local\nand regional government, working on such topics as water supply,\neconomic development, women's health, environmental protection,\npublic finance, governance, growth management, transportation,\nair quality and land use. She successfully mediated the\nnationally recognized Sacramento Area Water Forum Agreement, a\nsix-year effort to develop a safe, reliable and environmentally\nsound water supply for a three county metropolitan area through\nthe year 2030. Sherry has served as Senior Policy Consultant to\nthe Local Government Commission. She has authored a number of\nbooks and journal articles on local governmental policy issues.\n\nLawrence Susskind, Ford Professor of Urban and Environmental\nPlanning at MIT and Founder of Consensus Building Institute, has\nbeen an MIT faculty member for 32 years and currently heads the\nEnvironmental Policy Group. At Harvard Law School, where he\nhelped to found the Program on Negotiation, he teaches the\nAdvanced Negotiation Workshop and heads the Public Dispute\nResolution Program. Through the Consensus Building Institute,\nSusskind has pioneered the development of environmental dispute\nresolution techniques and is currently involved in consensus\nbuilding efforts in Israel, Canada, Japan, Brazil, Mexico, and\nHolland as well as collaborative efforts with the United States\nGeological Survey and EPA's Office of Environmental Justice.\nSusskind is the author of sixteen books including the prize-\nwinning Dealing with An Angry Public (Free Press, 1995) and The\nConsensus Building Handbook (1999).\n\nDaniel Yankelovich, Founder and Chairman of View Point Learning,\nestablished the public opinion research firm of Yankelovich,\nSkelly and White, and later DYG, Inc. He also founded The New\nYork Times /Yankelovich Poll, which subsequently merged with the\nCBS Poll. He is a director of Loral Space and Communications,\nInc. and director emeritus of CBS, Inc., Meredith Corporation,\nArkla, Reliance, and US West. Yankelovich was Research Professor\nof Psychology at New York University and Professor of Psychology\non the Graduate Faculty at the New School for Social Research.\nHe has also worked closely with Brown University, where he is a\nTrustee Emeritus. The author of nine books, including Coming to\nPublic Judgment: Making Democracy Work in a Complex World\n(Syracuse University Press, 1991) and The Magic of Dialogue\n(Simon and Schuster, 1999) and numerous essays. In 1995 he was\nawarded the prestigious Helen Dinerman Award by the World\nAssociation of Public Opinion Research (WAPOR)."
    },
    {
      "category": "Resource",
      "title": "summary.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-969-workshop-on-deliberative-democracy-and-dispute-resolution-summer-2005/c5975c607c0c960fb73adc3c2a16f8d6_summary.pdf",
      "content": "Synopsis of the Dispute Resolution/Deliberative Democracy Seminar\nMIT, Cambridge MA June 2005\n\nSYNTHESIS\nThis is based on comments from J.Forester and J.Innes and their summaries of comments\nfrom other participants.\n\nI. Need for Change\nJ.Forester noted the need to move high-quality deliberation from the periphery to the core\nof political decision-making. There is a lack of collective attention to creating new\ngovernance mechanisms that remain authentic. We also have to be more concerned about\nembedding high-quality deliberation in the institutional structure of decision-making.\n\nII. Continuous Process\nJ.Innes remarked that a well-run consensus-building process often continues in various\nforms long beyond the time a \"final\" decision is made. Participants come to realize that\nimplementation involves ongoing negotiations and that multiple voices and a forum are\nneeded to address emergent problems and new information.\n\nIII. Location\nJ.Innes highlighted J.Dryzek's explanation of the different locations in which deliberative\ndemocracy might be situated. J. Forester noted that there is no single site, actor, or\nlocation where decisions can be made.\n\nIV. Unjust Process\nJ.Forester suggested that the question about inevitable or necessary injustice should be\nunderstood as deeply ambiguous, or as a matter of inevitable incompleteness. Although\nan effective dispute resolution process may not promise complete justice, it does create\nsufficient justification for public action. Practitioners and theorists need to be humble\nabout the limits of dispute resolution processes.\n\nV. Bias in Mediation\nJ. Forester noted additional dispute resolution practitioners' biases: that interdependence\nproduces opportunities to negotiate and a space of possibilities to explore; that we should\nconsider inappropriate the inequalities that are typically present in complex public policy\ndisputes (but do not yet involve sufficient legal or constitutional inequities or violations\nof rights); that conversation matters even when parties distrust, dislike, disbelieve and are\ndisinclined to talk to each other; that disputants bring partial information and judgments\n(\"raw opinion\" as D. Yankelovich put it) and can and will learn; and, that disputants can\ncreate workable options and proposals under supportive conversational conditions that\nprotect them from escalating arguments about blame.\n\nJ.Innes asked for more discussion about what the biases in stakeholder processes are or\nmight be. It is a serious concern that needs to be addressed directly. Perhaps consensus\nbuilding is biased toward people who are better deliberators, or favors interests that are\nby their nature better able to organize. Perhaps it has a bias towards representativeness,\ntowards empowering the less empowered or challenging the status quo and existing\nauthority. Perhaps it is biased against the people who are not there.\n\nVI. Resistance\nPublic\nIn reference to D.Yankelovich's comment about public resistance to dispute resolution\nprocesses, practitioners around the country find themselves disabusing people all the time\nabout various myths regarding what dispute resolution and consensus building actually\ninvolve. People need to know that it is not about replacing regulatory agencies, it is about\nsupplementing them; it is not about compromising on principles, it is about reaching\nmutually satisfying (rather than lose-lose) outcomes; it is not about giving up on expertise\nand letting anyone's technical information dominate, it is about taking advantage of the\nbest available information and avoiding my expert versus your expert. We need to work\nto unravel the enormous resistance to these processes.\n\nDecision-makers\nJ.Forester noted that P.Adler's comment that decision-makers have problems getting\nwhat they need to make decisions actually reflects a huge challenge for all of us to\ndevelop a better understanding of the culture, function, and structure of administrative\nsystems in which dispute resolution processes can be helpful and might be welcomed by\ndecision-makers.\n\nVII. Time Scale\nJ.Forester noted that concerns about time linger. It's terribly important to find out if, in\nopposition to common stereotypes, dispute resolution processes might in fact be more\nefficient, time-wise, than regulatory processes held hostage to \"blue ribbon committees\"\nand the courts.\n\nVIII. Learning and Opinion to Judgment\nJ.Forester reiterated D.Yankelovich's desire for a better understanding of the ways in\nwhich \"raw opinion\" evolves into \"considered public judgment.\" This evolution, typical\nof dispute resolution processes, underscores the importance of respecting those who are\npounding their fists on the table and asserting their demands. The processes we are\ntalking about should not involve making compromises or betraying one's principles.\n\nJ.Forester would also have liked to see more attention paid to how we think that parties\nlearn, to strategies that would promote that learning, and to what that implies for\ninstitutional design. Specifically, we need further discussion about how dispute resolution\nprocesses encourage learning about others' and one's own interests, \"value,\" what is at\nstake, and the \"facts that matter\" in particular cases that haven't yet been recognized by\nany party. Other participants noted a lack of discussion about the institutional basis for\nreflective learning and continuity between decisions, as well as learning about values and\ninterests.\n\nIX. Linking the Two Fields\nJ.Innes drew attention to the late exchange initiated by S.Sherry asking for take-home\nlessons from the deliberative democracy theorists. F.Fisher had suggested that the benefit\nof the discussion would actually accrue more to the theorists than the practitioners.\nHowever, theorists can help practitioners who want to think about and talk about what\nthey are doing.\n\nJ.Innes reflected that the two fields may be engaged in very different kinds of enterprises.\nThe theorists are looking to frame, discuss and refine ideas about deliberation and\ndemocracy and build a conceptual framework for a field. Some do it using logic and\ndisciplined argument and some do it through a type of grounded theorizing based on\nactual cases. They are working on developing their own discipline and judging by our\ndifficulties in getting some well-known theorists to come, somewhat uninterested in\ntalking with others or building cross-disciplinary links. It should be noted that the\ntheorists who did attend were mostly people who do empirical research.\n\nThe practitioners are trying to produce societally beneficial outcomes through dialogue.\nThey are interested in how best to do this and are caught up in a very real world of\npolitics, conflict and specific problems they work to solve. Although they would love\nhelp from the world of political theory, they do not really relate to the enterprise that the\ntheorists are engaged in. They think that theory is more easily translatable to action than\nit typically is, particularly theory that comes through logical argumentation rather than\ngrounded theorizing. Their time horizon is much shorter than the theorists', since the\ntasks they work on are pressing and immediate. Yet, it seems that they hold similar\nvalues and goals regarding fair, informed and just decision-making. They differ perhaps\nin being more focused on decision-making, but their concerns intersect with the\ndeliberative democracy group in that they know that stakeholder-based dialogues are not\nnecessarily representative of the unorganized citizenry. They know that whatever is\ndecided by these largely elite and skilled stakeholders may meet most interests, but still\nhas to face a less-informed and less-interested public when it comes up for formal\n\ngovernmental approval. They want to be able to link stakeholder decision-making to the\npublic-at-large, but they lack the methods and skills to do so.\n\nJ.Forester noted that C. Menkel-Meadow's comment that many of us \"are trained to\nargue,\" is fundamental. We have cultural models, institutions, training, and familiarity\nwith argument and debate, with images of neutral moderating, with argumentative styles\nof attack and counterattack, even with ground rules, and we are all too familiar with the\nways that vigorous argument can become ad-hominem and personal. This matters all the\nmore when we contrast that to the public ignorance - lack of models, institutions,\ntraining, and familiarity - with the basic creative moves of joint inquiry, mediated\nnegotiation, and consensus building.\n\nX. What was Missing from the Workshop Discussion\nJ.Innes noted that there was little discussion of capacity--the capacity of a community to\ngovern itself and to engage in dialogue or dispute-resolution. If dispute resolution and\npublic dialogue processes both build capacity, how do we look at the issues differently? It\nmay be a gradual and iterative process to build the type of citizenry we need.\n\nJ.Forester highlighted the relatively large amount of time devoted to discussion of\nprocess design and representation, and the small amount of time we spent discussing\n\"third party\" roles and actual practice. This and a similar lack of attention to mediator\nbehavior in the theoretical literature reveals a structural and procedural--rather than a\npragmatic--bias in the literature. Perhaps it is indicative of an implicit search for a\nsystem that will be abstractly sufficient and legitimate instead of a search for an informed\nsense of practical judgment that reflects and might inform what practitioners do.\n\nAdditional issues that participants identified as missing from the discussion were: the\nprecise design of deliberative institutions, cases where the population of potential\nstakeholders is unbounded (e.g. transnational, transgenerational), strategies for addressing\nresource constraints at local, regional, national, and global levels, the fact that power in\npolitical contexts is dynamic not static, and what our role might be as change agents."
    },
    {
      "category": "Resource",
      "title": "session2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-969-workshop-on-deliberative-democracy-and-dispute-resolution-summer-2005/092999aa34446ec261da60172af656b6_session2.pdf",
      "content": "Scenario 1: Municipal Decision-Making\nFacilitator: Judith Innes\nPanelists: Josh Cohen, Archon Fung, David Laws, Carolyn Lukensmeyer, Jane\nMansbridge, Nancy Roberts, Jay Rothman\n\nScenario: A local government decides that it wants to \"consult\" citizens more directly\nbefore a critical long-term development decision is made (regarding the investment of a\nsubstantial amount of public money). The dispute centers on the appropriateness of filling\nmapped wetlands so that a new highway spur connecting the city to the nearby interstate\ncan be built. As usual the battle lines have been drawn between environmentalists who\noppose filling the wetlands and development interests who say that the roadway is the\nkey to revitalizing the declining city economy. Elected officials are deciding who to\ninclude in the consultation and how to include them. One faction wants the mayor to\npick a blue ribbon advisory committee to formulate suggested city policies and priorities\ngoverning wetland protection (above and beyond federal and state laws). Another wants\nto run a set of public hearings once the experts selected by the city have prepared a\ndetailed plan for the roadway. A third proposes a non-binding referendum. A fourth\nwants a consensus building process that would involve all relevant stakeholder groups\n(and let them nominate their own representatives). This consensus building process\nwould involve a fairly large group of stakeholders in generating detailed plans for the site\nas well as local wetland protection polices.\n\nParticipants began by identifying current deficiencies of each field. Comments centered\non the need for change, a need for representation of the common interest, the\ntransformation by which individual opinion becomes collective judgment, institutional\nmemory and process design.\n\nI. Need For Change\nTo help conceptualize the different kinds of citizen participation, A.Fung described it as a\nthree-dimensional space. Along one axis are the participants: elected representatives,\nprofessional stakeholders, randomly or self-selected citizens. Along another axis is the\nprocess through which these participants interact: listening, deliberating, or bargaining.\nAlong a third axis is the participants' level of decision-making power: none, some, or\ntotal. Each form of assembly has deficiencies, regarding the distribution of power.\n\nJ.Mansbridge cautioned that although the representative process should be critically\nanalyzed, its merits should not be overlooked. If representatives have the trust of their\nrespective groups, they may be able to forge a satisfactory compromise. However, since\n\nwe are interested in reasonable and fair solutions, deliberation ought to illuminate\ncommon interests and conflicts among interests. Even when representation is not an issue,\nP.Adler warned, mediators often feel unable to raise support for crafting a resolution.\nThis could be improved by thinking about consent, not just consensus, and trying to reach\na centrist political position that can withstand centrifugal force. To illustrate this point,\nM.Elliott noted an example from the news. Fourteen centrist senators had just averted a\nfilibuster of presidential judicial nominations by forging an agreement behind closed\ndoors. Media coverage of this event has focused on how conservatives disapproved of the\ncompromise centrist position.\n\nC.Lukensmeyer was the first of many to note that representative democracy needs to be\nsupplemented with more analysis of power relations and stronger links to decision-\nmaking. One way to help participants commit to decision-making and implementation is\nthe creation of democratic spaces within which the polity and authorities can invest time\nand resources, and take a \"leap of faith\" -- agree to implement whatever final decisions\nare produced within that democratic space. The call for such a space would be echoed\nduring later sessions.\n\nC.Menkel-Meadow asked the group to consider how we think about representativeness,\nspecifically, demographics. The word \"demographics\" comes from the word \"demos,\"\nmeaning \"people.\" She cautioned against making assumptions about people based on\ntheir demographic group, because it can lead to a formulaic approach to creating\n\"representativeness\": \"getting X people from column A and Y from column B to the\ndiscussion table in order to ensure 'representativeness,'\" such as in jury selection.\nThough politicians and the media exacerbate identity politics by filtering out points of\nview through use of demographics, we need to remember that we all belong to multiple\nidentity groups.\n\nEmphasizing another dimension of the consensus-building/deliberation processes,\nD.Kahane urged that before deciding on methodology, groups need to enumerate\nideology by prioritizing normative ideals such as efficiency and justice.\n\nII. Voice for the Common Interest\nRelated to the recognition of a need for change, participants discussed a need for\nrepresentation of the common interest. C.Lukensmeyer began this conversation by asking\nwhich voices can speak for the public good. J.Innes asked who would then be a\nrepresentative of the common interest? How would we know that someone actually\nrepresents the common interests (and public good), and how would that be different from\na consensus building process? J.Mansbridge answered that not just one person but a\ngroup of people would work to develop something that represented the public good. The\ngroup's conversation would follow, as closely as possible, the ideal elected representative\nprocess. C.Lukensmeyer added to this idea the qualification that participants would not\nhave pre-formed positions about the issue. J.Innes wanted to know how such people\nwould be selected, and N.Roberts answered by citing successful cases in which\ncommunity members are invited to participate in whatever capacity they choose. One\nbenefit of this method is that it encourages some people to participate who might\notherwise abstain or lack representation. To help publicize the invitation the press should\nalso be involved early in the process. Reminding the group that representation should not\nalways be maximized, A.Fung cited cases in which there might be reasons to exclude the\nmost interested stakeholders, such as bipartisan redistricting in the United States. In such\ncases, a random group of citizens might be less biased, and therefore more capable of\ndeciding what is best.\n\nHowever, regarding the process of random sampling and deliberative processes in general,\nS.Podziba warned against assuming that altruism, and not private interests, will\ncharacterize citizens' behavior. Citing Hobbes, she said there are always private interests.\nIf we want to elevate ourselves above the \"state of nature\" by crafting and adhering to\ncreative and community-building solutions, we need to test assumptions of altruism.\nD.Kahane noted that although people may start out with different and divisive private\ninterests, the right process can encourage a move towards consensus. \"How much faith\ndo we have that that can happen?\" he asked, concerned that some people are inevitably\nexcluded but that democratic agonism yields positive results.\n\nIII. Transformation: Individual Opinions to Collective Judgment\nD. Kahane's comments led participants to raise specific comments about the\ntransformation he described. D.Yankovitch commented that the dialogue that facilitates\nthis transformation is just as important as who is chosen to participate. The shift from\nindividual opinion to collective judgment requires that participants listen provisionally to\neach other. He lamented that our society is skewed towards advocating individual\ninterests. The general public's interest would be better balanced if the individual\ntransformation he described could take place on a wider scale.\n\nRegarding this transformation from \"raw\" to \"informed\" opinion, J.Cohen distinguished\nbetween individuals' points of view (e.g., religious, sectarian), which they do represent,\nand their interests. People have points of view that do not necessarily represent their\ninterests.\n\nTo avoid confusing the two, L.Susskind suggested that some kind of nomenclature other\nthan \"common interest\" be used to represent other people's needs and desires when\ndiscussing this transformation from raw to informed opinion. He went on to say that\nconsensus can only be reached if participants consider both their own interests and the\ninterests of others. Therefore, introducing to the dialogue the goal of consensus, and\nperhaps a decision rule that requires participants to reach an agreement, can help people\ntake account of others. By doing so, it can shift the purpose of dialogue from developing\nunderstanding of opposing perspectives to consensus-building.\n\nC.Lukensmeyer was concerned about the media's role in the transition from individual or\nstakeholder identity to a collective identity. Can the media be part of public education,\nand thereby strengthen the democratic process, or are they only looking for errors and\ncontroversy?\n\nIV. Institutional Memory\nM.Elliott cited the need for more reflective practice and institutional memory, saying that\nwe need the capacity to take what has happened in one situation and carry it over to\nanother.\n\nV. Process Design\nParticipants also raised a number of ideas about how to design processes to bring about\nchange. N.Roberts emphasized the need for creative, open-ended, future-oriented\nsolutions that invite exploration, emphasize positive results, and supplement\nrepresentative democracy. J.Rothman suggested that the focus should first be on passion\nand vision, and then on specific processes to be used -- what are the stakeholders'\npassions and what do they envision? He continued, after these things have been\naccounted for and a process has been implemented, there must be an opportunity to\nreframe problems and redesign the resolution process. Otherwise, people will not see an\nopportunity to become involved and they will lose hope for the future. Participants' goals\nand priorities should inform this redesign process. In this way we can incorporate input\nfrom the bottom up while policy-makers work to develop guidelines to help guide the\ndiscourse between the environment and development groups. Given the need for\nfeedback and bottom-up input, Rothman also recognized the need for concrete action\nwithin time constraints.\n\nJ.Cohen cautioned that some people do not want to think in terms of vision. Deliberative\ndemocracy is about individuals exercising their power. Therefore, we must be careful\nabout identifying deliberative democracy with a particular way of doing business and\n\"vision.\"\n\nC.Lukensmeyer recognized the need to mix and integrate methods and apply them to\nappropriate processes.\n\nL.Susskind shifted the focus from stakeholders to their representatives, reminding the\ngroup that elected representatives, not just stakeholders, need to be able to implement any\n\ndecisions that are made. \"We do not want to replace representative democracy with ad-\nhocracy,\" he said. In order for elected officials to be interested in the decision-making\nprocess, there need to be certain minimum conditions met. First, representatives of\nstakeholder interests, including the common interest, need to be self-selected. \"Blue\nribbon\" experts selected by the convening authority will lack credibility. Second,\nsomeone must be accountable for enforcing the agreed upon design process. A mediator\nis a good candidate for this role, but whoever it is must be perceived as legitimate by the\npublic and elected officials. Third, there must be an opportunity for joint inquiry and\nproblem-solving, such as joint fact-finding. Fourth, there must be a written agreement to\nwhich people can be held accountable. Participants should sign it after the final draft is\ncirculated among those being represented.\n\nD.Laws added that people who participate in such efforts become process designers. In\nhis view, it is critical that people have the ability to reshape the agenda, the ground rules\nand the roster of participants. D.Kahane noted that some processes do not allow\nparticipants to reframe the process. He asked if that was a question of efficiency or if in\nsome cases there were reasons why we might not want participants to be able to reframe\nthe process.\n\nC.Menkel-Meadow pointed out that deliberation and reasoned argument use particular\npolitical frames. Given this process pluralism, L.Susskind's principles are important in\nmany, but not all processes. There is no panacea, no process that fits all situations. \"It\ndepends.\"\n\nReflecting on the idea of feedback, M.Hajer identified the risk of assuming that one\ndecision-making moment exists. Instead, there is a chain of decisions, and many new and\ndifferent considerations at each stage in any process."
    },
    {
      "category": "Resource",
      "title": "session3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-969-workshop-on-deliberative-democracy-and-dispute-resolution-summer-2005/edb4d48699aea2f1f5e100124829128f_session3.pdf",
      "content": "Scenario 2: Metropolitan Policy-Making\nFacilitator: David Booher\nPanelists: John Dryzek, Mike Elliott, Frank Fischer, Bill Isaacs, Susan Sherry\n\nScenario: A metropolitan agency wants to engage a wide range of stakeholders in a\npolicy dialogue regarding regional \"fair share\" housing policy. State and metro agencies\nhave agreed to hire a professional \"mediator\" to help manage a policy dialogue on a\nmetropolitan scale. The question is, what should the mediator's mandate include,\nespecially with regard to the involvement of advocates of low income residents and\nresidents of color who may or may not have the knowledge and skills needed to\nparticipate on an equal footing with real estate and municipal interests. The 15 suburban\ntowns on the periphery of the region are trying to fend off litigation (and possibly state\nlegislation) charging that their exclusive land use policies are excluding poor people from\nthe jobs and housing available outside the central city.\n\nParticipants' comments focused on the need for change, process design, the role of the\nmediator, individual learning, and time-scale.\n\nI. Need For Change\nS.Sherry focused the conversation on how elected officials can address conflict resolution\nand expand it more into something like deliberative democracy. She asked how\npractitioners can take into account those who are underserved or disenfranchised.\nSpecifically, she asked how the disenfranchised could be included when there is either no\norganized interest to represent them or their representative is overstretched. C.Menkel-\nMeadow cautioned against thinking of ignored groups as homogenous. There are vastly\ndifferent concerns at play.\n\nB. Isaacs asked, \"Which problem are we trying to solve?\" He reflected that the answer\ndepends on the participants and their time constraints. He went on to say that in order to\nchange the discourse at any level, it needs to be changed at every level. He challenged\nworkshop participants to raise questions which could not be answered, to take risks and\nmake themselves vulnerable. He suggested that the group think in terms of microcosms in\nwhich different dialogues can take place, and in terms of what we would do if we had ten\nyears to develop a decision-making process and get movement. He commented that\nalthough we often get movement, we don't know why. Therefore, there is a need to raise\nthe level of inquiry by voicing our own uncertainties.\n\nM. Elliott asked what it means to reconstitute communities, specifically in cases where\nwe have not had community at the regional level and we are now creating it. Such\nambiguity about the ends, D. Booher countered, actually reflects the real world. Part of\nthe deliberative process is to deliberate about what the ends are. Subsequently, we can\ndeliberate about the means. C.Lukensmeyer added that we need new governance\nmechanisms. Polling data show that the public supports a move toward regional\ngovernment, but it is the existing government that is not interested in ceding power. This\nrepresents an institutional failure, said J. Innes. We don't view deliberative processes as\nbeing capable of changing institutions. She reminded the participants that we do not have\nto accept the boundaries as they are at the beginning. We can rethink goals. M.Elliott\nnoted that people's identities and how they frame a problem may be more important to\nsolving a problem like this (i.e. in the scenario) than the facts. In order to make progress,\nhe said, we need to catalyze a level of commitment, learning and engagement through a\nlong-term, sequenced process. This will require an interactive process of civic outreach\ninvolving the media, not an alternative dispute resolution process. We need to envision a\ndifferent kind of future around first principles. Then, we can move forward to develop\nconcrete actions and strategies that generate commitments from particular communities.\n\nM.Sclavi returned to S.Sherry's question about how to include disenfranchised people.\nShe suggested that we need to re-create a group spirit. Otherwise, civil and public\nservants will be tempted to just go back to their offices, and public citizens to return to\ntheir homes, and the community spirit will not be preserved. Policy-makers feel more\ncomfortable in the living room of the disenfranchised than the disenfranchised do in\npolicy-maker's board rooms. Civil servants must learn to meet in the neighborhoods\nwhere disenfranchised people live, drink coffee with them, and in general be their guests.\nThis levels the playing field and can enhance trust. At every stage, she said, you must\ncreate a collaborative mood that will last after they go home. We will only work together\nif it is enjoyable, rewarding, and leads to creative solutions.\n\nD.Booher noted that there are disincentives for deliberation. Some officials make a show\nof committing to a deliberative processes, but really just want to educate the public about\nthe decisions they have already made. In light of this, he asked, \"How do we design\ndeliberative and representative institutions? or are we kidding ourselves that deliberative\nand democratic institutions can be up to the challenges of the modern age?\"\n\nII. Process\nJ.Dryzek asked if, instead of connecting deliberative exercises to policy decisions, the\nkey question might actually be the reconstitution of social relationships. In deeply\ndivided societies, deliberation can be separate from decision-making. In these cases, the\nkey function of deliberation is the process of dialogue itself. In the most problematic\ncases, such as those divided along ethnic, religious, or national lines, connecting that\ndialogue to decision-making may obstruct both. The focus should be on learning to live\ntogether rather than on any decision-making moment..\n\nPicking up where M. Sclavi left off on the issue of location, J.Fishkin commented that we\nneed to pay attention to the type of forum used and its design. Deliberative democracy is\nnot just one thing. Reiterating the relativity of process design, he argued that everything\ndepends on which design you employ, and this decision depends on the circumstances.\n\nC.Lukensmeyer added an additional design principle to those mentioned, the principle of\nembeddedness. She said that we need to think not just microscopically, but\nmacroscopically as well. The challenge is to think about the macroscopic implications of\nour microscopic decisions.\n\nIII. Role of mediator\nF.Fisher commented that deliberation and dispute resolution cannot do much outside of\nthe current distribution of power. Mediators are politically constrained, and the bargains\nthey broker benefit some communities more than others. One way to address this is to not\nuse alternative dispute resolution at the outset. Instead, the mediator could focus on ways\nto reduce the communicative implications of power differentials, and find ways to build\n\nsocial and political capital. Drawing on participatory action research methods, the\nmediator could organize community seminars in ways that build social capital, paying\nparticular attention to disadvantaged and disenfranchised communities. Media coverage\ncould also be used as a discursive resource to lend the deliberations some weight.\n\nD.Fairman asked what mediators can do if they recognize that there is a governance\nproblem and that it is impossible for the regulatory agency to do its job. Do you do your\njob and come back with the recommendation that a new institution is needed before we\ncan address this? Or, do we suggest that we have to muddle through, knowing that it\nwon't solve the governance problem at its core?\n\nS.Sherry noted another practical dilemma. She described instances in which practitioners\nwant to do what feels right in terms of the disenfranchised and underserved, but they\nknow that this may not serve the common interest. She offered the example of curb-cuts\nin sidewalks that handicapped citizens request but which cost taxpayers an inordinate\namount of money.\n\nIV. Learning: Individual\nFollowing up on the notion of learning, J.Forester commented that learning processes do\nnot reduce simply to exchange or bargaining. Participants in a process listen to the others\nat the table. The challenge is to think about how people can learn in non-argumentative\nways, such as breaking bread together. What happens during these social exchanges that\nis not reducible to rational exchange of goods and services? We do not give a good\naccount of this, yet it can help us to reach agreement.\n\nV. Time-scale and Continuous Process\nM.Elliott asked how deliberative democracy handles complexity. Federal agencies have\nthe capacity to carry things through for 10 years. However, is it possible for unpaid\nlaypeople to do this meaningfully? He remarked that we do not have good models for\nhow to do this over 10 years. Many of the problems that we face don't have solutions.\nInstead, they create corollary problems. This creates the need for an ongoing effort,\n\nwhich we as a society are quite capable of confronting. However, the institutional base\nfor doing this is critical."
    },
    {
      "category": "Resource",
      "title": "session4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-969-workshop-on-deliberative-democracy-and-dispute-resolution-summer-2005/951de1ad287745e297e7aaee01bb8a3f_session4.pdf",
      "content": "Session 3: National-level Consensus Building\nFacilitator: John Forester\nPanelists: Peter Adler, David Fairman, Jim Fishkin, Susan Collin Marks, Susan Podziba\n\nScenario: A federal agency has decided to involve the public in a negotiated rule making\nprocess (i.e. drafting regulations pursuant to federal legislation). Many questions\nregarding the role and structure of government advisory bodies in this context are\nanswered by federal legislation (i.e. the Federal Advisory Committee Act). Some\nquestions, however, remain open. For example, what kind of fact-finding or technical\nstudies can and should the advisory group commission on its own (separate from the\nsponsoring agency)? What approach to joint fact-finding is most likely to ensure an\neffective balance between science and politics in the development of proposed\nregulations? And, is it reasonable to seek such a balance through the engagement of ad\nhoc representatives of various non-elected constituencies? Who should pay for whatever\nstudies the group decides to commission? How might peer-review of the technical work\nfit into this process? And, what if the regulations in question concern actions or polices\nthat could create serious risks to human health and safety? When fear, anger and emotion\nrun high, what can and should be expected of joint fact-finding or efforts to balance\nscience and politics?\n\nI. Process\nIn his response to the questions posed by this scenario, J.Fishkin conveyed his interest in\nincluding the public in such discussions. He said that it is important to probe the political\nwill to \"clarify tradeoffs\" and make \"causal connections.\" Furthermore, he added, the\npublic is \"disempowered\" when discussing issues about which experts already agree.\nTherefore, it is important that elites disagree so the public is empowered to think for\nthemselves. However, we need a consensus on which experts should field the public's\nquestions. We need neutral moderates. Then, of course, there's the question of who\nparticipates, and random sampling is a good way to include people who do not have pre-\nformed opinions.\n\nD.Fairman suggested that there might be mechanisms for public engagement that can\nsupplement the work of the people at the table. He suggested joint fact-finding as a\npowerful way to answer analysis-based questions, but not interest-based questions.\nJ.Layzer agreed, saying that scientists cannot answer all questions. When a collaborative\nprocess gives a group of scientists a charge, the group is constrained by what is feasible\nand legitimate. Although the result is not necessarily biologically defensible, it becomes\n\nthe template from which the collaborative process proceeds. It is not too difficult to reach\na technical consensus. The question that remains is what are the bounds of uncertainty\nabout that agreement, what were the scientists asked to agree about in the first place, and\nwhat are they going to do about that. Since science will not take us to the policy\nconclusion, P. Adler commented, our goal should be to turn uninformed argument into a\nbetter-informed search for solutions. By themselves, joint fact-finding and scientific\nadvisory groups are a \"midpoint.\" We need to establish relationships and set up a culture\nof inquiry, he said. We first jointly frame the question as a joint search. We then conduct\nan inventory of the information relevant to the topic, jointly interpret it, and then grapple\nwith all the uncertainty and limits on our knowledge. This process is not just about\nscientific knowledge. There is also legal, economic and cultural expertise. D.Kahane\nasked if there is a reason why the selection of experts tends to involve elites rather than\nbeing democratic and why such processes are usually closed. S.Podziba answered that\nthis is dependent on the context.\n\nS.Podziba went on to reflect on the huge challenge for exchanging information during\nnegotiated rulemaking. Uncertainty and power imbalances prevent the government from\ntaking action on its own and compel people to engage with one another. Everyone around\nthe table has something to learn and something to teach. Often, there is not enough time\nfor joint fact-finding because that would involve initiating new studies. Like visioning, it\nalso runs the risk of raising the level of abstraction to too high a level. How, then, do we\nexchange information? We should use a deliberative process to synthesize and learn from\nnew information. We want to challenge ourselves and advance. We can then fill in what\nwe do know and what we can create. We have to meet the group's needs in terms of how\nthey get them the information they require and how they process that information so they\ncan make informed decisions together. J.Fishkin cautioned that there are many defects\nwith public discourse, such as lack of information, misinformation, contested information,\nand strategically incomplete information. S.Podziba replied that a criterion for selecting\nparticipants in negotiated rulemaking is that they be prepared to negotiate with good faith\nin good will. With the public watching, discussions about bad arguments are not\nsustainable and usually get filtered out.\n\nII. Criteria for Deliberative Democracy\nL.Susskind commented that the USA and other countries have institutionalized a\nmechanisms for scientific inquiry, like environmental impact assessment. An EIA\nrequires transparency of decisions that might otherwise be made behind closed doors. It\nrequires the gathering of information, it engages experts and non-experts in dialogue, and\nit requires accountability and reason giving by decision makers. It requires that scientists\nconsider alternatives to what has been proposed, that proposals be clear to laypeople, and\nthat a written record of the discussion be published for public scrutiny. He asked whether\nthis process \"meets all the requirements for enhancing deliberative democracy.\"\n\nJ.Forester responded that EIA appears too static and does not provide sufficient\nopportunity to question the project being proposed, and is therefore not deliberative.\nJ.Innes concurred, saying that although it does invite some stakeholder feedback and\ngenerate some public knowledge, it is too structured and discourages participation.\n\nM.Elliott added that while EIA was a procedural intervention that added voices to the\npublic dialogue, it is not deliberative. C.Lukensmeyer noted that EIA does create a\nstructural framework. However, within that structure there is a need to figure out how to\nguarantee equity of voice and access while remaining \"authentic.\" D.Booher clarified that\ninstitutions such as EIA were not designed with deliberation in mind-- they were\ndesigned to protect people from the government. If we assume that voters are engaged,\nwe need an alternative to EIA because research indicates that these institutions are\nresistant to deliberation.\n\nF.Fisher cautioned that deliberative democracy, and political theory in general, cannot\njustify a particular technique. Deliberative democracy is a utopian ideal, a counterfactual\nthat serves as a basis for continual critique of society. There is no fixed body of principles\nof deliberative theory. In this respect, Fisher opined, deliberative democracy may be\nmore interested in asking questions and testing assumptions, whereas dispute resolution\nmay be more interested in answering questions. J.Dryzek added that deliberative\ndemocracy is more like a contextually specific critique that can help with institutional\ndesign.\n\nJ. Dryzek went on to talk about preferences. He said that reflection on the part of\ndeliberators means changing preferences. Stakeholders have less capacity to change\npreferences than lay citizens, but there are good reasons to bring both groups to the table\nand help them examine their preferences together. He asked how we can do this, how to\ncombine lay person deliberations with stakeholder deliberations. J.Fishkin noted that this\nkind of thinking--recognizing that deliberative democracy is utopian-- is a good way to\nthink about democratic reform. We can do social science experiments, he said, to see\nwhat people might think under different sets of circumstances.\n\nIII. Bias in Mediation\nM.Hajer pointed out that the processes under discussion are essentially tools for\ncommunication, and that tools are always specialized--they have \"biases.\" (For example,\na screwdriver is specialized to twist screws. This is its bias.) Since no discursive form is\n\nwithout bias, mediation must have its biases. If we want to rethink deliberative\ndemocracy, we should try to identify the bias of mediation. D.Fairman responded that\nmediation is biased in favor of agreement and consensus. J.Forester added that\norganization is \"the mobilization of bias\"--\"it organizes some things in and some things\nout.\" He noted another bias of public dispute mediation in favor of public knowledge."
    }
  ]
}