{
  "course_name": "World Literatures: Travel Writing",
  "course_description": "This semester, we will read writing about travel and place from Columbus’s Diario through the present. Travel writing has some special features that will shape both the content and the work for this subject: reflecting the point of view, narrative choices, and style of individuals, it also responds to the pressures of a real world only marginally under their control. Whether the traveler is a curious tourist, the leader of a national expedition, or a starving, half-naked survivor, the encounter with place shapes what travel writing can be. Accordingly, we will pay attention not only to narrative texts but to maps, objects, archives, and facts of various kinds.\nOur materials are organized around three regions: North America, Africa and the Atlantic world, the Arctic and Antarctic. The historical scope of these readings will allow us to know something not only about the experiences and writing strategies of individual travelers, but about the progressive integration of these regions into global economic, political, and knowledge systems. Whether we are looking at the production of an Inuit film for global audiences, or the mapping of a route across the North American continent by water, these materials do more than simply record or narrate experiences and territories: they also participate in shaping the world and what it means to us.\nAuthors will include Olaudah Equiano, Caryl Philips, Claude Lévi-Strauss, Joseph Conrad, Jamaica Kincaid, William Least Heat Moon, Louise Erdrich, Álvar Núñez Cabeza de Vaca.\nExpeditions will include those of Lewis and Clark (North America), Henry Morton Stanley (Africa), Ernest Shackleton and Robert F. Scott (Antarctica).",
  "topics": [
    "Humanities",
    "Literature",
    "International Literature",
    "Nonfiction Prose",
    "Humanities",
    "Literature",
    "International Literature",
    "Nonfiction Prose"
  ],
  "syllabus_content": "Course Description\n\nThis semester, we will read writing about travel and place from Columbus's\nDiario\nthrough the present. Travel writing has some special features that will shape both the content and the work for this subject: reflecting the point of view, narrative choices, and style of individuals, it also responds to the pressures of a real world only marginally under their control. Whether the traveler is a curious tourist, the leader of a national expedition, or a starving, half-naked survivor, the encounter with place shapes what travel writing can be. Accordingly, we will pay attention not only to narrative texts but to maps, objects, archives, and facts of various kinds.\n\nOur materials are organized around three regions: North America, Africa and the Atlantic world, the Arctic and Antarctic. The historical scope of these readings will allow us to know something not only about the experiences and writing strategies of individual travelers, but about the progressive integration of these regions into global economic, political, and knowledge systems. Whether we are looking at the production of an Inuit film for global audiences, or the mapping of a route across the North American continent by water, these materials do more than simply record or narrate experiences and territories: they also participate in shaping the world and what it means to us.\n\nAuthors will include Olaudah Equiano, Caryl Philips, Claude Levi-Strauss, Joseph Conrad, Jamaica Kincaid, William Least Heat Moon, Louise Erdrich, Alvar Nunez Cabeza de Vaca.\n\nExpeditions will include those of Lewis and Clark (North America), Henry Morton Stanley (Africa), Ernest Shackleton and Robert F. Scott (Antarctica).\n\nCourse Goals\n\nContemporary Authors\n\nCaryl Phillips, Louise Erdrich, William Least Heat-Moon.\n\nRegions\n\nNorth America, Africa and the Atlantic World, the Arctic and Antarctic.\n\nExpeditions\n\nErnest Shackleton, Robert Scott, Lewis and Clark, David Livingstone, Henry Morton Stanley, Alvar Nunez Cabeza de Vaca.\n\nCourse Requirements\n\nInformal Writing\n\nThis consists of two sections. The first section contains 500-700 words and identifies and discusses an object that 1/ relates to the events or places described in one of our texts; 2/ changes our understanding by telling us something the text doesn't. The second section is a response\neither\nto Worsley reading for Ses #23 or to Erdrich's\nBooks and Islands\nfor Ses #25.\n\nGroup Work/Presentations\n\nEach group will be in charge of leading 2 days of discussion, which means you will: prepare a presentation on the readings and design activities and discussion questions that you think appropriate to the material and to your topic. Part of your presentation should be a hand-out with a bibliography of sources.\n\nCourse Grades\n\nACTIVITIES\n\nPERCENTAGES\n\nEssays 1, 2, 3 (15% each)\n\n45%\n\nRevision\n\n15%\n\nPeer response\n\n3%\n\nQuiz\n\n2%\n\nWiki posts (5% each)\n\n10%\n\nGroup work and presentations (10% each)\n\n20%\n\nParticipation and attendance\n\n5%\n\nMIT Literature Statement on Plagiarism\n\nPlagiarism--use of another's intellectual work without acknowledgement--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available at the\nWriting and Communication Center\nand the\nMIT Web site on Plagiarism\n.\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nPart 1. Introduction\n\nTime, Space, Event:\n\nJ. Stern, \"Rough Guide to My Apartment\"\n\nC. Columbus,\nDiario\n\nTourists, Travellers, Explorers:\n\nJamaica Kincaid (from\nA Small Place\n)\n\nC. Levi-Strauss,\nTristes Tropiques\n, chapters 1-4 (selections)\n\nJ. Conrad, \"Geography and Some Explorers.\"\n\nPart II. Crossing North America\n\nW. Least Heat-Moon,\nBlue Highways\n\nW. Least Heat-Moon,\nBlue Highways\n(cont.)\n\nW. Least Heat-Moon,\nBlue Highways\n(cont.)\n\nA. N. Cabeza de Vaca,\nNaufragios\n\nEssay 1 draft due one day later\n\nA. N. Cabeza de Vaca,\nNaufragios\n(cont.)\n\nM. Lewis and W. Clark,\nJournals\n\nEssay 1 due\n\nPeer responses due\n\nM. Lewis and W. Clark,\nJournals\n(cont.)\n\nM. Lewis and W. Clark,\nJournals\n(cont.)\n\nPart III. Africa and The Atlantic World\n\nO. Equiano,\nInteresting Narrative\n\nO. Equiano,\nInteresting Narrative\n(cont.)\n\nO. Equiano and H. M. Stanley,\nHow I Found Livingstone\n\nO. Equiano and H. M. Stanley,\nHow I Found Livingstone\n(cont.)\n\nO. Equiano and H. M. Stanley,\nHow I Found Livingstone\n(cont.)\n\nC. Phillips,\nThe Atlantic Sound\n, \"Atlantic Crossing,\" \"Leaving Home\"\n\nEssay 2 due\n\nPhillips, \"Homeward Bound,\" \"Home,\" \"Exodus\"\n\nPeer responses due (optional)\n\nWorkshop: revising your essays\n\nPart IV. Polar regions\n\nAtanarjuat\n, Quiz\n\n1st Informal writing section due on or before this date\n\nApsley Cherry-Garrard,\nWorst Journey\n, Introduction\n\nRevision due 1 day later\n\nApsley Cherry-Garrard,\nWorst Journey\n(cont.)\n\nApsley Cherry-Garrard,\nWorst Journey\n(cont.)\n\nF. Worsley,\nEndurance\n\nOption 1 for 2nd informal writing section due\n\nF. Worsley,\nEndurance\n(cont.)\n\nT. S. Eliot,\nThe Wasteland\n\nOptional revision due\n\nOption 2 for 2nd informal writing section due\n\nPart V. Remaining in place\n\nL. Erdrich,\nBooks and Islands\n\nOption 3 for 2nd informal writing section due\n\nL. Erdrich,\nBooks and Islands\n(cont.)\n\nEssay 3 due 1 day later",
  "files": [
    {
      "category": "Resource",
      "title": "Doing Close Reading",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/d14006fe81f0f0b87289594f16972d2a_guide_to_clo_rea.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\n21L.007\nFall 2007 (revised Fall 2008)\nSarah Brouillette/Mary Fuller\n\nDoing Close Reading\n\nSome Guiding Thoughts\n\n- Close reading entails slowly and carefully thinking about how a piece of\nwriting is constructed in order to better understand what impact it is\ntrying to have and what meaning it wants to convey. You will be dividing\nsentences and paragraphs up into little pieces, but not at the expense of\nsome larger unity. Think of the book as a machine made up of many parts,\nor, if you like a less mechanistic vocabulary, as a gourmet meal made up of\nmany courses. For it to function most perfectly, each part of the machine -\n0r the meal - must relate to the whole of which it is, then, an integral part.\nOf course the \"machine\" you are studying may be dysfunctional, in which\ncase your argument might identify a problem you have located in the way\nit works.\n\n- Language is a communications technology. Because it is largely\ndeliberately organized and hence less \"natural\" than speech, fiction often\nreveals the artificiality of all language, clarifying how we arrange sounds\nand words into units that take on meaning within specific social and\nculture situations. It might be useful to think of fiction as deliberately\norganized units of socio-cultural meaning. Usually, this involves three\nmain parties - the reader, the narrator/speaker, and the author - who\nshare a triangulated relationship.\n\n- The reader doesn't come to this triangle with nothing. Your brain is a\npowerful and active organ. Remind yourself of this each time you sit down\nto read. I know this is often difficult, but you should try to force yourself to\nthink about each word you are reading on the page. With pencil in hand,\ndevote yourself to the task, because you will be rewarded. Remember, you\nalready HAVE knowledge - immense amounts of it - and we can produce\nmore together in the classroom if we are all prepared to do so.\n\n- One of the glories of close reading is that it allows us to get beyond the\nbasic question of \"what happens,\" to ask how the writer gives us the\nimpression that anything happens at all (or doesn't, of course), while\nconvincing us that it matters. When you interpret something you don't\ndescribe what happens. Instead you contemplate why the text is significant\nor meaningful. Sometimes it is important to point out certain things that\nhappen in a story (plot moments), but the real work of reading literature\nrequires a much larger purpose.\n\n- Think about reading as a process without one necessary end or goal. This\nmight be unlike what normally happens in the sciences. The process of\ngenerating questions about the text, and about texts in general, is valuable\nin itself, and answers aren't always forthcoming. Sometimes good close\nreading is just about finding contradictions or complications in the text.\nMany problems in life aren't easily resolved, so why should literature be\ndifferent? Many of the agreed upon \"great classics\" work precisely through\nthwarting our expectations and telling us that there are no simple answers\nto all the big questions.\n\nThe Basic Steps\n\n1. Start by finding a passage that interests you for some reason, either\nbecause you are intrigued by it, or impressed, or annoyed. Often it helps to\nidentity a passage with clear boundaries within the larger text. Can you\nfind the beginning and the end?\n\n2. What is the literal meaning of the passage? Do you understand it fully? If\nnot, why not? Are you supposed to not? Are you missing something?\nSometimes it helps to paraphrase, in your own words, what you perceive to\nbe going on.\n\n3. Read the passage more than once, indicating all the parts that you find\ninteresting. Think about how you respond to a passage or word, and then\nthink about how the author has created that effect in you. Think about\ndiction, perspective, tone, punctuation - anything, really. I encourage you\nto write in your text, and to make an accompanying list of things as you\nread, recording your questions, thoughts / feelings, but also your\nunderstanding of the literary devices that are producing responses in you.\nWhat do the formal elements of the passage - for example, the diction\n(word choice), or the tone - tell you about the writer's attitude toward the\nsubject, and toward you? (MF: we've added a few other things to look at:\nwhat is the position of the author in the passage, as character observed by\nothers, as observing eye, or somewhere in between? How much does he\nclaim to know or to understand? How is he located with respect to time?\nYou may remember other kinds of questions from our discussions in\nclass).\n\n4. Is there another meaning, beneath the obvious literal surface, that you can\nidentify at this point?\n\n5. Do more than note these things, though. As you read through the entire\nwork you will want to connect your initial thoughts to the longer process of\npiecing together the overall meaning of a text. The details you note initially\nwill be added to some aggregate list in your mind, until you gradually\ndevelop a full picture of the narrative and of the relationship between its\nrecurring literary techniques and its meaning. Ultimately our goal is to\n\ndiscover the significance of a work of literature. Close attention to detail is\nonly the beginning.\n\n6. What overall concerns of the work are evident in this passage? How does\nthis passage relate to the whole? Does it add to it, or complicate it, or\nundermine it, or something else? Try to compare the passage to other\nones. Is it like or unlike the rest of the narrative?\n\n7. What conclusions can you come to about the larger work based on your\nanalysis? Answering this question may involve revising your initial\nthoughts about the passage, rethinking what originally drew you to it.\n\nWriting It Down\n\n1. Try out your ideas about the passage: in class, in tutorial, or in other\ndiscussions.\n\n2. (MF: this suggestion may be less helpful for our materials). Consult\ncritical sources if you are curious to see how your own results jive with\nthose of others. You can search the most comprehensive bibliography of\nessays and books of literary interpretation, which is the Modern\nLanguages Association bibliography, through the MIT libraries website:\nhttp://collections.chadwyck.com.libproxy.mit.edu/home/home_mla.jsp.\nYou may also find Google Scholar useful.\n\n3. Find a compelling way to convey your results in prose. Remember that\nyour own writing is a narrative, and that it is designed to have a certain\nimpact for your reader. Written notes you make about the process of close\nreading will help you immensely when you write your papers."
    },
    {
      "category": "Resource",
      "title": "Final Essay",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/c449fa460db299f571bfed6af98f3150_final_essay.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nFinal essay\nThis essay, like the first two, should be 5-7 pages. It should have an interesting title. Most of the topics\npresume some degree of comparison, but the level of detail and the number of texts explicitly considered is\nup to you. The goals are twofold: first, to look back over what you've read and thought this fall, and put\nsome of that thinking together into an interesting shape (interesting to you, that is); second, to show me\nwhat you know. One good way to do this, and also to make your points more concrete and prose more\nvivid, is to quote frequently but concisely from the texts you're discussing; when you do so, remember to\npay attention to context (both reminding the reader where in the narrative you're citing from, and\nconsidering the implications for your argument of what surrounds the text you quote). I'm far less\nimpressed with vague, hand-waving generalizations than with well-defined claims that correspond clearly\nwith evidence. I like to learn something from an essay, not necessarily new facts but new perspectives,\nnew questions, new connections. I don't need to be impressed by your vocabulary or held at arm's length\nby your prose; I like an essay that is simply trying to communicate to me something that has captured the\nwriter's attention. Finally, I like clear structure that is stays clear as the essay progresses (where are we in\nthe argument, what is coming next, why it's coming next).\nThe only firm requirement for this essay is to pay some attention to a text that you haven't written about yet,\nwhether from the last part of the semester or earlier.\nTOPICS\n1. Travel might be said to have two \"end points\": getting \"there\" (wherever we hope\nto arrive. or \"the inner cave\") and getting back. Either of these could be the focus\nof an essay: moments of arrival (how do we know when we get \"there,\" what do\nwe find, how does it meet our expectations, what does it enable us to do, how\ndoes it change the traveler or the conditions of the journey) or moments of return\n(how do we feel about the end of travelling, what do we bring back -- tangible or\nintangible, what have we left behind, how does home look once we have been\naway, was the journey \"worth it\").\n2. In similar terms, an essay could be focused on the initial \"call to adventure\" (to\nborrow from Jonathan and Yasemin): what initiates the journey? With what\nhopes or desires, needs, regrets, or fears, does the traveler separate him or herself\nfrom home? How does the experience of the journey match these expectations?\n3. What makes a \"good\" explorer, or a bad one? To answer this question, I would\nneed not only to list the qualities such a person has, but also to consider\nthe criteria which judgment is being made; I would have to scrutinize what I think\nexploration should accomplish, and what it should not do. I would also probably\nreflect on some of the different audiences potentially engaged in making\njudgements: scientists and other knowledge professionals? the government? the\npublic? officers? bearers and paddlers? hotel clerks? Adelie penguins? a\nhowling mob?\n4. What is a journey? How far do we need to go before we can say we are on one?\nHow much do we need to see? Must it have an objective? Must it succeed in its\ninitial aims to be a \"success\"? What happens to travelers and to their narratives\nwhen voluntary travel becomes a struggle for survival?\n5. What would be an ideal journey? where would you go? what would you bring?\nwhat would happen, both in terms of events, and in terms of your own\nexperience? why should we fund you? what would be the outcome? (Note:\neven with this topic, you must find a way to \"show me what you know.\")\n\n6. Do \"journeys\" only exist in books, or do we live out these patterns as well? Do\nwe have to dress up in pith helmets or paddle birch bark canoes to be explorers or\nto have an experience of discovery? How does the phenomenon of modern travel,\nordinary travel (on planes, trains, buses, subways, etc.), compare with the historic\nexperiences of quest, exile, exploration and so on that have been our focus for\nmost of this semester? (Caryl Phillips' description of his own travel could make a\nplace to begin).\n7. Planes, trains, automobiles, pagazis, compasses, sextants: just for something\ndifferent, think about the role played by transportation and the technology of\nlocation in the experience of travel. What difference does it make, qualitatively\nas well as practically, to the traveler's experience to be travelling by one medium\nas opposed to another? (For those who are interested, one Lewis and Clark wiki\nfocused on the technology of mapping).\n8. Other: this is a literature class, so attention to a writer's prose style and the quality\nof his language will always be welcome, whatever your topic. I haven't provided\nan explicitly historical topic (how travel has changed over time, how travel\nnarratives reflect and affect their times) because these seem, in my opinion, to\nrequire more research than is appropriate for the final essay in this particular\nsubject, and we haven't discussed how that kind of work would need to be done.\nHowever, you can certainly consider historical time as one dimension of\ncomparison for several of the topics above.\n9. Bonus: if you have come up short of the 20pp. minimum for your writing in the\nclass, or simply if you're interested, add a postcript to your essay proposing a\nbook or movie that I might add to the syllabus, and tell me why you think it would\nbe interesting. Suggestions from regions of the world other than those we've\ncovered would be especially welcome, and they need not be non-fictional\naccounts of travel."
    },
    {
      "category": "Resource",
      "title": "General Paper-Writing Guidelines",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/3c7df9b6a759f188ab40dd33e2f8b52f_ge_pa_writ_guid.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\n21L.007 World Literatures/HASS-CI Alisa K.\nBraithwaite\nFall 2007\n\nGENERAL PAPER-WRITING GUIDELINES\n\nAll papers need an argument. It is not enough to simply state a fact about the book that\nyou've read: \"Jamaica Kincaid's essay, A Small Place, sounds very angry.\" Your\nargument should be one that another person might argue against: \"The tone in Jamaica\nKincaid's essay, A Small Place, highlights the powerlessness of a nation like Antigua in\nits attempts to function as an independent nation.\" This is a stronger thesis because it is\nalready contemplating the \"how\" and \"why\" of the angry tone. It also allows the space\nfor another person to say, \"I don't think that's true at all,\" and develop his or her own\nthesis in opposition to it.\n1. Give your paper a title. Your paper should have a title that is both interesting\nand indicates the angle of your argument.\na. \"Paper #1\" or \"Satire in A Small Place\" are not strong titles.\nb. \"The Antiguan Library as a Metaphor for Cultural Decay in Jamaica\nKincaid's A Small Place\" is a clear and informative title that adequately\nprepares your reader for your essay.\n2. Avoid generalizations. Avoid sweeping statements that detract from the close\nreading you are performing. Comments about \"all readers,\" \"all novels,\" or \"the\nhuman condition\" place you on a slippery slope towards generalizations. Kincaid\nmay be writing about Antigua, but this text does not necessarily apply to the\nCaribbean as a whole, or to former colonies as a whole. Rather than thinking\nabout a text as \"representative of,\" think about what makes it unique. This will\nstrengthen your close readings.\n3. Do not summarize the plot. Since the text has already been written, there is no\nneed for you to write it again. You are creating your own narrative about your\nreading of the text, so plot summary is not necessary. Assume that your reader\nalready has some familiarity with the text. Although it is sometimes necessary to\ngive context (this happens after this or before that) that is all that your informed\nreader will need. Your analysis is what really interests your reader.\n4. Use multiple levels of analysis. Your essay should vary the level of analysis so\nthat it remains lively and engaging. Include the micro-level of close reading\n(looking at language, word-choice, etc.) and also expand to the level of the idea\n(what do these linguistic choices mean) and the larger structure (what happens to\nthe text as a result of these choices).\n5. Support your quotations. As you use evidence to support your thesis, be sure to\nset up the quotation for the reader through clearly stating the point you are making\nwith this evidence. \"Unpack\" the evidence by commenting on the specific\nfeatures of the quotation that resonate with your argument.\n6. Avoid intentional fallacy. Intentional fallacy is the attribution of intent to an\nauthor when it is not appropriate. We can't ever know what an author intended or\nthought, and authorial intent is not really the most important, or interesting, issue\n\nin a text. Instead discuss what an author's language accomplishes, or how a scene\nworks, or in what position a certain character places the reader.\n7. Strive for clarity, not impressiveness, in your writing. A dictionary is a better\nfriend than a thesaurus--you are looking for precision in your language, not\ngrandeur. Your language should be concise, efficient, lively, and clear. Avoid\nstock phrases or cliches.\n8. Be conscious of your structure. Your essay should move logically and should\nalways have smooth transitions between paragraphs. It should not be a simple list\nor enumeration of your points. Laundry-list essays are often a sign of a\ndescriptive or obvious thesis. Work to include some twists and surprises, but\nkeep to a logical structure.\n9. Know your reader and your writer! The assumption when writing an essay for\nclass is that you are writing for the professor. This is true. Another assumption is\nthat you are writing for a grade. This is also true, but neither of these assumptions\nis true in the way that many people think. In other words, don't write your essay\nfor me, or for a grade. Write an essay for a person who would be interested in the\ntopic and the text (who is a person similar to, but not exactly your professor), and\nwrite an essay that is for you! You need to be interested in your topic and in the\ntext that you choose. Your enthusiasm for your own work speaks volumes on the\nwritten page. So have fun (or as much fun as you can) with it and feel free to\nshare it with anyone (friends, family, thefacebook) who might also be interested.\n\nPortions of this handout were developed from a handout by Dr. Laura\nTheimann Scales at the American Academy of Arts and Sciences."
    },
    {
      "category": "Resource",
      "title": "Lifting Salad Plates: The Work of an 'Imagineer'",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/3c47da5cb096005857468da5ebd630a3_close_analys_sam.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\n21L007: Essay 1 draft\n\"Lifting salad plates: the work of an 'imagineer'\";\nMary Fuller\n\n\"At Shelbyville I stopped for supper and the night\" (Blue Highways 1:5, pp. 10-11).\n\nEarly in his journey, Heat-Moon stops to eat dinner at the Claudia Sanders dinner house near\nShelbyville, Kentucky. While he waits for a table, a married couple invites him to join them, and\nthey get into conversation.\nThe first thing the husband asks Heat-Moon is \"the question,\" one he is already, at this\nearly stage of the journey, \"waiting for\": \"what do you do?\" Heat-Moon's response suggests that\nhe doesn't yet have a good answer, either one that will satisfy the person asking or one that\nactually satisfies him. We don't find out what Heat-Moon actually said in response, but he\ndescribes that response in terms that suggest both that it's inadequate and that he is painfully self-\nconscious of its inadequacy (a lie, a joke, \"too long\"). Why is this question so hard to answer,\ngiven that it is exactly the kind of general, not-too-intimate inquiry that people throughout the\nbook find perfectly appropriate to ask as the first stage of conversation with a stranger?\nIt's worth noticing that Cal, the husband, phrases his question not as \"what are you\ndoing?\" -- but more generally, as \"what do you do?\" He is asking what Heat-Moon does\n(generally, characteristically, presumably as his regular work), not about Heat-Moon's journey,\nor what has brought him to Shelbyville, Kentucky. (Compare the waitress's question a few pages\nlater: \"So whata you doin' in the mountains?\"; p.27). This broader version of the question, with\nall it implies about identity and nature, seems to precipitate a minor crisis in which Heat-Moon is\nin fact unable to say what it is that he does.\nComment [MF1]: This line identifies\nthe passage by quoting from the first line,\nthen giving chapter and section number,\nfollowed by page numbers.\nComment [MF2]: This very short\nparagraph summarizes what happens in\nthis section.\n\n21L007: Essay 1 draft\nEven while Heat-Moon flounders for an answer, it becomes evident that Cal is not\ncentrally interested in what he will say (or be unable to say) in reply; he doesn't really seem to\ncare what, exactly, Heat-Moon does do for work. Instead, he responds by questioning the way\nHeat-Moon uses words to talk about what he does. What is work? What is a job? What do these\nwords really mean? The distinctions he draws between \"job\" and \"work,\" things you have to\nforce yourself to care about and things you care about for their own sake, suggests that instead of\nthinking too much about this kind of question, Heat-Moon has not thought about it enough, or\nhas not yet thought about it in the right way.\nAt this point, the wife interjects to say that \"Cal works at General Electric in Louisville.\nHe's a metallurgical engineer.\" This comment reminds us of how we might expect a\nconversation like this to go:\nwhat do you do?\nI'm an English instructor, but I'm between jobs right now. How about you?\nI'm a metallurgical engineer at GE.\nHow do you like that?... etc.\n\nCal resists this nudge aimed at putting the conversation back onto a more usual track, as a verbal\nexchange of business cards and mutual evaluation of status; he corrects his wife as well on the\nidea that what he does for GE is \"work\". His cynicism about corporate language tells us\nsomething about why he might be so interested in the real and precise meanings of words.\n\"Imagineering\" suggest that Cal's job might involve imagining something new and\ngetting it made, but in fact (he claims) \"it's a matter of making it look like we're getting\nsomething made.\" The culture of his workplace substitutes language about interesting work for\nthe reality of interesting work. More than that, Cal feels his actual work is \"pretending\"; he is\nexpected to be actively complicit in maintaining the collective, corporate illusion that something\nnew is getting made. We can only get at his idea of what real work might look like by reversing\nComment [MF3]: Here, you see the\nformat for quotations longer than,\nroughly, 10 words: single-spaced, and\nindented 1⁄2 at right and left margins.\n\n21L007: Essay 1 draft\nthe negatives with which he describes his job: real work would matter, would have a future,\nwould have continuity, and would bring together what he did with what he knew and what he\nwanted to know (11).\nAt the beginning of the scene, Cal in his \"suit of sharp creases\" and the wife in \"her\njacket lying as straight as an accountant's left margin\" appear to be two of a kind: proper, crisp,\nlinear folks. The wife voices an impression about Heat-Moon that reflects a collective\nevaluation: \"you can't be as dismal as you look... Just hunger, we decided\" (italics added). Heat-\nMoon's response to her (\"hunger's the word\") is actually the last thing we hear him say directly.\nAfter his fumbled answer to Cal's question -- an answer that is not transcribed -- the conversation\ndevelops into a dialogue between Cal and his wife, and indeed into a kind of disagreement. The\nwife's first interjection is one of several attempts she makes to persuade him towards a more\noptimistic or normative account of his work. \"It isn't that bad... you've learned lots.\" Indeed, in\nher insistence that he express a satisfaction he doesn't feel, we can see a parallel to GE's\nexpectation that he believe (or pretend to believe) in \"Imagineering.\"\nWe might suppose that Cal's wife doesn't want Cal to recognize and give voice to his\ndissatisfaction because she views that dissatisfaction as a potential threat; if he becomes able to\nrecognize how unhappy he is, perhaps he will do something about it. Evidently, the wife has a\nstake in what Cal \"does,\" however happy or unhappy it makes him -- she is proud of his title and\nhis status in a large American corporation, and we can suppose that she feels these confer an\nidentity on her as well as on him. (In fact, she is only ever named as \"the wife.\") So far, Cal is\nnot unhappy, angry, or desperate enough to match his actions to his words, but it is not clear\nwhat (if anything) he gains from the situation he insists on describing. Both his restlessness and\nhis frustrated creativity may be expressed by the tinkering he does throughout the scene to make\n\n21L007: Essay 1 draft\n\"forks, a spoon, and a knife into a lever system\" with which he lifts his and his wife's salad\nplates.\n\nThis scene invokes a number of larger topics, and here are some of them: engineering;\nwork in general, as a source of pleasure, identity, or unhappiness; prosperity and its\ncosts; marriage; restaurants and cafes; the textual presence or absence of the narrator;\nhow to evaluate a person's failure or success in life; and there may be others. I would\npick up at least one of those threads to talk about where this scene fits in the larger\ncontext of the book. One way would be by setting it next to another scene or section\nwhich makes for an illuminating contrast. Here, the connection I made immediately was\nbetween this section and section 11 in the same chapter (pp. 19-22), where the\nHammonds are another married couple talking to Heat-Moon about their work. Another\nmight be the scene with the mestizo hitchhiker, Porfirio Sanchez (4:7, pp. 145-48).\n\nComment [MF4]: The big thing I\nhave left out so far is the setting: \"Claudia\nSanders dinner house\". We don't hear\nanything at all about the actual meal they\neat. But there are connections to make\nbetween conversation and setting. The\ninvocation of Colonel Harlan Sanders and\nthe \"great buckets-in-the-sky\" invite us to\ncontrast this small, old, out of the way\nroadhouse serving regional food with the\nglobal franchising operation that Colonel\nSanders' fried chicken has become. (The\nonly figurative language in this section\noccurs when Heat-Moon is alluding to\nKFC -- which he never names directly,\nbut I think we all know what \"extra\ncrispy\" means here). More alienated\nwork? This conversation with a stranger\nseems like something that could happen\nin a little local restaurant, but would\nnever happen in KFC or Mickey D.'s.\nAnd yet apparently Cal and his wife need\nthe presence of a third person, even a\nstranger who doesn't say anything, in\norder really to talk to each other."
    },
    {
      "category": "Resource",
      "title": "Revision/Comparison Essay",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/cebb2bfb6bace44f26f67cb9835e68c1_revision1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nRevision/comparison essay\nDue: 1 day after SES #20\nLength: 7-9 pp.\nTopic: you choose, but compare one text you have written about (in the first or second\nessay) to one you have not yet written about; include in the comparison one relevant\nmedia object.\nTutorial required before submitting the essay.\n1. Identify a concept (and/or something more concrete) that connects a text you\nhave already written about, in either of the first two essays, with a second text,\none you haven't yet written about. Revise the existing essay to make it part of a\nlarger comparative essay that includes one \"media object\" from outside the text.\n2. Comparison should work both ways; ideally, setting two texts side-by-side will\nshow you and your reader something new about each one. It can bring to light\ndeep structures of ideas shared by texts and authors who may otherwise appear to\nbe miles apart. It can also clarify what is specific and unique to each text.\n3. The media object can be an image, a piece of information, a video clip, or a\nstatement by the author. You might start by looking at objects posted on the wiki,\non the website, or in the meta-media archive (note that a number of the meta-\nmedia objects are actually archives themselves; they are there for you to use in\nyour research). Ideally, you will find a way to work with something that is not\nonly verbal. Your object should have a role in the essay that is more than just\nillustration. For instance, if the portrait of Equiano was my object, I wouldn't just\nuse it to show what he looked like; I could be commenting on his choice of\nposture and dress, or I might think about how having a portrait made relates to his\nappropriation of English print media for radical purposes.\n4. It's up to you how much of the original essay to incorporate in the revision. You\nshould be able to build on what you have, to the extent that it fits the new\nframework. However, any problems with the original essay -- from typos to\nimplausible arguments -- should be fixed.\n5. Each essay is going to look a little bit different, and this is a somewhat complex\nassignment. Accordingly, part of the assignment is to meet either with me or\nwith Nora next week. Please sign up on the wiki if you haven't already done so,\nand let me know if you would prefer to meet earlier in the process, on Friday. I\nexpect to return your second essays by the end of the week, but don't wait until\nthen to start thinking about what you plan to do."
    },
    {
      "category": "Resource",
      "title": "Some Guidelines for Revising Your Essays",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/22e1c5c10c7ef04a14b8d9613d0b8ecf_revision_hand1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nSome guidelines for revising your essays\n- Substantive issues: any new ideas or questions you may have; questions,\nproblems, suggestions from my comments.\n- Transitions: if you see this mark -- T -- in your text, between paragraphs or\nsentences, I'm asking you to make clearer connections between ideas. Make an\noutline of your paper so you can see the structure of the argument; reorganize if\nnecessary; tell the reader what the connections are.\n- Fix the prose: Two general approaches are often helpful in revising prose. One\nis to read sentences out loud -- would you say this? Another is to retype your text\n-- surprisingly, this works. More specifically, in your essays you will find copy\nediting marks for two kinds of issues.\n1. Style (word choice or general wordiness). See the handout \"Paramedic\nMethod\" on MIT Server.\n2. Grammar (verb tense, idiom, articles, agreement).\n- Introductions (and titles). See below for some examples (based on texts from\nanother syllabus, I'm afraid).\n- Conclusions (and last sentences). See below.\no spend some extra time on the sentence which ends your essay; like titles,\nconcluding sentences have an impact disproportionate to their relative\nsize.\nSample introduction with title # 1 (not so good)\nShakespeare's \"The Tempest\"\nThroughout human history, human beings have responded to things in a variety of\nways. Also, their thoughts are enhanced by being in a place themself. In his book, the\nElizabethan playwright William Shakespeare states in 1613, \"oh brave new world.\" This\nshows there can be a positive evaluation. By contrast, it is also mentioned, \"you taught\nme how to curse.\" Among the characters, he becomes obvious that some things are the\nsame, and some were different.\nSample introduction with title # 2 (much better)\nWhat Is Shakespeare's Island?\nWhen it comes to describing a place, being there matters. But being there is not\nthe same for everyone -- and nowhere is this truth more clear than in The Tempest. For\nMiranda, the island is a place of wonder; for Caliban, a place of cursing and being\n\ncursed. The difference seems clear, even stark. Yet Miranda's wonder is in response to\nthe arrival of Ferdinand, who comes from outside, while Caliban speaks movingly of the\nproperties of the island as he showed them to Prospero in the past (citations go here).\nHow different are their islands, and how many islands are there in the play?\nSample introduction # 3 (another \"better\" introduction, analyzed)\n[Title]\n1. In 1578, a Protestant Frenchman\nremembers the taste of a remarkable fruit\nwhich he had eaten some 20 years before.\n2. Pineapples, writes Jean de Lery, have\n\"such a fragrance of raspberry that you can\nsmell them from far off; and as for the\ntaste, it melts in your mouth, and it is\nnaturally so sweet that we have no jams\nthat surpass them.\". Jean de Lery tasted\nthis pineapple in Brazil, during his sojourn\nthere among the Tupinamba, an indigenous\npeople known for their custom of\ncannibalism. 3. As this passage and others\nmake evident, de Lery sees the natural\nriches of Brazil as a gift from God [cite\nother passage briefly]. 4. Yet he tells us\nrepeatedly that the Tupinamba have been\n\"accursed or abandoned by God.\" 6.a How\ncan we make sense of the mismatch\nbetween Lery's sense that the 5.natural\nworld of Brazil is 5.blessed, while the\n5.human world is 5.cursed? 6.b How is he\nable to praise the fruit he eats among the\ncannibals?\n7. In this essay, I will examine ...\n\n1. In the text, this happens (\"this\" can be\neither an actual event, or the way that event\nis written about).\n2. Example or direct quotation.\n3. What should the reader notice in this\nexample?\n4. How does this phenomenon relate to\nthe rest of the text?\n5. What are the axes of comparison?\nWhat are the terms which will be used to\ncharacterize that relationship?\n6. Frame the question or problem that\narises:\na. in general, abstract terms.\nb. In specific, concrete terms.\n7. What will you try to do in the essay to\nshed light on the question you've\nidentified? (Optional, but a good habit for\nother kinds of writing).\n\nConclusions\nConclusions and introductions should be different, not interchangeable. The introduction\nasks, what's the problem? The conclusion looks back to that original question or problem\nand reviews what you have come up with in the body of the essay: does it illuminate the\noriginal question? Does it (also, or instead) answer any other questions?\n\nFor instance: my introductory question (in sample #3) was about the difference between\nhow Jean de Lery evaluates nature (pineapples) as opposed to human culture\n(cannibalism). In my conclusion, I might decide that the important difference was not\nbetween nature and human culture, but between the natural (including human customs)\nand the supernatural or theological.\nHere's what that might look like:\n\"Everything in the category of the natural can be judged by experience, aesthetically, by\nhow it tastes. But these judgments are not the final word, because the world of\nexperience and taste is subject to the higher laws of the supernatural world. The sensory\nexperience of eating a pineapple, for Jean de Lery, is less real and meaningful than the\nstate of the soul which will live on after the body and the pineapple are both gone. What\nmay seem to us like tolerance on his part is, in the end, indifference: whether we eat\npineapples or people, all that really matters is salvation.\""
    },
    {
      "category": "Resource",
      "title": "The Paramedic Method for Revising Prose (adapted from Richard Lanham)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/24894c5b0b50a17fb860b4bb45b076c8_the_param_method.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nThe Paramedic Method for Revising Prose (adapted from Richard\nLanham)\nA/ Jim kicks Bill.\nOR\nB/ Bill is being kicked.\nOne can easily see that a kicking situation is taking place between Bill\nand Jim.\nKicking Bill is an activity Jim currently partakes of.\nKicking is one of the many ways in which Bill and Jim participate in\nthe rich complexities of human interaction.\nThe scene mentions kicking, and two characters are involved.\nPrinciples for getting from B to A:\n1. Circle all the \"be\" verbs (e.g., \"is taking place\")\n2. Circle the prepositions (not, between, of ...).\n3. Ask, what's the action, who's performing it? Who's kicking who?\n4. Put the action into a simple active verb (not compound -- \"is taking\" -- or\npassive -- \"is being kicked\").\n5. Start fast -- cut out introductory verbiage (\"one can easily see ...\").\n6. Once you have a revised, shorter sentence, check to see if you need to\nadd more information (who is kicking who? Where? And why?\").\nCentral to our understanding of the nature of the relationships which exist between\nhuman beings in Daniel Defoe's eighteenth century novel Robinson Crusoe is a careful\nconsideration of the passage in which the print of a human foot is seen by Crusoe on the\nshore.\nCentral to our understanding of the nature of the relationships which exist between\nhuman beings in Daniel Defoe's eighteenth century novel Robinson Crusoe is a careful\n\nconsideration of the passage in which the print of a human foot is seen by Crusoe on\nthe shore.\nWhen Defoe's character Robinson Crusoe sees a human footprint on the sand, his\nreactions help us understand the novel's view of human relations.\nAfter eighteen years alone, Defoe's character Robinson Crusoe sees a human footprint on\nthe sand. His reactions exemplify the novel's view of human relations as basically\ncompetitive.\nMore sample sentences (to fix, not imitate)\n1. This allows Ariel to achieve a good outcome, while Caliban finishes\nthe play and is still unclear as to what is his ultimate outcome.\n2. As is clearly evident, Powhatan then continues in this scene with the\ncolonists and Pocahontas and says that it is really extremely wrong to\nkill others in these circumstances, it will never, ever be him who is the\none to begin it.\n3. Also, it is said by Rowlandson that the Indians who are dressed up in\nEnglish clothing are foul and that they are heathens.\n4. The film and history are similar, yet different in many ways, and both\nuse many techniques specific to their genre.\n5. Though both captives write about their captivity, they do so using\ndifferent approaches, and as a result, leave the reader with two distinct\nimpressions.\nSample fixes\nFinally, Prospero gives freedom to the willing Ariel, but leaves Caliban\nneither free nor led.\nDisney's Powhatan chooses peace, refusing to let killing \"begin with me.\"\nRowlandson derides Indians in English dress as \"foul ... Heathens\" (94).\n....\n\nMary Rowlandson finds herself cast into a howling wilderness populated by\nsavages; for Jemison, this savage wilderness yields a domestic happiness\nviolated only by the arrival of settlers."
    },
    {
      "category": "Resource",
      "title": "Writing Introductions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/abb14b9dd0a5f8608fe118a1db4db375_revision_hand2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nWriting introductions\nA good introduction can help you map out and focus what an essay will be about. (Titles\ncan do this too). Bad introductions take up space but don't help you or the reader figure\nout what's coming next or why. Many papers look a bit like this:\nIntro:\nFrom the beginning of time, α has been true/important/of interest to human\nbeings. Author X & author Y both mention α in their works.\nBody:\n- Example α1\n- Example α2\n- Example α3\nConclusion:\n[Ack! How do I conclude? I don't know where to go, so even though it's kind of\nboring...:] As I have now shown, we see α in these works of great genius by X\nand Y. OR 5. Though both authors write about α, they do so using different\napproaches, and as a result, leave the reader with two distinct impressions.\nWhat is a writer to do? Here are some suggestions and observations.\n1. It's hard to finish a good introduction before you have a draft of the paper.\n(Introductions usually need to be partially or wholly rewritten near the end of the\nwriting process, once you know what you are introducing). Use it as a tool during the\nwriting process to figure out the main question you want to ask and why that\nquestion is a questsion.\n2. Once you know what you're introducing, try to introduce it right away. Do not resort\nto human history or the beginning of time.\n3. You will need to make some general points in your introduction, using (for instance)\nbroad concepts like \"nature\" and \"nurture\", \"gender,\" \"power\", etc. These general,\nconceptual terms are 1/ important and 2/ dangerously vague and potentially\nmonotonous if you leave them all alone without a little bit of concrete, specific detail\nto keep them company. For an example, see below.\n\nIntro2:\nAuthor X and author Y both make α central to their texts [titles follow] [etc.].\nThis sentence does the job of introducing the topic right away, but it's kind of\nboring and also kind of vague. So here's my rewrite, letting α =interpersonal\nrelationships , X and Y = Milton [Paradise Lost, a poem based on the Genesis\nstory of Adam and Eve's creation, temptation, and fall from Eden] and Defoe\n[Robinson Crusoe, a novel about a man who is shipwrecked on a desert island,\nalone until he rescues a native man who will become his servant and companion].\nIntro3:\nFor both Milton and Defoe, intimate relationships combine danger and trust. In\nParadise Lost, Adam's love for his wife helps him decide to eat the forbidden\napple, rather than remaining alone and sinless; Eve's love for her husband induce\nher to offer it to him rather than keeping it to herself. Love appears to override\nthese two characters' impulses towards self-preservation and rivalry, yet the\nconsequences are so terrible that we may question their decisions. By contrast,\nRobinson Crusoe's Friday and Crusoe begin their relationship at opposite ends of\na gun, with every reason to fear each other. Yet the cannibal and the colonist end\nby finding \"perfect\" obligation and love together, pooling their resources to\nmaster the environment and its other inhabitants. Is it safe to love someone, or\nshould self-interest be our guide? Milton and Defoe appear to offer different\nanswers.\nNow the paper which follows has something to do which isn't trivial/obvious: how do\nMilton's and Defoe's text each answer this question? The intro may also give me some\nother questions to explore in the paper: e.g. what are Adam's feelings for Eve, and Eve's\nfor Adam? How and why do Crusoe and Friday both let down their guard? Are these\nrelationships really comparable, or are there differences which should be taken into\naccount?\nConclusion3: Here, you would sum up what the answers alluded to the introduction are;\ndistinguish between them as succintly as possible; and note anything unexpected which came up in\nthe course of the paper. (E.g., Adam and Eve lose everything through their love for each other,\nbut Michael assures them that they will nonetheless find a \"paradise within thee, happier far\"\nthan the Eden they left)."
    },
    {
      "category": "Resource",
      "title": "Writing Workshop Handouts",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/833f1e681baa0dc6cbb64cf0f360e9ff_writ_work_hand.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nWriting Workshop handouts\nHere, you will find three handouts:\n1. A summary (link to Writing issues you raised section in this document) of\nresponses to the issues you asked to have addressed.\n2. A draft ( link to Section 2 of a draft essay (column 1) analysed (column 2) in\nthis document) of an essay on instruments in Equiano's Narrative, with an\nanalysis of what the draft is doing; I've tried to show the writing process.\n3. A more polished draft, (link to Revising the essay: towards a comparison\nbetween Equiano and Phillips in this document) with notes for how I might\nrevise this material for purposes of a comparative essay on Equiano and Caryl\nPhillips, with a sample \"media object.\"\nWriting issues you raised:\n1) Time allocation: clean draft vs. messy draft with revisions. The latter works better\nfor most writers.\na) I never know what I want to say until I've done several drafts.\nb) Trying to get it right the first time gives most people writer's block.\n2) Forming a thesis.\na) Start with something loose and intuitive.\nb) Modify it as you write; make it sharper/more precise.\nc) Make this process part of the essay. \"I felt that such and such was the case. I\nwondered if that held true throughout the text. I looked at some important scenes\nto see what I could discover. In the end, I found that a/ I was right, and was able\nto understand why such and such was the case with more depth and detail; b/ I\nwas largely right, but I had to qualify my idea in several important ways; c/ I was\nactually wrong -- here's why I originally thought such and such was the case, and\nwhat led me to change my mind.\"\n3) Transitions between sections and paragraphs.\na) Fill in context carefully,\nb) clarify the conceptual relationship,\n\nc) step back to the bigger picture.\n\n4) \"What can I claim?\"\na) Is it plausible?\nb) Is it relevant?\nc) Is there counter-evidence?\nd) Remember that texts are not a clear window to reality; that's not their job.\n5) Conclusions.\na) restate the key points: don't forget the highpoints of your analysis.\nb) look back at the questions you have raised: make sure you addressed them,\nand if not, do it now.\nc) assess your claims objectively: what degree of certainty is it reasonable to have,\ngiven the evidence available to you? Is there counter-evidence in the text, and\nhow important is it? Are there questions is not possible to answer in the present\nessay, or even at all? Are there questions other than the ones you've asked that\nwould be interesting to pursue?\n6) Introductions.\na) give the \"loose and intuitive\" version of your thesis.\nb) hold argumentative claims for later.\nc) raise questions that the conclusion will answer.\nd) hint at the conclusion, but don't give everything away.\ne) Provide basic context.\nf) WRITE THEM LAST.\n\nSection 2 of a draft essay (column 1)\nanalysed (column 2)\nA few weeks ago, as we talked in class about the second essay, we looked at three\npassages from Equiano's Interesting Narrative, all focused on his observations and\ndescriptions of tools and instruments: agricultural instruments in Africa, a watch and\npainting in Virginia, and the instruments of writing (journal, pen, candle) on his\nexpedition to the Arctic. Here, you'll see some of the process by which I begun to put\ntogether some detailed close readings of the second scene into the frame of a bigger\npaper; this section would come after a discussion of African tools in chapter 1, and before\na description of writing and danger in the Arctic, in chapter 3.\nWhen Equiano describes his home in chapter 1, we\nMAJOR TRANSITION: I recall\nsee simple tools used for obvious purposes by\nthe previous section, and create a\npeople he knows well. When he arrives in Virginia\nparallel construction to show its\nin chapter 3, he encounters artifacts that are new\nrelationship to the next section.\nand strange. [Describe the scene; think about how\nit's different from the first scene]. These objects are\n\nintimidating in their complexity; not only does he\nnot understand how they work, but he also doesn't\nknow what purpose they are intended to serve.\n\nThe young Equiano, still a child, and far from\nKEY ELEMENTS -\neverything that is familiar to him, decides that the\nDESCRIPTIVE SUMMARY\nwatch and the painting are there to watch him and to\nreport if he does anything wrong. He speculates\n\nthat they work either by magic, or because they\ncontain the spirits of dead people.\n[all this context is important - it\nmatters where we are on the\n\ntimeline of age and experience]\n[Do I know anything about what\nleads him to these ideas?]\n\nThere are two ideas here to explore: first, that these\nKEY ELEMENTS --\nare instruments of surveillance and punishment;\nANALYTIC: I had to come back\nsecond, that they are animate rather than\nand add this sentence later,\nmechanical.\nbecause I couldn't quite see it right\naway.\n\nWhat leads Equiano to these interpretations of what\nMINOR TRANSITION:\n\nhe sees? **\nintroducing the next part of this\nsection on the scene in Virginia.\n\nHe is reasoning on the basis both of what he\nANALYSIS: (Later on, I decided\nunderstands from the past, and also what he\nto cut this sentence, but writing it\nunderstands clearly about his present environment.\nhelped me get the argument\nclearly in my mind). How should I\n\nsequence the discussion that\nfollows? I need to find out what I\nwill be able to say about each part\nof the scene before I can decide.\n\nEquiano writes that he was \"affrighted at some\nDESCRIPTION 1: the watch.\nthings I saw\" especially because, as he entered the\nFollowed by some\nhouse, he had seen \"a black woman slave... cruelly\nloaded with various kinds of iron machines.\" In\n\nparticular, he describes one on her head which\nprevents her from eating, drinking, or speaking: \"I\n\nwas much astonished and shocked at this\ncontrivance.\" He describes what he sees not in\nANALYSIS: more\nterms of the familiar and readily understandable\nabstract/conceptual description\n(chains and shackles), but as a form of alien\n(familiar vs. alien).\ntechnology, a \"machine\" or \"contrivance.\" He\nunderstands that the purpose of this \"machine\" is to\n\nlimit the woman's freedom of action, and he\nobserves that it does so \"cruelly.\" When he\n\nspeculates that the watch and painting serve similar\nends, he is reasoning from what he has already\n\nobserved and understood about the use of\n\"contrivances\" in his immediate environment.\nCLAIM: generalizing from the\nanalysis.\n\nThe painting causes Equiano to feel \"affrighted\"\nDESCRIPTION 2: the painting.\nbecause it is utterly unfamiliar to him, \"having\nnever seen such things as these before.\" He quickly\n\nconcludes that it probably serves the same purpose\nas the watch and the iron muzzle, namely, to\n[This is where I decided that this\nobserve his actions while the master is asleep.\nparagraph has to go second,\nFrom there, however, he goes on to make several\nbecause the example of the\nconjectures about how the painting \"works.\" When\npainting has something in\nEquiano speculates that the picture is either magical\ncommon with the example of the\nor a repository for the spirits of the dead, he is\nwatch, but also something\n\ndrawing on ideas that he has brought with him from\nextra].\nhome, in an effort to find something familiar in\nwhat appears to be an alien environment. If the\n\npainting contains the spirits of great men who have\ndied, perhaps \"the whites... offer them libations as\nCLAIM: another analytic point to\nwe used to do our friendly spirits.\"\nparallel the one just above.\n\nBut SO WHAT? Here, I go back\nto the \"big picture\" and realize I\nleft out something obvious.\n\nEquiano's response to things he doesn't understand\nOVERVIEW: this material, along\nseems to be a combination of fear and wonder. He is with the context and analysis to\nvery far from understanding the makeup and\nfollow, needs to go at the\npurpose of watches and paintings in the way that we beginning of the section, before\nwould understand them, or that he himself would\nthe two paragraphs of description,\nunderstand them as an adult.\nat **. It's a more obvious, general\npoint, so it goes before the detailed\n\nanalysis.\n[How does he understand them as\nan adult?]\n\nEquiano will later become skilled at arithmetic and\nCONTEXT: this raises the\nnavigation; he will come to value both the ingenious question, which will be obvious to\ncontrivances of European civilization, and his own\nthe reader, but I didn't think of it\nmastery of them.\nuntil now: How do I make sense\nof this difference between how he\n\nshows himself as a child and how\nhe shows himself as an adult?\n\nANALYSIS: I decided that the\n\npoint was not just about how\nEquiano himself changed, but also\n\nabout his intentions as a narrator in\nshowing us that change.\nMaking himself look naive here will make him\nseem more sophisticated later.\n\nHe is mistaken in all of his ideas about the watch\nSUMMARY/ANALYSIS: now\nand the painting; yet in producing these\nI'm back to the sequence of the\ninterpretations, he explores the power of his own\nessay -- this will come directly\nunaided reason to make sense of complex, alien,\nafter the material on the painting,\nand even frightening new phenomena in a hostile\nas an answer to SO WHAT? It\nenvironment.\nincorporates both the obvious\ngeneral point and what I learned\n\nfrom more detailed analysis, and\ndeals with the apparent conflict\nbetween them.\n\nAs a boy newly arrived in Virginia, he is already\nSUMMARY/ TRANSITION: I'm\ndeveloping the mind and consciousness we will see\ngetting ready to move on to the\nwhen he is a mature man recording in his journals\nnext section, the scene in the\nthe details of an expedition to the Arctic.\nArctic.\n\nRevising the essay: towards a comparison\nbetween Equiano and Phillips\nSecond text: Caryl Phillips, The Atlantic Sound, \"Homeward Bound: Thru the Door of\nNo Return.\" This section, at the end of the chapter on Ghana, brings to a head this\nchapter's ongoing preoccupation with time, punctuality, watches, and the difference\nbetween \"African\" and \"Western\" relationships to both. The narrator's irritation about\nlateness turns into a critique of \"returned\" Americans who wish to reject watches and\ntimekeeping in favor of a \"return\" to simply watching the sun for time. The issue of time\nsurfaces both at the microlevel, in attention to watches and clocks, and at the macro level,\nin a series of reflections on history.\n(broken image link in original source)\nThe watch has lost its time-keeping function, and become a pure symbol - existing side\nby side with actual, functional watches. This will give another perspective on \"African\"\nrelations to timekeeping. I've also found some text associated with the object: \"the\nability to \"control time\" -- to determine when events happen is frequently asserted on the\nflags and shrines of... the Fante.... these [cast-gold watches] do not have a timekeeping\nmechanism... they are still warning conjunction with perfectly functional, often very\nexpensive, watches with prestigious logos. The cast-gold watches are obviously less\nabout keeping the time than with owning it and, once more, with displaying wealth\"\n[Doran Ross, Gold of the Akan from the Glassell Collection (Houston, 2002).\n\nIn this column is a more polished version of the\nIn this column are my notes for\n\"original\" essay.\nhow I might change this material\nin moving towards a revision..\nWhen Equiano describes his home in\n\nchapter 2, we see simple tools used for obvious\npurposes by people he knows well. When he\nI'm going to keep the material\narrives in Virginia in chapter 3, he encounters\nabout Africa, because the point in\nartifacts that are new and strange. [Describe the\nPhillips seems to be a contrast\nscene]. These objects are intimidating in their\nbetween Africa and the West; I\ncomplexity; not only does he not understand how\nwant to compare the contrast in\nthey work, but he also doesn't know what purpose\nEquiano to the contrast in Phillips.\nthey are intended to serve. He is still a child, far\nfrom home, and \"had no person to speak to that I\n\ncould understand.\" Left to his own devices, the\nyoung Equiano decides that the watch and the\nI'm also going to focus more\npainting are there to watch him and to report if he\nspecifically on the watch and on\ndoes anything wrong. He speculates that they work\ntimekeeping.\neither by magic, or because they contain the spirits\nof dead people. What leads Equiano to these\ninterpretations of what he sees?\n\nOverall, the young Equiano's response to\nOwning and understanding things\nthings he doesn't understand, here and elsewhere in\nlike watches becomes a sign of\nthe text, seems to be a combination of fear and\nbelonging to the Western world.\nwonder. He is very far from understanding the\nmakeup and purpose of watches and paintings in the\nway that we would understand them, or that he\nhimself would understand them as an adult, later on\n\nin the book. Moreover, rather than examining these\nobjects more closely in order to learn more about\nMake more of the relationship\nthem, he simply assigns them to the category of the\nbetween time-keeping, calculation,\nsupernatural: things which cannot be explained by\nand the applied math of\nrational means, and should not be approached by\nnavigations. Highlight the\nordinary people. Later in the narrative, Equiano\nquantitative and abstract\nwill come to value both the ingenious contrivances\ndimension of all these skills.\nof European civilization, and his own mastery of\nReplace the scene in the Arctic\nthem. (For instance, he will become skilled at\nwith something else.\narithmetic and navigation). To some extent,\nmaking himself look naive here will make him\nseem more sophisticated later. At the same time,\nthere are elements of the scene which point forward\nto the sophisticated man Equiano will become,\nrather than backwards to the naive child he once\n\nwas.\n\nEquiano writes that he was \"affrighted at\nEquiano associates machines and\nsome things I saw, the more so\" because, as he\ncontrivances with the oppressive\nentered the house, he had seen \"a black woman\nviolence of slavery. Compare with\nslave... cruelly loaded with various kinds of iron\nassociations made by the\nmachines.\" In particular, he describes one on her\n\"returned\" Americans in Phillips.\nhead which prevents her from eating, drinking, or\nThey seem to feel that returning to\nspeaking: \"I was much astonished and shocked at\na life that is simpler in material\nthis contrivance.\" He describes what he sees not in\nterms will also return them to the\nterms of the familiar and readily understandable\nstate they would have been in had\n(chains and shackles), but as a form of alien\nslavery never happened.\ntechnology, a \"machine\" or \"contrivance.\" He\nunderstands that the purpose of this \"machine\" is to\n\nlimit the woman's freedom of action, and he\nobserves that it does so \"cruelly.\" When he\nAdd some material about how\nspeculates that the watch \"would tell the gentleman\nwatches and similar instruments\nany thing I might do amiss,\" he is reasoning from\n(for instance, the compass) are\nwhat he has already observed and understood about\nused more generally -- what do\nthe use of \"contrivances\" in his immediate\nthey allow people to do, and how\nenvironment.\ndo they seem to function as\nsymbols in the text? Use Stanley,\n\nLewis and Clark.\n\nThe painting causes Equiano to feel \"affrighted\" for\n\nsomewhat different reasons: not because it is , but\nbecause it is utterly unfamiliar, \"having never seen\nLess a contrast than an overlap\nsuch things as these before.\" He quickly concludes\nwith Kohain's group in The\nthat the painting probably serves the same purpose\nAtlantic Sound - lots of libations\nas the watch and the iron muzzle, namely, to\nin the ceremony he organizes.\nobserve his actions while the master is asleep.\nBring in some of the things\nFrom there, however, he goes on to make several\nEquiano says about the\nconjectures about how the painting \"works.\" For\nresemblances between Judaism\ninstance, if the painting contains the spirits of great\nand African religious practice. Of\nmen who have died, perhaps \"the whites... offer\ncourse, he ends up by rejecting\nthem libations as we used to do our friendly\nboth. Equiano opts for modernity,\nspirits.\" When Equiano speculates that the picture\ncomplexity, and technology over\nis either magical or a repository for the spirits of the the primitive innocence he\ndead, he is drawing on ideas that he has brought\nassociates with his childhood. He\nwith him from home, in an effort to map out\nis not interested in going back.\nconceptually what appears to be an alien\nenvironment.\n\nIn short, this scene shows the young\nThis part of the essay relates more\nEquiano reasoning on the basis both of what he\nto Equiano's development over the\nunderstands from the past, and also what he\ncourse of the narrative, and that's\nunderstands clearly about his present environment.\nno longer my focus; I will\nHe is mistaken in all of his ideas about the watch\nprobably cut this material. I won't\nand the painting; yet in producing these\nhave time to talk about the Arctic,\ninterpretations, he explores the power of his own\nalthough it occurs to me that the\nunaided reason to make sense of complex, alien,\nscene of Equiano sitting by himself\nand even frightening new phenomena in a hostile\nand writing is probably the\nenvironment. As a boy newly arrived in Virginia,\nmoment in the narrative when he\nhe is already developing the mind and\nlooks most like Phillips. They are\nconsciousness we will see when he is a mature man\nboth writers whose mission it is to\nrecording in his journals the details of an expedition describe the Atlantic world to\nto the Arctic.\nothers."
    },
    {
      "category": "Resource",
      "title": "Guidelines for Essay 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/a4a3c6f93aa56eef4655a6ba80975b14_essay_guidelines.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nThis assignment is the first stage in preparing your first essay. In your draft, I'd like you\nto focus on choosing and closely analyzing a passage of about 1-2 pages; you will\nprobably also be thinking about the larger issues that connect it to the rest of the book,\nbut try to do as much closely focused analysis as you can. For more information and\nsuggestions, see three documents under Readings and Resources>Assignments: Close\nAnalysis Sample, Guide to Close Reading, General Paper-Writing Guidelines.\nFormat: Times Roman 12 pt (or similar font), double-spaced, 1\" margins. See \"Close\nAnalysis Sample\" for examples of how to format short and long quotations.\nEssay 1: on Blue Highways.\nDraft (3 pp.) due: 1 day after SES #7.\nOne peer response to another draft due: SES #8.\nThis assignment in brief: write a closely focused, analytic essay on William Least Heat-\nMoon's Blue Highways. I've described the work in steps.\n1. Select and describe a passage. Begin by choosing a manageable portion of the\ntext, ideally one that attracts, puzzles, or otherwise interests you (try to avoid ones\nwe've spent a long time on in class, unless it's a passage you yourself presented).\nSome sections are short enough to use in their entirety, like chapter 1 section 2;\nfor longer sections, try to focus more tightly on an event, a conversation, a scene,\nor place. The piece of text you select should be no longer than a page or two.\nThe essay should begin by describing, in a sentence or two, what happens in this\npiece of the text, answering the usual orienting questions of who, what, when (on\nthe journey, in relation to other events), and where. \"Why\" will come later.\n2. Do a close reading of this passage. What is close reading? Broadly speaking,\nusing attention to the details of the text to generate an account of what it means\nand does: the contents of this particular passage, the form given to those contents\nby the writer, and the implications or effects that result.\na. Begin by taking notes; I like to make a Xerox of the text I'm thinking\nabout, so I can carry it around with me and mark it up. Underline, circle,\ndraw arrows, scribble in the margins, and when you start to think of\nlonger, more connected things to say, write those down. I'll make some\nsuggestions on things to notice and look for in the forthcoming \"Close\nReading\" document, but we have of course been doing some of this in\nclass.\n\nb. As your notes build up, start to look for patterns in your material, and\nthink about how to organize these observations in a logically connected\nway that makes those patterns evident and meaningful.\nc. Write up your analysis as a connected piece of prose. When you write up\nyour analysis or close reading, you are taking your reader on a tour of the\ntext that points out and makes sense of its important features, both those\nthat are obvious, and those that are not immediately apparent. Once you\nhave done that, begin to think about \"why\" - what features of this passage\n(writing strategies, pre-occupying topics or questions, etc.) link it to other\nparts of the book.\n3. Set this passage and its concerns in the larger context of the book. Why does\nthis scene matter to the work? Why was it included, and told the way it was,\nnoticing the things it notices? What preoccupations connect it to the larger flow\nof the journey and the book; what does this passage have to say about those larger\nconcerns?\nIn your draft, you should have gotten to about the end of step 2, with some ideas about\nstep 3. As you go from draft to final version, you should think more about the last set of\nquestions in step 3, and about how to integrate them with your close reading. A good\nanalytic essay moves back and forth between details and the big picture. To that end,\nquote the text liberally but in a highly targeted way -- it's better to quote the exact word,\nphrase, or sentence you need than to gesture towards a paragraph-length block of text.\nFinally, find a title for the final version that sums up what's interesting about your\npassage. \"A discussion of Blue Highways\" is not a real title. More specific (and\ninteresting): \"An Imagineer talks about work\"; \"Lifting salad plates: the work of an\n'imagineer'\"; \"What's your line?: talk about work in the home of KFC\"; you get the\nidea.\nRelated documents: see Readings and Resources>Assignments for a sample close\nanalysis (with examples of how to use quotation), a guide to close reading, and general\nguidelines for writing papers about literature."
    },
    {
      "category": "Exam",
      "title": "Atanarjuat Quiz: Answers",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/991d702460020e7ed1834abeca4ddadc_quiz_answers.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nAtanarjuat Quiz: answers.\n(Questions are in quiz_questions.doc)\n1. A stranger shaman from \"up North\" brings evil to the community, according to\nPanikpak. One thing he says suggests that Sauri's desire to replace his father may\nhave \"called\" him.\n2. The narrator is Panikpak, mother of Sauri, sister of Qulitalik, grandmother of Oki,\nand friend to Atuat.\n3. He needs a woman to take care of his clothes. Her family encourages her to go\nwith him, perhaps with evil intentions.\n4. She has sex with his brother.\n5. She runs home to her family and tells them that Atanarjuat try to kill her, even\nthough she didn't do anything.\n6. They accept her, and persuade the brothers to let her rejoin the family.\n7. (There are probably several reasons). He is jealous that the woman he was\nengaged to preferred Atanarjuat; Atanarjuat \"stole\" his fiancee by beating him in a\ncompetition; he believes or chooses to believe that Atanarjuat has beaten his\nsister; he envies Atanarjuat's hunting ability; the curse has made him jealous of\nAtanarjuat just as there was rivalry between their fathers.\n8. He finds the camp of Panikpak's brother and his family.\n9. Panikpak's brother buries Atanarjuat under some seaweed. He feeds Oki and his\nfriends ex until they can't think clearly.\n10. Because his father will not let him marry Atuat after Atanarjuat has disappeared.\n11. Panikpak's brother appears to grow walrus tusks.\n12. A leather biker jacket and an iPod."
    },
    {
      "category": "Exam",
      "title": "Atanarjuat Quiz: Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/bca266f53ec2420893f00700dc3e8643_quiz_questions.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nAtanarjuat Quiz: Questions\n(Answers are in quiz_answers.doc)\n1. What do the opening scenes of the movie suggest about the causes for later\nconflicts?\n2. Who is the narrator in these early scenes, and how is that narrator related to some\nof the other characters?\n3. When Atanarjuat's first wife is pregnant, why does he take Oki's sister along with\nhim when he goes caribou hunting?\n4. What does Atanarjuat's second wife do that he objects to?\n5. After he takes exception to what she has done, what does she do next?\n6. When she returns, what do her co-wife and sister-in-law do?\n7. Why is Oki out to get Atanarjuat?\n8. At the end of Atanarjuat's long run across the ice, what does he encounter?\n9. When Oki catches up with Atanarjuat in the next scene, why doesn't he find him?\n10. Why does Oki kill his father?\n11. In the last scene of the movie, what indicates to you that magic is taking place?\n12. What is \"Oki\" wearing in the clips that follow the end of the movie?"
    },
    {
      "category": "Lecture Notes",
      "title": "Cherry Apsley-Garrard, \"Introduction,\" The Worst Journey in the World: Selections",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/324a9becacfc55116219fb2c8e5f8997_cher_apsle_intro.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nCherry Apsley-Garrard, \"Introduction,\"\nThe Worst Journey in the World:\nselections.\nPolar exploration is at once the cleanest and most isolated way of having a bad time\nwhich has been devised. It is the only form of adventure in which you put on your clothes\nat Michaelmas and keep them on until Christmas, and, save for a layer of the natural\ngrease of the body, find them as clean as though they were new. It is more lonely than\nLondon, more secluded than any monastery, and the post comes but once a year. As men\nwill compare the hardships of France, Palestine, or Mesopotamia, so it would be\ninteresting to contrast the rival claims of the Antarctic as a medium of discomfort. A\nmember of Campbell's party tells me that the trenches at Ypres were a comparative\npicnic. But until somebody can evolve a standard of endurance I am unable to see how it\ncan be done. Take it all in all, I do not believe anybody on earth has a worse time than an\nEmperor penguin.\n[Brief history of Antarctic exploration follows, including an outline of events on the Scott\nexpedition which is the subject of Apsley-Garrard's book]\n... [Around the turn of the twentieth century,] the spirit of adventure, which has always\nled men into the unknown, combined with the increased interest in knowledge for its own\nsake to turn the thoughts of the civilized world southwards. It was becoming plain that a\ncontinent of the extent and climate which this polar land probably possessed might have\nan overwhelming influence upon the weather conditions of the whole Southern\nHemisphere. The importance of magnetism was only rivalled by the mystery in which the\nwhole subject was shrouded: and the region which surrounded the Southern Magnetic\nPole of the earth offered a promising field of experiment and observation. The past\nhistory, through the ages, of this land was of obvious importance to the geological story\nof the earth, whilst the survey of land formations and ice action in the Antarctic was more\nuseful perhaps to the physiographer than that of any other country in the world, seeing\nthat he found here in daily and even hourly operation the conditions which he knew had\nexisted in the ice ages of the past over the whole world, but which he could only infer\nfrom vestigial remains. The biological importance of the Antarctic might be of the first\nmagnitude in view of the significance which attaches to the life of the sea in the\nevolutionary problem.\nAnd it was with these objects and ideals that Scott's first expedition, known officially as\nthe British Antarctic Expedition of 1901-1904, but more familiarly as 'The Discovery\nExpedition,' from the name of the ship which carried it, was organized by the Royal\nSociety and the Royal Geographical Society, backed by the active support of the British\nGovernment. The executive officers and crew were Royal Navy almost without\nexception, whilst the scientific purposes of the expedition were served in addition by five\nscientists. These latter were not naval officers.\n\n[On this expedition, Scott, Wilson and Shackleton attempted to reach the South Pole;\nShackleton fell ill with scurvy, and they were obliged to turn back at 82o 16' S. Edgar\nEvans and Lashly were also on this trip. On a subsequent expedition in 1908, Shackleton\npioneered a route up the Beardmore Glacier, reaching to 88o 23'S. Scott's second\nexpedition departed England June 1910. Shackleton's last expedition, about which we\nwill read, followed Scott's.]\n....\nThe story of Scott's Last Expedition of 1910-13 is a book of two volumes, the first\nvolume of which is Scott's personal diary of the expedition, written from day to day\nbefore he turned into his sleeping-bag for the night when sledging, or in the intervals of\nthe many details of organization and preparation in the hut, when at Winter Quarters.\n[MIT owns a first edition of this book; volume II includes \"reports of the journeys and\nthe scientific work undertaken by Dr. E. A. Wilson and the surviving members of the\nexpedition\"]. The readers of this book will probably have read that diary and the\naccounts of the Winter Journey, the last year, the adventures of Campbell's Party and the\ntravels of the Terra Nova which follow. [\"Campbell's Party\": a group of 6 men left at\nanother point on the coast; ice conditions prevented their relief by ship as planned, and\nthese men survived the Antarctic winter in a snow cave, eating seals] With an object\nwhich I will explain presently I quote a review of Scott's book from the pen of one of Mr.\nPunch's staff:\n\"There is courage and strength and loyalty and love shining out of the second volume no\nless than out of the first; there were gallant gentlemen who lived as well as gallant\ngentlemen who died; but it is the story of Scott, told by himself, which will give the book\na place among the great books of the world. That story begins in November 1910, and\nends on March 29, 1912, and it is because when you come to the end, you will have lived\nwith Scott for sixteen months, that you will not be able to read the last pages without\ntears. That message to the public was heartrending enough when it first came to us, but it\nwas as the story of how a great hero fell that we read it; now it is just the tale of how a\ndear friend died. To have read this book is to have known Scott; and if I were asked to\ndescribe him, I think I should use some such words as those which, six months before he\ndied, he used of the gallant gentleman who went with him, 'Bill' Wilson. 'Words must\nalways fail when I talk of him,' he wrote; 'I believe he is the finest character I ever met--\nthe closer one gets to him the more there is to admire. Every quality is so solid and\ndependable. Whatever the matter, one knows Bill will be sound, shrewdly practical,\nintensely loyal, and quite unselfish.' That is true of Wilson, if Scott says so, for he knew\nmen; but most of it is also true of Scott himself. I have never met a more beautiful\ncharacter than that which is revealed unconsciously in these journals. His humanity, his\ncourage, his faith, his steadfastness, above all, his simplicity, mark him as a man among\nmen. It is because of his simplicity that his last message, the last entries in his diary, his\nlast letters, are of such undying beauty. The letter of consolation (and almost of apology)\nwhich, on the verge of death, he wrote to Mrs. Wilson, wife of the man dying at his side,\nmay well be Scott's monument. He could have no finer. And he has raised a monument\nfor those other gallant gentlemen who died--Wilson, Oates, Bowers, Evans. They are all\n\ndrawn for us clearly by him in these pages; they stand out unmistakably. They, too, come\nto be friends of ours, their death is as noble and as heartbreaking. And there were gallant\ngentlemen, I said, who lived--you may read amazing stories of them. Indeed, it is a\nwonderful tale of manliness that these two volumes tell us. I put them down now; but I\nhave been for a few days in the company of the brave ... and every hour with them has\nmade me more proud for those that died and more humble for myself.\"\nI have quoted this review at length, because it gives the atmosphere of hero-worship into\nwhich we were plunged on our return. That atmosphere was very agreeable; but it was a\nrefracting medium through which the expedition could not be seen with scientific\naccuracy--and the expedition was nothing if not scientific. Whilst we knew what we had\nsuffered and risked better than any one else, we also knew that science takes no account\nof such things; that a man is no better for having made the worst journey in the world;\nand that whether he returns alive or drops by the way will be all the same a hundred years\nhence if his records and specimens come safely to hand.\n....\n\nSo there is already a considerable literature about the expedition, but no connected\naccount of it as a whole. Scott's diary, had he lived, would merely have formed the basis\nof the book he would have written. As his personal diary it has an interest which no other\nbook could have had. But a diary in this life is one of the only ways in which a man can\nblow off steam, and so it is that Scott's book accentuates the depression which used to\ncome over him sometimes.\nWe have seen the importance which must attach to the proper record of improvements,\nweights and methods of each and every expedition. We have seen how Scott took the\nsystem developed by the Arctic Explorers at the point of development to which it had\nbeen brought by Nansen, and applied it for the first time to Antarctic sledge travelling.\nScott's Voyage of the Discovery gives a vivid picture of mistakes rectified, and of\nimprovements of every kind. Shackleton applied the knowledge they gained in his first\nexpedition, Scott in this, his second and last. On the whole I believe this expedition was\nthe best equipped there has ever been, when the double purpose, exploratory and\nscientific, for which it was organized, is taken into consideration. It is comparatively easy\nto put all your eggs into one basket, to organize your material and to equip and choose\nyour men entirely for one object, whether it be the attainment of the Pole, or the running\nof a perfect series of scientific observations. Your difficulties increase many-fold directly\nyou combine the one with the other, as was done in this case. Neither Scott nor the men\nwith him would have gone for the Pole alone. Yet they considered the Pole to be an\nachievement worthy of a great attempt, and \"We took risks, we knew we took them;\nthings have come out against us, and therefore we have no cause for complaint....\"\nIt is, it must be, of the first importance that a system, I will not say perfected, but\ndeveloped, to a pitch of high excellence at such a cost should be handed down as\n\ncompletely as possible to those who are to follow. I want to so tell this story that the\nleader of some future Antarctic expedition, perhaps more than one, will be able to take it\nup and say: \"I have here the material from which I can order the articles and quantities\nwhich will be wanted for so many men for such and such a time; I have also a record of\nhow this material was used by Scott, of the plans of his journeys and how his plans\nworked out, and of the improvements which his parties were able to make on the spot or\nsuggest for the future. I don't agree with such and such, but this is a foundation and will\nsave me many months of work in preparation, and give me useful knowledge for the\nactual work of my expedition.\" If this book can guide the future explorer by the light of\nthe past, it will not have been written in vain.\nBut this was not my main object in writing this book. When I undertook in 1913 to write,\nfor the Antarctic Committee, an Official Narrative on condition that I was given a free\nhand, what I wanted to do above all things was to show what work was done; who did it;\nto whom the credit of the work was due; who took the responsibility; who did the hard\nsledging; and who pulled us through that last and most ghastly year when two parties\nwere adrift, and God only knew what was best to be done; when, had things gone on\nmuch longer, men would undoubtedly have gone mad. There is no record of these things,\nthough perhaps the world thinks there is. Generally as a mere follower, without much\nresponsibility, and often scared out of my wits, I was in the thick of it all, and I know.\nUnfortunately I could not reconcile a sincere personal confession with the decorous\nobliquity of an Official Narrative; and I found that I had put the Antarctic Committee in a\ndifficulty from which I could rescue them only by taking the book off their hands; for it\nwas clear that what I had written was not what is expected from a Committee, even\nthough no member may disapprove of a word of it. A proper Official Narrative presented\nitself to our imaginations and sense of propriety as a quarto volume, uniform with the\nscientific reports, dustily invisible on Museum shelves, and replete with--in the words of\nmy Commission--\"times of starting, hours of march, ground and weather conditions,\"\nnot very useful as material for future Antarcticists, and in no wise effecting any catharsis\nof the writer's conscience. I could not pretend that I had fulfilled these conditions; and so\nI decided to take the undivided responsibility on my own shoulders. None the less the\nCommittee, having given me access to its information, is entitled to all the credit of a\nformal Official Narrative, without the least responsibility for the passages which I have\nstudied to make as personal in style as possible, so that no greater authority may be\nattached to them than I deserve.\nI need hardly add that the nine years' delay in the appearance of my book was caused by\nthe war. Before I had recovered from the heavy overdraft made on my strength by the\nexpedition I found myself in Flanders looking after a fleet of armoured cars. A war is like\nthe Antarctic in one respect. There is no getting out of it with honour as long as you can\nput one foot before the other. I came back badly invalided; and the book had to wait\naccordingly.\n...."
    },
    {
      "category": "Resource",
      "title": "Class Discussion: \"Blue Highways\"",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/e5aec226697c759035165d18cc3f97df_thoughts.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nI liked the ending. It made me feel like he has learned something, not just healed\nemotionally. In the beginning I felt like he was just trying to wander around and forget\nhis problems, but towards the end, he seems to have grown as a person. The ending was\nprofound in that sense. It was poetic even if it never happened.\nI didn't really like how this book ended -- there was no resolution or really any indication\nthat the book was ending except that the words stopped. However, I can appreciate that\nhe may have done this on purpose, as a kind of further continuation of the character of the\nbook. I think that a lot of this book is like that to me -- I don't necessarily like it, but I\ncan respect it for his view of the world and take on life.\nDisappointed. He traveled across the country and met amazing, miraculous people, but\nhe didn't find the answers he was looking for. I guess I was expecting the Hollywood,\nEureka, life-changing moment that often escapes reality. However, I feel a still my life\nwould have been changed for the better and was disappointed that he didn't learn from the\nsages of the blue highways. I would have enjoyed more stories, because I found out more\ninteresting than his travelogue.\\\nThe book, in general, reads like a series of short stories, which makes the and in almost\nanti-climactic. I find in the beginning we read a lot more of Least Heat Moon's emotions\nin the narration than we do further on. Despite editing and personal bias, he tends to keep\na neutral opinion. This neutrality and lack of central plot makes the book incomplete\neven when it ends. The afterword (if I had a copy) would wrap up the book as a whole.\nAfter reading selections from Blue Highways, I'm not sure if I was very satisfied with the\nwork as a whole. While at first I found the whole premise of the story interesting,\nreading through short fragments of Heat-Moon's framed experience didn't leave a lasting\nimpression on me. It seemed as if his healing process of traveling from place to place\nwas a way to avoid his problems, and in the end, nothing conclusive came from it.\nBy the end of Blue Highways, I was exasperated with Heat-Moon's three-month journey\nto \"find himself.\" Throughout the trip, his experiences with different types of people\nshowed him what kind of person he wanted to be (someone with inner peace), but he\nremains unmotivated actually to become that person. The road trip changed his\nperspective, but will it instill long-term change in his life? I enjoy the stories, but I don't\nknow if the book served the purpose Heat-Moon hoped.\nI really like how this book explored parts of the US that would otherwise be ignored by\nmainstream America. It opened my eyes to another side of America. Also I like how the\nauthor just wanted to set out to get away from it all, and how the journey changed him.\nI really liked the book because personally, I can relate myself to Heat-Moon. I am\nthinking about how to write a short collection of journals about all the places I went to in\nChina and all the Olympic events I watched. The more I read in the book, the more I like\nhow Heat-Moon not only introduces what's famous in a town, but also reveals the place's\nculture through his regular-day conversations with the people.\n\nGreat book! I was really able to understand the spiritual journey he was making due to\nhis writing style and perspective. The afterword changed my view of the novel when he\nstarted to mention how the book came to be and in a sense the healing process it\ncatalyzed within him.\nI liked this book a lot because it is compelled me to think about so many inspiring things\nthat I hadn't thought of. One of the parts I found great but we did not discuss in class was\nhis nostalgia at the end. There are parts of the text that I really loved, like when Roemer\nsays (p. 382), \"we're trying to hold back the future, but we do believe what has happened\nin Greenwich is at least as important as what could happen here. The future should grow\nfrom the past, not obliterate it.\" The way he looked at areas and people was different\nfrom the typical way, which rendered it unique. There were some parts were the\ndescription was too long, but at the end the story grew more interesting and discussed\nthings that are more universal. There were some points where I, as an international, got\nlost.\nMy overall impression of the book at its conclusion was overwhelmingly positive. I felt\nthat Blue Highways represents a unique and transformative (albeit selective) journey for\nHeat-Moon and I believe that the reader may take away from it a variety of ideas about\nthe American culture, the process of discovering oneself, and the idea of wholeness. I\nbelieve that Heat-Moon's process of writing the story allowed me to have an extra insight\ninto his journey and experience, which made the book much more meaningful. One\naspect that I did not enjoy it was the way that his biases pervaded the text -- in the context\nof a narrative, it can be seen as distracting...\nReading Blue Highways was the journey all its own. I began reading enchanted by the\nprospect of a cross-country expedition to America's \"other half,\" and even wished at\ntimes to be among the raw role \"simpletons\" Heat-Moon describes. Through Heat-\nMoon's biases, however, I realized that doing so would be avoiding modernity. This\nbook, for me, is a lesson in accepting the past, that the only way to preserve it is not by\nisolation but by integrating it successfully with modern culture.\nWhen I first started the book, I was unsure if I could handle rambling pages of a\ntravelogue but I really appreciated the character selections. Heat-Moon definitely\ndoctored passages when he spoke with people, but the wide range of perspectives tied to\na geographical context kept the book flowing well. Towards the end of the book, he\nstarts losing his perspective through other people. He becomes a seemingly unreliable\nnarrator when he doesn't use a first-hand dialogue, and the book becomes less interesting\nto me. I started liking the book as a character survey rather than how Heat-Moon\nintended the book to be read."
    },
    {
      "category": "Resource",
      "title": "Opening Scenes of Atanarjuat",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/ed7bfa3998a9f669078e7b65328349c8_open_sce_of_ata.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nOpening scenes of Atanarjuat\nThis story is spread out over two moments, about a generation apart. The\nbeginning of the film tracks back and forth in time, and can be harder to follow when you\ndon't yet recognize characters or know their relationships.\nAt the beginning of the film, a stranger has come to the community at Igloolik.\nYou see him first in an interior scene, where he and the group's leader, Kumaglaq, are\ncomparing clothes; he is the one on the left, who says he \"adores little boys\". (In the\nfilm's closing scene, when the stranger returns, you'll notice that his hood is made very\ndifferently from what men in the community wear; clearly, \"not one of us\"). Kumaglaq\nis the one wearing a distinctive walrus-tooth necklace, which will be passed down to\nsuccessive leaders. The stranger from \"up north\" (Greenland?) is a shaman, and proposes\na contest; the children are told to leave. The woman whose face is shown repeatedly in\nthis scene is Panikpak, Kumaglaq's wife and a key character in the movie.\nIn the next scene, we see Panikpak saying goodbye to her brother Qulitaliq and\nhis wife, who are leaving to settle somewhere else - these characters turn out to have a\nfew shamanic powers themselves, and they know hard times are coming. Later in the\nfilm, Qulitaliq will reenter the narrative as a much older man who helps Atanarjuat.\n(Kumaglaq's spirit will also manifest at a few moments in the film, and Atanarjuat's son\nis named after him, so he is not gone for good). As Panikpak watches them leave, she\nbegins to recall in voiceover (\"Evil came to us...\") the rest of what happened when the\nstrange shaman came to them. We return to that earlier scene.\nThe shaman (Tungajuaq) and Kumaglaq engage in a contest, and Tungajuaq\nkills him (we see him fall over). Notice the sounds in this scene -- they will recur later on\nat moments when the evil shaman's influence is at work. Tungajuaq then takes the\nnecklace from one to another man in the igloo; he holds it up to Tulimaq, the dead\nleader's favorite, but finally gives it to Sauri, Kumaglaq's son, saying \"be careful what\nyou wish for.\" Tulimaq calls out Sauri as implicated in his father's death. The stranger\nshaman has not only killed the group's leader, but left a curse, which will affect Tulimaq\nand persist into the next generation.\nIn the next scenes, you'll see how things go for Tulimaq - not well. He is so\nunlucky hunting that he, his wife, and their small sons, must struggle to survive on\nwhatever leftovers Sauri allows them. His wife can't wait until their sons grow up; she\nhopes they will do better taking care of her.\nFrom there, the narrative jumps forward to a time when Amaqjuat and\nAtanarjuat are grown, as are Sauri's irascible son Oki (who wears a distinctive hood of\nwhite foxtails) and daugher Puja (flirtatious, wears straight bangs). Sauri still wears the\nwalrus-tooth necklace as leader. Panikpak, now an old woman, has developed a bond\nwith a beautiful young woman who is the namesake of her own mother, Atuat (and so\naddresses her as \"little mother\"). Present-day Atuat has been promised to Oki by her\nparents. But she seems to be partial to Atanarjuat . The story goes from there.\n\nCharacters and family ties:\nKumaglaq is married to Panikpak, the\n\nsister of Qulitaliq (and daugher of Atuat).\n\nSauri is Kumaglaq and Panikpak's son,\nTulimaq belongs to Sauri's generation.\nand follows his father as leader.\n\nAmaqjuat and Atanarjuat are Tulimaq's\nsons. Atanarjuat marries another Atuat.\n\nPuja and Oki are Sauri's children, and\nOki will also follow his father as leader.\nKumaglaq is Atanarjuat and Atuat's son;\nhe is named after Panikpak's husband."
    },
    {
      "category": "Resource",
      "title": "Reading The Wasteland",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/a37ec703bf495a6cf8d9e0f37359ce10_read_the_wastela.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nReading The Wasteland\nHow to read The Wasteland\nThe Wasteland, section 1: a guided tour\nThe Wasteland and travel writing\nShackleton and the \"fourth man\"\nWere there more time, I would lay some of this out in class. But since we will be zipping\nthrough this important and difficult poem very briskly, this handout is meant to orient you\nand lay the groundwork for discussion.\nHow to read it.\nThere are two ways to read this poem: as a kind of crossword/puzzle/challenge (looking\nup all the allusions, translations from foreign languages, and struggling to \"decode\" its\ndifficulty) or as something like a piece of music, to be (in the first instance) heard, and\nthen responded to intuitively. I recommend trying the second way first, and then going\nback for the footnotes. You won't \"get\" all the allusions, and it isn't necessary to get\nthem, but the footnotes should give you a general sense of the texts and (sometimes)\nstories that are being evoked.\nA few words of context. This poem was, you'll notice, published in 1922 - a few years\nafter Shackleton's voyage in the Endurance, and also only a few years after the end of\nWorld War I. A change in sensibility is evident: no waving of a flag given by the King\nwill suffice to \"buck up\" the wasted cityscape of Eliot's poem. The absence of coherent,\nnatural characters and of a conventional storyline gives an aesthetic form to the (widely\nshared) sense that, somewhere in those intervening years, things fell apart in a pretty\ndecisive way. Eliot's response is not only to represent this fragmentation in the\nfragmented form of his poem; in announcing the Grail legend -- and the fertility rituals\nand myths underlying it - as the real \"meaning\" of the poem, he reaches outside a\nmodern, European culture he sees as broken and quarries the \"primitive cultures\" studied\nby anthropologists for a more stable and enduring pattern of meanings. That pattern is,\nessentially, the archetypal narrative of the journey or quest.\nI'll say a few more framing things below, but before continuing at this general level, I'd\nlike to get started with a representative outline of what's going on in section I, to help\neveryone find their footing in the poem.\nThe Wasteland, section 1: a guided tour.\nIn this section, like others, we hear a number of different voices and languages, none\nexplicitly identified with a character or source: the effect is something like what you hear\n\nwhen you scan through different frequencies on the radio (an aural experience that would\nhave seemed very modern in 1922). Eliot - like Phillips - works by juxtaposing pieces\nof text without giving us the connecting tissue between them. But a little digging makes\nthe thematic connections between this fragments pretty apparent. Check it out; we'll talk\nabout this section briefly in class before heading towards the end of the poem.\n- Lines 1-7: \"We\" (all of us) are in a dead land, where the possibility of renewal,\nof getting up and trying again, seems less appealing than forgetfulness, sleep, and\ngiving up. (A bit reminiscent of Cherry in the Antarctic!).\n- Lines 8-18: \"Marie\" seems to be a Central European aristocrat (her cousin is an\nAustro-Hungarian archduke), a cosmopolitan of somewhat uncertain nationality; she\nleads a life of leisure and privilege, yet is still insomniac (she stays awake all night\nreading), only feels \"free\" in the mountains, and migrates with the seasons, an\nexpensive form of homelessness. You will remember that World War I began with the\nassassination of one of \"Marie's\" presumptive relatives, the Archduke Ferdinand. The\njuxtaposition of this voice with those around it connects the particular \"deadness\" of\nThe Wasteland's setting to the cultural and historical setting of early twentieth-century\nEurope, one of whose features was an intermarried, cosmopolitan aristocracy - the heirs\nof several much decayed but still lingering empires - that still played a key role in\nnational rule. The existence and influence of this international aristocracy helps to\nmake intelligible (along with many other factors) the precipitation of \"world war\" by\nthe murder of a wealthy Austrian archduke in Sarajevo.\n- Lines 19-30: A prophetic voice, with echoes of Isaiah, Ezekiel and Ecclesiastes.\nAgain, \"we\" are in a wasteland, but this voice that speaks from beyond our knowledge\ncan reveal to us not the coming of the Messiah, but only the \"secret\" of our fear and\nmortality. The world is \"stony rubbish,\" and we are \"a handful of dust\".\n- Lines 31-34: a quotation from Act I of the opera Tristan und Isolde. Isolde is at\nsea, and hears a sailor sing this song of longing: a fresh wind blows, seeming to\npromise something - and yet the wind does not bring the beloved's ship home. (In the\nstory, the ship is taking her to marry King Mark of Cornwall, but she will soon fall\npassionately in love with his nephew Tristan. In act II of the opera, they become lovers,\nare discovered, and Tristan is wounded in a duel). Tristan, by the way, was a knight of\nKing Arthur's Round Table, connecting this story to one verson of the Grail Legend (as\na quest set for King Arthur's knights).\n- Lines 35-41: this lyrical memory of a girl given flowers (\"Your arms full, and\nyour hair wet\") contrasts with the dry and empty landscape of lines 19-30; yet what the\nspeaker remembers is his inability to say the right words to her, to seize the moment -\nhe \"failed\" somehow to capture this brief glimpse of other possibilities that seem fertile,\nerotic, beautiful.\n\n- Line 42: Tristan und Isolde again; now we are in Act III, and the wounded\nTristan is at his castle in Brittany, waiting for Isolde's ship to come - and yet as he\nlooks out to sea, he sees only \"desolate and empty\" waves - she is not there.\n- Lines 43-59: Madame Sosostris is a more modern prophet; she tells fortunes\nusing the Tarot cards. In contrast to the grand and frightening voice we heard in 19-30,\nshe is a bit seedy (not to mention ill) - and her horoscopes are illegal. She might be a\nfraud - or is that voices and authorities from outside the modern cityscape have now\nbeen made illegal and driven underground? (The figures in the horoscope she draws\nwill recur later in the poem).\n- Lines 60-68: the quotation at lines 63-64 is from Dante's Inferno: he is\ndescribing the crowds of damned souls in hell. These lines are seamlessly integrated\ninto a closely and accurately observed description of morning rush hour in the City, the\nold part of London where banks and financial businesses are located. These are places\nyou could find on a map or visit on an urban walking tour, but the real landscape and\nthe phantasmal, imaginary landscape of hell merge in Eliot's description. As the lines\nat the entrance to Dante's hell read: \"Abandon hope, all ye who enter here.\"\n- Lines 69-76: \"Mylae\" was a naval battle during the first war between Rome and\nCarthage, 260 BCE. Eliot is again collapsing the modern urban scene with another\nplace and time, bending the rules of nature. Most significantly, these lines imagine the\npossibility of new growth, renewal, or rebirth as deeply disturbing (don't let that corpse\nbloom or get dug up!), taking us back to the poem's opening lines. In section 1, \"we\"\n(and the last lines insist that \"we readers\" are not only an audience, but are also\nimplicated in this problematic) are caught between the emptiness and desolation of\nmodern urban life, and fear of what any possible change might look like or might\ndemand from us. (When Isolde does finally arrive in Wagner's opera, Tristan tears off\nhis bandages and dies).\nThe Wasteland and travel writing\nWhat else, besides its quest structure, makes The Wasteland an appropriate reading for\nthis class? I was, of course, tempted by the Shackleton reference, which we'll talk about\n- but there is more. Eliot had initially wanted the poem's epigraph to be a phrase from\nJoseph Conrad's Heart of Darkness, his searing novel of a journey up the Congo River on\na route brutally opened by Stanley only a few years earlier. (You'll remember that we\nread Conrad's essay on explorers in September). A few allusions to Conrad's novel are\nstill woven into the poem, as traces of Eliot's preoccupation with it. More than that,\nthough, both the poem and its writer exemplify an especially modern (or, Modernist)\nvariant of travel. Eliot was born in America, but moved to England and took English\ncitizenship; this voluntary exile resembles that of his contemporaries James Joyce\n(Ulysses) and Samuel Beckett (Waiting for Godot), both Irishmen who spent much of\ntheir writing lives in Paris, as well as that of many writers in the present who have left\nformer colonies to live and work in metropolitan centres like London, Paris, and New\nYork. Boston alone has a number of illustrious examples -- Seamus Heaney (Ireland),\n\nDerek Walcott (St. Lucia), Jamaica Kincaid (Antigua) -- a few other well-known names\nmight be V.S. Naipaul (Trinidad), Salman Rushdie (India), Michael Ondaatje (Sri\nLanka)... you get the idea.\nThe two key terms for Eliot's life are exile and cosmopolitanism. He is cosmopolitan in\nthe sense that he is working not so much in a tradition of American poetry or even\nAnglophone poetry, but appropriating the entire Western European literary tradition.\n(You can try counting the number of languages in the poem). Although he is obviously a\nhuge nerd with respect to literature, he is not only a nerd - in the poem, we hear the\nvoices of elite speakers and of canonical literary and musical texts (Shakespeare, Wagner,\nDante, etc.) but we also hear the voices of lower-class women drinking in pubs, of\nsecretaries eating from cans in one-room apartments, of travelling salesmen looking for a\nquick gay weekend in a hotel near the train station.\nWith all these languages and all these sociolects (the ways different social groups speak a\ncommon language), Eliot is taking us on a kind of tour of his historical moment and\ncultural location. Not only the findings but the method of anthropology have marked this\npoem, which is made up of closely observed and recorded voices - in all their variety --\nas much as of literary allusions. He is also, of course, paying careful attention to the\nmap of Greater London.\nShackleton and the \"fourth man\".\nIn a footnote to The Wasteland l. 360, Eliot identifies the passage beginning \"Who is the\nthird who walks always beside you?\" as an allusion to Shackleton's expedition. He is\nrecalling a phenomenon described by Worsley (and by Shackleton in his own book) as\nhaving been experienced by all three of the men present on their epic crossing of South\nGeorgia; it is right at the end of our reading for Tuesday. We can talk about this passage\nin Worsley; in The Wasteland, this passage about the phantasmal extra companion occurs\nin the poem's last section, as we finally approach the \"empty chapel\" that might hold the\nGrail or something like it - in essence, an object with power to catalyse healing and\nrenewal. As the notes helpfully explain, Eliot is weaving together the Grail legend,\ncontemporary history, and the story of the disciples' journey to Emmaus in the Gospel of\nLuke, chapter 24 (the reference is hyperlinked in the notes, and it's worth looking at). In\nany case, in terms of the poem's narrative as in Worsley, the invisible \"third\" or \"fourth\"\nperson on the journey appears as the goal of the journey draws near, and as the travellers'\npractical and spiritual resources hover close to exhaustion."
    },
    {
      "category": "Resource",
      "title": "Reading The Wasteland",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/6621a127d1dc356aabb3199883c8737b_thewasteland_1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nWere there more time, I would lay some of this out in class. But since we will be zipping\nthrough this important and difficult poem very briskly, this handout is meant to orient you\nand lay the groundwork for discussion.\nHow to read it.\nThere are two ways to read this poem: as a kind of crossword/puzzle/challenge (looking\nup all the allusions, translations from foreign languages, and struggling to \"decode\" its\ndifficulty) or as something like a piece of music, to be (in the first instance) heard, and\nthen responded to intuitively. I recommend trying the second way first, and then going\nback for the footnotes. You won't \"get\" all the allusions, and it isn't necessary to get\nthem, but the footnotes should give you a general sense of the texts and (sometimes)\nstories that are being evoked.\nA few words of context. This poem was, you'll notice, published in 1922 - a few years\nafter Shackleton's voyage in the Endurance, and also only a few years after the end of\nWorld War I. A change in sensibility is evident: no waving of a flag given by the King\nwill suffice to \"buck up\" the wasted cityscape of Eliot's poem. The absence of coherent,\nnatural characters and of a conventional storyline gives an aesthetic form to the (widely\nshared) sense that, somewhere in those intervening years, things fell apart in a pretty\ndecisive way. Eliot's response is not only to represent this fragmentation in the\nfragmented form of his poem; in announcing the Grail legend -- and the fertility rituals\nand myths underlying it - as the real \"meaning\" of the poem, he reaches outside a\nmodern, European culture he sees as broken and quarries the \"primitive cultures\" studied\nby anthropologists for a more stable and enduring pattern of meanings. That pattern is,\nessentially, the archetypal narrative of the journey or quest.\nI'll say a few more framing things below, but before continuing at this general level, I'd\nlike to get started with a representative outline of what's going on in section I, to help\neveryone find their footing in the poem.\nThe Wasteland, section 1: a guided tour.\nIn this section, like others, we hear a number of different voices and languages, none\nexplicitly identified with a character or source: the effect is something like what you hear\nwhen you scan through different frequencies on the radio (an aural experience that would\nhave seemed very modern in 1922). Eliot - like Phillips - works by juxtaposing pieces\nof text without giving us the connecting tissue between them. But a little digging makes\nthe thematic connections between this fragments pretty apparent. Check it out; we'll talk\nabout this section briefly in class before heading towards the end of the poem.\n- Lines 1-7: \"We\" (all of us) are in a dead land, where the possibility of renewal,\nof getting up and trying again, seems less appealing than forgetfulness, sleep, and\ngiving up. (A bit reminiscent of Cherry in the Antarctic!).\n\n- Lines 8-18: \"Marie\" seems to be a Central European aristocrat (her cousin is an\nAustro-Hungarian archduke), a cosmopolitan of somewhat uncertain nationality; she\nleads a life of leisure and privilege, yet is still insomniac (she stays awake all night\nreading), only feels \"free\" in the mountains, and migrates with the seasons, an\nexpensive form of homelessness. You will remember that World War I began with the\nassassination of one of \"Marie's\" presumptive relatives, the Archduke Ferdinand. The\njuxtaposition of this voice with those around it connects the particular \"deadness\" of\nThe Wasteland's setting to the cultural and historical setting of early twentieth-century\nEurope, one of whose features was an intermarried, cosmopolitan aristocracy - the heirs\nof several much decayed but still lingering empires - that still played a key role in\nnational rule. The existence and influence of this international aristocracy helps to\nmake intelligible (along with many other factors) the precipitation of \"world war\" by\nthe murder of a wealthy Austrian archduke in Sarajevo.\n- Lines 19-30: A prophetic voice, with echoes of Isaiah, Ezekiel and Ecclesiastes.\nAgain, \"we\" are in a wasteland, but this voice that speaks from beyond our knowledge\ncan reveal to us not the coming of the Messiah, but only the \"secret\" of our fear and\nmortality. The world is \"stony rubbish,\" and we are \"a handful of dust\".\n- Lines 31-34: a quotation from Act I of the opera Tristan und Isolde. Isolde is at\nsea, and hears a sailor sing this song of longing: a fresh wind blows, seeming to\npromise something - and yet the wind does not bring the beloved's ship home. (In the\nstory, the ship is taking her to marry King Mark of Cornwall, but she will soon fall\npassionately in love with his nephew Tristan. In act II of the opera, they become lovers,\nare discovered, and Tristan is wounded in a duel). Tristan, by the way, was a knight of\nKing Arthur's Round Table, connecting this story to one verson of the Grail Legend (as\na quest set for King Arthur's knights).\n- Lines 35-41: this lyrical memory of a girl given flowers (\"Your arms full, and\nyour hair wet\") contrasts with the dry and empty landscape of lines 19-30; yet what the\nspeaker remembers is his inability to say the right words to her, to seize the moment -\nhe \"failed\" somehow to capture this brief glimpse of other possibilities that seem fertile,\nerotic, beautiful.\n- Line 42: Tristan und Isolde again; now we are in Act III, and the wounded\nTristan is at his castle in Brittany, waiting for Isolde's ship to come - and yet as he\nlooks out to sea, he sees only \"desolate and empty\" waves - she is not there.\n- Lines 43-59: Madame Sosostris is a more modern prophet; she tells fortunes\nusing the Tarot cards. In contrast to the grand and frightening voice we heard in 19-30,\nshe is a bit seedy (not to mention ill) - and her horoscopes are illegal. She might be a\nfraud - or is that voices and authorities from outside the modern cityscape have now\nbeen made illegal and driven underground? (The figures in the horoscope she draws\nwill recur later in the poem).\n\n- Lines 60-68: the quotation at lines 63-64 is from Dante's Inferno: he is\ndescribing the crowds of damned souls in hell. These lines are seamlessly integrated\ninto a closely and accurately observed description of morning rush hour in the City, the\nold part of London where banks and financial businesses are located. These are places\nyou could find on a map or visit on an urban walking tour, but the real landscape and\nthe phantasmal, imaginary landscape of hell merge in Eliot's description. As the lines\nat the entrance to Dante's hell read: \"Abandon hope, all ye who enter here.\"\n- Lines 69-76: \"Mylae\" was a naval battle during the first war between Rome and\nCarthage, 260 BCE. Eliot is again collapsing the modern urban scene with another\nplace and time, bending the rules of nature. Most significantly, these lines imagine the\npossibility of new growth, renewal, or rebirth as deeply disturbing (don't let that corpse\nbloom or get dug up!), taking us back to the poem's opening lines. In section 1, \"we\"\n(and the last lines insist that \"we readers\" are not only an audience, but are also\nimplicated in this problematic) are caught between the emptiness and desolation of\nmodern urban life, and fear of what any possible change might look like or might\ndemand from us. (When Isolde does finally arrive in Wagner's opera, Tristan tears off\nhis bandages and dies).\nThe Wasteland and travel writing\nWhat else, besides its quest structure, makes The Wasteland an appropriate reading for\nthis class? I was, of course, tempted by the Shackleton reference, which we'll talk about\n- but there is more. Eliot had initially wanted the poem's epigraph to be a phrase from\nJoseph Conrad's Heart of Darkness, his searing novel of a journey up the Congo River on\na route brutally opened by Stanley only a few years earlier. (You'll remember that we\nread Conrad's essay on explorers in September). A few allusions to Conrad's novel are\nstill woven into the poem, as traces of Eliot's preoccupation with it. More than that,\nthough, both the poem and its writer exemplify an especially modern (or, Modernist)\nvariant of travel. Eliot was born in America, but moved to England and took English\ncitizenship; this voluntary exile resembles that of his contemporaries James Joyce\n(Ulysses) and Samuel Beckett (Waiting for Godot), both Irishmen who spent much of\ntheir writing lives in Paris, as well as that of many writers in the present who have left\nformer colonies to live and work in metropolitan centres like London, Paris, and New\nYork. Boston alone has a number of illustrious examples -- Seamus Heaney (Ireland),\nDerek Walcott (St. Lucia), Jamaica Kincaid (Antigua) -- a few other well-known names\nmight be V.S. Naipaul (Trinidad), Salman Rushdie (India), Michael Ondaatje (Sri\nLanka)... you get the idea.\n\nThe two key terms for Eliot's life are exile and cosmopolitanism. He is cosmopolitan in\nthe sense that he is working not so much in a tradition of American poetry or even\nAnglophone poetry, but appropriating the entire Western European literary tradition.\n(You can try counting the number of languages in the poem). Although he is obviously a\nhuge nerd with respect to literature, he is not only a nerd - in the poem, we hear the\n\nvoices of elite speakers and of canonical literary and musical texts (Shakespeare, Wagner,\nDante, etc.) but we also hear the voices of lower-class women drinking in pubs, of\nsecretaries eating from cans in one-room apartments, of travelling salesmen looking for a\nquick gay weekend in a hotel near the train station.\nWith all these languages and all these sociolects (the ways different social groups speak a\ncommon language), Eliot is taking us on a kind of tour of his historical moment and\ncultural location. Not only the findings but the method of anthropology have marked this\npoem, which is made up of closely observed and recorded voices - in all their variety --\nas much as of literary allusions. He is also, of course, paying careful attention to the\nmap of Greater London.\nShackleton and the \"fourth man\".\nIn a footnote to The Wasteland l. 360, Eliot identifies the passage beginning \"Who is the\nthird who walks always beside you?\" as an allusion to Shackleton's expedition. He is\nrecalling a phenomenon described by Worsley (and by Shackleton in his own book) as\nhaving been experienced by all three of the men present on their epic crossing of South\nGeorgia; it is right at the end of our reading for Tuesday. We can talk about this passage\nin Worsley; in The Wasteland, this passage about the phantasmal extra companion occurs\nin the poem's last section, as we finally approach the \"empty chapel\" that might hold the\nGrail or something like it - in essence, an object with power to catalyse healing and\nrenewal. As the notes helpfully explain, Eliot is weaving together the Grail legend,\ncontemporary history, and the story of the disciples' journey to Emmaus in the Gospel of\nLuke, chapter 24 (the reference is hyperlinked in the notes, and it's worth looking at). In\nany case, in terms of the poem's narrative as in Worsley, the invisible \"third\" or \"fourth\"\nperson on the journey appears as the goal of the journey draws near, and as the travellers'\npractical and spiritual resources hover close"
    },
    {
      "category": "Resource",
      "title": "Reading The Wasteland",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/d6faf2085505814ca977cf4162ce65ac_thewasteland_2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nWere there more time, I would lay some of this out in class. But since we will be zipping\nthrough this important and difficult poem very briskly, this handout is meant to orient you\nand lay the groundwork for discussion.\nHow to read it.\nThere are two ways to read this poem: as a kind of crossword/puzzle/challenge (looking\nup all the allusions, translations from foreign languages, and struggling to \"decode\" its\ndifficulty) or as something like a piece of music, to be (in the first instance) heard, and\nthen responded to intuitively. I recommend trying the second way first, and then going\nback for the footnotes. You won't \"get\" all the allusions, and it isn't necessary to get\nthem, but the footnotes should give you a general sense of the texts and (sometimes)\nstories that are being evoked.\n\nA few words of context. This poem was, you'll notice, published in 1922 - a few years\nafter Shackleton's voyage in the Endurance, and also only a few years after the end of\nWorld War I. A change in sensibility is evident: no waving of a flag given by the King\nwill suffice to \"buck up\" the wasted cityscape of Eliot's poem. The absence of coherent,\nnatural characters and of a conventional storyline gives an aesthetic form to the (widely\nshared) sense that, somewhere in those intervening years, things fell apart in a pretty\ndecisive way. Eliot's response is not only to represent this fragmentation in the\nfragmented form of his poem; in announcing the Grail legend -- and the fertility rituals\nand myths underlying it - as the real \"meaning\" of the poem, he reaches outside a\nmodern, European culture he sees as broken and quarries the \"primitive cultures\" studied\nby anthropologists for a more stable and enduring pattern of meanings. That pattern is,\nessentially, the archetypal narrative of the journey or quest.\nI'll say a few more framing things below, but before continuing at this general level, I'd\nlike to get started with a representative outline of what's going on in section I, to help\neveryone find their footing in the poem.\nThe Wasteland, section 1: a guided tour.\nIn this section, like others, we hear a number of different voices and languages, none\nexplicitly identified with a character or source: the effect is something like what you hear\nwhen you scan through different frequencies on the radio (an aural experience that would\nhave seemed very modern in 1922). Eliot - like Phillips - works by juxtaposing pieces\nof text without giving us the connecting tissue between them. But a little digging makes\nthe thematic connections between this fragments pretty apparent. Check it out; we'll talk\nabout this section briefly in class before heading towards the end of the poem.\n- Lines 1-7: \"We\" (all of us) are in a dead land, where the possibility of renewal,\nof getting up and trying again, seems less appealing than forgetfulness, sleep, and\ngiving up. (A bit reminiscent of Cherry in the Antarctic!).\n\n- Lines 8-18: \"Marie\" seems to be a Central European aristocrat (her cousin is an\nAustro-Hungarian archduke), a cosmopolitan of somewhat uncertain nationality; she\nleads a life of leisure and privilege, yet is still insomniac (she stays awake all night\nreading), only feels \"free\" in the mountains, and migrates with the seasons, an\nexpensive form of homelessness. You will remember that World War I began with the\nassassination of one of \"Marie's\" presumptive relatives, the Archduke Ferdinand. The\njuxtaposition of this voice with those around it connects the particular \"deadness\" of\nThe Wasteland's setting to the cultural and historical setting of early twentieth-century\nEurope, one of whose features was an intermarried, cosmopolitan aristocracy - the heirs\nof several much decayed but still lingering empires - that still played a key role in\nnational rule. The existence and influence of this international aristocracy helps to\nmake intelligible (along with many other factors) the precipitation of \"world war\" by\nthe murder of a wealthy Austrian archduke in Sarajevo.\n- Lines 19-30: A prophetic voice, with echoes of Isaiah, Ezekiel and Ecclesiastes.\nAgain, \"we\" are in a wasteland, but this voice that speaks from beyond our knowledge\ncan reveal to us not the coming of the Messiah, but only the \"secret\" of our fear and\nmortality. The world is \"stony rubbish,\" and we are \"a handful of dust\".\n- Lines 31-34: a quotation from Act I of the opera Tristan und Isolde. Isolde is at\nsea, and hears a sailor sing this song of longing: a fresh wind blows, seeming to\npromise something - and yet the wind does not bring the beloved's ship home. (In the\nstory, the ship is taking her to marry King Mark of Cornwall, but she will soon fall\npassionately in love with his nephew Tristan. In act II of the opera, they become lovers,\nare discovered, and Tristan is wounded in a duel). Tristan, by the way, was a knight of\nKing Arthur's Round Table, connecting this story to one verson of the Grail Legend (as\na quest set for King Arthur's knights).\n- Lines 35-41: this lyrical memory of a girl given flowers (\"Your arms full, and\nyour hair wet\") contrasts with the dry and empty landscape of lines 19-30; yet what the\nspeaker remembers is his inability to say the right words to her, to seize the moment -\nhe \"failed\" somehow to capture this brief glimpse of other possibilities that seem fertile,\nerotic, beautiful.\n- Line 42: Tristan und Isolde again; now we are in Act III, and the wounded\nTristan is at his castle in Brittany, waiting for Isolde's ship to come - and yet as he\nlooks out to sea, he sees only \"desolate and empty\" waves - she is not there.\n- Lines 43-59: Madame Sosostris is a more modern prophet; she tells fortunes\nusing the Tarot cards. In contrast to the grand and frightening voice we heard in 19-30,\nshe is a bit seedy (not to mention ill) - and her horoscopes are illegal. She might be a\nfraud - or is that voices and authorities from outside the modern cityscape have now\nbeen made illegal and driven underground? (The figures in the horoscope she draws\nwill recur later in the poem).\n\n- Lines 60-68: the quotation at lines 63-64 is from Dante's Inferno: he is\ndescribing the crowds of damned souls in hell. These lines are seamlessly integrated\ninto a closely and accurately observed description of morning rush hour in the City, the\nold part of London where banks and financial businesses are located. These are places\nyou could find on a map or visit on an urban walking tour, but the real landscape and\nthe phantasmal, imaginary landscape of hell merge in Eliot's description. As the lines\nat the entrance to Dante's hell read: \"Abandon hope, all ye who enter here.\"\n- Lines 69-76: \"Mylae\" was a naval battle during the first war between Rome and\nCarthage, 260 BCE. Eliot is again collapsing the modern urban scene with another\nplace and time, bending the rules of nature. Most significantly, these lines imagine the\npossibility of new growth, renewal, or rebirth as deeply disturbing (don't let that corpse\nbloom or get dug up!), taking us back to the poem's opening lines. In section 1, \"we\"\n(and the last lines insist that \"we readers\" are not only an audience, but are also\nimplicated in this problematic) are caught between the emptiness and desolation of\nmodern urban life, and fear of what any possible change might look like or might\ndemand from us. (When Isolde does finally arrive in Wagner's opera, Tristan tears off\nhis bandages and dies).\nThe Wasteland and travel writing\nWhat else, besides its quest structure, makes The Wasteland an appropriate reading for\nthis class? I was, of course, tempted by the Shackleton reference, which we'll talk about\n- but there is more. Eliot had initially wanted the poem's epigraph to be a phrase from\nJoseph Conrad's Heart of Darkness, his searing novel of a journey up the Congo River on\na route brutally opened by Stanley only a few years earlier. (You'll remember that we\nread Conrad's essay on explorers in September). A few allusions to Conrad's novel are\nstill woven into the poem, as traces of Eliot's preoccupation with it. More than that,\nthough, both the poem and its writer exemplify an especially modern (or, Modernist)\nvariant of travel. Eliot was born in America, but moved to England and took English\ncitizenship; this voluntary exile resembles that of his contemporaries James Joyce\n(Ulysses) and Samuel Beckett (Waiting for Godot), both Irishmen who spent much of\ntheir writing lives in Paris, as well as that of many writers in the present who have left\nformer colonies to live and work in metropolitan centres like London, Paris, and New\nYork. Boston alone has a number of illustrious examples -- Seamus Heaney (Ireland),\nDerek Walcott (St. Lucia), Jamaica Kincaid (Antigua) -- a few other well-known names\nmight be V.S. Naipaul (Trinidad), Salman Rushdie (India), Michael Ondaatje (Sri\nLanka)... you get the idea.\nThe two key terms for Eliot's life are exile and cosmopolitanism. He is cosmopolitan in\nthe sense that he is working not so much in a tradition of American poetry or even\nAnglophone poetry, but appropriating the entire Western European literary tradition.\n(You can try counting the number of languages in the poem). Although he is obviously a\nhuge nerd with respect to literature, he is not only a nerd - in the poem, we hear the\nvoices of elite speakers and of canonical literary and musical texts (Shakespeare, Wagner,\nDante, etc.) but we also hear the voices of lower-class women drinking in pubs, of\n\nsecretaries eating from cans in one-room apartments, of travelling salesmen looking for a\nquick gay weekend in a hotel near the train station.\nWith all these languages and all these sociolects (the ways different social groups speak a\ncommon language), Eliot is taking us on a kind of tour of his historical moment and\ncultural location. Not only the findings but the method of anthropology have marked this\npoem, which is made up of closely observed and recorded voices - in all their variety --\nas much as of literary allusions. He is also, of course, paying careful attention to the\nmap of Greater London.\nShackleton and the \"fourth man\".\nIn a footnote to The Wasteland l. 360, Eliot identifies the passage beginning \"Who is the\nthird who walks always beside you?\" as an allusion to Shackleton's expedition. He is\nrecalling a phenomenon described by Worsley (and by Shackleton in his own book) as\nhaving been experienced by all three of the men present on their epic crossing of South\nGeorgia; it is right at the end of our reading for Tuesday. We can talk about this passage\nin Worsley; in The Wasteland, this passage about the phantasmal extra companion occurs\nin the poem's last section, as we finally approach the \"empty chapel\" that might hold the\nGrail or something like it - in essence, an object with power to catalyse healing and\nrenewal. As the notes helpfully explain, Eliot is weaving together the Grail legend,\ncontemporary history, and the story of the disciples' journey to Emmaus in the Gospel of\nLuke, chapter 24 (the reference is hyperlinked in the notes, and it's worth looking at). In\nany case, in terms of the poem's narrative as in Worsley, the invisible \"third\" or \"fourth\"\nperson on the journey appears as the goal of the journey draws near, and as the travellers'\npractical and spiritual resources hover close to exhaustion."
    },
    {
      "category": "Resource",
      "title": "Reading The Wasteland",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/8b2ef88a34d45de34ca17b6ab7748c50_thewasteland_3.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nWere there more time, I would lay some of this out in class. But since we will be zipping\nthrough this important and difficult poem very briskly, this handout is meant to orient you\nand lay the groundwork for discussion.\nHow to read it.\nThere are two ways to read this poem: as a kind of crossword/puzzle/challenge (looking\nup all the allusions, translations from foreign languages, and struggling to \"decode\" its\ndifficulty) or as something like a piece of music, to be (in the first instance) heard, and\nthen responded to intuitively. I recommend trying the second way first, and then going\nback for the footnotes. You won't \"get\" all the allusions, and it isn't necessary to get\nthem, but the footnotes should give you a general sense of the texts and (sometimes)\nstories that are being evoked.\nA few words of context. This poem was, you'll notice, published in 1922 - a few years\nafter Shackleton's voyage in the Endurance, and also only a few years after the end of\nWorld War I. A change in sensibility is evident: no waving of a flag given by the King\nwill suffice to \"buck up\" the wasted cityscape of Eliot's poem. The absence of coherent,\nnatural characters and of a conventional storyline gives an aesthetic form to the (widely\nshared) sense that, somewhere in those intervening years, things fell apart in a pretty\ndecisive way. Eliot's response is not only to represent this fragmentation in the\nfragmented form of his poem; in announcing the Grail legend -- and the fertility rituals\nand myths underlying it - as the real \"meaning\" of the poem, he reaches outside a\nmodern, European culture he sees as broken and quarries the \"primitive cultures\" studied\nby anthropologists for a more stable and enduring pattern of meanings. That pattern is,\nessentially, the archetypal narrative of the journey or quest.\nI'll say a few more framing things below, but before continuing at this general level, I'd\nlike to get started with a representative outline of what's going on in section I, to help\neveryone find their footing in the poem.\nThe Wasteland, section 1: a guided tour.\nIn this section, like others, we hear a number of different voices and languages, none\nexplicitly identified with a character or source: the effect is something like what you hear\nwhen you scan through different frequencies on the radio (an aural experience that would\nhave seemed very modern in 1922). Eliot - like Phillips - works by juxtaposing pieces\nof text without giving us the connecting tissue between them. But a little digging makes\nthe thematic connections between this fragments pretty apparent. Check it out; we'll talk\nabout this section briefly in class before heading towards the end of the poem.\n- Lines 1-7: \"We\" (all of us) are in a dead land, where the possibility of renewal,\nof getting up and trying again, seems less appealing than forgetfulness, sleep, and\ngiving up. (A bit reminiscent of Cherry in the Antarctic!).\n\n- Lines 8-18: \"Marie\" seems to be a Central European aristocrat (her cousin is an\nAustro-Hungarian archduke), a cosmopolitan of somewhat uncertain nationality; she\nleads a life of leisure and privilege, yet is still insomniac (she stays awake all night\nreading), only feels \"free\" in the mountains, and migrates with the seasons, an\nexpensive form of homelessness. You will remember that World War I began with the\nassassination of one of \"Marie's\" presumptive relatives, the Archduke Ferdinand. The\njuxtaposition of this voice with those around it connects the particular \"deadness\" of\nThe Wasteland's setting to the cultural and historical setting of early twentieth-century\nEurope, one of whose features was an intermarried, cosmopolitan aristocracy - the heirs\nof several much decayed but still lingering empires - that still played a key role in\nnational rule. The existence and influence of this international aristocracy helps to\nmake intelligible (along with many other factors) the precipitation of \"world war\" by\nthe murder of a wealthy Austrian archduke in Sarajevo.\n- Lines 19-30: A prophetic voice, with echoes of Isaiah, Ezekiel and Ecclesiastes.\nAgain, \"we\" are in a wasteland, but this voice that speaks from beyond our knowledge\ncan reveal to us not the coming of the Messiah, but only the \"secret\" of our fear and\nmortality. The world is \"stony rubbish,\" and we are \"a handful of dust\".\n- Lines 31-34: a quotation from Act I of the opera Tristan und Isolde. Isolde is at\nsea, and hears a sailor sing this song of longing: a fresh wind blows, seeming to\npromise something - and yet the wind does not bring the beloved's ship home. (In the\nstory, the ship is taking her to marry King Mark of Cornwall, but she will soon fall\npassionately in love with his nephew Tristan. In act II of the opera, they become lovers,\nare discovered, and Tristan is wounded in a duel). Tristan, by the way, was a knight of\nKing Arthur's Round Table, connecting this story to one verson of the Grail Legend (as\na quest set for King Arthur's knights).\n- Lines 35-41: this lyrical memory of a girl given flowers (\"Your arms full, and\nyour hair wet\") contrasts with the dry and empty landscape of lines 19-30; yet what the\nspeaker remembers is his inability to say the right words to her, to seize the moment -\nhe \"failed\" somehow to capture this brief glimpse of other possibilities that seem fertile,\nerotic, beautiful.\n- Line 42: Tristan und Isolde again; now we are in Act III, and the wounded\nTristan is at his castle in Brittany, waiting for Isolde's ship to come - and yet as he\nlooks out to sea, he sees only \"desolate and empty\" waves - she is not there.\n- Lines 43-59: Madame Sosostris is a more modern prophet; she tells fortunes\nusing the Tarot cards. In contrast to the grand and frightening voice we heard in 19-30,\nshe is a bit seedy (not to mention ill) - and her horoscopes are illegal. She might be a\nfraud - or is that voices and authorities from outside the modern cityscape have now\nbeen made illegal and driven underground? (The figures in the horoscope she draws\nwill recur later in the poem).\n\n- Lines 60-68: the quotation at lines 63-64 is from Dante's Inferno: he is\ndescribing the crowds of damned souls in hell. These lines are seamlessly integrated\ninto a closely and accurately observed description of morning rush hour in the City, the\nold part of London where banks and financial businesses are located. These are places\nyou could find on a map or visit on an urban walking tour, but the real landscape and\nthe phantasmal, imaginary landscape of hell merge in Eliot's description. As the lines\nat the entrance to Dante's hell read: \"Abandon hope, all ye who enter here.\"\n- Lines 69-76: \"Mylae\" was a naval battle during the first war between Rome and\nCarthage, 260 BCE. Eliot is again collapsing the modern urban scene with another\nplace and time, bending the rules of nature. Most significantly, these lines imagine the\npossibility of new growth, renewal, or rebirth as deeply disturbing (don't let that corpse\nbloom or get dug up!), taking us back to the poem's opening lines. In section 1, \"we\"\n(and the last lines insist that \"we readers\" are not only an audience, but are also\nimplicated in this problematic) are caught between the emptiness and desolation of\nmodern urban life, and fear of what any possible change might look like or might\ndemand from us. (When Isolde does finally arrive in Wagner's opera, Tristan tears off\nhis bandages and dies).\nThe Wasteland and travel writing\nWhat else, besides its quest structure, makes The Wasteland an appropriate reading for\nthis class? I was, of course, tempted by the Shackleton reference, which we'll talk about\n- but there is more. Eliot had initially wanted the poem's epigraph to be a phrase from\nJoseph Conrad's Heart of Darkness, his searing novel of a journey up the Congo River on\na route brutally opened by Stanley only a few years earlier. (You'll remember that we\nread Conrad's essay on explorers in September). A few allusions to Conrad's novel are\nstill woven into the poem, as traces of Eliot's preoccupation with it. More than that,\nthough, both the poem and its writer exemplify an especially modern (or, Modernist)\nvariant of travel. Eliot was born in America, but moved to England and took English\ncitizenship; this voluntary exile resembles that of his contemporaries James Joyce\n(Ulysses) and Samuel Beckett (Waiting for Godot), both Irishmen who spent much of\ntheir writing lives in Paris, as well as that of many writers in the present who have left\nformer colonies to live and work in metropolitan centres like London, Paris, and New\nYork. Boston alone has a number of illustrious examples -- Seamus Heaney (Ireland),\nDerek Walcott (St. Lucia), Jamaica Kincaid (Antigua) -- a few other well-known names\nmight be V.S. Naipaul (Trinidad), Salman Rushdie (India), Michael Ondaatje (Sri\nLanka)... you get the idea.\nThe two key terms for Eliot's life are exile and cosmopolitanism. He is cosmopolitan in\nthe sense that he is working not so much in a tradition of American poetry or even\nAnglophone poetry, but appropriating the entire Western European literary tradition.\n(You can try counting the number of languages in the poem). Although he is obviously a\nhuge nerd with respect to literature, he is not only a nerd - in the poem, we hear the\nvoices of elite speakers and of canonical literary and musical texts (Shakespeare, Wagner,\nDante, etc.) but we also hear the voices of lower-class women drinking in pubs, of\n\nsecretaries eating from cans in one-room apartments, of travelling salesmen looking for a\nquick gay weekend in a hotel near the train station.\nWith all these languages and all these sociolects (the ways different social groups speak a\ncommon language), Eliot is taking us on a kind of tour of his historical moment and\ncultural location. Not only the findings but the method of anthropology have marked this\npoem, which is made up of closely observed and recorded voices - in all their variety --\nas much as of literary allusions. He is also, of course, paying careful attention to the\nmap of Greater London.\nShackleton and the \"fourth man\".\nIn a footnote to The Wasteland l. 360, Eliot identifies the passage beginning \"Who is the\nthird who walks always beside you?\" as an allusion to Shackleton's expedition. He is\nrecalling a phenomenon described by Worsley (and by Shackleton in his own book) as\nhaving been experienced by all three of the men present on their epic crossing of South\nGeorgia; it is right at the end of our reading for Tuesday. We can talk about this passage\nin Worsley; in The Wasteland, this passage about the phantasmal extra companion occurs\nin the poem's last section, as we finally approach the \"empty chapel\" that might hold the\nGrail or something like it - in essence, an object with power to catalyse healing and\nrenewal. As the notes helpfully explain, Eliot is weaving together the Grail legend,\ncontemporary history, and the story of the disciples' journey to Emmaus in the Gospel of\nLuke, chapter 24 (the reference is hyperlinked in the notes, and it's worth looking at). In\nany case, in terms of the poem's narrative as in Worsley, the invisible \"third\" or \"fourth\"\nperson on the journey appears as the goal of the journey draws near, and as the travellers'\npractical and spiritual resources hover close to exhaustion."
    },
    {
      "category": "Resource",
      "title": "Reading The Wasteland",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/e77f6bc32b2dce0076dc9f0cf0d8894f_thewasteland_4.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nWere there more time, I would lay some of this out in class. But since we will be zipping\nthrough this important and difficult poem very briskly, this handout is meant to orient you\nand lay the groundwork for discussion.\nHow to read it.\nThere are two ways to read this poem: as a kind of crossword/puzzle/challenge (looking\nup all the allusions, translations from foreign languages, and struggling to \"decode\" its\ndifficulty) or as something like a piece of music, to be (in the first instance) heard, and\nthen responded to intuitively. I recommend trying the second way first, and then going\nback for the footnotes. You won't \"get\" all the allusions, and it isn't necessary to get\nthem, but the footnotes should give you a general sense of the texts and (sometimes)\nstories that are being evoked.\nA few words of context. This poem was, you'll notice, published in 1922 - a few years\nafter Shackleton's voyage in the Endurance, and also only a few years after the end of\nWorld War I. A change in sensibility is evident: no waving of a flag given by the King\nwill suffice to \"buck up\" the wasted cityscape of Eliot's poem. The absence of coherent,\nnatural characters and of a conventional storyline gives an aesthetic form to the (widely\nshared) sense that, somewhere in those intervening years, things fell apart in a pretty\ndecisive way. Eliot's response is not only to represent this fragmentation in the\nfragmented form of his poem; in announcing the Grail legend -- and the fertility rituals\nand myths underlying it - as the real \"meaning\" of the poem, he reaches outside a\nmodern, European culture he sees as broken and quarries the \"primitive cultures\" studied\nby anthropologists for a more stable and enduring pattern of meanings. That pattern is,\nessentially, the archetypal narrative of the journey or quest.\nI'll say a few more framing things below, but before continuing at this general level, I'd\nlike to get started with a representative outline of what's going on in section I, to help\neveryone find their footing in the poem.\nThe Wasteland, section 1: a guided tour.\nIn this section, like others, we hear a number of different voices and languages, none\nexplicitly identified with a character or source: the effect is something like what you hear\nwhen you scan through different frequencies on the radio (an aural experience that would\nhave seemed very modern in 1922). Eliot - like Phillips - works by juxtaposing pieces\nof text without giving us the connecting tissue between them. But a little digging makes\nthe thematic connections between this fragments pretty apparent. Check it out; we'll talk\nabout this section briefly in class before heading towards the end of the poem.\n- Lines 1-7: \"We\" (all of us) are in a dead land, where the possibility of renewal,\nof getting up and trying again, seems less appealing than forgetfulness, sleep, and\ngiving up. (A bit reminiscent of Cherry in the Antarctic!).\n\n- Lines 8-18: \"Marie\" seems to be a Central European aristocrat (her cousin is an\nAustro-Hungarian archduke), a cosmopolitan of somewhat uncertain nationality; she\nleads a life of leisure and privilege, yet is still insomniac (she stays awake all night\nreading), only feels \"free\" in the mountains, and migrates with the seasons, an\nexpensive form of homelessness. You will remember that World War I began with the\nassassination of one of \"Marie's\" presumptive relatives, the Archduke Ferdinand. The\njuxtaposition of this voice with those around it connects the particular \"deadness\" of\nThe Wasteland's setting to the cultural and historical setting of early twentieth-century\nEurope, one of whose features was an intermarried, cosmopolitan aristocracy - the heirs\nof several much decayed but still lingering empires - that still played a key role in\nnational rule. The existence and influence of this international aristocracy helps to\nmake intelligible (along with many other factors) the precipitation of \"world war\" by\nthe murder of a wealthy Austrian archduke in Sarajevo.\n- Lines 19-30: A prophetic voice, with echoes of Isaiah, Ezekiel and Ecclesiastes.\nAgain, \"we\" are in a wasteland, but this voice that speaks from beyond our knowledge\ncan reveal to us not the coming of the Messiah, but only the \"secret\" of our fear and\nmortality. The world is \"stony rubbish,\" and we are \"a handful of dust\".\n- Lines 31-34: a quotation from Act I of the opera Tristan und Isolde. Isolde is at\nsea, and hears a sailor sing this song of longing: a fresh wind blows, seeming to\npromise something - and yet the wind does not bring the beloved's ship home. (In the\nstory, the ship is taking her to marry King Mark of Cornwall, but she will soon fall\npassionately in love with his nephew Tristan. In act II of the opera, they become lovers,\nare discovered, and Tristan is wounded in a duel). Tristan, by the way, was a knight of\nKing Arthur's Round Table, connecting this story to one verson of the Grail Legend (as\na quest set for King Arthur's knights).\n- Lines 35-41: this lyrical memory of a girl given flowers (\"Your arms full, and\nyour hair wet\") contrasts with the dry and empty landscape of lines 19-30; yet what the\nspeaker remembers is his inability to say the right words to her, to seize the moment -\nhe \"failed\" somehow to capture this brief glimpse of other possibilities that seem fertile,\nerotic, beautiful.\n- Line 42: Tristan und Isolde again; now we are in Act III, and the wounded\nTristan is at his castle in Brittany, waiting for Isolde's ship to come - and yet as he\nlooks out to sea, he sees only \"desolate and empty\" waves - she is not there.\n- Lines 43-59: Madame Sosostris is a more modern prophet; she tells fortunes\nusing the Tarot cards. In contrast to the grand and frightening voice we heard in 19-30,\nshe is a bit seedy (not to mention ill) - and her horoscopes are illegal. She might be a\nfraud - or is that voices and authorities from outside the modern cityscape have now\nbeen made illegal and driven underground? (The figures in the horoscope she draws\nwill recur later in the poem).\n\n- Lines 60-68: the quotation at lines 63-64 is from Dante's Inferno: he is\ndescribing the crowds of damned souls in hell. These lines are seamlessly integrated\ninto a closely and accurately observed description of morning rush hour in the City, the\nold part of London where banks and financial businesses are located. These are places\nyou could find on a map or visit on an urban walking tour, but the real landscape and\nthe phantasmal, imaginary landscape of hell merge in Eliot's description. As the lines\nat the entrance to Dante's hell read: \"Abandon hope, all ye who enter here.\"\n- Lines 69-76: \"Mylae\" was a naval battle during the first war between Rome and\nCarthage, 260 BCE. Eliot is again collapsing the modern urban scene with another\nplace and time, bending the rules of nature. Most significantly, these lines imagine the\npossibility of new growth, renewal, or rebirth as deeply disturbing (don't let that corpse\nbloom or get dug up!), taking us back to the poem's opening lines. In section 1, \"we\"\n(and the last lines insist that \"we readers\" are not only an audience, but are also\nimplicated in this problematic) are caught between the emptiness and desolation of\nmodern urban life, and fear of what any possible change might look like or might\ndemand from us. (When Isolde does finally arrive in Wagner's opera, Tristan tears off\nhis bandages and dies).\nThe Wasteland and travel writing\nWhat else, besides its quest structure, makes The Wasteland an appropriate reading for\nthis class? I was, of course, tempted by the Shackleton reference, which we'll talk about\n- but there is more. Eliot had initially wanted the poem's epigraph to be a phrase from\nJoseph Conrad's Heart of Darkness, his searing novel of a journey up the Congo River on\na route brutally opened by Stanley only a few years earlier. (You'll remember that we\nread Conrad's essay on explorers in September). A few allusions to Conrad's novel are\nstill woven into the poem, as traces of Eliot's preoccupation with it. More than that,\nthough, both the poem and its writer exemplify an especially modern (or, Modernist)\nvariant of travel. Eliot was born in America, but moved to England and took English\ncitizenship; this voluntary exile resembles that of his contemporaries James Joyce\n(Ulysses) and Samuel Beckett (Waiting for Godot), both Irishmen who spent much of\ntheir writing lives in Paris, as well as that of many writers in the present who have left\nformer colonies to live and work in metropolitan centres like London, Paris, and New\nYork. Boston alone has a number of illustrious examples -- Seamus Heaney (Ireland),\nDerek Walcott (St. Lucia), Jamaica Kincaid (Antigua) -- a few other well-known names\nmight be V.S. Naipaul (Trinidad), Salman Rushdie (India), Michael Ondaatje (Sri\nLanka)... you get the idea.\nThe two key terms for Eliot's life are exile and cosmopolitanism. He is cosmopolitan in\nthe sense that he is working not so much in a tradition of American poetry or even\nAnglophone poetry, but appropriating the entire Western European literary tradition.\n(You can try counting the number of languages in the poem). Although he is obviously a\nhuge nerd with respect to literature, he is not only a nerd - in the poem, we hear the\nvoices of elite speakers and of canonical literary and musical texts (Shakespeare, Wagner,\nDante, etc.) but we also hear the voices of lower-class women drinking in pubs, of\n\nsecretaries eating from cans in one-room apartments, of travelling salesmen looking for a\nquick gay weekend in a hotel near the train station.\nWith all these languages and all these sociolects (the ways different social groups speak a\ncommon language), Eliot is taking us on a kind of tour of his historical moment and\ncultural location. Not only the findings but the method of anthropology have marked this\npoem, which is made up of closely observed and recorded voices - in all their variety --\nas much as of literary allusions. He is also, of course, paying careful attention to the\nmap of Greater London.\nShackleton and the \"fourth man\".\nIn a footnote to The Wasteland l. 360, Eliot identifies the passage beginning \"Who is the\nthird who walks always beside you?\" as an allusion to Shackleton's expedition. He is\nrecalling a phenomenon described by Worsley (and by Shackleton in his own book) as\nhaving been experienced by all three of the men present on their epic crossing of South\nGeorgia; it is right at the end of our reading for Tuesday. We can talk about this passage\nin Worsley; in The Wasteland, this passage about the phantasmal extra companion occurs\nin the poem's last section, as we finally approach the \"empty chapel\" that might hold the\nGrail or something like it - in essence, an object with power to catalyse healing and\nrenewal. As the notes helpfully explain, Eliot is weaving together the Grail legend,\ncontemporary history, and the story of the disciples' journey to Emmaus in the Gospel of\nLuke, chapter 24 (the reference is hyperlinked in the notes, and it's worth looking at). In\nany case, in terms of the poem's narrative as in Worsley, the invisible \"third\" or \"fourth\"\nperson on the journey appears as the goal of the journey draws near, and as the travellers'\npractical and spiritual resources hover close to exhaustion."
    },
    {
      "category": "Resource",
      "title": "Some References to the Promised Land in the Hebrew Bible",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/acb95058cfcfdf984acb2ebe4dc88b40_pro_land_ref.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nSome references to the promised land in\nthe Hebrew Bible.\nFrom http://www.biblegateway.com/\n\nGenesis 17:7-9\n7And I will establish my covenant between me and thee and thy seed after thee in their\ngenerations for an everlasting covenant, to be a God unto thee, and to thy seed after thee.\n8And I will give unto thee, and to thy seed after thee, the land wherein thou art a stranger,\nall the land of Canaan, for an everlasting possession; and I will be their God.\n9And God said unto Abraham, Thou shalt keep my covenant therefore, thou, and thy seed\nafter thee in their generations.\n\nExodus 3:7-9\n\n7And the LORD said, I have surely seen the affliction of my people which are in Egypt,\nand have heard their cry by reason of their taskmasters; for I know their sorrows;\n8And I am come down to deliver them out of the hand of the Egyptians, and to bring\nthem up out of that land unto a good land and a large, unto a land flowing with milk and\nhoney; unto the place of the Canaanites, and the Hittites, and the Amorites, and the\nPerizzites, and the Hivites, and the Jebusites.\n9Now therefore, behold, the cry of the children of Israel is come unto me: and I have\nalso seen the oppression wherewith the Egyptians oppress them.\nCome now therefore, and I will send thee unto Pharaoh, that thou mayest bring forth my\npeople the children of Israel out of Egypt.\n\nNumbers 13\n\n1And the LORD spake unto Moses, saying,\n2Send thou men, that they may search the land of Canaan, which I give unto the children\nof Israel: of every tribe of their fathers shall ye send a man, every one a ruler among\nthem.\n...\n17And Moses sent them to spy out the land of Canaan, and said unto them, Get you up\nthis way southward, and go up into the mountain:\n18And see the land, what it is, and the people that dwelleth therein, whether they be\nstrong or weak, few or many;\n19And what the land is that they dwell in, whether it be good or bad; and what cities they\nbe that they dwell in, whether in tents, or in strong holds;\n20And what the land is, whether it be fat or lean, whether there be wood therein, or not.\nAnd be ye of good courage, and bring of the fruit of the land. Now the time was the time\nof the firstripe grapes.\n21So they went up, and searched the land from the wilderness of Zin unto Rehob, as men\ncome to Hamath.\n22And they ascended by the south, and came unto Hebron; where Ahiman, Sheshai, and\nTalmai, the children of Anak, were. (Now Hebron was built seven years before Zoan in\nEgypt.)\n23And they came unto the brook of Eshcol, and cut down from thence a branch with one\ncluster of grapes, and they bare it between two upon a staff; and they brought of the\npomegranates, and of the figs.\n24The place was called the brook Eshcol, because of the cluster of grapes which the\nchildren of Israel cut down from thence.\n25And they returned from searching of the land after forty days.\n26And they went and came to Moses, and to Aaron, and to all the congregation of the\nchildren of Israel, unto the wilderness of Paran, to Kadesh; and brought back word unto\nthem, and unto all the congregation, and shewed them the fruit of the land.\n27And they told him, and said, We came unto the land whither thou sentest us, and surely\nit floweth with milk and honey; and this is the fruit of it."
    },
    {
      "category": "Resource",
      "title": "The Atlantic Sound",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-007-world-literatures-travel-writing-fall-2008/43b44852b4c30ba4263846b4389a510d_the_atlant_sound.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n21L.007 World Literatures: Travel Writing\nFall 2008\n\nThe Atlantic Sound.\nPrologue: Atlantic Crossing.\nThe narrator crosses the Atlantic to his \"home\" in England, retracing his parents'\njourney from the West Indies to England when he was a child.\n1. Leaving Home.\n1881: John Ocansey goes to Liverpool to bring a lawsuit against Robert Hickson,\nthe merchant who has defrauded his own adopted father.\nPostscript.\n- Present: the narrator arrives in Liverpool by train and takes a tour with\nStephen.\n2. Homeward Bound.\n- Present: Mansour introduced, first as a detainee in Britain, then as the\nnarrator's driver in Accra. With some temporal back and forth, the narrator flies\nfrom Gatwick and arrives Accra. He has dinner with Mansour and they discuss\nMansour's present situation. Interview with Dr. Ben Abdallah, Ghanaian \"Pan-\nAfricanist\" with ideas about the slave trade that the narrator finds rather\nsurprising: they discuss the way history is taught in schools, and the way that\nhistorical preservation should be done. Interview with Dr. Robert Lee, African-\nAmerican dentist. He and the narrator discuss the differences in how Africans\nand African-Americans see things, and they too discuss questions of site\npreservation and memory.\nEl Mina: the Encounter.\n- This historical summary (specifically, the history of El Mina and the\ntrade associated with it) can be skipped, if you must. Basic info: the Portuguese\nbuilt a fort here from which to conduct trade in (first) gold, and later slaves.\nElmina became one of the major West Africa ports for the Atlantic slave trade.\n\nPanafest (I):\n- Present: the narrator arrives at Elmina with Mansour, his driver, for the\nfirst of three short sections focused on \"Panafest: a time when the diasporan\nfamily returns to Mother Africa to celebrate the arts, creativity and intellectual\nachievements of the Pan African world.\" One of the performances in this section\n\nis an \"official atonement ceremony.\" The end of the section looks towards the\nnext set of events, held at Cape Coast Castle.\nCape Coast: an African missionary.\n- 1741-66: Philip Quaque. This biographical section is written rather\ndifferently than the earlier narrative of Joseph Ocansey -- here, the narrator gives\nus information but we can also tell that he is reading or rereading documents that\ndon't tell him absolutely everything. Summary: Quaque was an African man\neducated in England who returned to Cape Coast as a missionary after he was\nordained. He served as chaplain to the British slavers who (by this point) were\nstaffing the castle, but met with limited success in trying to educate or convert the\nlocal African population. The narrator comments that he had forgotten his own\nlanguage, and \"never once expressed moral outrage at the indignities that were\nbeing visited upon his fellow Africans.\" If nothing else, you should read the last\ntwo paragraphs of this section with their quote from one of Quaque's last\nletters.\nPanafest (2):\n- the narrator is (still) staying at a hotel with many other foreign visitors,\nparticularly from the Caribbean, who have come for the festival. They are not\nhappy with the facilities. Pay attention to the last two paragraphs of this\nsection, at least.\n*Mansour:\n- in this section, the narrative loops back to provide Mansour's life story up\nuntil the point when he was imprisoned in Britain as an illegal immigrant. Born\nin Ghana, he has sought work and education in Nigeria, Libya, Egypt, and Saudi\nArabia before getting a student working visa for England. In England, he worked\nunder the table and taught Arabic while enrolling in several academic programs,\nand was periodically picked up by police or immigration officers or finally being\ndetained and sent back. Now he was seeking to get to the United States. The\nsection concludes by describing his situation now. The last two pages of the\nsection are especially noteworthy as they bring to ahead the narrator's growing\ndiscomfort and perhaps judgment of Mansour's life plans.\nHashuvah: The Return.\n- Present: the narrator visits a cafe at Elmina that is part of a community\nof African-American \"returnees\" led by an man named Kohain Halevi. The cafe\nis being visited by several busloads of tourists from the Americas; one of the\nbusinesses run by the community is a tool or service in the area.\n- We get a bit of background on Halevi, whose reading of the Bible \"had\nled him to believe that God would eventually lead black people in America out of\n\ntheir bondage.\" You may remember that Equiano saw many points of comparison\nbetween the African religious tradition of his childhood (whether actually\nremembered, or reported by others) and the practices of Judaism. Halevi and\nothers believe that \"Hebrew traditions... were practiced in Africa before the onset\nof the Atlantic slave trade.\" Frustrated in their attempts to settle in Israel, they\nhave settled on Africa as \"the promised land.\" Halevi's beliefs intersect with ideas\nabout the kinds of experiences visitors to the area ought to have. The section ends\nwith a narrator chatting to someone in a bar.\nPanafest (3): THIS SECTION CAN BE SKIPPED\n- back at the festival, the narrator sees a display describing a utopian\ncommunity of \"African Hebrew Israelites\" who have settled in Israel. He will\nvisit this community in the last section of the book. The hotel staff are irritated\nwith their Jamaican guests, and have decided to ask them to leave.\n*Through the Door of No Return:\nPresent: Kohain Halevi's ritual, in fort where Quaque is buried. The\nnarrator attends a ceremony, organized as part of the festival, that commemorates\nthose who were sent through the castle's \"door of no return\" and into slavery. I\nwould like to spend some time on this section.\n3. Home. THIS CAN BE SKIPPED (ca. 33 pp.).\nPresent: Phillips in Charleston. Most of the section tells a story from very\nearly in the civil rights era, about a very well-connected and socially prominent\nwhite judge who alienated his entire community by an antiracist decision in a\nvoting rights case. An additional offense was his decision to divorce his wife and\nmarry a northern woman with whom he had fallen in love; and were vocal\nsupporters of civil rights. There is a great deal of documentary detail in this\nsection, but the gist of it is that even while staying in his home, the judge's actions\nmade him effectively homeless. The narrator also visits\nSullivan's Island, the place of arrival in America for many slaves, or as he calls it,\n\"the black Ellis Island. Finally, he watches \"the Charleston Festival of African\nand Caribbean Art\" downtown, and reflects on it as an invocation of the past.\n*Epilogue: Exodus.\nThis section finds the narrator with the Hebrew Israelites, who we have\nheard described earlier. Again, he witnesses public performance. We should pay\nattention to the opening and closing pages of this section in particular to get a\nsense of where the book ends up."
    }
  ]
}