{
  "course_name": "Writing and Reading the Essay",
  "course_description": "This is a course focused on the literary genre of the essay, that wide-ranging, elastic, and currently very popular form that attracts not only nonfiction writers but also fiction writers, poets, scientists, physicians, and others to write in the form, and readers of every stripe to read it. Some say we are living in era in which the essay is enjoying a renaissance; certainly essays, both short and long, are at present easier to get published than are short stories or novels, and essays are featured regularly and prominently in the mainstream press (both magazines and newspapers) and on the New York Times bestseller books list. But the essay has a history, too, a long one, which goes back at least to the sixteenth-century French writer Montaigne, generally considered the progenitor of the form. It will be our task, and I hope our pleasure, to investigate the possibilities of the essay together this semester, both by reading and by writing.",
  "topics": [
    "Humanities",
    "Literature",
    "Academic Writing",
    "Creative Writing",
    "Nonfiction Prose",
    "Humanities",
    "Literature",
    "Academic Writing",
    "Creative Writing",
    "Nonfiction Prose"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nThis is a course focused on the literary genre of the\nessay\n, that wide-ranging, elastic, and currently very popular form that attracts not only nonfiction writers but also fiction writers, poets, scientists, physicians, and others to write in the form, and readers of every stripe to read it. Some say we are living in era in which the essay is enjoying a renaissance; certainly essays, both short and long, are at present easier to get published than are short stories or novels, and essays are featured regularly and prominently in the mainstream press (both magazines and newspapers) and on the\nNew York Times\nbestseller books list. But the essay has a history, too, a long one, which goes back at least to the sixteenth-century French writer Montaigne, generally considered the progenitor of the form. It will be our task, and I hope our pleasure, to investigate the possibilities of the essay together this semester, both by reading and by writing. We'll begin with a brief consideration of its history and then will proceed to see what some critics and practitioners of the essay have had to say about it in an effort to outline its parameters. And we will read a great many essays - classic ones by writers living and dead, as well as ones hot off the press. This reading will, I hope, inspire you in the task of writing essays of your own, which will be the central element of our work together. Writing, after all, emerges from writing - that is, we become able writers both by\nwriting\nourselves and by\nreading\nand reflecting on the writing others have done. Reading what other writers have written, along with the frequent practice of writing, is what inspires us to write and helps us have something to say.\n\nTextbooks\n\nI have ordered two anthologies of essays for the course:\n\nKlaus, Carl, Chris Anderson, and Rebecca Blevins Faery.\nIn Depth: Essayists for Our Time\n. 2nd ed. Boston, MA: Heinle, 1993. ISBN: 9780155001725.\n\nMenard, Louis, and Robert Atwan, eds.\nThe Best American Essays 2004\n. Boston, MA: Houghton Mifflin, 2004. ISBN: 9780618357093.\n\nI will frequently supplement the selections in the anthologies and handouts of other essays, as opportunity or inspiration arises. You will also need a good handbook. I've ordered:\n\nLunsford, Andrea.\nEasy Writer\n. 2nd ed. New York, NY: Bedford Books, 2001. ISBN: 0312400551.\n\nBut if you have another favorite, you're welcome to use it; just check with me first to be sure it's a good choice.\nThe Mayfield Handbook of Technical and Scientific Writing\n, written by MIT writing professors and available to you online via the Writing Center Web site, contains most of the information you will need for reference. And please do have ready access to a good dictionary.\n\nOne of the primary texts for our course will be the essays all of you write and what all of us have to say about them in workshops. Class workshops, in which we will respond to and learn from the writing done by everyone in the class, will occupy much of our class time. Your purpose in these workshops will be to support each other's work in progress by offering careful, thoughtful, and serious responses as readers, pointing out what you see as the writer's successes and offering constructive suggestions for improving the work. The essays you submit to the workshops will be understood to be work in progress; you will use the responses of readers (including me) to revise, refine, and polish your work before submitting a final version.\n\nCourse Requirements\n\nWriting successfully depends to a great degree upon your ability to\nread\nwith scrupulous care, attention, and insight. Careful reading of all assigned material, including workshop submissions by other students in the class, will be one of the foundations of your work for the course. Because the assigned essays are usually pretty short, I expect you to read them at least twice through. You will be expected to have completed all assigned reading on the day a text is discussed in class, and brief in-class writing to prepare for discussion will help you stay disciplined about getting the reading done. For workshops, you must prepare by\nreading\nthe submission carefully and\nwriting\na response to the writer. We'll discuss together how we'll do this, in online forums or in hard copy. Other occasional brief and informal in-class writing will help you stay disciplined about getting the reading done on time. In addition, as part of the Communication Intensive designation for this class, you will have opportunities to develop your oral presentation skills: you will make one major oral presentation to the class; you will be expected to take an active part in class discussion; and you will be responsible for leading class discussion of assigned reading on at least one occasion.\n\nTo help you engage more deeply with the reading you do, you will keep a\nReader's Notebook\n- a place for you to write informally to explore the reading, raise questions, follow up on implications, record your responses. Most of the notebook writing will be done outside of class, but our occasional in-class writing will also be part of your notebook. I will expect about three-quarters to a page or so of typewritten response to each essay - informal, speculative, reflective of careful reading, and written in a spirit of questioning and exploration. For further explanation of my expectations of your notebook writing, see the Reader's Notebook handout I will give you. I will collect notebooks at random, a few at a time, so please\nalways bring your notebook to class with you\n. My hope is that the notebook writing will deepen and enrich both the reading and writing you'll do in the weeks ahead.\n\nThe more public writing you will do - that is, the writing that is aimed at a public audience - will be essays that you will submit on a regular basis throughout the semester, five in all, of roughly 6-7 typewritten pages each (though one will be slightly longer). You will collect this writing, along with your Reader's Notebook, in a portfolio of at least 25 pages of revised and polished writing submitted at the end of the semester. (The portfolio is in lieu of a final examination.) You will choose submission dates from a list I will give you. I will occasionally place some constraints or requirements on your writing; within the parameters of the assignment, though, you will be free to choose what you want to write about. I will, of course, be happy to help you find a subject if you need that help. All your essays in their first incarnation will be discussed in class workshops with other members of the class, and you will receive response from me as well. You are also welcome to meet with me in conference to discuss revision possibilities in addition to the individual conferences I will initiate from time to time. You must submit a revision of each essay to me by the end of the week following your work's being discussed in workshop. I will give you additional response on your revision, which you may use to guide optional final revisions for your portfolio.\n\nAll the work you submit during the semester must be your original work, and none of it may have been submitted to meet the requirements in any other class\n. Plagiarism or re-submitting work will result in withdrawal and an F in the course.\n\nOur schedule is tight, so\nall written work must be handed in on time\n.\nNo exceptions\n, unless for real and serious emergencies, in which case you should get in touch with me at once.\nExtensions for emergencies will be granted only once per student per semester\n.\n\nYour responsibility in the class is to be not only a writer, but also a reader and responder for other members of the class community. It is essential, then, that you\nattend class faithfully and come to each class fully prepared to participate in discussions of assigned reading and in writing workshops\n.\nLateness for class, if extreme or chronic, will be counted as an absence\n. You must notify me as soon as possible when a real and serious emergency keeps you from attending class.\nMore than three unexcused absences will result in your course grade being lowered; more than five absences will result in your receiving a failing grade\n.\nMissing class on a day when your work is up for workshop discussion will count as two absences\n. So\ndon't take casual cuts\n, and\ncome to class faithfully\nand\non time\nand\nprepared to participate fully\nin class activities.\n\nI will evaluate your work by responding as carefully and thoughtfully as I can to all the writing you do for the class, but I will not grade individual pieces of writing. At the end of the semester, you will submit to me a portfolio containing all the writing you have done for the course, including at least 25 pages of revised and polished essays and your Reader's Notebook, so that I can assign you a grade for the semester. In deciding on semester grades, I will consider, most importantly, the overall quality of the written work you submit in your portfolio, but also the degree and consistency of your effort throughout the semester, the success you demonstrate in revising your work, how actively you participated in class discussion and workshops, the quality of your oral presentation and classroom contributions, and how well you served as a reader and responder for other writers in the class. The primary determinant of your grade, of course, will be the quality of your writing. I promise to let you know at once if your performance falls to the level of C or below, and I will be happy to talk with you at any time about your work and your progress in the course.\n\nAll required work\n(assignments and assigned revisions, notebook and in-class writing, reading assignments)\nmust be completed satisfactorily in order to receive a passing grade for the course\n.\n\nA friend of mine once characterized her work as a scientist as \"serious play.\" The phrase has stuck with me. \"Serious play,\" I think, should be both challenging and inviting, and it should command our enthusiasm, attention, and commitment. The phrase characterizes the spirit in which I hope we will enter into our study and practice of the essay this semester. We will work very hard together, I promise, but I hope we will enjoy ourselves too - I'm a firm believer that people learn best when they do. I'm always open to questions and suggestions; I promise to listen attentively and to treat you and your work with seriousness and respect; and I look forward to our learning from and with each other and to a pleasant and productive semester.",
  "files": [
    {
      "category": "Resource",
      "title": "antler_essay.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-735-writing-and-reading-the-essay-fall-2005/d5490d79b9114c09dd4392f25096f194_antler_essay.pdf",
      "content": "Natania Antler\nWriting and Reading the Essay\nProf. Rebecca Faery\nThe Heart of a Vampire\n\nI sit in the subway car and watch the blackness of the tunnel fly by the window. A\nface stares back at me. Pale, sallow cheeks accent red rimmed eyes and lips. With a chill\nrunning down my spine I can almost see the glint of teeth, a drop of blood on the chin...\nIt's 6:30 in the morning and I'm just starting my trip, so I am entirely justified in feeling\nvampire-ish. But as I sit, pondering my reflection, I wonder why \"vampire\" is the first\ndescription that springs to mind when I look at my tired face.\n***\nMy father is a horror movie aficionado, and on the rare event that he actually got\nme to watch one of his horror films, something like The Shining, I'd always run out of the\nroom at the first hint of monster or anything supernatural. My aversion to most horror\nfilms continues to this day, yet I will voluntarily, even enthusiastically, watch a movie\nabout vampires. I've never been able to stomach werewolves, zombies, or even axe\nmurderers and space aliens, but vampires...these undead monsters have always been fine\nby me.\nI suppose my interest in vampires was first piqued when my parents read\nBunnicula to me. This is a tale told by a family dog, Harold, who recounts the adoption of\na rabbit by the family. This rabbit, named Bunnicula, seems like nothing special, until\nvegetables, drained white, begin appearing in the fridge. Chester, the family cat, is\nconvinced that Bunnicula is a vampire, and Harold tells of the many ways in which the\ncat tries and fails to finish off the bunny. I had completely forgotten about this story until,\n\nwhile looking further into the topic of vampires, I stumbled upon a description of\nvampire watermelons. According to an article in Wikipedia, it was a superstition held by\nthe Roma people that a watermelon kept past ten days would sometimes turn into a\nvampire, complete with the appearance of blood on its skin. They weren't known to do\nmuch harm, lacking teeth, but were said to roll around growling.\nMost vampires, however, are not rolling fruit or rabbits. They are usually men or\nwomen who drink the blood of unsuspecting folk; the effects of this blood draining range\nfrom serious injury, to death, to becoming a vampire oneself. The tales of vampires\nclosest to our current definition originated in Eastern Europe, but vampires have popped\nup all over the world in myths dating back as far as Babylonia. As time passes vampires\nevolve and change with the societies that recount their existence. Vampires as we know\nthem now were popularized in Western consciousness most notably by Bram Stoker's\nnovel, Dracula, published in 1897. Stoker loosely based his character on a historical\nCount Dracula, Vlad (the Impaler) Tepes, who was a particularly brutal and bloodthirsty\nprince from Wallachia (now in Romania) in the 1400s. But this is where it gets\ninteresting: in the novel, the historical Dracula, a brutal Turk-fighting national hero, is\nswitched to a cultured Transylvanian nobleman who likes to drink blood. As the real\nVlad is changed for Stoker's novel, so vampires have evolved in nature since their\nconception. Folkloric vampires were often the angry or cursed spirits of deceased\npeasants come back to prey on the living, usually their own family. Modern vampires, on\nthe other hand, are much more complicated. While they can roam freely from their\nhomelands, they also have a number of rules governing their behavior. It is unclear how\nthese vampires become vampires, because it changes from story to story, but many were\n\nhuman once. The important thing about modern vampires is that they've stepped out of\nfolklore to a place in society anchored in literature and other such permanent media. This\nhasn't homogenized vampires; in fact, it has had the opposite consequence: vampires are\nnow more diverse and widespread than ever.\nOur Western culture, me included, seems to have become captivated, if not\nobsessed, by vampires, judging from the amount of entertainment featuring these blood-\nsucking creatures. Are vampires nothing special as monsters are concerned because as\nhumans we like to create beings that embody our current fears, or is there something else\nabout vampires that makes them so popular? I'd posit that they are indeed unique\nmonsters. As a society, even as we fear vampires, we are also strangely attracted to them.\nWe like vampires in spite of ourselves. We portray vampires as beautiful, smart and\npowerful creatures, even though their definition--the thing that unites all variations on\nthe vampire myth--is that they drink blood, which is ultimately harming some victim.\nVampires, especially when they are portrayed as sentient beings and not mindless hordes,\nshould be the very definition of evil, yet we can't get enough of them!\nI like vampires in part because they have always seemed intelligent to me. Unlike\nwerewolves, vampires must often use cunning and charm to get at their prey, rather than\nbrute force. How else would they be invited into a dwelling? While this invitation\nrequirement may be relatively new to vampire lore, older legends suggest that vampires\nhad an obsession with counting, almost to the point of obsessive compulsion. According\nto Wikipedia, seeds were left by the graves of suspected vampires in Eastern Europe to\nkeep them occupied with counting through the night, and in China bags of rice were also\nsupposed to stop vampires in their tracks. While this trait of vampires has largely died out\n\nin modern lore, we still have Sesame Street's Count von Count! Isn't obsessive\ncompulsive behavior and affinity for numbers often associated with intelligence?\nVampires are in fact scarily similar to your stereotypical college nerd. Smart, thin and\npale, only coming out at night....here the similarities end, and I dart my eyes around the\nroom, before admitting that I brought my vampire cloak with me to college in the hopes\nof wearing it for Halloween.\nI'd like to say that I'm attracted to vampires only because they're smart, but to be\nhonest I'd have to admit that some of them are also rather handsome. Even though\nvampires were not supposed to be notably attractive in the Eastern European tradition,\nthey looked well-fed, and were often dark-skinned, certainly in contrast to their\nmalnourished prey. Ever since The Vampyre, a short novel published in 1819 by John\nWilliam Polidori, contained as its protagonist Lord Ruthven, a philandering, undead, and\nattractive aristocrat, we've seen sexually irresistible and wealthy vampires throughout\nmodern fiction. While Dracula isn't described in Stoker's novel as particularly beautiful,\nhe is certainly striking, and has a penchant for preying on young and beautiful women.\nMina Harker, another female character in the Dracula novel, is discovered being given a\n\"baptism in blood\" from Dracula himself:\nWith his left hand he held both Mrs Harker's hands, keeping them away with her\narms at full tension; his right hand gripped her by the back of the neck, forcing\nher face down on his bosom. Her white nightdress was smeared with blood, and a\nthin stream trickled down the man's bare breast, which was shown by his torn\nopen dress.\n\nWhen I first read this passage a few years ago I thought it sounded more than a bit kinky,\nand all that I've read since then confirms this notion. In fact, Dracula has at its heart a\nclear commentary on gender roles and sexuality. Here's a passage towards the beginning\n\nof the book in which Jonathan Harker meets \"the weird sisters,\" Dracula's kin: \"All three\nhad brilliant white teeth, that shone like pearls against the ruby of their voluptuous lips.\nThere was something about them that made me uneasy, some longing and at the same\ntime some deadly fear.\" As one sister is about to bite Harker says, \"I closed my eyes in a\nlanguorous ecstasy and waited--waited with beating heart.\" Carol Senf, in her book\nDracula: A Reader's Companion, says that Stoker is making a commentary on the new\nwomen in Victorian society. He feels threatened by sexually forward women (although\nnot necessarily smart and technically capable women like the heroine Mina), thus has\nturned them into vampires. Dracula symbolizes foreign sexuality, something threatening\nin the Victorian era, and has often been interpreted to be homosexual. I'm not sure about\nthat last interpretation, but I do think that Senf has a point when she says this about the\nend of the 19th century when Dracula was written: \"During a period so concerned with\nthe connection between sexuality and crime, it would have been easy to associate almost\nany kind of sexuality with the monstrous Other, the vampire.\"\nPerhaps the unnatural beauty and sex appeal of vampires have at their roots\nsomething to do with religion. After all, in Slavic folklore a person could become a\nvampire after being excommunicated or buried improperly. In fact, much of the\ndevelopment of the vampire legend was influenced by the schism between the Orthodox\nand Roman churches in Eastern Europe. In the Orthodox tradition, an uncorrupted body\nwas a vampire; in the Roman tradition, it was a saint. Religious undertones persist in\nvampire fiction to this day, most notably in that vampires can be warded off by various\nholy objects. A handsome or beautiful vampire is now synonymous with an evil tempter\nor temptress. But perhaps as the dominance of religion, or at least \"morality\" in the\n\nVictorian sense, has subsided a bit recently in our culture, so it has in vampire stories.\nWe've become more open to admitting that we think vampires can be sexy and\nsympathetic, just as we're more open to displaying our own sexuality. In her essay on the\nsexual aspects of the treatment of vampires in fiction, Margaret Carter paraphrases Carol\nSenf, who, \"has pointed out that the very qualities that make the traditional vampire a\nthreat in nineteenth-century stories such as Carmilla and Dracula -- particularly his or her\nerotic power and unconventional behavior -- make the vampire appealing to twentieth-\ncentury readers.\"\nEven Brad Pitt, Tom Cruise and Antonio Banderas combined in the movie\nInterview with the Vampire might not have convinced me that vampires could be sexy\nuntil I read a fantasy book on the subject, which soon became one of my favorites.\nSunshine is about a young woman who through a serious of complicated circumstances\nrescues, befriends, and then even starts to fall in love with a vampire. This vampire, to his\ncredit, stops preying on humans for the most part--and this may help with his potential\nfor attractiveness--but still he remains a vampire. Had I not read this book, I probably\nwould have continued blissfully watching vampire movies without a second thought as to\nwhy I like them, but now the reason has been made painfully clear. The good qualities of\nvampires are not immediately obvious, but once you start looking for them they pop up\neverywhere. I think that Nina Auerbach, in the introduction to her book, Our Vampires,\nOurselves puts it well when she says this,\n\nTo the jaded eye, all vampires seem alike, but they are wonderful in their\nversatility. Some come to life in moonlight, others are killed by the sun; some\npierce with their eyes, others with fangs; some are reactionary, others are rebels;\nbut all are disturbingly close to the mortals they prey on.\n\nAs a society we're in a rocky romance with vampires. We create and destroy rules for\ntheir behavior, often we fall in love with them, sometimes we scorn them, killing them\noff in droves, but always we remain captivated. Vampires certainly embody our fears, but\nabove all our secret desires and our dark sides. Next Halloween, as I don a luxurious\nblack velvet cloak with red satin lining, a skimpy black tank top and pants, and some\nabnormally sharp teeth, I will be glad, but perhaps still slightly disappointed, that the chill\nin the autumn air is a completely natural occurrence and not emanating from my pale\noutstretched hand.\n\nNote:\nThe texts cited and used in the preparation of this essay include Nina Auerbach's Our\nVampires Ourselves, University of Chicago Press, 1995; Margaret L. Carter's Lust, Love,\nand the Literary Vampire online in Strange Horizons, 2002, at\nhttp://www.strangehorizons.com/2002/20020722/vampire.shtml;\nBram Stoker's Dracula, Oxford Univeristy Press, with introduction by Maud Ellmann,\n1996; Carol Senf's Dracula: A Reader's Companion, Twayne Publishers, 1998; and\narticles from Wikipedia Online, \"Dracula,\" \"Vampire,\" \"Vampire Fiction,\" Vampire\nMelons.\""
    },
    {
      "category": "Resource",
      "title": "bring_armageddon.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-735-writing-and-reading-the-essay-fall-2005/a7ecacdbae8819bdfe42f3f1c2ebbb51_bring_armageddon.pdf",
      "content": "An MIT student\nRebecca Faery\nRecitation 1\nReading and Writing the Essay\n\nBringing Armageddon\n\nMost recently, I have come to think of writing sensually. I love the sounds of\nEnglish, flowing and rolling and yet distinct, this language with the word \"quire\"\ndescribing the thickness of Roget's Thesaurus and sounding like \"choir\" for a group of\npeople singing. I love the smell of pens, the crisp brittleness of the pages of a dictionary\nor the Bible, the sometimes overwhelming whiteness of a blank sheet of college-ruled\npaper. And maybe I am stuck in the \"oral phase;\" I love how the metal end of an old-\nfashioned number two pencil - the part that holds in the eraser - rests smooth and cold\nagainst my bottom lip while I think of what to say next.\n\nDuring high school, writing was study. Pages shot out of my inkjet in the fall like\nso many dried up leaves. I swept them off of the floor into my folders and disposed of\nthem properly at school. My writing developed two seasons like Georgia's: summer,\nwhen the weather and my prose would be warmer, and the colder part of the year,\nOctober through March, when writing for school was mainly formal and academic. In\nhigh school, I learned what disciplined, standard, correct English writing looks like, and\nwhy I prefer a strong voice and style when the two conflict. To be fair, before high\nschool, I ranked among the therapeutic writers, taking refuge in a journal when the\noutside world seemed too harsh. I escaped from fights with my mother or frustration\nwith school work into notebooks.\n\nIt seems my writing began this way, in discontent. My oldest extant work is a\nshort Christmas story called \"The Littlest Elf,\" circa late first grade. Santa's smallest elf,\nmore competent than those around her, feels isolated from her peers; she resembles my\nfive year old self physically as well. I differed from other students in grade school: I\nspent all my free time reading; I spoke in larger words; I didn't pay attention to what I\nwore until sixth grade. And I wrote profusely without ever truly mastering cursive script.\nThat, in reverse chronological order, is the history of my writing, that I have always loved\nit, and in short, that I have wanted to be a writer for as long as I can remember.\nIt may seem odd then that, excepting the first few months after his death, I don't\nremember ever wanting to have my father back. This may be partially because I cannot\nremember having him in the first place. But let me start at the end again. My father took\nhis life when I was five years old. Alright. Now for the beginning.\n\nKingston Eric Lisk was born in what I imagine to be a small town in Illinois to an\nalcoholic man and his quarrelsome second wife. He had many siblings and half siblings\nbut excelled among them by going to college, where he obtained a studied business and\npre-law, and then to law school, where he met and married my mother. By all accounts\n(or by my mother's, the only one that I have heard), Kingston was intelligent, funny,\nhandsome, slightly overenthusiastic about the SpaceQuest series of computer games, and\n- here's the kicker - alcoholic. Laura, my mother's best friend from college her maid of\nhonor, told my mom she \"didn't have to go through with\" my parent's wedding.\nMy mother declined Laura's advice, entering into a two and a half year marriage\nthat would leave her bankrupt and alone raising an infant daughter. To be fair again,\n\nthough, she emerged with her juris doctor and a position as an attorney in the Navy. My\nfather met the official, legal end of their marriage with much less: no steady job, no\ndegree, and no recollection of what he did most nights. He had gained during the\nmarriage, too, however; by the time my parents actually divorced, Kingston had two extra\nchildren and a common law second wife. The years of Kingston's life between his\ndivorce from my mother and his suicide are a mystery to me; I cannot imagine that they\nwent well. In any case, his actions of April 1991 brought new elements into my life, as\nwell: I went with my mom to Florida, though we missed Kingston's funeral; I went with\nmy mom to the Navy base's Father's Day Picnic, though I missed strong dad-arms\nwheelbarrow racing me across the field; and I went with my mom to therapy, which\ninvolved a lot of writing and was completely satisfactory.\n\nI went a long time without being angry at my father for the awkwardness of\nsimple things, friends asking \"where is your dad;\" drawing pictures of a two-person, one-\ndog family for class. I felt him as a negative presence, benevolent and watching over me.\nI got angry at Kingston when my mother finally decided seven years later that I was old\nenough to know he'd committed suicide, at which point in time I also got very angry at\nMom. The revelation did make for months, if not years, of easy writing.\nHow, I wondered, and explored again and again in journal entries, how could my\nmother marry an alcoholic man, my mother, who held everything in my life together over\nten years and five states? How could she blind herself to what a horrible person my\nfather must have been? How could she hide his horribleness from me? Then there were\nquestions about my father, namely, how could he have been that horrible; how could his\n\nlife have been so horrible that he had to end it? The most disturbing, looking back, are\nthe questions I wrote down about me: \"what did I do to make my father's life miserable?\nWhat could I have done to stop him?\" Even at twelve I recognized that I had been too\nyoung to actively help my father. \"What does it mean,\" I wrote once, \"that I come from a\nperson who could do this to himself and his family?\" And the underlying question there\nwas, am I like him?\nThis question became a subconscious driving force for decisions I made. My\nfather dropped of school; I would work hard for good grades. My father couldn't keep a\njob; I would be a leader in many clubs. My father lost all of his and my mother's money;\nI would save allowance for college starting in seventh grade. My father was an alcoholic;\nI would never drink alcohol or try any other kind of drug. My father didn't have strong\nties to the world; I would invest deeply in making a few close friends. My father failed at\nliving; I would not be like him.\n\nAbout three years ago, I attended the Sewanee Young Writers' Conference in\nTennessee. As a member of the fiction section of the two-week program, I was tasked\nwith writing a ten-page short story. The conference expected me to string more words\ntogether than I had ever attempted to use in one piece before. I called home and\nmentioned the problem to Mom. Did she have any ideas? Yes; she had been going\nthrough some old files and found a story my dad wrote back in law school. She hadn't\nread it, she said, but maybe it would provide some inspiration. Did I want her to fax it?\n\"Sure, I guess.\" It was odd because we never talked about my father. We still\ndon't. I asked one of the Conference staff how I could get a fax and called Mom back\n\nwith the number. We had breached the subject of my father that day, and I the air felt\nthick on my side of the phone. Yes, I was eating well, I assured her. Yes, she told me,\nthe cats and dogs were doing fine, but they missed me.\n\nThe fax came later that day, and I had my first real communication with my\nfather. His short story, actually a forty-page novella called Bringing Armageddon,\ndepicted a general on his deathbed. The man had led well in war, not brilliantly, but very\nwell, and in a renewed conflict after some years of peace, heavy armaments were being\nused to attack the enemy based on his wartime policy suggestions. The U.S. was about to\ndeploy a bomb that would lead to near complete destruction, if not initially then trough\nother countries' retaliations. As the general, now an old man contemplated his service in\nbattle, he realized that he had been wrong all of his life and that his decisions were\nbringing about the end of the world, bringing Armageddon. In his last moments, the\ngeneral struggled to get word to officials that what they were doing, what he had been\ndoing his whole life, was wrong, but he died before contacting anyone. And his death\nwas not a noble death; his revelation had come too late to bring redemption.\nForty pages of typewritten text, twice read in the span of two hours, told me more\nabout my father than years of questioning myself and strained hours of questioning my\nmother ever had. The amazing thing was that, more than being all too apt a metaphor for\nwhat I now imagine happened to my father, at least in his mind, near the end of his life,\nthe writing was good. Not brilliant, but immensely better than I expected from the one-\ndimensional image of my father I'd carried around for so many years.\n\nWhen I got home from the Young Writer's Conference, I found the box my mom\nhad been going through in the garage, and inside, a journal of my father's. Interspersed\namong the secret maneuvers for computer games comprising the majority of the notebook\nwere ideas for short stories, character sketches, notes from some lectures for a class. My\nfather, I realized as I read, had been intelligent; funny; sure, I could believe handsome;\nand hugely overenthusiastic about SpaceQuest. He wasn't just an alcoholic, and I wasn't\njust an alcoholic's daughter. Far from the confirmation I expected I needed, that I was\nnot like my father and would not become him, I found out that my father was like me. I\nhad been wrong to deny him all those years. Mom asked me a little later if the fax had\nbeen any help; she had since read my story from the conference and my father's novella\nand didn't see a direction connection. Did I know, Mom asked, that my father always\nwanted to be a writer - on the side, of course?\nI had gathered that from his story. I watched my mom for a minute, then shook\nmy head and smiled. \"Yeah, the story helped a lot. Thank you.\""
    },
    {
      "category": "Resource",
      "title": "campbell_samatha.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-735-writing-and-reading-the-essay-fall-2005/f27b208e06fb9aace926ad0f4091672f_campbell_samatha.pdf",
      "content": "Samantha Weiss\n\nNovember 4, 2005\nTurning Myth into Meaning\n\nThe final project of my literature class was supposed to be based on a work of\nfiction: I chose the Bible. I was a freshman in high school then, and I so offended my\ninstructor that I was asked by the administration to write her a formal apology and redo my\nproject. It was not my intention to offend, but I cannot pretend the irreverence did not\nappeal to me.\n\nMany of my high school classmates were devoutly Catholic. When our history\nclass studied how politics have shaped Christianity, a few students found the lesson to be\nso offensive that they turned their backs on the teacher before it even started and flatly\nrefused to participate. Heated conversation followed. As an atheist of Judaic ethnicity, I\nhad no emotional stake in the debate; for me the discussion was purely intellectual.\nPerhaps for that reason, my classmates, even some of my closest friends, were resentful of\nmy participation. Though I am usually at ease in class, that afternoon, I felt\nuncomfortable. When I did speak, which was hardly at all, I sensed a vocal majority ready\nto dispute my words before they even left my lips. I was not paranoid; I think a mob\nmentality developed, a Christians-against-the-world mind-set. For as long as I can\nremember, discourse about religion has made me resentful because of that sort of attitude.\n\nI see now that the repression I experienced as an atheist in that history class\nmotivated my book report on the Bible. For weeks I pored through the parts of the Bible\nrelevant to my project. I carried the thick, leather-bound volume with me everywhere. It\ntraveled with me from to class to class and home each night. I think my classmates were\ntaken aback; my parents were deeply uncomfortable. Religion was taboo at home as my\n\nparents, in an effort not to influence their children's religious beliefs, refused to speak of\ntheir own convictions. Yet I was adamant about continuing my project. At the end of those\nfew weeks I realized that despite their years of CCD and churchgoing, I knew more than\nany of my classmates about what was actually written in their Book. No one harassed me\nabout religion again.\n\nI was uncomfortably aware that my attitude toward religion was conflicting,\nperhaps even hypocritical. I cannot believe in a sentient being that is \"God.\" Yet, for\nreasons I failed to comprehend, my appetite for biblical knowledge became insatiable.\nReligion became increasingly important to me, almost an obsession. Before long I was\nseeing Judeo-Christian motifs everywhere. In the literature I read, I found subtle\nreferences to religion I had never picked up on before: the apocalypse, virgin birth,\nbaptism... I wrote about Jesus in papers and referenced biblical quotes in my diary entries.\nI read Flannery O' Conner, James Joyce, and Barbara Kingsolver. Even stranger to me\nwas that although I did not believe in religion, I was in love with ritual. Even as a child I\nwas entranced by temple services. The Hebrew, stories, and songs, put me in another\nplane of consciousness--one in which I felt no awareness of my physical presence. I felt\nonly introspective and calm.\nTwo years ago I participated in an overnight fast at a church as part of a program to\nraise money for African children. I woke just before dawn and slipped into the service\nroom so that I could sit by the altar as sunlight peeked through stained glass. Just the\nsetting--the crosses, the books, the paintings of saints I could now name--was enough to\nput me into a trance. It was hours before anyone else woke to interrupt my reverie. I was\n\ndeeply troubled that morning, confused because I did not know why I had allowed stories,\nwhat I believed then to be mere stories, to reshape my life.\n\nIn my freshman year at MIT, I discovered a book that tied my loose ends together\nin a way that was entirely unanticipated. The Power of Myth held answers I was seeking\nand insight I did not even know I was looking for. The book is the transcript of a\nconversation on mythology between Joseph Campbell, an American philosopher whose\nexpertise was mythology and comparative religion, and news reporter Bill Moyers. For\nCampbell, \"mythology\" encompasses Judeo-Christian beliefs and those of other religions,\nas well as classical Greek mythology. His message made sense to me: \"Myths are our\nsearch through the ages for truth, for meaning, for significance.\" They need not\nnecessarily be bound to one particular moment in history; they are the stories about the\nconstants of human experience: birth, coming of age, death, relationship with nature,\nrelationship with society, morality. The intrinsic value of mythological stories is that they\ntell us about ourselves, and in that manner, serve as a guide to life. Campbell said that\n\"When the story is in your mind, you see its relevance to something happening in your\nown life. It gives you perspective on what's happening to you.\" Soon after I read the\nbook, I began to recognize how much those biblical stories I became obsessed with in high\nschool inform us about ourselves.\n\nThe summer after freshman year of college, my closest friend Katy and I spent a\nweek Cancun. From tour books I learned that \"Cancun\" means \"Snake Pit\" in the Mayan\nlanguage. Snake pit. In my mind I associated \"snake\" with manipulation and betrayal. At\n\nChichen-Itza, I was disturbed when the entrances to the pyramids were adorned with stone\nsnakes of enormous proportions. I was shocked when our tour guide taught me that the\nsnakes were there because they are a symbol of good luck to the Mayan people. I was not\naware until that moment how intrinsic the belief that nature is evil is to me. In retrospect,\nit makes sense that I was stunned to find that the snake is revered in the Mayan culture;\naccording to Judeo-Christian custom, the snake was partially responsible for the Fall.\nFurthermore, Jesus speaks of snakes only once: \"You brood of vipers! How can you\nspeak of good things, when you are evil?\" (Matthew 12:34). Calling humans a brood of\nsnakes is equated with the accusation \"you are evil, \" in this context. The essential evil of\nthe snake, then, as well as the people, is assumed. In the Judeo-Christian culture, \"snake\"\nhas drastically negative connotations.\nYet the snake is not the only form of nature condemned as sinful in the Bible. All\nnature, at least in the Genesis and the Gospels, is ubiquitously associated with evil. Adam\nand Eve ate the forbidden fruit from the Tree of Knowledge in Eden (another natural\nimage), and \"The Lord God sent him [and Eve] forth from the Garden of Eden\" (Genesis\n3:23). The event is called The Fall, because humankind fell from both paradise and an\ninitial state of purity. In the words of Joseph Campbell, \"In the bible, eternity withdraws,\nand nature is corrupt, nature has fallen. In biblical thinking, we live in exile\" (3). The\nbelief that nature is inherently sinful manifests itself in the Gospels; images of wilderness\nare associated with temptation and Satan, while descriptions of tamed land, such as when\nJesus compares himself to a carefully cultivated vine, are correlated with goodness.\n\nCampbell's explanation of the of the two different types of mythology accounted\nfor my bewilderment at Chichen-Itza. One type of myth comes from earth-cultivating\ncultures and so is nature oriented. Because growers are dependent on the land for survival,\naccording to Campbell, there is a \"glorious interest in the beauty of nature and cooperation\nwith nature.\" The other mythology comes from nomadic people and is socially oriented.\nChristianity is, of course, socially oriented; \"nature is thought to be evil,\" Campbell says,\nso \"you don't put yourself in accord with it, you control it, or try to, and hence the tension,\nthe anxiety, the cutting down of forests and annihilation of native people.\" When I\nskimmed the Gospels and Genesis, I saw clues that nature is essentially evil everywhere.\nIn this instance, the Bible informs us that our culture holds that nature is inherently evil.\n\nI learned from Campbell's book that religion and mythology are intrinsically\nvaluable, even for those of us who don't believe that Jesus walked on water or that a giant\nturtle heaves the world about on its back. The literature and the rituals teach us about\nourselves and about the experience of being human. Rites of passage like confirmations,\nbar mitzvahs, and bat mitzvahs mark the transition from childhood to adulthood. In doing\nso they follow the biblical edict that we are to become adults: \"When I was a child I spake\nas a child, I thought as a child: but when I became a man, I put away childish things\"\n(Corinthians 13:11). Some Australian aborigine tribes send their boys through an ordeal of\ncircumcision and the drinking of men's blood. The Power of Myth suggests that both\nseemingly prosaic and extreme rituals do more than just delineate child from adult; they\nhelp us to make meaning in our lives.\n\nWhen I think back on my history class, I wonder, how many of those students who\nso adamantly opposed any questions of their faith actually used Biblical stories as a lens\nthrough which to interpret the world. Very few, I should think, since I know for certain\nthat most had no idea of what is written in the Book. I once spent an hour arguing that\nnowhere in the Bible is Mary Magdalene referred to as a whore. She isn't. Anywhere.\nMy classmates were reluctant to believe me; they knew better because Christianity is their\nfaith and not mine. Yet so many of my friends blindly adhere to a belief system that they\nknow almost nothing about. Then I wonder, why subscribe to a religion based on a\nbreathtaking collection of literature, literature that represents the collective wisdom of\ngenerations, and read none of it?\n\n*Notes: The sources cited in this essay include Bill Moyers and Joseph Campbell's The Power of Myth\n(1991) and The New Revised Standard Version Bible.\n\nWorks Cited\nMoyers, Bill. The Power of Myth. New York: Apostrophe S. Productions, Inc. and\nAlfred van der Mark Editions, 1988.\nNew Revised Standard Version Bible. United States: Division of Christian Education of\nthe National Council of the Churches of Christ in the United States of America,\n1989."
    },
    {
      "category": "Resource",
      "title": "oral_pres_gdlns.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-735-writing-and-reading-the-essay-fall-2005/fb60701d1d35d3f4706a512138d9528a_oral_pres_gdlns.pdf",
      "content": "21W.735:01, Fall 2005\nRebecca Faery\nThursday, October 27\n\nORAL PRESENTATION GUIDELINES\n\nOn November 3 and 8, members of our class community will make oral\npresentations to the group. The presentations are to be based on your investigative essays,\nso you should be easily able to speak authoritatively on your subject. Here are some\nguidelines for your presentation:\n\nYou should be prepared to speak for between 6 and 7 minutes. I will time\nthe presentations and stop you at 7 minutes.\nYou are welcome to use audio-visual tools, handouts, overheads,\nPowerPoint, or the blackboard as part of your presentation. If you choose\nto show a video, the time the video takes must be part of your 6 to 7\nminutes. And (need I say this?) the video should not take up a lot of your\npresentation time!\nAfter you have addressed the group, we will have 3-4 minutes for\nquestions and comments from the audience. Be prepared to handle\nquestions in a professional, authoritative manner.\n\nIn preparing, you should PRACTICE, PRACTICE, PRACTICE! At least 3\ntimes: once alone, once before a mirror, and once for a friend or two.\n\nTIME YOUR PRESENTATION WITH EACH PRACTICE so you know that\nyou won't exceed your time limit. This is essential!\n\nIntroduce yourself to your audience at the beginning of your presentation. Look\nsharp. Remember to make eye contact with the audience, to avoid \"fillers\" (um, uh, like,\nand so on), to speak naturally but to project your voice so you are sure to be heard, and\nto do whatever you can to present yourself as authoritative, interested and thoroughly\nprepared. Be lively; be interesting; be informative.\n\nAt the end of each presentation, you will get written feedback on your\nperformance from everyone in the class.\n\nSteve Strang, Director of the Writing Center, is available to give you pointers and\nresponse on your presentation if you sign up in advance.\n\nGood luck, and let me know if you have questions."
    },
    {
      "category": "Resource",
      "title": "pf_guidelines.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-735-writing-and-reading-the-essay-fall-2005/4acee5a50e7a6b3045b2621fb8b9a18b_pf_guidelines.pdf",
      "content": "21W.735:01, Fall 2005\nRebecca Faery\nThursday, December 1\n\nPREPARING YOUR PORTFOLIO FOR SUBMISSION\n\nOur semester together is drawing to a close, and it is time for you to begin the process of review,\nreflection, and re-vision necessary to prepare your portfolio of your work of the semester to submit to\nme so that I can assign you a grade for the course. The following guidelines are to help you to make\nsure your portfolio is complete and arranged in a way that will facilitate my review of your work.\n\nHere is what your portfolio must contain, and in this order:\n\n* Your profile of yourself as a writer and reader, assigned on the first day of class, with my\nresponses.\n* Your five essays, in the order that you wrote them: for each, first submitted version (with\nmy responses), revision (with my responses), and subsequent revision(s), if any.\n* Your Reader's Notebook: Responses to all assigned reading (with my responses, as\napplicable), arranged in chronological order as assigned, with full bibliographic entry as\nheading for each and with pages numbered, plus your response to the reading or lecture you\nattended.\n\nNote: Substantive re-visions of your work are welcome and encouraged and, if genuinely\nsuccessful, could raise your grade somewhat. Revisions will not in any case lower your grade,\nso you risk nothing in choosing to re-write, and grades aside, you stand to learn more from the\nrevision process--always the real reason to do it. If you decide to do additional revisions, they\nshould be inserted after the earlier revised and responded-to version. Even if you decide not to\ndo any substantive revisions, you must go through the last version of each essay and correct\nany editing problems (my responses and the check marks in the margins will be your\nguide).\n\n* Then, for your final writing assignment of the semester, I would like you to return to the\nscrutiny of yourself as a writer and reader with which we began the semester and to write another\nprofile of yourself as a writer and reader now, after this semester of work, learning, and practice.\nTo prepare for your self-scrutiny, re-read the course syllabus, the handout on the Reader's Notebook,\nand the writing workshop guidelines you were given at the start of the semester, as well as all the\nwriting you've done this semester, as assembled above. With the course goals and processes and the\nwork you've done fresh in your mind, ask yourself the following questions and address them in your\nwriter's profile: What sort of writer would you call yourself now? What have you learned about\nwriting and reading this semester? What are you proud of as you look through your portfolio? What\nremains for future efforts? Your claims, of course, should be ones your portfolio can support and give\nevidence of, though you certainly can claim to have learned about some aspect or feature of writing\nwhich you believe you have not yet mastered. What aspects of writing do you think you still need to\nwork on? And last, what do you foresee for yourself as a writer in the future? What would you like to\naccomplish in your writing, and how do you intend to go about accomplishing your writing goals?\n\nHow do you expect to continue to draw on what you've learned in this course in the writing you will do\nin the future?\n\n* Finally, prepare a brief Introduction and Conclusion to your portfolio (your \"Collected\nWorks\"!), number the pages of the portfolio sequentially throughout (numbering in ink by hand is\nokay), and then prepare a Table of Contents. Title your collection if you care to. Please be sure that\neverything in the portfolio is labeled (Essay I, Revised, etc.). And remember: no class notes, no\nhandouts, no extraneous \"stuff\" is to be included in the portfolio. Place your portfolio securely in\nsomething that will hold it together--not in a manila file folder, in other words! Also be sure your\nname is clearly legible on the outside cover of the portfolio.\n\nIn assessing your work and assigning grades, I will first check for completeness of your\nportfolio (all requirements must be met satisfactorily for a grade of C or better) and review your record\nof attendance in class, your preparedness for class (including workshops), your engagement and effort,\nactive and interested participation, and timely submission of the portfolio and of all assignments,\nnotebook, and other assigned work. The primary determinant of your grade will be the quality of your\nwritten work.\n\nYour completed portfolio is due at our final class meeting at my house on Tuesday, December 13.\n\nAs always, I'm happy to answer any questions you may have. I hope you will enjoy the process\nof reflection, review, and re-vision which preparing your portfolio will entail, and I look forward to\nreading your work."
    },
    {
      "category": "Resource",
      "title": "prts_irene_rahmn.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-735-writing-and-reading-the-essay-fall-2005/8c3a8d41d6ce88301a902aa76293c3cf_prts_irene_rahmn.pdf",
      "content": "Getting Priorities Straight\nIrene M. Rahman\n\nI thoroughly enjoyed my internship at Biogen Idec this past summer. It was a\ngood research experience, my colleagues were very friendly, and I had the opportunity to\nmake friends with other interns. All the employees seemed absorbed by their work and\noften worked long hours in their effort to advance the company's research. The best part\nof the week, though, was happy hour on Friday afternoon, when most of the thousand\nemployees of the company bustled into the biggest cafeteria on the Biogen Idec campus\nto eat, drink and make merry at the end of a hard week of work. Thai, Mexican, Indian,\nCajun--there were as many varieties of food as weeks of my internship. Not to mention\nthe various alcohols--beer, wine, berry drinks--and snacks--Cheetos, Lays, pretzels,\nregular M&Ms, peanut M&Ms. We really were working hard, and deserved no less.\n\nWhen I got back to college this semester, the first event organized by the\nBangladeshi Students' Association, of which I am a member, was a fundraising dinner to\nsponsor poor children in Bangladesh, where I was born and which I identify as my\nmother country. The money raised was donated to a non-profit organization called Save\nthe Children, which provides for the housing, food and education of children in rural\ncommunities of the country. Five hundred dollars can cover the cost of all of these for\none child for a year. For our dinner, it was my responsibility to order the food. I called\nMadina Market, asked them to prepare enough to feed forty people, and then inquired for\nthe price. The bill was three hundred dollars.\n\nTHREE HUNDRED DOLLARS!\n\nAfter mumbling a thank you to the restaurant owner, I put the phone down, my\nmind racing with numbers. Ordering for only forty people cost three hundred dollars! I\n\nwasn't worried about obtaining that amount for the dinner, because the Graduate Student\nCouncil had offered to cover it, given our fundraising effort. What appalled me was that\nthe price to feed eighty people from a restaurant for one meal, only twice the number that\nwe ordered for that day, exceeded that necessary to cover the basic needs of a child in\nBangladesh for three hundred and sixty five days, one thousand and ninety five meals,\ntwelve months of rent, two semesters of school supplies. And then I remembered happy\nhour. If even half the employees of Biogen Idec showed up on Friday afternoons to make\nmerry, the cost could be $2000 or more. Every week, the company spent as much money\nto keep it's poor, hardworking employees happy as it would take to sponsor four poor\nchildren in Bangladesh for an entire year. I could feel the Thai, Mexican, Indian and\nCajun food churning in my stomach with a vengeance.\n\nI must admit, I wasn't always this aware, even during the six years of my\nchildhood living in Bangladesh. I definitely noticed poverty as we drove by slum areas--\nthe rickshaw drivers sweating in the scorching heat, the traveling vendors carrying on\ntheir heads huge straw bowls of vegetables and fish from door to door, the women and\nchildren shaping and drying cement bricks for construction. But I was too young and\nignorant to care. At home, I had a TV, a computer and fancy furniture, so I had no need\nto step out of my childhood comfort zone and realize the families that we drove by\ncouldn't afford to eat three times a day or buy nice clothing for their children, even after\nworking so hard. But with experience, I could no longer turn a blind eye to such misery.\nOn my last trip to Bangladesh this past year, I visited a clinic newly opened in a\nvery crowded part of Dhaka. The name of the clinic was \"Paribaric Shastha\" or \"Family\nHealth Clinic\". As the name suggests, the clinic primarily provides services to women\nand young children, such as safe delivery, family planning counseling and\n\nimplementation, and vaccinations. The clinic is funded by non-governmental\norganizations (NGOs) that direct all of their funds at no profit, so its services are\naffordable to middle class and poor Bangladeshis.\n\nThe aspect of the clinic that I liked best was the \"satellite\" program. Apart from\nthe services provided at the regular clinic site, teams of two or three women went to\nremote areas where they knew the local women are unable to go to the clinic itself\nbecause of transportation costs or long working hours. The sites included various garment\nfactories and poor but densely-populated areas. I visited one such poor area with one of\nthe clinic teams. The streets of this site were very narrow, infested with trash, and\nbuzzing with flies, and yet accommodated hundreds of people and even vehicles. Many\nof the women who came to the satellite site had at least three children, many of whom\nlooked sickly or unhappy. The husbands of several of the women I talked to had very\nstrenuous yet unfortunately low-paying jobs in the construction industry or in factories,\nallowing them only two full meals per day, and even then, meals usually lacking in\nprotein-rich foods such as meat and eggs. That evening when I returned home and was\noffered a table full of a variety of dishes to choose from for dinner, I couldn't bring\nmyself to eat much. How could I, when I knew that the families I had seen today would\nprobably be sharing only one of those dishes among all their members?\n\nIt is upsetting to see the stark discrepancies in wealth between the rich and the\npoor in countries such as Bangladesh, created partly by people who just don't want to\nshare. There are areas with three-storied mansions adjacent to slum areas where the poor\nare scrambling to find roof space to sleep under. Too many fast-food chains and\ncybercafes to count are springing up everywhere, but the number of ventures to help the\npoor have been limited to government and international agencies. There are many\n\nridiculously rich businessmen who could feed hundreds of families with only a portion of\ntheir income, but instead decide to buy one of the three Jaguars that the country can\nimport.\n\nSuch people need to be made aware of their selfishness. The guy with the Jaguar\nprobably feels that he deserves a reward for having worked very hard to earn the money\nhe has. But is a bricklayer not working just as hard, or perhaps even harder, and still not\nbeing able to earn enough money to feed his hungry family three times a day? In the\nsame respect, Biogen Idec spends hundreds of dollars to keep its employees happy at the\nend of every week, when all I can think is that the same amount can sponsor mutiple\nchildren in Bangladesh or Somalia or Azerbaijan for an entire year. I generally believe in\nmoral relativism--people have their own priorities, their own philosophies to live by;\nhowever, in this case, it is completely unacceptable for the Jaguar dealer and Biogen Idec\nto live by the philosophy that they are their own units, such that they do not feel the need\nto stop living as well as they can because others may not be able to eat. Such selfish\nthinking has caused world poverty to persist for so many centuries--these people should\nconvert to considering the world as a whole unit of which they are a part, so that they feel\nthe urge to share with their fellow citizens in need.\n\nEven among the current \"sharers\", I must admit that there are differences in\nprioritizing. In his essay \"The Singer Solution to World Poverty\", Peter Singer points out\nthat according to the Conference Board, a nonprofit economic research organization, an\nAmerican household with an annual income of $50,000 (in 2000) spends around $30,000\nannually on necessities, so it should donate $20,000 a year to help the world's poor (146).\nI agree that this is the best cause to donate money to, so I shudder at the thought of the\n\nbillions of dollars that are spent on scientific research. I am fascinated by scientific\nknowledge and its applications, but while it is important to spend money to discover and\nmanufacture drugs that can reduce the symptoms of multiple sclerosis or rheumatoid\narthritis, it seems more critical to me to direct the billions of dollars spent on this research\nto ensure that every person on this earth is granted the basic rights of food and shelter.\nBut perhaps someone who sees a loved one deteriorate right in front of his or her eyes\nfrom cancer and chemotherapy would add the advancement of scientific research to the\ntop of his priority list. He would probably commit $20,000 of his annual income towards\nresearch, and none towards helping the poor.\n\nIt may also be difficult for sharers to constantly be responsible for the priorities\nthey claim to hold. I help raise money to make sure two children in Bangladesh have\nfood, shelter, schooling for a year, but does my priority stop being one if I use my time\nand money to do other things as well? When I go out to eat with my friends, buy my\ntwentieth pair of shoes, go to the movies, I am compromising this priority. Even as I\nwrite this essay, I am contemplating whether I should go to the Hurricane Katrina Relief\ndinner this upcoming weekend, or stay in and catch up on my studies.\nSinger probably takes too extreme a position in suggesting that people should\ncontribute $20,000 of an income of $50,000. Using such an approach ends up being\nunproductive, because it is far to difficult to convince people to part with such a large\npercentage of their money. It may be difficult to convince others to live by my priorities,\nbut I must continue trying. Through my experiences with poverty, I have realized that as\nsomeone with the good fortune of having all her basic rights--food, shelter, healthcare,\neducation--fulfilled, I should try to make it a reality for others. I am proud to have\ndeveloped this value system, and I recognize that \"knowing where we should be going is\n\nthe first step toward heading in that direction\" (Singer, 146). So though I may not be\nconstantly committed to this priority, I find it worthwhile to strive towards that end.\nLikewise, I would like to make others aware of their good fortune and the need to help\nothers less fortunate to maintain a balance in the world.\nI am currently in the process of applying to medical school. If my goal of\nbecoming a doctor is attained, I want to take a few years later in my life when I've\naccumulated some wealth to fund and run a clinic like the Paribaric Shastha in a\ndeveloping country such as Bangladesh that is mostly cost free, so that people who can\nnot afford the expensive prices of private health care can be safe at least in terms of\nhealth. I know that one clinic may not be able to solve too many people's problems, but\nno single researcher will find the cure for cancer either, so I will strive to convince others\nto join me in my efforts to make a difference in the lives of people who direly need it.\n\nReference\nSinger, P. \"The Singer Solution to World Poverty.\" Best American Essays 2000.\nEd. Alan Lightman. Series Ed. Robert Atwan. Boston: Houghton Mifflin, 2000. 140-146."
    },
    {
      "category": "Resource",
      "title": "reader_nb_hndout.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-735-writing-and-reading-the-essay-fall-2005/deb7acd8b57b3bdc57b01d4ef3c659b1_reader_nb_hndout.pdf",
      "content": "21W.735:01, Writing and Reading the Essay\nFall 2005\nRebecca Faery\n\nTHE READER'S NOTEBOOK\n\nTo become an accomplished writer of essays you must read essays, not only for the pleasures\nwhich this particular form holds for readers, but also to learn about the range and texture and scope of\nthis kind of writing, to see what writers have done with it, and, I hope, to be inspired with possibilities\nfor your own writing. Part of your work for the semester, then, will be to read a great many essays and\nto respond to what you read in writing.\n\nI will expect roughly a page or so (a little less, a little more) of typewritten response to each\npiece you read. If you want to combine responses to two or three selections because of subject matter or\nstyle or whatever, your combined response should be correspondingly longer. Keep your notebook in a\nfolder of some sort (no loose pages, please!), separate from class notes, handouts, the other writing\nyou'll be doing. Keeping your responses on a disk also is a good way to make sure a lost notebook\ndoesn't present serious problems at the end of the semester (but print out a hard copy regularly--I won't\naccept a disk submission). I expect your responses to be informal, speculative, reflective of careful\nreading, and written in a spirit of critical questioning and exploration.\n\nYour responses should begin with a full bibliographic citation at the top of the page. Then\nyou should begin with a concise summary of what you've read (just a few sentences), then note or quote\nany passages that you found particularly striking or memorable (with parenthetical page citations), state\nwhat you understand to be the writer's point--the idea or motive which gives the piece shape and force--\nand speculate on how the piece might be useful to you in your own writing. Of course I'm interested to\nknow whether you enjoyed the reading or not, and why. You are also welcome and encouraged to refer\nto other things you've read by way of comparing or contrasting the piece you are writing about with\nothers.\n\nI will collect notebooks for a quick review regularly but randomly; please bring your notebook\nwith you to each class meeting.\n\nMy hope is that keeping the notebook will deepen and enrich both the reading and writing you'll\ndo in the weeks ahead, and that it will help you in your efforts to become a better writer."
    },
    {
      "category": "Resource",
      "title": "silent_read_ses.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-735-writing-and-reading-the-essay-fall-2005/0f58fc1660974639ebe6ba935cc2918f_silent_read_ses.pdf",
      "content": "21W.735:01, Fall 2005\nRebecca Faery\nThursday, November 17\n\nSILENT READING SESSION\nTuesday, November 22\n\nOur class meeting next Tuesday will be a Silent Reading Session: you are to bring a\nrevision of one of the essays you've written this semester to which you would like response from\nreaders, and you will all spend the class period reading and responding in writing to each other's\nwork.\n\nFor the Silent Reading Session, bring with you two copies of your revised essay. Be\nsure your name is on your submission, and that it is typed and double-spaced, and stapled or\npaper-clipped together, with a couple of sheets of blank paper attached to the back of each\ncopy so readers have room to write their responses. You should feel free to include a cover sheet\nif you want, saying what particular questions you have about the writing you have submitted and\nin what particular ways readers can help you in their response.\n\nThe procedure for the class period will be this: when you come into class, you will place\nyour two copies of your submission on the table, pick up a copy of another person's writing, read\nit and respond with comments on the blank pages at the back, then return that piece and pick up\nanother. We'll continue this until the class period is over.\n\nAs a reader, your responses, as always, should be friendly and constructive and should\ntake the form of a brief letter. Begin by addressing your comments to the writer by name. Your\nresponse should conform roughly to the process of our class workshops: you should first\ncomment on the strengths of what you've read-what the writer has done well, what you learned\nfrom reading the piece, what aspects of it especially interested or pleased you, particular insights\nyou gained from it, etc. Then you can, if you are so moved (and especially if the writer has\nasked for suggestions), make some suggestions for how the writer might add to or revise the\npiece to improve it-ideas for further elaboration, things that might be included or left out, what\nyou wanted to know more about, where you were confused or needed to know more. In closing,\nsign your name.\n\nAs always, I'm happy to answer any questions you may have as you prepare for the\nsession. I'll have something of my own out on the table also, for you to read if you choose.\n\nEnjoy this occasion to share with each other the fruits of all your labors this semester!"
    },
    {
      "category": "Resource",
      "title": "writ_profile_asg.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-735-writing-and-reading-the-essay-fall-2005/e18dd2bfab38dd15783fd268bb89fa0c_writ_profile_asg.pdf",
      "content": "21W.735:01, Writing and Reading the Essay\nFall 2005\nRebecca Faery\nThursday, September 8\n\nWRITING AND READING PROFILE\n\nDue Tuesday, September 13\n\nAs a starting point for the semester, I'd like you to spend some time thinking and writing about\nyourself as a writer and reader. In other words, I'd like you to compose a profile or portrait of yourself as\na reader and writer, including your reading and writing history and habits. This is the time to tell me,\nplease, if you have, or think you have, any particular problems or difficulties with reading or writing. I\nwould also like to know if English is not your first language.\n\nHere are some questions to get you started; feel free to include any other information you think\nimportant.\n\nWhat do you remember about being taught to write or being asked to write in school? What were\nyour writing successes, pleasures, problems, or confusions? What memorable things, positive or\nnegative, have people said to you about your writing? What feelings are associated for you with your\nmemories of learning to write or with the activity of writing? What role does writing play now in your\nlife, and what are your present attitudes about writing? What has your experience with writing at MIT\nbeen like so far (if you are not a first-year student)? What goals do you have for yourself as a writer, for\nthis course and for the future?\n\nNow think about the process you go through whenever you face a writing task. What kinds of pre-\nwriting activities do you engage in--reading, jotting, note-taking, daydreaming, procrastinating,\nmunching, meditating, jogging, napping, preparing a place to write, gathering writing materials, talking\nwith friends or colleagues about the writing you are about to do and your ideas for it? What sort of\nmaterials or surroundings do you prefer when you write? Do you draft in longhand or at a keyboard? Do\nyou write successive drafts and revise heavily, or do you produce a more nearly finished version as you\ngo along? Do you re-read your writing, silently or aloud, during the process of composing? What\nreference guides do you usually use--handbook, dictionary, thesaurus, spell checker? Where do you go\nfor advice or response to your writing?\n\nAre you a reader? Do you read for pleasure? What kinds of reading do you most enjoy? What do\nyou remember as the best book you ever read? Do you have a favorite writer whose work you have read a\nlot? Have essays been part of your reading repertoire?\n\nFinally, I'd like to know what led you to take this course. What are your expectations of the\ncourse, of me, of yourself, of other students? What do you hope to learn in your semester of Writing and\nReading the Essay?\n\nYour (typed, please) profile of yourself as a reader and writer is due in class on Tuesday. We'll\ntalk about some excerpts (anonymous) in class next Thursday. I look forward to reading what you write."
    },
    {
      "category": "Resource",
      "title": "essay3_jamie_sh.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-735-writing-and-reading-the-essay-fall-2005/da6be8f4a5cece4ba1a78176a6008c3b_essay3_jamie_sh.pdf",
      "content": "Jamie Shin\n21W.735 R01: Reading & Writing the Essay\nEssay #3 (Investigative Essay): Draft 2\nDec 13, 2005\n\nReturn of the Traditionalists?: Elite University Women's Choice\n\nSmart, ambitious and driven. Those three words probably best describe today's\nyoung women. Raised by the first generation of Supermoms (women who not only had\nfamilies but also careers), gender inequality is not something familiar to them. From a\nvery young age, they are encouraged to participate and excel in traditionally non-female\nfields across academics and athletics.\nI remember there was a popular Nike advertisement featuring Mia Hamm and\nMichael Jordan a few years ago. The slogan was \"anything you [Michael Jordan] can do,\nI [Mia Hamm] can do better.\" The advertisement showed snapshots of Mia Hamm and\nMichael Jordan playing different sports and in every snapshot, she was portrayed to be a\nstep ahead of him. That's exactly the kind of attitude today's young women have grown\nup with: anything guys can do, we can do just as well, maybe even better. Giving up just\nisn't part of our vocabulary.\nNumbers speak for themselves. At Harvard University, the number of female\nstudents in the freshman class exceeded that of male students in 2001. At the\nMassachusetts Institute of Technology, a traditionally male-dominated research institute,\nabout 50 percent of its freshman class are female students. It's a national trend--more\nfemale students are seeking higher education. It does not stop there. The number of\nfemale students in professional and graduate degree programs are on the rise as well. It's\nnot an unusual thing anymore to meet a female professor in engineering or a female\n\nexecutive.\nI was also raised with this \"anything they [guys] can do, I can do better\" slogan. I\nhave been a great follower of the trend. I went to a math and science magnet school and I\nam due to graduate with a degree in Economics from MIT. With a degree from an \"elite\"\ninstitution, I plan on going into something more competitive, fast-paced and male-\ndominated: the corporate world. Like many other students with background in\nEconomics or Finance, my choice of industry is investment banking: prestigious,\nnotorious for the workload, and predominantly male--historically and concurrently\nacross all levels.\nUntil I started interviewing, I did not fully realize how male the industry is. In the\nrecruiting process, I met more than a handful of interviewers--mostly junior to mid-level\nprofessionals in the industry. And only two of them were female; both first-year analysts,\nonly one year senior to me. As I sat in the waiting area of the Career Services Center\nwaiting for my interviews, I looked around the room. The gender ratio seemed pretty\neven, at least on the recruit level. If it starts out pretty even, close to 50:50, what\nhappened to those \"missing\" women in mid-level management? If they grew up as\nambitious and driven, where are they now, 10 years after graduation? Has \"giving up\"\nbecome part of their vocabulary once they left school? I wondered.\nIn late September this year, I ran across an interesting article from the New York\nTimes that answered my initial question but also raised more questions. After reading\n\"Many Women at Elite Colleges Set Career Path to Motherhood\" by Louise Story, the\nmystery was solved: the missing women are at home with children.\n\"My mother's always told me you can't be the best career woman and the best\nmother at the same time,\" Ms. Liu said matter-of-factly. \"You always have to\n\nchoose one over the other.\"\n\nThere was the answer to my previous question. Because a choice had to be made,\nwomen choose to stay home. I did not like the answer. What about most fathers? Are\nthey passing up on opportunities to be the best dads in order to be the best professionals?\nWhy is it a choice for women when it is not for men? Is it really impossible to be the\nbest parent and best professional at the same time? It seemed to be against everything\nmodern feminists had fought for.\nWhat's more disturbing is that many young, smart women make the decision to\nsignificantly (and negatively) alter their career path even before starting their career.\nStory did a survey of Ivy League college women, and about 30 percent of women\nsurveyed said they planned to leave the workforce while their children were young, while\nanother 30 percent planned to work part-time. Many students featured in Story's article\nsaid that despite their high ambitions of earning advanced degrees and having high-\npowered careers, they are planning on sacrificing their career to have a family. Some\nmay argue that there is no reason to be alarmed by what the survey is suggesting. What\none thinks when she is in her late teens and early twenties isn't necessarily the best\nindicator for what she will do later in life. However, it should be noted that expectations\nboth reflect and influence the prevailing social and cultural norms related to gender roles.\nWhat's causing these young smart women to make such important career decision\nwithout much hesitation? Historically, women had to fight for the right to higher\neducation and access to fulfilling careers. When those are available, why are today's\nyoung women walking away? Were the efforts of modern feminists futile? Altering\none's career is not a decision to be taken lightly. A study done by Pamela Stone and Meg\n\nLovejoy suggests that the cost of career interruption accounts for as much as one-third of\nthe gender gap in earnings. Despite the steep cost, women with higher education are out\nof the labor force at a rate roughly 3 times that of their male counterparts. Many women\nare leaving the work force in their 30s, the prime time for their career development,\ndespite their ambition and achievement. It's a loss not only for those women but also for\nthe younger generation, whose expectations are heavily influenced by the cultural norm\nset by those ahead of them.\nIn 1980, there was a similar article on the New York Times titled \"Many Young\nWomen Now Say They'd Pick Family Over Career.\" Over three-fourths of women then\nsaid mothers should either not work or only work part-time until their children were 5\nyears old. The majority of men agreed. In Story's survey, 25 years later, roughly 60\npercent of women answered that they are planning on altering their career for family.\nOnly two participants in 2005 answered that they \"expected their husbands to stay home\nwith the children while they pursued their careers.\" Only two more answered that the\ndecision would depend on whose career was furthest along. Despite women's\nachievement and the social changes that took place over the past 25 years, the landscape\nhas not changed much.\nIn Lovejoy and Stone's study that took place in 2004, 60 percent of women that\nquit their flourishing careers said their husbands were one of the key influences on their\ndecisions to quit. Women in high-profile careers are likely to be with men in professional\njobs much like their own, with long hours and extensive travel. For this reason, many\nwomen feel a lack of support from their husbands. \"He always said to me, 'You can do\nwhatever you want to do.' But he's not there to pick up any load,\" said Kristen Quinn in\n\nan interview with Lovejoy and Stone. Despite the high-powered nature of their own\ncareers, the majority of women do not explore the idea of their husbands cutting back.\nInstead, they implicitly accept that their own career was secondary. Despite their\nprevious proactiveness in academics and professions, women seem to be turning\nsurprisingly passive. They are more educated and living in a more progressive era, but\nthose women are new traditionalists in a sense that they accept child rearing as women's\nprimary responsibility.\nRegardless of her success, a woman's career is not taken as seriously in the\nsociety. While it is unacceptable for a man to interrupt his career even for a brief time\nperiod, it is almost expected for a woman. For example, as Mary Blair-Loy and Amy S.\nWharton point out in their study of working parents, men are extremely unlikely to take\nparental leaves, though it is officially available. For women, a career is still seen as\n\"something to play with\" until she can replace it with children, while it is seen as source\nof lifetime satisfaction for men. There's a dissonance between what's taught in school\nand what's practiced outside of school. In school (atheletics and academics), women are\nencouraged to explore and develop their abilities to full potential. The support is\ndisconnected once women march out the school gate with their diplomas. As daughters,\nthey were expected to live life to the fullest. Once they become wives and mothers, their\nself-fulfillment becomes less important: they are expected to function as support roles\nonly.\nCorporate culture is another factor shaping women's decision to quit. Women\nwith elite educations pursue high-powered careers, which are often seen as \"all or\nnothing.\" By nature, the work schedule is highly unpredictable, with last-minute\n\nbusiness trips and unexpected late nights. As an anonymous participant in Stone and\nLovejoy's study describes it, \"high-tech work week is really sixty hours, not forty.\"\nMany women are employed in settings where the pace and expectations were set by men\nwith stay-at-home wives who handle everything outside of work. Corporate culture has\nevolved to be less family-friendly. The face time in the office is much longer than it used\nto be. With thanks to improvement in transportation, business travel is much more\nfrequent. Even when parents are at home with children, they are never away from\nwork--there are e-mails, cell phones, and blackberrys. There's no life outside of work.\nWork is life. Due to the \"all or nothing\" nature of the work, many women view their\noptions as either working forty-plus hours a week or quitting.\nThere is an alternative. Between a forty-plus week job and a full-time motherhood,\nthere is a part-time job. By definition, it is an excellent idea. Women can have both--a\nfulfilling career and a rewarding motherhood--at a certain price. Unfortunately, it is not\neven an option for many professional women. According to Stone and Lovejoy, 40\npercent of women who tried to reduce work hours were denied. Even when one is lucky\nenough to work part-time, there is a dilemma. Working part-time in jobs that were\neffectively full-time make many women feel inadequate. The nature of having a part-\ntime career limits their career progression. Working part-time is often seen as a sign of\n\"lack of commitment\" and they are excluded from more interesting and engaging work.\nWorking part-time often does not meet their high standards and they end up putting in\nmore hours.\nIs it really elite women's \"choice\" to stay home? Not if it is a forced decision.\nThey are not making a free choice because they don't have the kind of institutional\n\narrangement and social understanding that would make a truly free choice possible.\nStructural support exists in name only. A high-profile career has become more and more\ndemanding, to a point if one wants to be successful, work must take up every single\nminute of one's life. Cutting back time or working flexible hours to spend time with\nchildren is seen as lack of commitment to one's career. There are parental leaves and\ndependent care programs supported by employers, but using those policies are often\nnegatively correlated with one's career progression. Under such circumstances, having it\nall is actually halving it all: a stressful career that is going nowhere and \"industrial-size\nhelpings of maternal guilt,\" as Katha Pollitt puts it in a column in The Nation. Lack of\ninstitutional support is not the only obstacle women have to tackle. There is also lack of\nemotional support from their partners and the society as a whole. The society supports\nyoung girls to be ambitious and adventurous. However, as they get older, the support is\nsuddenly gone. Instead, they are told by the society that their professional satisfaction\nand fulfillment are not that important. Given the current lack of structural and emotional\nsupport, it is not surprising that professional women are exiting the labor force 3 times as\nfast as men.\nWhat about young women's pre-planned career interruption? Is that also a choice?\nIs that a well-thought-through decision? It's a well-informed, forced choice. Women\nwho make the decision are aware of the price they will have to pay under the current\nsystem if they want to have it all. They are not neo-traditionalists. They are just picking\nup mixed signals. School and parents teach them that they can do anything they want to\ndo but at the same time, they see the struggles of their alumnae, once ambitious and smart\nlike themselves. Their opinions are nothing new or surprising. They are just reflecting\n\nthe current cultural norm. They are not to be blamed for giving up too early. What's to\nbe blamed really is the inflexibility of the corporate culture and of the current gender\nroles in the family.\n\nNote__________________________________________________________________________________\n\nThe works cited in this essay include: \"Many Women at Elite Colleges Set Career Path to Motherhood\" by\nLouise Story. The New York Times. September 20, 2005; \"Despearate Housewives of the Ivy League?\" by\nKatha Pollitt. The Nation. October 17, 2005; \"Mothers in Finance: Surviving and Thriving\" by Mary Blair-\nLoy and Amy S. Wharton, The Annals of the American Academy. November 2004; \"Fast-Track Women\nand the 'Choice' to Stay Home\" by Pamela Stone and Meg Lovejoy, The Annals of the American Academy.\nNovember 2004 ; and \"Many Young Women Now Say They'd Pick Family Over Career.\" by Dena\nKleiman. The New York Times. December 28, 1980."
    }
  ]
}