{
  "course_name": "Writing and Reading Poems",
  "course_description": "This course is an examination of the formal structural and textual variety in poetry. Students engage in extensive practice in the making of poems and the analysis of both students’ manuscripts and 20th-century poetry. The course attempts to make relevant the traditional elements of poetry and their contemporary alternatives. There are weekly writing assignments, including some exercises in prosody.",
  "topics": [
    "Humanities",
    "Literature",
    "Creative Writing",
    "Criticism",
    "Poetry",
    "Humanities",
    "Literature",
    "Creative Writing",
    "Criticism",
    "Poetry"
  ],
  "syllabus_content": "Course Meeting Times\n\nSessions: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nThis class teaches the understanding of poetry from the outside in and from the inside out. It is both an essay writing and a creative writing class. In the essay part students write one-page responses to a poem or poems. They then read these responses in class to focus class discussion. One-page because the emphasis is on concise expression of what students think and feel about the poems under discussion. Following this \"outside\" look at a given poet's work, students will write imitations of that work. The syllabus makes clear just what aspects of these poems are to be imitated but as students work from the inside they have considerable latitude. Imitations will be read and discussed in class. This version of the course looks at poems from Donald Allen's\nThe New American Poetry, 1945-1960\n. Allen chose poets who broke with tradition, and while several of them are now established figures their work is still creating waves in American poetry.\n\nReadings\n\nAllen, Donald, ed.\nThe New American Poetry, 1945-1960\n. Berkeley, CA: University of California Press, 1999. ISBN: 9780520209534.\n\nGrading\n\nACTIVITIES\n\nWEIGHTS\n\nAssessment of One-page Essays\n\n1/3\n\nImitations\n\n1/3\n\nClass Participation\n\n1/3\n\nAttendance\n\nSince this class is effectively a writing workshop, attendance is mandatory. You are also required to attend two Poetry @ MIT events.\n\nConferences\n\nWe will meet for two conferences, but my office door is always open to you. Please email me with any questions about assignments or other class business.\n\nPlagiarism\n\nSamuel Johnson defined plagiary as \"A thief in literature; one who steals the thoughts or writings of another.\" In academia plagiarism is a serious crime punishable by failure of the course and withdrawal from the Institute. All of the work you present to this class must be your own and written for this class alone.\n\nT. S. Eliot famously wrote, \"Immature poets imitate; mature poets steal.\" Theft in art raises a number of interesting questions many of which will be explored in class.\n\nCalendar\n\nWEEK #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nFavorite Poems\n\nCharles Olson's Poem\n\nPoetry response due\n\nOlson Imitations\n\nImitation due\n\nRobert Creeley's Poems\n\nPoetry response due\n\nCreeley Imitations\n\nImitation due\n\nBarbara Guest's Poems\n\nPoetry response due\n\nGuest Imitations\n\nImitation due\n\nPoetry @ MIT: Poetry reading by Alice Notley\n\nJames Schuyler's Poem and Letter\n\nPoetry response due\n\nSchuyler Imitations\n\nImitation due\n\nPoetry @ MIT: Poetry reading by Clayton Eshleman\n\nFrank O'Hara Poems\n\nPoetry response due\n\nO'Hara Imitations\n\nImitation due\n\nPhilip Whalen's Poems\n\nPoetry response due\n\nWhalen Imitations\n\nImitation due\n\nYour Own Poems",
  "files": [
    {
      "category": "Resource",
      "title": "a_imitate.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-756-writing-and-reading-poems-fall-2006/cb69b2a95105ef94f0f10aac46360513_a_imitate.pdf",
      "content": "Courtesy of Megan Sherkow. Used with permission.\nThe day you told me my brown eyes were green\n\nToday I saw you, Bryan, as you passed me,\nand before I felt something, but I didn't think it was you,\nyou looked away, even though, that night, you wouldn't stop looking at me,\nkissing me, in that horrible sloppy way, and I wanted to pull back,\nlike my first kiss, but with Kyle, on top of tie-dyed sheets\nwhen he said, \"Isn't this great?\" and I wanted to look away.\n\nBut you passed right by, walking in your bow-legged stomp\njust like Ben Kay in my Spanish class who I fantasize about almost every day\nwhich makes me feel sleazy, but I do it anyway,\nunbuttoning his shirt, feeling his black goatee against my hand,\n\nBut then I saw him walk, just like you, in that awkward pigeon-toed way,\nHe walked right past me."
    },
    {
      "category": "Resource",
      "title": "b_imitate.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-756-writing-and-reading-poems-fall-2006/e9b19720aca3f520d100c74f9affc83f_b_imitate.pdf",
      "content": "Courtesy of Megan Sherkow. Used with permission.\nmy fridge and I\nThe fridge is humming\nalthough I shouldn't say fridge because it is really two parts,\none part fridge and one part freezer,\nnot the same weight because the freezer\nis really only about 3 inches deep,\ncan't even fit a thing of frozen yogurt in it\nIt's humming, and I should know why,\nI'm a chemical engineer after all 10.213,\nstuff with compressors and pumps and heat flow and I just don't remember anymore,\nas usual I'm worthless\nBut it's not really humming, more of a growl,\na growl some mechanical animal, some metallic wolf,\nor maybe dog, like they have in futuristic movies,\nlike that one with Woody Allen where he had a pet that required batteries,\nI mean pooped batteries,\nI suppose I shouldn't say the word pooped in a poem but oh well,\nit's the best I can do\nI swing around in the same circles,\nthinking the same things, I tell myself\nwhy, what's the point, why do you think\nyou'll come up with something new after going down the same"
    },
    {
      "category": "Resource",
      "title": "c_imitate.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-756-writing-and-reading-poems-fall-2006/423a65202e5841dc7e830e8b922cfd43_c_imitate.pdf",
      "content": "Courtesy of Megan Sherkow. Used with permission.\nsoul\n\nI'm sick of clever,\nof the satisfying smack of a line,\nshocking, gruesome images, creative twists, self-absorbed, unusual, double edged\nrhythm.\n\nAnd aren't you a little old not to realize that cool is crap,\nsitting there in your little corner sneering at ironies.\nI don't even want to imagine who your heroes are,\nwhile you're listening to the buzzing or symphonies or hammering,\nor whatever damn sounds are shaking your head."
    },
    {
      "category": "Resource",
      "title": "creeley_imitate.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-756-writing-and-reading-poems-fall-2006/8f791f1286b2bd0913cc95ebd91c51d6_creeley_imitate.pdf",
      "content": "Courtesy of Lauren Tashima. Used with permission.\nCreeley Imitation\n\nThe Newspaper\n\nI read it, from beginning to\n\nthe end. Violence and\nwar. It is the best solution.\nWhat happened to the times\n\nwhen we learned mathematics,\nart and music in school?\nnot how to fight\na man\n\nwith a gun. I guess we can't\n\nhide in our naivety, or believe it won't be\nme. It's everywhere now,\nwhen I turn on my TV or go to the movies\nthat's what keeps it\ninteresting, they say. Now instead of living,\nwe try to stay alive."
    },
    {
      "category": "Resource",
      "title": "guest_imitate.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-756-writing-and-reading-poems-fall-2006/95bd92a1dd2561185db7e68fa6cc0b35_guest_imitate.pdf",
      "content": "Courtesy of C. Kiersten Pollard. Used with permission.\nBarbara Guest Imitation\n\nJeff sitting on the bar with a shotgun\nStaring down the Mormons\nCould not happen,\nEast of the river\nWhere the learned people\nCall hills mountains\nAnd do not comprehend space.\n\nI could be walking for miles alone\nEvading my taxes\nWhere theatre lights don't dim stars.\nI could die and never be found\nBecome a ghost story to tell around a fire\nWaiting for the water to boil.\n\nA place where you take off your watch\nLike a hat in a courtroom\nTalking to yourself about the weather\nFeeling sunburned,\nAnd the roughness of snowflakes.\n\nBut to tell you this is to ruin it slightly\nToo many feet make a meadow a road\nBringing light and safety\nThat illuminates every spider in the corner\nAnd puts a hand rail on the steep trails."
    },
    {
      "category": "Resource",
      "title": "ohara_imitate.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-756-writing-and-reading-poems-fall-2006/fb4522995b86e710d8317b8308112203_ohara_imitate.pdf",
      "content": "Courtesy of Lauren Tashima. Used with permission.\nFrank O'Hara Imitation\n\nAt 8am, my alarm is blaring\nalong with the sound of the girl's next door\nthe music chiming in with mine to wake me as I snooze\n\nbefore forcing myself to put on those tennis shoes\nthat I've been promising to wear\nand hear the sound of my feet and my tired breath\nbe drowned out by oncoming traffic\nand down by the river where it smells so awful\nevery time, it makes me wish I was home instead\nwhere the water is salty and not so poisonous\n\nand down the long hall where I can barely make eye contact\nI'm late again, and I can't avoid the sound of muses ringing in my ears\nIt seems impossible to keep up with the pace of a slideshow, and the words pile up on my\npage\nlike too much food on Thanksgiving dinner, I'll never be able to digest all of that\n\nI'm on the phone again\nit's like I live in two different worlds\n\n(one of guitar picks, teriyaki chicken and the best waves\n\nand another of variables that I still don't understand and some kind of dangle boots)\nthat don't know each other and will never meet\nbut it's not getting easier with time\nthe way I convinced myself\n\nthe water is so much more beautiful at the end of the day\nwhen the light tiptoes across the surface as I'm pushing against the wind\nit's like the streets become alive after dark and everyone I know is inside\nand I'm sweating and not even all that thirsty, just grateful to be out of the cold\nand I can barely hear anyone's voice except that guy behind the counter\nshouting, not at me, but at someone\nhe must be used to the noise\n\nIt's 8:05, I'm unsuccessfully still in bed\nbecause I really can't manage to get out\nnot because I'm all that tired,\nbut maybe because I still haven't done the last five things yesterday\nthat I had written in my planner (I never could see myself with one of these electronic ones)\n\nbut suddenly I'm wide awake because he likes one percent and I only have soy\nand it seems like such a little thing\nit isn't trivial at all."
    },
    {
      "category": "Resource",
      "title": "ohara_response.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-756-writing-and-reading-poems-fall-2006/8dcdb78f9a5bfc9b4cd5ef4b7200789a_ohara_response.pdf",
      "content": "Courtesy of Megan Sherkow. Used with permission.\nResponse to \"The Day Lady Died\"\n\nInitially, \"The Day Lady Died\" was overwhelming due to the abundance of obscure\nreferences. When reading the poem, I continually encounter words which are meaningless\nto me, yet it maintains rhythm. The specific times at the beginning of the poem infuse it\nwith tension; whatever the narrator is going to accomplish in the gaps of time is limited\nbecause he is bound to a set schedule, and the reader feels this pressure. Likewise, the\nconstant flow of movement from place to place gives me the impression of not only being\nrushed but also supplies the tension of wondering where the narrator is going, where will\nthese errands ultimately take him?\n\nThe bareness of the language in this poem is striking. O'Hara adorns almost no\nnouns with adjectives, which helps the poem move seamlessly because the reader is not\nencumbered by ornate images. Instead, O'Hara places us in the poem's world through the\nuse of capitalized phrases. This technique is effective in that it distinguishes the words that\nthe narrator sees from the words in the poem but also because words in the world often are\ncapitalized such as street signs and newspaper titles.\n\nThe climax to the poem's string of action, after the narrator buys \"a NEW YORK POST\nwith her face on it,\" is beautiful. Here O'Hara's naked writing pays off. By writing \"her\nface\" without attaching any descriptive detail to it, O'Hara establishes intimacy. When the\nnarrator says \"I am sweating a lot by now\" and mentions \"leaning on the john door\" I am\npanicked, shocked, and dizzy as I feel my heart being faster.\n\nUltimately, this poem which at first turned me off ended up hitting me hard.\nSomething about the narrator's disjointed journey, his lack of connection with people such\nas Linda who he sees often but has no relationship with, and the culmination in a sacred\ncommunion of grief in which \"everyone and I stopped breathing,\" illuminates something\nprofound. I don't know who Lady is, but I don't think it matters. I might be able to figure it\nout with an internet search, but would discovering factual information about her make the\npoem more meaningful to me when I have no experience of her?\n\nCourtesy of Megan Sherkow. Used with permission.\n\nI can examine the little that I do know about the world of this poem. I assume that\nMike is Mike Goldberg from \"Why I Am Not a Painter,\" and I think Patsy is his wife. I read\nthe poem, I saw the painting, I heard the story. Did it add anything? I like the insider's\nview, but with it I trade off an element of curiosity, a world of gossip and intrigue open to\nmy imagination.\n\nIn any event, O'Hara's ability to find the holy in the mundane, to take the daily\nmotions we go through and create poetry touches me."
    },
    {
      "category": "Resource",
      "title": "whalen_imitate.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-756-writing-and-reading-poems-fall-2006/263cb8c5669ad58f84fe26a7c84d9694_whalen_imitate.pdf",
      "content": "Courtesy of C. Kiersten Pollard. Used with permission.\nWhalen imitation\n\nYou'll have to call me at least twice\nAnd then the guilt will rise me up\nChange my clothes, trip me out the door\nWalking parallel to you across\nAll the cars, without Ally who is ill today\n\nWalking engage like Egyptians speaking French\nTwisting our ankles past the cold shade of buildings\nVacillating in the middle of the road\nWe finally decide where to find Juan\nThe usual\nSame-old-feeling-friends\nSmiling in the window of a cafe talking about\nRight now\n\nFacing west with the sun up my nose\nIs better than organic chemistry.\nPlus ice cream and maybe\nCoffee.\n\nI think we amuse people\nI don't care\nLet's play on Friday too!\nIn the park, I'll draw you a\nPicture of that bench not you\nWon't enjoy the hook I'll give you nose\nBy accident, I'm rusty\n\nRun off like rivers, still sandy\nBut in Cambridge and with a wind\nBack to where we came from with\nOnly a little procrastination\n\"Really we should have majored in Dance, or\neyebrow design. Recombinant DNA?\" I'll call you later\nand I cross the Mass Ave line."
    },
    {
      "category": "Resource",
      "title": "whalen_response.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-756-writing-and-reading-poems-fall-2006/482cb99e2eb4ec04ec249250bfdd2d36_whalen_response.pdf",
      "content": "Courtesy of Megan Sherkow. Used with permission.\nResponse to \"The Same Old Jazz\"\n\nThis poem seems to be more of Whalen's shtick: observations of his surroundings\nwhich lead to long trains of associations interspersed with philosophical ponderings.\nAlthough it is enjoyable to follow some of these trains, such as the weed branches to antlers\nto a menorah to the linguistic roots of the word menorah, at first glance I didn't think the\npoem offered much more than this, making the title ironic because the poem itself is \"The\nsame old jazz.\"\nI found other parts of the poem to be humorous as well. For instance, I was\nsurprised by his use of the word \"satyr.\" Maybe Whalen has some preoccupation with\nsatyrs because he also used the word in his poem \"For C.\" In any event, to me a satyr, the\nhalf goat/half man mythical creature, has little connection to a male cat. I think satyrs\nmight always be male and are known for seducing females, so I suppose seeing the\npregnant female cat is what triggered this odd association. However, Whalen's unusual\nchoice of words reveals the uniqueness of his thoughts, establishing his individuality, which\nis surprising considering that he rambles about the philosophy of selflessness.\nLikewise, the interplay between the two cats is comically rendered. Imagining that\none cat sniffing another's urine is a message from \"Sweet Papa\" to \"The White Queen,\"\nWhalen lightens the tone of the poem, providing a contrast between the earlier serious\nportions of poem where he mentions some of the common questions regarding the meaning\nof life such as, \"what if I never told any of this?\"\nThis leads me back to the repeated question, \"what's wrong with two?\" Originally, I\nthought that this question referred to some sort of profound spiritual connection, but after\nthinking about the parallel between the two cats and the narrator and Cleo, I came to the\nconclusion that perhaps Whalen is satirizing the pensive philosopher who sits and observes\nthe world, thinking deep thoughts. He indicates that the answers lie in the natural\nconnection between two people, in the physicality of \"some of [his] age [whirling] down the\nbathroom drain.\""
    },
    {
      "category": "Resource",
      "title": "ohara_imitate2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-756-writing-and-reading-poems-fall-2006/2b63b8183ad70454514eddf0c70059b6_ohara_imitate2.pdf",
      "content": "Courtesy of Megan Sherkow. Used with permission.\nFrank O'Hara Imitation\n\nThe day you told me my brown eyes were green\n\nToday I saw you, Bryan, as you passed me,\nand before I felt something, but I didn't think it was you,\nyou looked away, even though, that night, you wouldn't stop looking at me,\nkissing me, in that horrible sloppy way, and I wanted to pull back,\nlike my first kiss, but with Kyle, on top of tie-dyed sheets\nwhen he said, \"Isn't this great?\" and I wanted to look away.\n\nBut you passed right by, walking in your bow-legged stomp\njust like Ben Kay in my Spanish class who I fantasize about almost every day\nwhich makes me feel sleazy, but I do it anyway,\nunbuttoning his shirt, feeling his black goatee against my hand,\n\nBut then I saw him walk, just like you, in that awkward pigeon-toed way,\nHe walked right past me."
    }
  ]
}