{
  "course_name": "Writing About Literature",
  "course_description": "Students, scholars, bloggers, reviewers, fans, and book-group members write about literature, but so do authors themselves. Through the ways they engage with their own texts and those of other artists, sampling, remixing, and rethinking texts and genres, writers reflect on and inspire questions about the creative process. We will examine Mary Shelley’s reshaping of Milton’s Paradise Lost, German fairy tales, tales of scientific discovery, and her husband’s poems to make Frankenstein (1818, 1831); Melville’s redesign of a travel narrative into a Gothic novella in Benito Cereno (1856); and Alison Bechdel’s rewriting of Oscar Wilde’s The Importance of Being Earnest (1895) in her graphic novel Fun Home (2006). Showings of film versions of some of these works will allow us to project forward in the remixing process as well.",
  "topics": [
    "Humanities",
    "Literature",
    "Criticism",
    "Humanities",
    "Literature",
    "Criticism"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nStudents, scholars, bloggers, reviewers, fans, and book-group members write about literature, but so do authors themselves. Through the ways they engage with their own texts and those of other artists, sampling, remixing, and rethinking texts and genres, writers reflect on and inspire questions about the creative process. We will examine Mary Shelley's reshaping of Milton's\nParadise Lost,\nGerman fairy tales, tales of scientific discovery, and her husband's poems to make\nFrankenstein\n(1818, 1831); Melville's redesign of a travel narrative into a Gothic novella in\nBenito Cereno\n(1856); and Alison Bechdel's rewriting of Oscar Wilde's\nThe Importance of Being Earnest\n(1895) in her graphic novel\nFun Home\n(2006). Showings of film versions of some of these works will allow us to project forward in the remixing process as well.\n\nCourse Requirements\n\nReadings\n\nShelley, M. S.\nFrankenstein\n. New York, NY: Norton, 1995. ISBN: 9780393964585.\n\nMelville, H.\nBenito Cereno\n. Boston, MA: Bedford/Saint Martin's, 2006. ISBN: 9780312452421.\n\nBechdel, Alison.\nFun Home\n. Boston, MA: Mariner's Books, 2007. ISBN: 9780618871711.\n\nWilde, Oscar.\nThe Importance of Being Earnest, and Other Plays\n. New York, NY: Oxford University Press, 2008. ISBN: 9780199535972.\n\nAssignments\n\nStudents are expected to complete a minimum of 20 pages of writing, revise a written assignment based on feedback, and develop facility in oral presentations and discussions. The emphasis is on\nwriting\n: the\nwriting process\n, from pre-writing through drafting, revising, and editing; and the\nrhetorical dimensions of writing\n: the audience for whom one is writing, and the purpose for which one is writing--to argue, inform, persuade, explain, convince, and so on. Students also address major trouble-spots in grammar, mechanics, and style; effective paragraph construction; and proper use and citation of research materials and sources.\nIn-class workshops\noffer peer feedback on writers' work in progress, allowing students to develop a critical vocabulary and giving writers suggestions for revision. There is no final exam in this class.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClose reading essay (5 pp)\n\n10%\n\nClass presentation / handout\n\n10%\n\nResearch essay (5 pp)\n\n15%\n\nRevision (5 pp)\n\n15%\n\nCharacter study essay (5 pp)\n\n15%\n\nComparison essay (5 pp)\n\n15%\n\nActive participation\n\n20%\n\nActive Participation\n\nActive participation, including thorough reading of assigned materials before class, attendance in class and meetings with writing advisor, and participation in discussions and workshops is highly encouraged and counts towards 15% of the overall grade.\n\nExpectations\n\nWritten work should be double-spaced, with standard margins and font sizes.\n\nAttendance at film showings is required. Discussion will follow the showing.\n\nCome to class. Attendance will be noted and constitutes part of the participation grade.\n\nParticipate in class. A central goal of the class is creating a vital space for learning within a participatory culture.\n\nMIT Statement on Plagiarism\n\nPlagiarism--use of another's intellectual work without acknowledgement--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available at the\nWriting and Communication Center\nand the\nMIT Web site on Plagiarism\n.\n\nCalendar\n\nLEC #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nShelley.\nFrankenstein,\npreface, preface to 1831 edition and volume I\n\nShelley.\nFrankenstein,\nvolume II\n\nShelley.\nFrankenstein,\nvolume III\n\nWriting workshop: Close reading. Choose a report topic.\n\nLibrary research workshop\n\nEssay 1 (Close reading of a passage in\nFrankenstein\n- 5 pp) due\n\nFrankenstein\nSources and contexts: Reports (5 minutes) on Prometheus Myth (Hesiod's\nTheogony\n, Aeschylus'\nPrometheus Bound\n), Scientists (Erasmus Darwin, Luigi Galvani, Humphrey Davy), and Explorers (James Cook)\n\nFrankenstein\nSources and contexts: Reports on Creature's reading list (Plutarch's\nLives\n, Milton's\nParadise Lost\n, Goethe's\nThe Sorrows of Young\n\nWerther\n)\n\nFrankenstein\nSources and contexts: Reports on Romantic Poets (Shelley, Byron, Coleridge) and the Sublime (Burke)\n\nFrankenstein\nSources and contexts: Philosophy (John Locke, Jean-Jacques Rousseau, William Godwin, Mary Wollstonecraft)\n\nEssay 2 (Research paper on the implications of a source or context for\nFrankenstein\n- 5 pp) due 1 day after LEC #10\n\nFrankenstein\nAdaptations: Early Silent Film\n\nBranagh, Kenneth.\nFrankenstein\n. 1994\n\nFrankenstein\nAdaptations: Early Silent Film (cont.)\n\nRevision workshop\n\nEssay/Revision (Analysis of Shelley's use of a source in\nFrankenstein\n- 5 pp) due 2 days after LEC #14\n\nMelville.\nBenito Cereno\n\nMelville.\nBenito Cereno\nand Amasa Delano\n\nMelville.\nBenito Cereno\nand Performance\n\nWriting workshop: Character study\n\nEssay 3 (Study of character and performance in\nBenito Cereno\n) due 5 days after LEC #19\n\nWilde.\nThe Importance of Being Earnest\n\nWilde.\nThe Importance of Being Earnest\n(cont.)\n\nParker, Oliver.\nThe Importance of Being Earnest\n. 2002\n\nBechdel.\nFun Home\n\nBechdel.\nFun Home\n(cont.)\n\nWriting workshop: Comparison essay\n\nEssay 4 (Comparison of Wilde's and Bechdel's uses of a theme - 5 pp) due 2 days after LEC #25",
  "files": [
    {
      "category": "Resource",
      "title": "Guidelines for Revision",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-000j-writing-about-literature-fall-2010/be23a6f30478cfa25b81087bb648b9b4_MIT21L_000JF10_assn03.pdf",
      "content": "Guidelines for Revision\nPreliminary: Review Your Materials and Do New Research\n--Re-read the novel, your sources, and the most suitable scholarly essays. You want to\navoid the generalizations that may have crept into the first draft, to select what you really\nneed for the second, and to uncover passages and ideas you may not have considered\nbefore.\n--If you depended on secondary sources before, go to the original sources and read more\nof the texts. Reading is as important a part of revision as writing, if not more so. Take\ntime with this step before going back to your essay.\n1. Getting Started\n--Make sure you understand all comments on the essay. See me if they're illegible.\n--Look up grammatical, usage, and stylistic errors in the style manual.\n--Decide what areas you want to concentrate on in your revision; you may not be able to\ncover every possible issue.\n2. What's the Big Idea?\n--Reconsider your thesis and argument. Even if they were clear and effective in the\noriginal, see what you can do to improve.\n--Try to narrow and focus your thesis. Apply the \"so what?\" test. Ask yourself if\nanyone would argue against this thesis; if not, find a way to take a more controversial or\nspecific position.\n-- Ask yourself if your thesis is an observation or an argument. and try to avoid\ncommitting yourself to an observation that other alert readers would be able to make for\nthemselves.\n--Check your evidence. Have you derived your argument from a close reading of\nlanguage and details in the text or have you relied on generalizations?\n--Look at the introduction and conclusion. Make sure the introduction sets up the\nargument, showing the significance of your point. Try to make your conclusion\nprovocative and interesting. More than summarizing your argument, it should show its\nimplications in a larger context. Try to keep the reader thinking after the paper is over.\n3. How Do You Get There?\n-- Pay attention to topic sentences and paragraph organization. Each paragraph should\nhave a topic sentence that advances the argument. Give this sentence emphasis in the\nparagraph and subordinate your supporting statements, evidence, explanation, etc., to\nit.\n-- Use transitions from point to point within the paragraph and make sure the paragraph\ncompletes the thought before going on.\n-- Use transitions also from paragraph to paragraph, making it clear how you get from\none point to the next.\n-- Avoid summarizing or describing material that you can assume your reader knows,\nand try to avoid topic sentences that seem to point more to the work in question (\"in\nthe next paragraph the author uses this image,\" or \"then the character leaves town\")\nthan to your ideas (\"although the image seems earthly in the first sentence, by the\n\nsecond the author is giving it a new, more religious meaning,\" or \"nowhere is the\nauthor's use of flight imagery more evident than when the character leaves town\").\n-- Break up long, rambling paragraphs into more manageable units; alternatively\nconsider combining or expanding short, choppy paragraphs.\n4. Details, Details\n--Edit your essay. Fix the grammatical and spelling errors and obvious blemishes of\nstyle.\n--Work on verbs (reduce passive verbs and overuse of the verb \"to be\"), eliminate\nwordiness and repetition, and vary and enrich your diction (unless it needs simplifying).\n--Most of all, remember and remind your reader that there's a real person with a\ndistinctive voice behind all this prose. See if you can make that voice be heard!\n5. Think Again\nAll of the above is pretty much meaningless if you don't feel connected to the material or\ndon't have something to say. If you're not sure what you really meant or don't know\nwhy it's important, think about it harder, talk to a friend about the material (often a good\nway to develop your ideas), or see me or Louise Harrison Lepera for further\nbrainstorming.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.000J / 21W.734J Writing About Literature\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Notes on Close Reading",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-000j-writing-about-literature-fall-2010/911de183b58b0a2575b5324effb9b95c_MIT21L_000JF10_assn01.pdf",
      "content": "Notes on Close Reading\n\n21L000/21W734J\nWhat does it mean to read a text closely and analyze it? Why do we do close reading in\nliterary study?\nThe answers to these questions emerge more from the doing than the talking. Briefly,\nclose reading is a basic tool for understanding, taking pleasure in, and communicating\none's interpretation of a text. The skills employed in literary close reading lend\nthemselves to other kinds of investigation and analysis (for works in other media, for\nexample) but focus on language as conveying meaning.\nWhen an assignment calls for close reading, it's best to start by choosing a brief but\npromising passage, one that you find intriguing. Here are some useful steps.\n1. Choose a short passage that allows you to investigate the details closely. Here, for\nexample, is a paragraph in Mary Shelley's Frankenstein, Vol. 1, Ch. 4.\nI thought I saw Elizabeth, in the bloom of health, walking in the\nstreets of Ingolstadt. Delighted and surprised, I embraced her; but as I\nimprinted the first kiss on her lips, they became livid with the hue of\ndeath; her features appeared to change, and I thought that I held the corpse\nof my dead mother in my arms; a shroud enveloped her form, and I saw\nthe grave-worms crawling in the folds of the flannel. I started from my\nsleep with horror; a cold dew covered my forehead, my teeth chattered,\nand every limb became convulsed; when, by the dim and yellow light of\nthe moon, as it forced its way through the window-shutters, I beheld the\nwretch--the miserable monster whom I had created. He held up the\ncurtain of the bed; and his eyes, if eyes they may be called, were fixed on\nme. His jaws opened, and he muttered some inarticulate sounds, while a\ngrin wrinkled his cheeks. He might have spoken, but I did not hear; one\nhand was stretched out, seemingly to detain me, but I escaped, and rushed\ndown stairs. I took refuge in the court-yard belonging to the house which I\ninhabited; where I remained during the rest of the night, walking up and\ndown in the greatest agitation, listening attentively, catching and fearing\neach sound as if it were to announce the approach of the demoniacal\ncorpse to which I had so miserably given life.\nRead your passage multiple times, annotating it and responding to whatever you find\nstriking in the language and its technical features.\n2. For example, look at diction. What kinds of words does Shelley use? Look up any\nthat are unfamiliar. Does she aim for lofty diction (used for special occasions) or\ncommon diction? Are the words long or short, Latinate or Anglo-Saxon, specialized\n(i.e. legalistic, medical, jargon, elite) or ordinary? Remember that the rules for\ndiction are different at different times in history.\n\n3. Next, look at sentence structure. Can you map the sentences (find the subject and\nverb, locate phrases and clauses)? Does the author use active or passive verbs? What\nrhythms or patterns does the sentence structure create--long flowing ones, short\nchoppy ones--and how do these relate to the meaning?\n4. Does the passage contain figurative language? What sensory images or metaphors or\nsimiles do you observe? What is the significance or effect of the author's use or lack\nof figurative language?\n5. What do you notice about the structure of the passage overall? Does it have a climax\nor significant turning point? How does it organize or develop its ideas, impressions,\nor themes?\n6. You can also analyze tone. Is the narrator being straightforward, factual, open? Or is\nhe taking a less direct route toward his meaning? Does the voice carry emotion? Or\nis it detached from its subject? Do you hear irony? If so, what do you make of it?\n7. Once you have a grasp of the language, you can begin to look for problems or\ncomplications in your reading of the passage, to move beyond description to\ninterpretation. What are the effects of the technical features of the passage? In the\nexample above, you may discover some difference between what the author appears\nto be doing (giving you a complete, unbiased narrative) and what she also\naccomplishes (raising doubts about the narrator's point of view, whether he fully\nunderstands the implications of what he's seen, whether this narrator can be trusted,\netc.). You can now begin to talk about the ways Shelley's language, which seems to\ninvite our confidence, is also raising these doubts.\n8. At this point, you can propose a generic hypothesis, something like, \"In this passage,\nShelley raises questions about Victor Frankenstein's character through her contrast\nbetween the violence Frankenstein witnesses and his seemingly bland, even\ninappropriate response to it.\" You can proceed to fill in the outlines of this point by\nexplaining what you mean, using details and quotations from the passage to support\nyour point.\n9. You still need an argument and will need to go back to your opening to sharpen the\nthesis. The question is Why? Or to what effect? Your thesis might build on what\nyou've already written by suggesting the larger implications of your observations and\nby structuring your paper more rigorously.\n10. Using this method to get started, you will have achieved some very important things,\nnamely:\n1) you have chosen a specific piece of the text to work with, hence avoiding\ngeneralizations and abstractions that tend to turn a reader off;\n2) you have moved from exposition (explaining or summarizing what's there) to\narguing a point, which will involve your reader in a more interactive and risky\nencounter;\n3) you have carved out your own reading of the text rather than taking the more\nwell-worn path;\n4) you have identified something about Shelley's method that may well open up\nother areas of the text for study and debate. Bravo!\n11. With your more refined thesis in place, you can go back and make sure your\nsupporting argument explains the questions you've raised, follows through on your\nargument, and comes to a provocative conclusion. By the end, you may be able to\n\nexpand from your initial passage to a larger point, but use your organization to keep\nthe reader focused all the way.\nThe most exciting thing for a reader, and the most useful for an essayist, is that close\nreading generally offers surprises. Your project is not so much about telling readers what\nthey probably can see for themselves but also about revealing what they might have\nmissed that could delight them. It's helpful, then, to go into the paper with an open mind\nand be ready to adjust your thesis to the evidence you find in the text.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.000J / 21W.734J Writing About Literature\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Report Guidelines",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-000j-writing-about-literature-fall-2010/902ca801be64251e6f9998bf7641f465_MIT21L_000JF10_assn02.pdf",
      "content": "21L000/21W734J\nReport Guidelines\n1. Research your topic, consulting a balance of print and online sources and drawing\non the resources offered in the research workshop (SES #6).\n2. Select salient points and materials: facts and information, sample passages for a\nwriter, central ideas for a thinker or scientist, the passage(s) in Frankenstein\nwhere you see Shelley referring to or showing knowledge of your source or topic.\n3. Prepare a handout with copies for the class, no more than one sheet, presenting\nyour materials in an organized, concise format. You may include pictures or other\nvisual materials if they fit and are appropriate. Give your talk a title.\n4. Include discussion questions for the class. Make sure these are questions the class\ncan actually answer, given how little they will know about your topic. So, \"why\ndoes Shelley refer to Coleridge?\" may be impossible to answer and hard to\ndiscuss. \"How does Shelley's knowledge of Humphrey Davy's experiments seem\nto have influenced her portrayal of scientists in the novel?\" might work better, if\nyou have supplied enough information to allow students to speculate on that topic.\n5. Provide a bibliography in correct MLA format at the end of your handout.\n6. Practice delivering your talk so that you're sure you can make your points in\nunder five minutes, can address the class directly without reading from and\nrepeating the handout materials, and can hit the high points clearly and concisely.\n7. Meet with the other member(s) of your report group to compare your materials.\nYou want to avoid overlap and repetition, but you may also find intriguing shared\nthemes and threads to emphasize, and working together will enrich your\nindividual efforts. You can decide as a group if you want to present your talks in a\nparticular order or format (PowerPoint, speaking from different parts of the room,\ndoing an interpretive dance, etc.--just remember to stay within the time limits).\n8. You will be graded on the effectiveness of your handout and oral delivery and on\nthe usefulness of your report for engendering discussion and understanding of\nShelley's use of sources.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.000J / 21W.734J Writing About Literature\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Revision Workshop Worksheet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-000j-writing-about-literature-fall-2010/7e0db1597ed1f31439dc859800a9606d_MIT21L_000JF10_assn04.pdf",
      "content": "21L000/21W734J Writing About Literature\nRevision Workshop Worksheet\nImproving Your Thesis\n--Reconsider your thesis and argument. Even if they were clear and effective in the\noriginal, see what you can do to improve. Start by going over your essay and looking for\nthe best statement of your thesis, wherever it appears. Notice if you said it best at the\nbeginning, in the middle, or at the end. Use this space to write it out.\n--Try to narrow and focus your thesis. Apply the \"so what?\" test. Ask yourself if\nanyone would argue against this thesis; if not, find a way to take a more controversial or\nspecific position. Use this space to write a counter-thesis, the statement you imagine\nsomeone making in opposition to your own or departing from it some critical way.\n-- Ask yourself if your thesis is an observation or an argument and try to avoid\ncommitting yourself to an observation that other alert readers would be able to make for\nthemselves. Even if you have a thesis that sets up an argument, see if you can narrow it\nto the issue that is of greatest concern in your essay. See if your thesis anticipates and\naddresses the counter-arguments raised above. Use this space to write a more focused\nthesis than the one you have.\n--Now make sure that your refined thesis appears in your opening paragraph and that\nyou have set it up succinctly and energetically. Avoid windy generalizations and\ndigressions. Provide a useful context for your point, including the relevant information\nthe reader needs. Start your new opening paragraph here.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.000J / 21W.734J Writing About Literature\nFall 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}