{
  "course_name": "Writing About Race: Narratives of Multiraciality",
  "course_description": "In this course we will read essays, novels, memoirs, and graphic texts, and view documentary and experimental films and videos which explore race from the standpoint of the multiracial. Examining the varied work of multiracial authors and filmmakers such as Danzy Senna, Ruth Ozeki, Kip Fulbeck, James McBride and others, we will focus not on how multiracial people are seen or imagined by the dominant culture, but instead on how they represent themselves. How do these authors approach issues of family, community, nation, language and history? What can their work tell us about the complex interconnections between race, gender, class, sexuality, and citizenship? Is there a relationship between their experiences of multiraciality and a willingness to experiment with form and genre? In addressing these and other questions, we will endeavor to think and write more critically and creatively about race as a social category and a lived experience.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Literature",
    "Creative Writing",
    "Fiction",
    "Nonfiction Prose",
    "Social Science",
    "Anthropology",
    "Ethnography",
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Literature",
    "Creative Writing",
    "Fiction",
    "Nonfiction Prose",
    "Social Science",
    "Anthropology",
    "Ethnography"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nIn this course we will read essays, novels, memoirs, and graphic texts, and view documentary and experimental films and videos which explore race from the standpoint of the multiracial. Examining the varied work of multiracial authors and filmmakers such as Danzy Senna, Ruth Ozeki, Kip Fulbeck, James McBride and others, we will focus not on how multiracial people are seen or imagined by the dominant culture, but instead on how they represent themselves. How do these authors approach issues of family, community, nation, language and history? What can their work tell us about the complex interconnections between race, gender, class, sexuality, and citizenship? Is there a relationship between their experiences of multiraciality and a willingness to experiment with form and genre? In addressing these and other questions, we will endeavor to think and write more critically and creatively about race as a social category and a lived experience.\n\nClass Assignments\n\nThis is a writing-centered course. Students will write a one-page response paper for each assigned text. There will also be two longer writing assignments: a 7-8 page critical essay responding to readings and screenings from the first month of the course, and a 12-15 page personal essay in which you will incorporate what you have learned through our critical/theoretical discussions of assigned texts into a creative exploration of your own experience - what Cherrie Moraga has called \"theory in the flesh.\" In addition, there will be short in-class writing exercises over the course of the semester.\n\nRegular class participation is required. Students are expected to come to each session prepared to discuss the day's texts, and every student will lead one class discussion. In addition, you will be expected to provide productive feedback on your peer's manuscripts during workshops.\n\nWorkshops\n\nThere will be three writing workshops during the semester in which students will break up into small groups and discuss each other's critical and personal essays as works-in-progress.\n\nGrading\n\nYou will receive individual grades for the two essays. Your final grade will be based upon these essays, the other contents of your portfolio (response papers and in-class assignments) and on your participation in class discussions and workshops.\n\nTexts and Films\n\nPlease see the\nreadings\nsection for a detailed list of the Texts and Films used in this course.\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nTime Magazine, \"The New Face of America\" (selected articles)\n\nIn-class writing assignment\n\nDunning, \"Brown Like Me\"\n\nRekdal, \"We Do Not Live Here...\"\n\nZack, \"American Mixed Race\"\n\nRopp, \"Do Multiracial Subjects Really Challenge Race?\"\n\nPerez, \"How To Rehabilitate a Mulatto\"\n\nReview\n\nMoraga, \"La Guera\"\n\nAnzaldua, \"La Conciencia de la Mestiza\"\n\nOrtiz Cofer, \"The Story of My Body\"\n\nProposal for critical essays due one day after Ses #5\n\nWorkshop of critical essays\n\nScreening: Ngozi Onwurah,\nThe Body Beautiful\n\nDavid Hosley,\nA Beautiful Blend\n\nKip Fulbeck,\nBanana Split\n\nBarry,\nOne Hundred Demons\n\nDiscussion of films\n\nAbel,\nLa Perdida\n\nIn-class writing assignment\n\nCritical essay due\n\nAbu-Jaber,\nThe Language of Baklava\n\nAbu-Jaber,\nThe Language of Baklava\n(cont.)\n\nIn-class writing assignment\n\nMcBride,\nThe Color of Water\n\nIn-class writing assignment\n\nMcBride,\nThe Color of Water\n(cont.)\n\nNunez,\nA Feather on the Breath of God\n\nIn-class writing assignment\n\nProposal for personal essay due\n\nNunez,\nA Feather on the Breath of God\n(cont.)\n\nWorkshop of personal essays\n\nSenna,\nCaucasia\n\nIn-class writing assignment\n\nSenna,\nCaucasia\n(cont.)\n\nFirst drafts of personal essay due\n\nAdiele,\nMeeting Faith\n\nIn-class writing assignment\n\nAdiele,\nMeeting Faith\n(cont.)\n\nWorkshop of personal essays (revisions)\n\nScreening: Ozeki,\nHalving The Bones\n\nDiscussion of\nHalving The Bones\n\nOzeki,\nAll Over Creation\n\nIn-class writing assignment\n\nOzeki,\nAll Over Creation\n(cont.)\n\nLast class, reading and party\n\nRevised personal essay and portfolio of other written work due",
  "files": [
    {
      "category": "Resource",
      "title": "“Uno, Dos, Tres…” I began",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-742j-writing-about-race-narratives-of-multiraciality-fall-2008/11683880f498869689e80522899eab0c_MIT21W_742JF08_a_qntfd.pdf",
      "content": "MIT Student\n21W.742 Writing about Race\n\nA Quantified Relationship\n\n\"Uno, Dos, Tres, Cuatro, Cinco...\" I began.\nIt was almost noon on a Saturday morning; most of the boys in the neighborhood\nwere probably kicking a soccer ball, scraping up coins to buy a piece candy from a local\nvendor, or picking fights with kids in other neighborhood. I was almost four years old,\nand my family was living in my grandmother's house in Aguililla, Michocan--my\nmother's hometown in Mexico. Her home consisted of one large kitchen with a small\nwooden table, and one bedroom that held two queen-sized beds. There was only one faint\nlight bulb in the house, since mainly her candles kept the room bright when the sky got\ndark. My mother always enjoyed relaxing on the hammock that was nestled in between\ntwo pillars in my grandmother's patio, especially during the dry hot days of the summer.\nI was counting the number of red stripes on my mother's sleeve. While she sat\nrelaxing under a shade, I just wanted to keep counting over and over, trying to get the\nnumbers' order perfect. She told me to go run and play with the chickens in my\ngrandmother's backyard but I couldn't get up to do it, not today. The sensation I felt of\nbeing able to understand the world of numbers thrilled me. My mother had just taught me\nthe first nine numbers in Spanish, and I felt like it was the beginning of my understanding\nof an entire new language.\n\nI had asked her what came next, since I naturally understood that there had to be\nmore. But she said that I would need to grow up to understand more. But weeks passed,\n\nand I only grew more and more curious about numbers and mathematics to the point\nwhere my mother could not answer my curiosity. She was familiar with basic addition\nand subtraction-- some multiplication--but anything deeper into the world of\nmathematics was out of her reach because she had never learned it properly. My mother\nhad decided to quit school at the age of 11, right after finishing elementary school. She\nhad given up on her education. Though she could have continued to middle school, which\nwould cost her family money, she felt compelled to stay at home and help her mother\nwho was still housing six other sons that were all older than my mother.\nBut contrary to how she sees herself, I have always believed that my mother is\none of the hardest working people I have met in my life. She is the second youngest\ndaughter of 13 children, with her oldest brother being 17 years older than her. In Mexican\nfamilies, the younger daughters are typically the ones most expected to help the family by\nserving the parents and older siblings. She grew up in a rural Mexican rancho, where the\neveryday lives of women revolve around housekeeping, cooking, and taking care of the\nmale workers. Though my mother was not necessarily fond of these responsibilities, she\nhad decided to accept this position instead of pursuing an education.\nWhen she came of age, however, my mother had decided that this was not the life\nshe wanted to lead, and certainly not the place where she wanted to raise her children.\nShe had met my father, who was already highly involved in drug trafficking and was\nslowly gaining more and more respect as an authority in the business. Aware of the \"good\nlife\" that America had to offer, my father convinced my mother to flee with him to the\nUnited States where they could start a family together. Knowing only a life of misery in\nthis rural Mexico, my mother was willing to start a new life and pursue the American\n\ndream that she so faithfully believed now. She abandoned her family in Mexico at the age\nof 23, and gave birth to her firstborn daughter Jenny Torres in Houghson, California soon\nafter. Five years later, my father was still highly involved with the drug cartel business in\nMexico. But broken agreements, misled deeds, and malicious business ultimately led to\nthe assassination of my father, leaving my mother with a 5 year-old daughter and a new-\nborn child in her arms while living in California. Subsequently, my mother was forced to\nmake her return to Mexico, because she could not afford a living for herself and her two\nkids in the United States. We went to go live in my grandmother's house in Mexico,\nwhere my mother could recuperate and eventually learn how to support her two kids all\non her own. We had been here for over three years now and here I was, almost four years\nold, just learning how to count.\n\n\"Six, Seven, Eight, Nine, Ten...\"\nMy eyes stayed fixated on the moonlight that was creeping through the blinds,\ncarrying what appeared to be a celestial glimmer into our bedroom. Cradled in between\nmy mother's lower back and my sister's thick golden brown hair, I always had trouble\nsleeping at night when I was a child. I remember always turning side to side, sometimes\nsweaty, kicking the air, shoving the covers over my sister's legs so as to find the place\nwhere sleep was hiding.\nWe were now staying in my aunt's house in East Palo Alto, CA. We left Mexico\nwhen I was almost five years old, and my mother could only afford to pay rent for one\nbedroom. One queen-sized bed, a long wooden night stand, a television with an antenna\nwrapped in aluminum foil, and a small closet in which one could easily decipher my\n\nmother's life story; our shared small bedroom contained enough to keep me company in\nthe nighttime.\nThis was the time for me to think. I was a fairly quiet child at my school\nBrentwood Oaks in East Palo Alto, and I always blushed when teachers called on me. But\nwhen trying to fall asleep my mind would just keep racing, thinking of the right words\nthat I should have communicated better that day. By the time I was eight years old I\nalready spoke English and Spanish fluently--I had a vocabulary that was twice as larger\nthan most kids my age, and yet I was never willing to speak either language much. The\nonly time I spoke up was during my mathematics classes. I was never too shy about\nsharing my answers with the class, or asking questions to the teacher. I enjoyed learning,\nso I had no problem with communicating if it helped me understand mathematics more.\nThe more that I became fluent with number manipulation, the more intense grew\nmy curiosity for the nature of such a language. Multiplication and division came easy to\nme, and fractions and long division eventually became like puzzles that were fun to solve.\nIn any situation, there was one right answer, and one right way of thinking; I began to\nform a confidence like no other. I could speak mathematics, maybe even better than I\ncould speak English or Spanish at the time. I had first learned to count in Spanish, and I\nwas communicating the mathematical terms at school in English now, but the very\nnumbers themselves were their own words that I successfully comprehended; this was\nwhen I learned that mathematics was universal--it could be spoken in any language. It\nbecame the bridge between my two acquired tongues.\nThe problem, however, was that this newly realized inclination towards\nmathematics forced me to compartmentalize the way in which I communicated with\n\npeople. I was confident in the way that I spoke to my math teachers, but I kept from\nspeaking to my peers because I did not know how to. My Black peers only spoke English,\nso that was my only way to communicate with them. But with my Mexican peers, I\nnaturally wanted to speak Spanish to them since that is the language that I was taught to\nspeak by my own Mexican family. This was the source of confusion, and the reason why\nI couldn't sleep at night sometimes. I was trying to speak three different languages at the\nsame time without even realizing it.\n\nBut with my mother, I am only allowed to speak Spanish because that is the only\nlanguage she can speak. It was in Spanish that I learned so much about my mother's\nhistory, about her love for my father who was murdered only months after my birth, and\neven the stories of her hope to pursue the American dream. Countless times, I asked my\nmother to tell me the story of her journey to the United States as an illegal immigrant. But\nshe always refuses to reveal many details of her trips--she hates recalling the days that\nshe had to endure the thirst while walking miles and miles through the Arizona desert. I\ncannot even imagine what it was like when her legs were cramping up while curling\nunder the seat of a car for three hours in case they were pulled over by border patrol. In\nany case, she always ensures to remind us that every single time she crossed the border,\nshe was doing it for my sister and me, to provide us with the opportunities that she had\nnot been privileged to have as a young girl. To this day, she still tells me that the last\nthing she wants to see is us working a job that involves backbreaking labor like her jobs\nhave been. She has never been ashamed of her occupations, but she faithfully believes\nthat all her sacrifices will ultimately bring my sister and I many opportunities that will get\nus far in life.\n\nThis was evident in the way that she was always curious to know about\neverything I had learned in school every day. I really enjoyed learning in elementary\nschool, so I had no problem communicating my excitement about school to my mother.\nAdditionally, I had no problem with having my mother taking a break from her\napparently busy schedule around the house to relax while she talked to me. I would tell\nher about my geography, earth science, and arithmetic classes and she would attentively\nsit down and listen to me. From state capitals, to learning about cold blooded animals, I\ncould tell that my mother was fascinated with my desire to learn by the way that she\nlooked at me as I spoke. Her eyes were squinted, her lips were fastened, and she gently\ncaressed her knees with her tired hands. Perhaps it was a grateful fascination, in which\nshe could revel in my positive educational experience--it was an opportunity that she had\nnot been blessed with herself.\n\nWhen I was in elementary school, she was working as a housekeeper at a nearby\nQuality Inn. Her inability to learn English eliminated many potential jobs, but she did not\nmind a janitorial job because she had been used to physical labor all her life. Even at\nhome, before taking us to school and heading for work she would always make sure that\nthe bed covers had been perfectly set and that all of our clothes had been placed in the\nright location. I would even come home every day from school to my mother mopping\nthe living room or scraping the grease from the stove in the kitchen, soon after she had\njust gotten home from work. We were still living in my aunt's house, so my mother felt\ncompelled to help around the house wherever she could to express her gratitude for my\naunt who let us live in her home.\n\nI was about nine years old when I discovered how very little money my mother\nactually made at her job. I would always walk with her to the nearby grocery store to cash\nher check on Fridays. She would hold my hand cautiously and always forced me to walk\nnext to her on the side away from the street. I had never asked how much actual money\nshe had been handed by the grocery clerk who cashed her check, but I just knew that she\nwould always use a couple of those dollars to buy me an ice cream cup or a bag of hot\nCheetos to take home with me.\nWe had just walked out of the store with a chocolate bar in my pocket when it\nfinally occurred to me that I should ask. But soon after, I almost could not believe it when\nshe told me that her job earned her only $6.50 an hour. For the next 5 minutes of our\nwalk back home, I was highly tempted to run back inside the store and exchange the\ncandy for the money back. Somehow in my head I could not piece together why\nsomebody who works so hard to carry out such arduous tasks would make so little\nmoney. After that, I began to see everything in terms of wages--every $5 that I asked my\nmother to spend on me would equate to about one hour of her life that she had was at her\njob picking up heavy objects, scrubbing sinks clean, cleaning up after careless\nindividuals. I learned to never ask for more from my mother at such an early age. My\nmathematical approach to my mother's situation allowed me to realize that everything I\nhad taken for granted actually had a price that my mother had to pay for herself, and I did\nnot want to let that keep happening.\n\n\"Eleven, Doce, 13, Fourteen, Quince...\"\n\nI was sitting by myself at our small square table that stood right next to the\nrefrigerator and the stove, trying to eat a dinner plate that I had microwaved myself. We\nwere now living in the garage of one of my mother's friends in East Palo Alto, which\nconsisted of only one bedroom and a living-dining room combo that was equipped with a\nsmall sink and a stove. I had my own twin-sized bed now, but my mother and sister still\nshared the same queen sized bed that we previously had in our old room. I liked this place\na lot better than our old room, especially because we had our own bathroom, and even\nour own space to grow our own plants just outside of our door on the side of the house.\nThe only thing that would have made this place even better would have been a desk to do\nall my homework assignments. But I never asked for one--the small dinner table was\nenough space for me.\nMy sister had just gotten home from her after-school program, and she was on the\ncouch trying to finish her homework early so as to have time later that night to talk on the\nphone with her friends. She was a junior in high school, so she was always complaining\nabout how much work made junior year unbearable. The old television was on and I was\nwatching the same cartoons that I was accustomed to watching every day after middle\nschool. Normally my mom would have dinner prepared around this time, but today was\ndifferent. The wooden gate banged outside, and soon our mother's large dark hair was\nvisible at the doorway. She was carrying a manila folder in one hand, and her black purse\nin the other. She was still wearing her uniform shirt from work, with the \"Nancy's\nSpecialty Foods\" emblem on the front. She was more quiet than usual, and she just sat\ndown calmly. Within two seconds, the tears began to stream down her cheeks as she sat\non the couch silently. In a few more seconds, the silent tears became incessant cries.\n\nI quickly turned my head away from my dinner, and my sister immediately\npushed her books aside hastily. Through her sobbing, my mother tried to explain to us\nthat her application for affordable housing in a nearby apartment complex had been\nrejected to her face. This was not the first time that we had been denied since most places\nhad lotteries for acceptance, so I did not understand why she was so frustrated. It was\nthen that my mother yelled the word \"discriminacion!\" in agony. She had tried to go in\nwith all the necessary documents, old utility bills and bank statements to demonstrate\ngood credit, even a recommendation letter in Spanish. And still, the fact that she could\nnot verbally communicate with the manager due to her lack of English skills, the\nopportunity was denied to her face. I cannot even imagine the kind of response she\nreceived--it was enough to bring my mother to tears.\nPowerless. That is how she felt, and that is how she described it. America had let\nher down. In her eyes, the American dream which she so desperately pursued would not\nbe a reality until she had a place to call her own. To her, an apartment for herself and her\ntwo kids meant that she would finally have an establishment--a foundation for her own\nfamily. Ever since we had moved to the United States, we had always lived inside of a\nhome that was not our own. My mother still felt like a guest in this country. To be an\nAmerican, she needed to have a home that was her private property. But today, she\nrealized how much more it would take. We would need to remain guests in America for a\nfew more years, and she would need to start making attempts to learn English soon.\nThe only rare chance that I had to hear my mother speak English was during\nphone calls with my teachers. There were many occasions in which my middle school\nteachers felt compelled to call my mother and ask her why there had been such a drastic\n\nchange in my behavior in school, and I would witness her struggling with her English\ntrying to communicate how sorry she was to my teachers. I had gone from being one of\nthe best-behaved outstanding students, to a misbehaved poor-performing delinquent at\nschool in sixth grade. During my sixth grade year, we were told that the males at our\nschool had acquired some of the lowest standardized test scores in the entire state of\nCalifornia, and I was performing no better than the rest of my male counterparts. At the\ntime, I was so afraid of being different from the other boys around me because I feared\nthat I would be classified an outsider. I was in school with the same people who I gone to\nkindergarten with, but as we kept growing older it felt more and more like we wanted to\nbuy into the wider negative stereotypes that plagued our community. Ever since East Palo\nAlto had been US Murder Capital in 1992, all of the wealthy surrounding cities in the\nSilicon Valley had since labeled East Palo Alto as a dangerous, criminal city. We had\nbeen marginalized.\nOn my walk home from middle school, I had become accustomed to seeing a\npack of boys running down Camellia Drive, chasing down a car from which they could\npurchase their weed. I saw young boys running through our back yard to escape the\npolice. I fell asleep to the sound of bullet shots and police sirens right outside my\nwindow, hoping that a bullet would not come flying into my home. Gang violence was\nstarting to become common among my friends and even older family members. It was\nnot the life I wanted to live, but at the time it felt like it would be my only option. My\nnegative surroundings had taught me to silence my mathematically-oriented nature, like it\ndid not belong. As teachers grew more frustrated with me, the harder I tried to upset\nthem. I knew I had potential, but I did now know why I did not want to realize it. Afraid\n\nof being different from the rest of the kids in school and afraid of being labeled, I hid my\nintellectual ability, pretended that I hated school, and forced myself to fail miserably in\nhomework and tests. This was always so frustrating, because I would listen so attentively\nin my math classes in middle school, even while all my peers were getting distracted and\nnot focusing on learning the material. And still, I felt nervous about demonstrating my\nskills on paper, so I would always show the right steps on exam problems but would\nintentionally make small mistakes so as to make my answers completely wrong.\nThe Latinos around me were beginning to speak their own language--Spanglish.\nIt was a very unique language that naturally eased the frustration of being forced to speak\ntwo languages in and out of the home for Latinos. I naturally became a fluent speaker of\nit. It felt so good being able communicate the idea I had in mind in whatever language\nfelt appropriate at the time, even in between sentences and phrases. I spoke this to my\nsister, my cousins, and my Latino peers who were all doing so poorly academically. The\ntwo languages I had been taught at such a young age were beautifully combining into one\neclectic tongue that took the best of both worlds--a hybrid. The sad part was that I was\nbeginning to feel like it left no room to speak mathematics, which had been such a big\npart of my life until then. If English and Spanish were blending so well together, why\nwasn't mathematics so easy to incorporate into my lifestyle? I did not know where to\nplace it--in other words, I was not sure if my mathematical talent made me more of an\nEnglish-speaking American than it did a Spanish-speaking Mexican, or vice-versa. It had\nserved so well as a bridge before, but now I was beginning to believe that it served more\nas a barrier to my speech freedom.\n\nI envied my mother so much at the time; I believed that she could not relate to the\nstruggle I was facing. She only knew one language, and her life had been centralized in\nthat one dimension. I felt like I was dealing with three dimensions, looking for the best\nway to bring balance to it. But it was not until my sister's high school graduation that\nmany things started to make more sense to me. My sister had overcome so many social\nbarriers. She had been expected to get pregnant and drop out of high school, like many\ngirls her age had done. But she had grown an affinity for politics, social change, and\neconomic reform and was admitted to UC Berkeley. My sister had utilized her education\nto achieve more than I had ever dreamed possible for her, or even for me. A powerful\nwriter, my sister had learned Spanglish as well, but it was her mastery of both the English\nand Spanish languages that allowed her to excel. This was when I learned that I was in a\nbetter position than most people because I actually had the ability to think in terms of\nthree different languages. This could work to my advantage, and I realized that I too\ncould make it to college as well, someday.\n\n\"16, 17, 18, 19, 20\"\n\nMy heart was racing. We never had carpet in our house-- my mother seemed to\nalways prefer tile floors. But this just made the floor feel even colder today. I was\nwearing my slippers and pajamas, as I raced to connect my computer to our 50-day trial\ndial-up internet connection with AOL. It was nine in the morning on a Saturday, and my\nmother was at work. She had left me breakfast on the stove, but I was too excited to eat it.\nI opened the old lap top that my sister handed me down, and as I waited for my desktop\n\nscreen to load, I looked around our new house. It was very sunny outside, and the dining\nroom looked too clean. I could see the greenery of the spring season through the glass of\nour front door. This day was almost too perfect. When I finally logged on to the MIT\nadmissions website, I nervously clicked on the link that would reveal my destiny. I had\nbeen admitted. I swung my hands in the air, clapped my hands to redness, and unleashed\na real cry of joy.\n\nI was seventeen years old, and I had just moved into my new room in our new\nhouse. I had never had a space to call my own since we had always lived in such small\nspaces. But after years of determination, my mother somehow managed to save up\nenough money to put down money for a down-payment on a home in East Palo Alto. She\nwas still working as an assembly worker in a quiche factory, but she had asked my uncle\nto cosign with her on this house and he happily agreed. His great credit was enough for\nthem to get a loan approved. And here I was, sitting in our own living room reading an\nadmission letter from the Massachusetts Institute of Technology on my computer screen.\nI always look back at this day as one of the best days of my life. My mother had a place\nto call her own, and I was on a great path to college.\n\nI am currently a junior at MIT, and I can truly say that this is a magical place that\ntransforms people. I firmly believe that I will emerge from MIT a stronger thinker with\nkeep abilities, a passionate leader with a global perspective, and overall a more\ncompassionate human being. Having such a strong mathematical background in high\nschool ultimately led me to choose engineering as my main focus of study in college, and\nI believed that MIT would be the best place to do that. The reason that I believe that MIT\nis such an outstanding institution is because it has allowed me redefine my\n\nnumerical/computational ability to something even greater. Before MIT, I had a very\nlinear approach to mathematics--the belief that there was always one way of thinking\nand one right answer. While studying engineering, I have discovered that the beauty of\nmathematics and problem-solving lies in its ability to get manipulated itself to create\nsomething even more advanced. For example, many famous scientists have reduced some\nof the world's most complex problems into a simple equation. Once these constitutive\nmathematical relationships have been defined, they have allowed us to explore even\ndeeper levels of nature solely on the basis of mathematical manipulation and\ninterpretation. MIT has allowed me to share this perspective, and that is why I believe\nthis place produces such amazing engineers.\n\nIn addition, being at MIT has allowed me to view mathematics for what it really\nis--another language. My sophomore year I took a class called \"Mechanical waves and\nvibrations\" and on the first day of class, our Polish professor named Wit Busza told us:\n\"You cannot describe nature with English, or German, or Chinese, or any other spoken\nlanguage for that matter--that of course, can only be done with mathematics.\" Numbers\nare their own entities, and they appear all throughout history written in their own way,\nbeing held constant. I think that there is a great deal that can be learned from thinking of\nmathematics and life in this respect. The fundamentals have never changed, and yet\nhumans have progressed so much because of it. My dream is to someday make a\ntechnological contribution to mankind that my mother can be proud of. Perhaps the\nscientific properties of this contribution will be highly complex, but I believe that my\nmother will simply sit back and simply listen to me explain as she always does. Maybe I\nwill be speaking Spanish, or maybe even English. My story has served to teach her that\n\nthere are countless benefits to having multiple ways to communicate. She has been taking\nEnglish classes, and is hoping to earn her citizenship in the next few years for her to\nfinally be recognized a citizen of this country. I am happy to know that I was able to\nteach her something, because she taught me so much. And it all started with her teaching\nme the number line.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.742J / WGS.231J Writing About Race: Narratives of Multiraciality\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}