{
  "course_name": "Writing and Experience: Reading and Writing Autobiography",
  "course_description": "The reading and writing in this course will focus on the art of self-narrative or autobiographical writing. Such writing can be crafted in the form of a longer autobiography or of separate, shorter autobiographically-inspired essays. The various forms of autobiographical narrative can both reflect on personal experience and comment on larger issues in society.\nThis course explores, through reading and writing, what it means to construct a sense of self-and a life narrative-in relation to the larger social world of family and friends, education, media, work, and community. What does it mean to see ourselves as embodying particular ethical values or belonging to a certain ethnic, racial, national or religious group(s)? How do we imagine ourselves within larger “family narrative(s)” and friendship groups? In what ways do we view our identities as connected to and expressed by our educational and work experiences, including experiences at MIT? How do we see ourselves as shaping and shaped by the popular media culture of our society? How do we think about our ethical and social responsibility to our friends, families and communities (large and small)? Readings will include autobiographically-inspired nonfiction and fiction.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Literature",
    "Creative Writing",
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Literature",
    "Creative Writing"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 2 seminars / 1 week, 1.5 hours / seminar\n\nPrerequisites\n\nNone.\n\nDescription\n\n\"If you want readers to breathe life into your writing... then you must breathe experience into your words as you write\"- Peter Elbow,\nWriting With\n\nPower\n\n\"Good writing is about telling the truth\"- Anne Lamott,\nBird by Bird: Some Instructions on Writing and Life\n\n\"Life is an endless recruiting of witnesses\"- Carol Shields,\nThe Stone Diaries\n\nOur reading and writing in this course will focus on the art of self-narrative or autobiographical writing. Such writing can be crafted in the form of a longer autobiography or of separate, shorter autobiographically-inspired essays. The various forms of autobiographical narrative can both reflect on personal experience and comment on larger issues in society.\n\nThis course explores, through our reading and writing, what it means to construct a sense of self--and a life narrative--in relation to the larger social world of family and friends, education, media, work, and community. What does it mean to see ourselves as embodying particular ethical values or belonging to a certain ethnic, racial, national or religious group(s)? How do we imagine ourselves within larger \"family narrative(s)\" and friendship groups? In what ways do we view our identities as connected to and expressed by our educational and work experiences, including experiences at MIT? How do we see ourselves as shaping and shaped by the popular media culture of our society? How do we think about our ethical and social responsibility to our friends, families and communities (large and small)? Readings will include autobiographically-inspired nonfiction and fiction.\n\nThroughout the course, we will explore the craft of storytelling and the art of persuasion, exploring different ways to employ the tools of fiction (e.g., character, setting, dialogue) in writing creative nonfiction narratives that draw upon autobiographical experiences. In discussing some readings, we will examine the ethical issues involved in defining the boundary between fiction and nonfiction in life writing. We will also explore multiple ways in which students can write effective and persuasive creative nonfiction essays that draw upon life experiences and establish a perspective or craft an argument, drawing on outside sources and citing these sources appropriately.\n\nNotes\n\nThis course meets MIT's\nCI-HW requirement\n.\n\nMIT students taking this course can only receive credit if they have not taken another 21W.022 Writing and Experience class.\n\nRequired Reading\n\nLunsford, Andrea A.\nEasy Writer: A Pocket Guide\n. 5th ed. Bedford / St. Martin's Press, 2013. ISBN: 9781457640469.\n\nYou should also have on hand a college dictionary and thesaurus.\nThe Oxford English Dictionary\nis available online through the library website for MIT students. There are also other valuable writing and research aids available online to MIT students through the\nlibrary website\n. Check the \"virtual reference\" section of the library website. For general writing reference, also see\nEasy Writer\n.\n\nWriting and Oral Communication Assignments\n\nThe goals of this course are to develop your skills in writing creative nonfiction that draws upon your own life experiences as well as secondary sources. We will focus specifically on: (a) translating the material of personal experience into vivid, reflective, well-organized and persuasive prose that expresses a clear perspective or central idea; (b) using outside sources effectively and appropriately. By the end of the term, you will have written about 25 pages of revised prose, as well as your homework assignments.\n\nIn writing from your own life experience, it is crucial that you shape your material to motivate a wider reading public. There needs to be something at stake for readers in your writing about, for example, your Halloween rituals, community service experiences or your pride in your grandmother's dedication to her job. The motive for readers might be the desire to meditate on common human fears, desires, conflicts or life stages or to understand a particular social issue from your perspective. Remember that argument can take many forms; life experience is a type of evidence.\n\nThere will be four major writing assignments; students will submit each piece in a first version (a fully realized piece, not a \"rough draft\") and later, in revised form. In each assignment, you will be asked to draw upon autobiographical material. In the first essay of 4-5 pages (typed, double-spaced), you will focus on a core aspect of individual identity. The second essay is a \"personal investigative\" assignment (7-8 pg.); you are asked to explore a significant question that arises from your own experience and integrate relevant material from outside sources.\n\nThe third and fourth essays (6-7 pg. each) focus on topics/experiences of your own choice. These four major assignments, as well as regular homework exercises are at the center of the course. Each major assignment will build upon the skills of the previous piece(s) that you've written. Reading assignments and preliminary writing exercises will prepare you for each piece that you will be crafting. Over the course of the semester, you will revise each major piece. Throughout the semester, our class will focus on writing as a process of initial crafting and revising to create works that are lively, clear, engaging and meaningful to a wider audience.\n\nStudents will also give an oral presentation and readings from their own writing at the beginning and end of the term. There is no final exam in this course.\n\nClass Participation and Attendance / Writing Workshop\n\nTo foster a sense of intellectual community, this course is structured as a seminar. Throughout the term, we will be discussing the work of professional, as well as student, writers. It is crucial that you come to class prepared to offer thoughtful comments on assigned readings as well as helpful feedback to your peers. A vital, ongoing intellectual conversation--about our writing and that of published authors--is at the heart of the course. To be effective as a seminar participant, you will need to complete reading and writing tasks by their due dates. Please arrive at class on time and bring assigned readings with you.\n\nThe writing workshop--in which students respond to their peers' works-in-progress--is a very important part of the course. For all four major writing assignments, we will have an in-class workshop after first versions have been submitted. We will also workshop some shorter pre-draft writing assignments. My expectation is that you will respond to each other's work seriously and critically and approach each essay with sensitivity, insight and imagination. For each workshop, you will be asked to read several essays, discuss them with your classmates and respond to each piece in the form of individual letters to the writers. The ethical norm of our class is that all students writing (including your comments) is considered confidential; you should store other students' works-in-progress in a secure place and not discuss your peers' writing (or your comments) outside the class community. This ethic, regularly practiced in professional writing workshops, enables us to develop the trust and security we need as a small writing community.\n\nSince our class functions as a writing community and the first \"public\" for your essays, it is essential that you attend class faithfully. If you have more than two absences, it may affect your final grade. Under Writing Program policy, you cannot pass the course if you have more than five absences. Three latenesses (more than ten minutes) count as an absence. If you miss class because of a personal or medical emergency, please contact me (or have a dean contact me) as soon as possible. Do not miss workshop classes except in an emergency.\n\nPolicy on Electronic Devices in the Classroom\n\nAll students in our classroom community have an equal right to a distraction-free educational environment, which is most conducive to learning. The unnecessary use of electronic devices in the classroom (\"multitasking\") is distracting and unfair to other students and the instructor.\n\nWithin our classroom, laptop computers and other electronic devices may only be used to access online readings or assignments, in the event that a student is unable to bring a print copy. Otherwise, laptop computers and other electronic devices must be closed at all times; cell phones should always be completely turned off and stored away.\n\nCommenting and Grading\n\nACTIVITIES\n\nPERCENTAGES\n\nEssay 1\n\nEssay 2\n\nEssay 3\n\nEssay 4\n\nAttendance, Homework, Participation\n\nOral presentations\n\nThis semester you will write four pieces, each with a different focus. Each piece will be initially submitted as a first version and later, in revised form. In reviewing first versions of your essays and stories, I will evaluate your work-in-progress and provide comments and suggestions for revision. I am also available to meet with you to discuss your writing. First versions of the first three essays are evaluated and commented on; revisions are letter graded. The first version and revision of Essay 4 are both letter-graded. Pre-draft and homework exercises will be acknowledged with a check and / or brief comments. It is important that you submit work on the due date. In the event of a personal or medical emergency, please contact me (or have a dean contact me) as soon as possible. Late submission of work without an extension may result in a lowered final grade.\n\nTo pass the course, all required work must be submitted. Your final grade will reflect the quality of your revised essays, the thoughtfulness of your homework exercises, your oral presentations, your attendance, preparation for and participation in class, and your contribution as a reader for your peers. The four major essays count for 80% of your final grade. The first essay is worth 15%, the second essay is 25%; the third and fourth essays are worth 20% each.\n\nClass attendance, homework and participation count for about 15% of your final grade. Oral presentations are 5% of the final grade.\n\nWriting Objectives\n\nIn commenting on your writing, I will encourage you to:\n\ndraw upon your own life experience to create vivid and readable prose\n\naddress an intelligent, public audience in an appropriate style\n\nadapt the tools of fiction (setting, character, dialogue) to creative nonfiction\n\ndevelop your ideas and narratives in an interesting, original and coherent manner\n\nsupport your arguments with evidence, integrating and citing primary and secondary sources creatively and appropriately\n\nexpress yourself clearly in language that uses the conventions of English grammar, punctuation, word usage and source citation\n\nexperiment with different narrative styles and structures\n\nConferences\n\nNote: This information is relevant to MIT students taking the course on campus. OCW users should look to this as an example of how writing is taught at MIT.\n\nOver the course of the semester, I am available to meet with you in conference to discuss a particular piece or more general strategies for improving your writing. My role is as a writing coach, to offer feedback and suggest options to you as a writer, as you make decisions about how to plan and revise your work. Conferences offer a rich opportunity to extend the conversations of the seminar about strategies for successful writing. You should come well prepared to conferences to discuss your strategies for a particular essay or type of writing. You may find it helpful to see me in conference at the pre-writing stage of brainstorming and idea generation, at the stage between the first version and revision, or at the midterm point to discuss your progress for the course and your goals for the rest of the term. At least one conference with the instructor is required for the semester.\n\nWriting / Communication Advisor: Louise Harrison Lepera\n\nIn addition to meeting with me, Louise Harrison Lepera is the writing / communication advisor for this course. Students will be required to meet with her as they (a) prepare for their oral presentations and (b) create research plans for the second major assignment, the personal investigative essay. She is also available to students who may want to consult with her on other aspects of their writing for this class.\n\nWriting and Communication Center; Information on Writing-Related Events and Courses\n\nIn addition to meeting with me and with Louise Harrison Lepera, students may want to visit the\nWriting and Communication Center\n, which offers free one-on-one professional advice from lecturers who are published writers and experienced college educators. They offer advice about all types of academic, creative, and professional writing and about all aspects of oral presentations. They offer advice also about applications, theses, CVs, etc. The Center hosts many\npages of advice about writing and oral presentations\n.\n\nThe\nCMS / Writing Program website\nalso has information on topics of interest to students: classes, advising, requirements for majors, minors and concentrators, and public events. Annually, the program awards student writing prizes in various genres (e.g., essay, poetry, technical writing).\n\nAcademic Integrity: Avoiding Plagiarism\n\nUsing someone else's language and / or ideas without proper attribution is academically dishonest. As members of this class and the larger scholarly community, you are expected to abide by the norms of academic honesty. While a good deal of collaboration between students is encouraged in and out of class, failing to acknowledge sources or willfully misrepresenting the work of others as your own will not be tolerated. Plagiarism can result in withdrawal from the course with a grade of F, suspension or expulsion from the Institute.\n\nEverything you submit must be your own work, written specifically to earn credit in this class. You may not \"recycle\" text written for another course, or before the class started.\n\nAcademic Integrity at the Massachusetts Institute of Technology: A Handbook for Students\nexplains these issues in detail; you are responsible for understanding its contents. In class, we will also work on citing sources and discuss ways to acknowledge them properly. When in doubt, consult with the instructor.\n\nWriting Portfolio\n\nPlease keep all four major assignments (first versions and revisions) and my comments together in a writing portfolio. Please note: your writing portfolio should be kept separately (in a binder with pockets or ring notebook) from your other material for class.\n\nPublishing Your Work\n\nStudents are strongly encouraged to craft their essays with the goal of publication. During the semester, we will discuss strategies for planning for publication. CMS / Writing annually publishes\nAngles\n, an online journal of exemplary writing from the introductory courses; students can submit their work for consideration for publication to the Angles editorial committee at the end of the term.\n\nMIT student publications include:\n\nAngles\n\nThe Tech\n- MIT's daily newspaper\n\nRune\n- A biannual journal of arts and letters featuring original work by MIT students, staff, faculty and affiliates",
  "files": [
    {
      "category": "Resource",
      "title": "Communications Self-assessment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-022-03-writing-and-experience-reading-and-writing-autobiography-spring-2014/9a2a095a3d0cf1532b5aa1c2e1bbd9d7_MIT21W_022_03S14_csa.pdf",
      "content": "COMMUNICATION SELF-ASSESSMENT INVENTORY\n\nThe MIT Communication Requirement stemmed partly from alumni feedback. MIT alumni consistently report that\nexpertise in communication principles and practices--in other words, knowing how to write and speak clearly and\ncompellingly in both formal and informal situations--is essential to their careers after MIT. A majority of MIT alumni\nreport that they wish they had dedicated more of their own time and effort to learning how to argue effectively with\nevidence, how to write and speak with grace and style, and how to assess and provide for the needs of their various\naudiences.\nAs an undergraduate now in a CI subject, you have the opportunity to learn from their experience and to take charge of\nyour own communication education, which begins by assessing your knowledge and abilities, and then setting specific\ngoals for the semester. As you move through the communication requirement, you can keep adding new or more\nadvanced goals, so that by the time you graduate, you will have learned how to write and speak as a professional in your\nfield.\n\nName ______________________________________\n\nMIT ID _________________________\n\nYour year First year Sophomore Junior Senior\n\nSemester ______________________\n\nYour Course _______________________\n\nSubject _________________________\nIs this the first CI subject you have taken at MIT?\nYES\nNO\n\nIf \"NO,\" please list the other CI subject(s) you have taken:________________________\n\nDid you take the FEE?\nYES\nNO\nIf yes, what do you remember as the most important feedback that you received?\n\nCircle the best answer to the following statements:\nI enjoy writing and seek opportunities to write for\ndifferent purposes\n\nI believe that writing helps me to develop stronger\nideas and to explore complex issues in academic\nwork\n\nI have sufficient experience and knowledge about\nwriting in this subject\nI have no strong feelings about writing, neither\nseeking nor avoiding it\n\nI find writing to be easy in some subjects and\nharder in others\n\nI generally understand the principles for academic\nwriting, but want to learn more about writing in\nthis subject\n\nI haven't given much thought to writing in different\nsituations; I just the write the same way in each\nsubject\n\nI have mostly avoided writing, and subjects that\ninvolve writing\n\nI often feel unclear about the principles and\npurposes for writing in this subject, or in most\nsubjects\n\nIn my writing, I communicate research findings to\nmultiple audiences using discipline-appropriate\nconventions\n\nFor my writing projects, I conduct research using\nmethods for investigating questions appropriate to\nmy discipline\n\nIn my writing, I seek relevant authoritative\ninformation and recognize the meaning and value\nof that information\n\nIn my writing, I use inquiry as a process to develop\nquestions relevant for authentic audiences within a\nvariety of disciplines\n\nFor my writing projects, I practice different ways of\ngathering, investigating, developing, and presenting\ninformation\n\nI listen to and reflect on the ideas and responses of\nothers--both peers and instructors--to my writing\n\nIn my writing, I make connections between my own\nideas and those of others\nI understand how to find meanings new to me or\nbuild on existing meanings as a result of new\nconnections\n\nI know how to incorporate new content knowledge\ninto my writing projects\n\nI enjoy learning to apply new knowledge that I have\ndiscovered\n\nI like to learn new methods to investigate\nquestions, topics, and ideas\nI understand how to communicate what I have\nlearned in a variety of ways\nI understand how to evaluate the effects or\nconsequences of my communication choices\n\nI commit the time it takes to explore, in writing, a\ntopic, idea, or demanding task\nI understand how to grapple with challenging ideas,\ntexts, processes, or projects\nI follow through, over time, to complete tasks,\nprocesses, or projects\n\nI consistently take advantage of in-class (peer and\ninstructor responses) opportunities to improve and\nrefine my work\n\nI consistently take advantage of out-of-class\n(writing or learning center support) opportunities\nto improve and refine my work\n\nI understand how to engage and incorporate the\nideas of others, giving credit to those ideas by using\nappropriate citation methods\n\nI approach writing assignments in multiple ways,\ndepending on the task and my purpose and\naudience\n\nI recognize that conventions (such as formal and\ninformal rules of content, organization, style,\nevidence, citation, mechanics, usage) are\ndependent on discipline and context\n\nI understand how to reflect on the communication\nchoices I make in light of context, purpose, and\naudience\n\nI examine processes I use to think and write in a\nvariety of disciplines and contexts\nI know how to use what I learn from reflections on\none writing project to improve writing on\nsubsequent projects\n\nI am comfortable locating and evaluating sources\n\nI am comfortable developing a focused, clear thesis\nstatement\n\nI am comfortable organizing information & ideas to\nstructure into a logical sequence\nI am comfortable generating the first draft of a\npaper\n\nI am comfortable writing the introduction and\nconclusion to a paper\n\nI am comfortable creating smooth, logical\ntransitions between paragraphs and sections\n\nI am comfortable incorporating and properly citing\nsources in my papers\nI am comfortable adapting my written message to a\nspecific target audience\nI am comfortable revising my draft for logic,\nstructure, and development after instructor, peer,\nand/or self-review\n\nI generally stick to the topic, identifying and\nomitting extraneous information\n\nI often move beyond the surface or the obvious\nclaims to a more rigorous argument\nI know how to establish and maintain a writing\nschedule that gives me enough time to produce my\nbest paper\n\nI feel tense when I see the words \"speech\" and\n\"public speech\" on a class syllabus\n\nI have no fear of giving a speech\nI look forward to giving a speech\nI get anxious when I think about a speech coming\nup\n\nI enjoy preparing for a speech\nI do poorer on speeches because I am anxious\nI am in constant fear of forgetting what I prepared\nto say\n\nWhen I make a mistake while giving a speech, I find\nit hard to concentrate on the parts that follow\nI feel relaxed while giving a speech\nI am comfortable giving informal oral presentations\non a reading or topic\n\nI am comfortable giving a presentation about my\nresearch\nI make a deliberate effort to adapt my oral\npresentation to specific target audiences\nI use strategies to capture the audience's attention\nin the beginning of a speech\n\nI enjoy giving oral presentations\nI feel comfortable and relaxed before giving a\nspeech\n\nI am comfortable giving feedback to other students\non papers\n\nI am comfortable giving feedback to other students\non oral presentations\nI am confident that I appear relaxed and confident\nwhen I give a speech\nI am confident that I use sufficient vocal variety\nwhen I give a speech\n\nI am confident I make sufficient eye contact when I\ngive a speech\nI am confident I use appropriate gestures and body\nmovement when I give a speech\n\nPlease check the appropriate box to identify the level of experience you have with the following communication (writing\nor speaking) genres\nGenre\nNo experience\nSome experience\nSignificant experience\nPersonal writing (journals, first-person\nessays)\n\nCreative writing (fiction and poetry)\n\nEssay exams\n\nTechnical writing and reports\n\nBlog entries\n\nLab reports\n\nLiterary analysis\n\nLiterature reviews and annotated\nbibliographies\n\nWritten arguments that draw on\nmultiple sources\n\nFactual (descriptive or explanatory)\npapers/reports\n\nInformal oral presentations on a\nreading or topic\n\nFormal presentations about research\n\nFormal argumentative speeches\n\nFormal debates with assigned or\nchosen positions\n\nInformal debates in class when there\nare differences in interpretation\n\nPlease check the appropriate box to identify how helpful you have found the following activities in the past to support\nyour writing process\nActivity\nNot helpful\nSomewhat helpful\nVery helpful\nSummarizing ideas from lectures or readings\n\nWriting out your own reflections and responses\nto readings or lecture material\n\nWriting critical questions and exploratory\nanswers about the material as you read\n\nWriting definitions of key concepts in your own\nwords\n\nKeeping a general journal for recording\nthoughts and ideas\n\nFree writing on the topic before you begin\nformal writing\n\nBrainstorming notes in an informal outline,\nmind map, or cluster diagram\n\nWriting a formal outline\n\nTalking out your questions and ideas with a\nclassmate or friend\n\nReceiving comments on my use of evidence\nand understanding of the content\n\nReceiving comments on my thesis, original\nideas, and insights about the material\n\nAddressing questions that ask me to clarify\nwhat I mean in specific passages\n\nAddressing questions that raise issues I hadn't\nyet considered, or considered fully\n\nReceiving comments about the form or\nstructure of my essay\n\nReceiving positive comments about what's\nworking well\n\nReceiving critiques of what's not clear,\naccurate, or well-developed\n\nReceiving specific suggestions for further\ndevelopment\n\nReceiving editing marks on my syntax,\ngrammar, and punctuation\n\nSETTING PERSONAL WRITING AND SPEAKING GOALS FOR YOUR CI SUBJECT\nThink about the kinds of writing and speaking you expect to do as a professional after graduation. Next, think about any gaps that\nexist between your current repertoire of writing and speaking skills and those needed by professionals in your field. To close these\ngaps, what needs to change about your writing and speaking?\nThe goals you choose should be rhetorically based, specific, and realistic (i.e., achievable). Thus, goals such as \"ace this course\" (not\nrhetoric-based), \"get better at writing\" (too general), and \"produce grammatically flawless first drafts\" (probably not realistic) are\ninappropriate for this exercise. List your goals here:\nWriting:\n\n1.__________________________________________________________________________________\n\n2.__________________________________________________________________________________\n\nSpeaking:\n\n1.__________________________________________________________________________________\n\n2.________________________________________________________________________________\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.022.03 Writing and Experience: Reading and Writing Autobiography\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Autobiography Exercise: The Intersection of Family History and Autobiography",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-022-03-writing-and-experience-reading-and-writing-autobiography-spring-2014/9641c82f72548e50a85f3aa9882cefb7_MIT21W_022_03S14_0220_ic.pdf",
      "content": "\"Deep\" Autobiography Exercise: The Intersection of Family History and Autobiography\n\nList up to ten traits or aspects of yourself that you would like to understand further (e.g.,\nthese could be personality traits like shyness, physical traits such as short stature or\nnear-sightedness, or occupational aspirations such as being a chemical engineer, cancer\nresearcher or actor.\n\nWhile many writers trace these traits to the influence (genetic or environmental) of\ntheir immediate families, others look to past generations for influence as well.\n\nHow far back do you have knowledge of your maternal line?\nGrandparents\nGreat-grandparents\nGreat-Great grandparents, etc.\n\nPaternal line?\nGrandparents\nGreat-grandparents\nGreat-great grandparents, etc.\n\nSometimes establishing these family lines is complex. If you are adopted or have a\nstepparent, you may have multiple lines of influence.\n\nWhat do you think you could discover about yourself by being able to obtain more\ninformation about generations past?\n\nTypes of records available vary by country, time period and states within the US. U.S.\nrecords include such data as birth, marriage, divorce, immigration and naturalization\nrecords, military draft and service records and death and burial records. Many records\nare available online, although the U.S. census (and many state censuses) have a privacy\nscreen of 75 years.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.022.03 Writing and Experience: Reading and Writing Autobiography\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Editing Self-assessment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-022-03-writing-and-experience-reading-and-writing-autobiography-spring-2014/7a1401a02eaaf1d201e89e3334125ffd_MIT21W_022_03S14_esa.pdf",
      "content": "Self-Assessment: Editing and Reviewing Skills\n\nWrite for about five minutes\n\n1. What are your strengths as an editor/reviewer? (Name two or three strengths.)\n\n2. What are your areas of weakness?\n\n3. In what aspects of writing can your classmates learn the most from you?\n\n4. How would you like to continue to improve as an editor/reviewer?\n\na. Skills in noticing problem areas in a piece\n\nb. Mode of communicating areas for improvement\n\nOther comments on your experience as an editor/reviewer:\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.022.03 Writing and Experience: Reading and Writing Autobiography\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Exercise in Collective Autobiography",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-022-03-writing-and-experience-reading-and-writing-autobiography-spring-2014/7b5a460ebce0f6232bd6447231b6336b_MIT21W_022_03S14_0401_ic.pdf",
      "content": "The Things They Carried Exercise in Collective Autobiography\n\nTake about ten minutes to complete this exercise.\n\n1. List up to ten physical items MIT students typically have in their backpacks or their rooms. Then add up to\nfive psychological \"things\" or weights they also carry.\n\n2. Using a style like that of O'Brien, write a paragraph, commenting on these \"things\", both physical and\npsychological.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.022.03 Writing and Experience: Reading and Writing Autobiography\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Final Submission Requirements",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-022-03-writing-and-experience-reading-and-writing-autobiography-spring-2014/2d042cbaf5683b7588381abc36c4b440_MIT21W_022_03S14_final.pdf",
      "content": "Final Submissions: Three Files: Final Versions #3 and #4, Concluding Letter.\n\nFor your end-of-term submissions, include final versions of Essays 3 and 4. With your final\nversions, include a short evaluative letter (approx. 1 page) describing how you have seen your\nwriting improve over the course of the term. (Obviously, you will want to comment explicitly on\nthe revisions of Essays 3 and 4.) You may want to focus on such aspects of writing as:\naddressing a broader audience, writing engaging introductions, using the tools of fiction (e.g.,\ndialogue, interior monologue, setting), organizing your essays, crafting compelling conclusions,\nand editing on the sentence level (e.g., for wordiness and repetition, etc.) What aspects of your\nwriting do you want to continue to work on? Note: the final letter takes the place of two separate\ncover letters for the final versions of Essays 3 and 4.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.022.03 Writing and Experience: Reading and Writing Autobiography\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Guidelines for Homework and Class Preparation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-022-03-writing-and-experience-reading-and-writing-autobiography-spring-2014/a6ad2b8250a373621207f29d07983348_MIT21W_022_03S14_guide.pdf",
      "content": "Guidelines for Homework and Class Preparation\n\nNote: Dual Submission: All homework must be typed and submitted both electronically\nover email (before class) and in hard copy at the class meeting.\n\nThe purpose of regular homework assignments is to help strengthen your skills in\n\"reading as a writer,\" focusing on the ways in which authors craft their pieces to address\nintended audiences. Throughout the term, you will regularly submit short assignments\n(approx. 1- 1 1/2 typed pg., double-spaced) on required readings and films for class.\nSome homework assignments are listed on the course calendar; others will be distributed\nin class or emailed to students. For other assignments, I will ask you to answer specific\nquestions. Other assignments are more open-ended; you can choose to focus on one or\nmore aspects of the writer's craft. These assignments will help to prepare you for class\ndiscussions as well as your own essay writing.\n\nHere are some general questions to consider in reviewing assigned readings for class. In\nyour homework assignments, you may only focus on a few questions. However, thinking\nabout all of them will be very helpful in preparing for class discussions.\n\n- What is the meaning of the title? Why do you think the author chose this specific\ntitle?\n- What is the tone of the piece -persuasive, angry, informative/neutral, ironic,\nhumorous?\n- What kind of language has the writer chosen for the piece- e.g., direct and simple,\ncolloquial, abstract \"high academic\", personal/confessional, comic? Does the tone\nshift over the course of the piece? What is the effect(s) on you as a reader? What\ndo you think s/he assumes about the audience?\n- How does the writer begin and end the piece? What do the introduction and\nconclusion suggest about how to interpret the essay?\n- What sections, paragraphs, words or sentences seem especially powerful? Why?\n- How does the writer use the tools of fiction (character, setting, dialogue) in\nnonfiction?\n- How does the writer sequence the essay in time (e.g., using flashbacks,\nflashforwards, starting \"in media res\", in the middle of the action)?\n- In what ways does the writer employ imagery, symbol and metaphor?\n- Does the writer use rhetorical devices such as repetition? What is the effect?\n- What seems to be the central point of the piece?\n- How do you see this essay as connecting with other readings (for the course or\noutside), your life experiences, and issues that you have thought about?\n- What have you learned as a writer from this piece? Do you see yourself using or\navoiding some of the same approaches or techniques as a particular writer?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.022.03 Writing and Experience: Reading and Writing Autobiography\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework Exercise: Kaysen",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-022-03-writing-and-experience-reading-and-writing-autobiography-spring-2014/43892d7ead1ff0a7312ca65e84770e96_MIT21W_022_03S14_0417.pdf",
      "content": "Homework Exercise: Kaysen\n\nSusanna Kaysen's memoir Girl, Interrupted reflects on her experience, as a young\nadult during the late 1960s, of being an in-patient at McLean Hospital in Belmont,\nMa. Suffering from mental anguish (and diagnosed with \"borderline personality\ndisorder\"), Susanna Kaysen is pressured by her psychiatrist and parents to sign\nherself into McLean. Once an in-patient, she discovers, to her surprise, that it is\nquite difficult to leave. Kaysen spends about 18 months as an involuntary\npsychiatric patient at McLean. Her memoir reflects on the nature of what many call\n\"mental illness\" and prompts readers to think about what they can learn from her\nexperience.\n\n1. Comment briefly on these two quotes from the Kaysen excerpt. How do they\ninfluence the way that you see mental anguish/illness?\n\nBut most people pass over incrementally, making a series of perforations in the\nmembrane between here and there until an opening exists. And who can resist an\nopening?\n\nIn the parallel universe the laws of physics are suspended. What goes up does not\nnecessarily come down. A body at rest does not tend to stay at rest, and not every\naction can be counted on to provoke an equal and opposite reaction.\n\n2. Why do you think Kaysen includes the section \"Etiology\"?\n\n3. What's the effect of reading \"Velocity vs. Viscosity\"?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.022.03 Writing and Experience: Reading and Writing Autobiography\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework Exercise: Shooting an Elephant",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-022-03-writing-and-experience-reading-and-writing-autobiography-spring-2014/2c164222ad1dda0cd75ee0be71bf7d5e_MIT21W_022_03S14_0213.pdf",
      "content": "Homework Exercise: Orwell, Shooting an Elephant\n\n1. How would you describe Orwell's voice as a writer, Orwell's \"I\"? What was his\nmotive in writing this piece?\n\n2. Why do you think Orwell decides to stay within the time frame of this one\nincident? How does this compare with Walker's approach in \"Beauty..\"? (What\nwould it have been like if Walker wrote a similar piece?)\n\n3. How does Orwell paint himself as a character? What is your attitude as a reader\ntoward Orwell in this essay?\n\n4. How is your view influenced by the fact that you know that Orwell goes on to\nwrite classic works such as 1984 and Animal Farm? If this piece had been written\nby \"Anonymous\" or \"Mark Smith\" (who never wrote another published piece),\nwould your reaction be different?\n\n5. Why is the elephant's death so slow? What are some different interpretations of\nwhat the elephant symbolizes?\n\n6. What is the meaning of the conclusion? What thoughts are with you as you leave\nthe essay?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.022.03 Writing and Experience: Reading and Writing Autobiography\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework Exercise: Witherspoon",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-022-03-writing-and-experience-reading-and-writing-autobiography-spring-2014/cd882ac74a358d8793816f1961a85262_MIT21W_022_03S14_0306.pdf",
      "content": "Questions on \"This Pen for Hire\" (1995) - Abigail Witherspoon\n\nWrite about question #5, #6 and one other question (total length: one to one and half\npages). We will discuss all the questions in class.\n\n1. What are the possible meanings of the title?\n2. Why does the author use a pseudonym? What might the name \"Abigail\nWitherspoon\" signify? If the author wanted to cloak identity, why didn't he/she\nchoose to be anonymous?\n3. What do you see as the writer's motive for writing and publishing this essay?\n4. In what ways is the style of the piece (semi-journal, retrospective diary) effective?\nDo you have any criticisms of Witherspoon's style?\n5. Does the analogy between writing papers and prostitution, between writing and\nsexuality, work? How does the writer extend the metaphor in the essay?\n6. Do you find the writer a reliable or believable narrator? Do you sympathize with\nWitherspoon? In what ways, if any, do your feelings toward the writer change as\nyou read through the piece?\n7. In what ways is this essay a personal confession? In what ways is \"This Pen...\" an\neducational critique? Do you see the writer's critique as valid?\n8. How does this piece compare with Orwell's \"Shooting An Elephant\"? How might\nyou feel about this essay if you knew that it had been written by a now-famous\nauthor?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.022.03 Writing and Experience: Reading and Writing Autobiography\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework: Douglass and Nelson",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-022-03-writing-and-experience-reading-and-writing-autobiography-spring-2014/127286205524af0df8baca04aa2c0de8_MIT21W_022_03S14_0304.pdf",
      "content": "Frederick Douglass, \"Learning to Read and Write\" and Anita Nelson, \"Fast Food, Living Fast\"\n\nIn discussing class readings, we have been identifying variations in writers' portrayals of\nthemselves in autobiographical or self-writing. In a given piece, the \"I\" can be assertive, proud,\nremorseful, nostalgic, resilient, individualistic, embedded in community - the list goes on. If a\nwriter is using an \"I now/I then\" approach, the \"I\" may change dramatically over time in the\ncourse of an essay. Within book-length autobiographies or memoirs, the \"I\" inevitably\ntransforms during a lifetime.\n\nAlternately, sometimes writers use the second person \"you\" to address the audience of readers\ndirectly. Using \"you\" is a less common, but sometimes quite effective, device.\n\nTypically, writers ask themselves the questions below in choosing a style of narration in a given\npiece of autobiographical writing.\n1. Who is my intended (primary) audience(s)?\n2. How do I want to communicate with them (e.g., through humor, anger, a \"cautionary\"\ntale, nostalgia)?) What reactions do I hope they have to my writing?\n\nAssignment\n(a) Describe 19th century abolitionist Frederick Douglass's use of the \"I\" in \"Learning to\nRead and Write\", a chapter of a traditional and politically-oriented autobiography\n(about a paragraph). Select a few sentences that illustrate his use of the \"I\". (You don't\nneed to comment on each sentence individually.) Who is Douglass's intended\nreadership? What seems to be Douglass's primary motive(s) in writing this chapter?\n\n(b) Contemporary student writer Anita Nelson crafts an \"in action\" (in medias res)\nintroductory paragraph, and then moves into second person narration in her\nessay \"Fast Food, Living Fast.\" What is the effect of the first paragraph and the second\nperson narrative style? Choose a few sentences that seem central to the piece. Why do\nyou think she chose this less-common form of narration?\n\n(c) Would you consider using third person to narrate a story of your own? How\nwould your first essay change if you were to write it in third person?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.022.03 Writing and Experience: Reading and Writing Autobiography\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}