{
  "course_name": "Writing and Rhetoric: Rhetoric and Contemporary Issues",
  "course_description": "This course seeks to provide a supportive context for students to grow significantly as writers by discovering and engaging with issues that matter to them. Writing on social and ethical issues, we can see ourselves within a tradition of authors such as Charles Dickens, Frederick Douglass, Elizabeth Cady Stanton, George Orwell, Rachel Carson, John F. Kennedy and Martin Luther King, Jr., who have used the power of the pen to inspire social change.",
  "topics": [
    "Humanities",
    "Literature",
    "Rhetoric",
    "Social Science",
    "Communication",
    "Public Administration",
    "Public Policy",
    "Social Welfare",
    "Society",
    "Global Poverty",
    "Humanities",
    "Literature",
    "Rhetoric",
    "Social Science",
    "Communication",
    "Public Administration",
    "Public Policy",
    "Social Welfare",
    "Society",
    "Global Poverty"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session.\n\nPrerequisites\n\nNone\n\nNote: Students cannot receive credit for this course if they have successfully completed another \"Writing and Rhetoric\" class at MIT.\n\nDescription\n\nWriters are witnesses.\n--E. L. Doctorow\n\nYou write in order to change the world...if you alter, even by a millimeter, the way people look at reality, then you can change it\n. --James Baldwin\n\nIf I waited for perfection..., I would never write a word\n. --Margaret Atwood\n\nOur best writing happens when we care passionately about our topics. That sense of passion often emerges in relation to contemporary social issues, such as poverty, homelessness, injustice, or environmental crisis, which deeply concern us. Writing offers a critical avenue of civic engagement so that we can understand issues more profoundly, communicate that understanding to the public and advocate for change.\n\nThis course seeks to provide a supportive context for students to grow significantly as writers by discovering and engaging with issues that matter to them. Writing on social and ethical issues, we can see ourselves within a tradition of authors such as Charles Dickens, Frederick Douglass, Elizabeth Cady Stanton, George Orwell, Rachel Carson, John F. Kennedy and Martin Luther King, Jr., who have used the power of the pen to inspire social change. Throughout the term, we will analyze the rhetorical approaches of some of these authors, as well as contemporary writers such as Marion Wright Edelman, Barbara Ehrenreich, Ezekiel Emanuel, Susanna Kaysen, Jonathan Kozol and Michael Pollan. We will also discuss different rhetorical strategies that aim to increase awareness of social problems, to educate the public about different perspectives on contemporary issues and to persuade readers of the value of particular solutions to social problems.\n\nThis course also focuses on the visual rhetoric of photography and film, which, combined with print media, help raise awareness of social problems and advocate for change. We will analyze classic American documentary photographs by Dorothea Lange, Lewis Hine and Jacob Riis, and will screen some more recent documentary films (e.g.,\nFood, Inc., Consuming Kids\n).\n\nThis course incorporates a service-learning perspective in the third major assignment; students are asked to write grant proposals for community service projects to address problems such as homelessness or educational inequality; writers often do their best work when engaged with real-world problems. This assignment connects with MIT's mission to develop in each student \"not only the ability to work wisely, creatively and effectively for the betterment of humankind, but also the passion for doing so.\"\n\nReadings\n\nLunsford, Andrea A.\nEasyWriter\n. 5th ed. Bedford / St. Martin's, 2013. ISBN: 9781457640469.\n\nVarious essays and articles are listed in the\nCalendar\n. Students should print out all online readings at the beginning of the term and bring assigned articles with them to each class.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nMajor Writing Assignments\n\nEssay 1\n\nEssay 2\n\nAssignment 3 (Grant Proposal)\n\n75%\n\n15%\n\n35%\n\n25%\n\nHomework Assignments\n\n10%\n\nAttendance, Preparation for Class, Participation, and Oral Presentation\n\n15%\n\nPublishing Your Work\n\nStudents are strongly encouraged to craft their essays with the goal of publication; we will discuss strategies for planning for publication.\n\nCourse Policies\n\nClass Participation\n\nTo foster a sense of intellectual community, this course is structured as a seminar, in which we discuss the work of professional, as well as student, authors. It is crucial that students come to class on time, with required texts and well prepared to offer thoughtful responses to the readings and classmates' writing. To be effective participants, students need to complete reading and writing tasks by assigned dates. A vital, ongoing intellectual conversation is at the heart of the course.\n\nAttendance\n\nSince our class functions as a writing community and the first \"public\" for students' essays, it is essential that students attend class consistently. More than two absences may affect the final grade. Under CI-HW\nguidelines, a student cannot pass the course with over five absences. Lateness is discourteous to the instructor and fellow students. Three latenesses--or early departures--of more than 15 minutes count as an absence. If a student must be absent from class or cannot submit an assignment on time because of a personal or medical emergency, he or she should contact me (or have a dean email me) as soon as possible. If an absence occurs, a student should contact a classmate about class material and obtain any handouts. Major assignments and many handouts will appear on the website by the day after they are distributed in class.\n\nElectronic Devices in the Classroom\n\nEveryone in our classroom community has an equal right to a distraction-free educational environment, which is most conducive to learning. The unnecessary use of electronic devices in the classroom (\"multitasking\") is distracting and unfair to other students and the instructor. Therefore, please completely turn off and store away your laptops, cellphones and other electronic devices during class. The use of laptops may be permitted on specific occasions if / when, for example, we are doing joint library research online. In short, plan on using printed copies of readings in class, and directing your attention to the texts, to other students and to me.\n\nAcademic Integrity\n\nAcademic integrity is the foundation of all scholarship, because being able to trace how our ideas have developed in relation to other people's theories, research, and evidence, as well as our own, is what ensures the soundness of our research. Thus, university communities have a collective investment in ensuring that the practices of academic integrity are thoroughly learned and carefully practiced. In this CI-HW subject, we will study many features of academic argument that will help you to understand how scholars make use of sources, and distinguish their own ideas from those of other scholars. You will learn to read sources carefully, to assess their validity and usefulness to your own thinking, to use some kinds of sources as evidence that you'll analyze and argue about, and other kinds of sources as a theoretical foundation or counterargument to extend or deepen your own ideas about a subject. You will also learn the mechanics of source use: How to accurately quote, paraphrase, and cite sources according to one of the common systems of citation.\n\nAs members of this class and the larger scholarly community, you are expected to abide by the norms of academic integrity. Everything you submit must be your own work, written specifically for this class. You may not \"recycle\" text written before September 2015 (e.g., admissions essay) or turn in work produced for another MIT class this semester. While a good deal of collaboration is encouraged in and out of class, all sources--of ideas as well as words and images, whether from a text, or the internet--must be acknowledged according to the conventions of academic citation. Willful disregard for these conventions--i.e., plagiarism--can result in withdrawal from the course with a grade of F, and / or suspension or expulsion from the Institute.\n\nFor more information about policies and practices, please refer to the\nMIT Policy on Academic Integrity\n. The handbook\nAcademic Integrity at the Massachusetts Institute of Technology: A Handbook for Students\nexplains these issues in detail; you are responsible for understanding its contents. In class, we will also work on citing sources and discuss ways to acknowledge them properly. When in doubt about how to find, use or properly cite sources, students should consult the instructor.",
  "files": [
    {
      "category": "Resource",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: A Basic Guide to Grant Writing",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/19217cc23a253a00daa4909104f4979c_MIT21W_011F15_grant.pdf",
      "content": "GRANT WRITING: A BASIC GUIDE\nNote: Individual grant and fellowship applications will have specific requirements\n(e.g., some require abstracts; some do not).\n\nA. Initial Steps\n1. Seeking funding for research, program development, education or public service\n2. Scholarships/fellowships and grants: differentiating types of funding-\nIs the focus on you or your research/project?\n3. Types of Fellowships and Grants: internal, external, targeted, individual,\ninstitutional: researching your options; considering your audience\n4. Contacting grant representatives; reading the RFP (Request for Proposal) or RFA\n(Request for Application)\n5. Reviewing other successful grants of this type.\n\nB. The Application Process\n1.Who is your audience (s)? The Rhetoric of Grant Writing. How to approach\nfunders: generalists and specialists. Tailor language/terminology to readers.\n2. Describe the research or program to be funded and potential benefits of the\nresearch.\n3. Provide solid data to support your claims. Conduct a preliminary study\nof your own if no data are available. (Grant applications need to be persuasive,)\nHow will you protect the rights of human subjects? (if applicable)\nPublic service/education: Be sure the definition of the problem matches the scope\nof the solution (e.g., local problem/local solution)\nRemember: the absence of your proposed program IS NOT the problem\n4. Public Service/Education: Describe the program or activity oriented toward a\nsolution. Perform the \"mind's eye\" test.\nWho is the target audience for your program?\nWhere will the project take place? What is the time period?\nWho will conduct the program? What similar or transferable\nexperience/expertise/skills do they have?\n(Research: Where will this research be conducted?\nBy whom? Where? With what equipment? For what time period?)\n5. Create a realistic budget: remember that institutions take a % of grants under\ntheir auspices and that many incidental expenses add up.\nHave other funders given money?\n6. Research: how will you report/disseminate your results? Public service/education:\nHow will you evaluate the effectiveness of your program? Who will evaluate it?\n\nPost-Application\n1. Processing bad news: dealing with rejection;resubmission\n2. Successful application:\nReporting Out: Creating an account of your program and its success:\nWriting post-grant reports (This may include a separate report in addition\nto any publications from the research.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: Advice About Collaboration",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/dea83c2808bc9602fc8945e0c7bd1d5e_MIT21W_011F15_advice.pdf",
      "content": "21W.011 Fall 2015\nOral Presentation: Advice about COLLABORATION\nCollaboration has become a key practice at MIT and elsewhere, not least because\nsolving complex problems requires using multiple perspectives. Working together\ncan save time, achieve better results than solo efforts, and be fun. It also means that\nyou plan AND present together. As you anticipate collaborating on your oral\npresentation, consider these points in planning with your partner:\n\n*Communicate clearly. Your expectations may differ, so be explicit. Ex.: \"I want us\nto do the best job we can, so can we rehearse?\" \"I've spent an hour so far; have you?\"\n\n*Discuss your respective experience collaborating (\"I haven't had success collabo-\nrating because others didn't do their part, so let's make sure we have similar goals\"),\n\n*Work to make equal commitments to the presentation; you both should prepare\nin time to submit an outline the week prior to your presentation date. Ensure that\nyour schedules allow time to plan in person, which is more effective than email, etc.\n\n* Commit to equal preparation time, both together and separately. Review the\nassignment prompt carefully.\n\n*Clearly allocate responsibilities. E.g., will one or both submit your outline? Who will\nmonitor time to stay within the 15-minute limit?\n\n*Divide the presentation in a way that builds upon each of your strengths. (E.g., one\nintroduces the topic, both provide examples of this particular writing issue, etc.)\n\n*Work on giving and accepting constructive criticism; offer helpful feedback and\nuse your partner's comments to improve your presentation style.\n\nIf you plan to use the room's audiovisual equipment, check it before you\npresent. Those using a Mac MUST bring a special connector (\"dongle\").\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: Designing Evaluations in Grant Writing",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/38075e80b3399eff388d8425f55c7123_MIT21W_011F15_designing.pdf",
      "content": "21W.011 Fall 2015\n\nDESIGNING EVALUATIONS IN GRANT WRITING\n\nA successful grant application always includes an evaluation plan that attempts\nto measure the success of the program. Before designing such a plan, the\ngrantwriter should identify the purpose of the evaluation, asking:\n\n1) Am I/we evaluating this program or project so that we can improve it mid-\nstream or adjust for possible problems? Note that one can make changes to a\nprogram or project based on an informal assessment of problems. However,\na formal midpoint evaluation or formative assessment may establish a better\nknowledge base from which to make changes.\n\nAm I/we evaluating this program at the end (summative assessment) to\ndecide (a) whether to offer it again, replicate it in another site or seek\nanother cycle of funding (b) to assess the success this project or program?\n\n2. What am I assessing/evaluating in this project\n* Improvement of neighborhood/community (building projects)\n* Positive (\"green\") environmental impact\n*Use (Building projects)\n*Safety (Building projects, athletic programs)\n*Attitudinal change (Tutoring/mentoring programs, anti-smoking programs)\n*Skill improvement (tutoring, teaching)\n* Behavioral change (tutoring/mentoring, anti-smoking programs)\n*Aesthetic/art/music appreciation\n\n4. What strategies will I use to assess my project? When will I assess my\nproject?\n\n*Expert Evaluation/Observation\n* Pre and post testing of skills (e.g., math, language)\n* Interviews (at what points)\n*Surveys/questionnaires on behavioral and attitudinal changes\n\nEvaluation Terms: formative assessment\nsummative assessment\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: Grant Proposal Ideas",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/234a373a96c7c0ed0b561c248c1c195b_MIT21W_011F15_grantideas.pdf",
      "content": "21W.011 Fall 2015\n\nAssignment #3- Grant Proposal Ideas\n\nBelow is a list of grant proposal ideas, grouped by theme. Previous students in\nthis course have generated some projects; others have been created by community\norganizations. As in Essay #2, this list is not intended to limit your choices, but\nrather to give you a sense of the kinds of projects that one might create. Also note\nthat some proposals are for new pilot projects, while others are to fund existing\norganizations and programs.\nAs you brainstorm about possible grant proposal projects, think of the social\nproblems or issues that concern you the most and those you have already written\nabout. What small-scale community projects could address or alleviate this\nproblem?\n\nEducation and Job Counseling\n\nBoston/Cambridge Area\n\nJob counseling for homeless adults\nAfterschool tutoring and homework assistance for homeless children\nBasketball and reading program for middle-school boys\nSTEM mentoring program for middle school girls\nMedia literacy classes for elementary school summer campers\n\"Unplugging\"- nature appreciation program for high school students\nAmphibious Achievement - funding ongoing program at MIT\nFinancial literacy program - for low-income teens (students wrote and performed in\na comedy about financial decisions- e.g., applying for credit cards, deciding on\nstudent loans, etc.)\n\nOther U.S. Communities\n\nAfterschool tutoring in math and science for low-income elementary and middle\nschool students (South Carolina)\n\nCollege Readiness - mentoring and SAT preparation for low-income high school\nstudents (Florida)\n\nInternational\n\nAfterschool tutoring program (Ghana)\n\nNutrition and Health\nCambridge/Boston\n\nFood redistribution program for low-income families\n\nCookbook for low-income and immigrant families\nSmall community garden - tie-in with elementary education in science, art and\nnutrition\nCommunity meals - to promote healthy eating and dialogue on community issues\n\nOther U.S. Communities\n\nNutrition and cooking classes at a local food pantry/church\n\nInternational\n\nNutrition program for adults with chronic diseases such as diabetes, heart disease\n(India)\n\nExercise and Fitness\n\nBoston/Cambridge\n\nTai Chi classes for senior citizens\nKayaking for Kids- summer program for elementary school students\nCricket at MIT- expansion of existing program\nBicycle Repair clinic\n\nOther Communities (U.S.)\n\nImproving a bike trail and providing bike safety info (Wisconsin)\n\nGreen/Environmental Projects\n\nBoston/Cambridge\n\nGreen roof on an MIT residence\nCommunity garden with student artwork in the center of MIT campus\n\nOther communities\nBeach clean up and conservation project (California)\n\nArts/Humanities\n\nBoston/Cambridge\nSummer \"spoken word\" writing program for middle-school students\nArt appreciation program for low-income high school students\nVisits to museums, theatre, film with discussion\nArt and Memory- program for senior citizens\nSummer drama program for middle school students\nSummer photography workshop for middle school students\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: Grant Proposal Outline",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/20b0796c4f4ccd3b96c51119f4dd76fa_MIT21W_011F15_proposal.pdf",
      "content": "TYPICAL GRANT PROPOSAL OUTLINE\n\nA. Abstract/Summary\nB. Organizational Information (if you are writing on behalf of an organization) -\nomit if you are writing as an individual)\nC. Problem/Need Description\nD. Planned Activity/Program/Research\nE. Impact of Activity/Program/Research\nF. Evaluation of Impact\nG. Other Funding\nH. Budget\nI. Supplementary materials (if needed) - e.g., charts, graphs, bibliography, an article\ndescribing the problem\n\nNote: Some grant competitions (e.g., MIT Public Service Center) require some other\ninformation, such as:\n\n*sustainability of a project over time (after student has completed the project)\n*housing arrangements (if relevant)\n*safety and medical needs (if abroad- e.g., personal safety plans, proper immunizations\nfor particular locations)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: Oral Presentation on Writing Issues",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/2974fb0a8514f2a08b96293df7ed552b_MIT21W_011F15_oral.pdf",
      "content": "21W.011 ORAL PRESENTATIONS ON WRITING ISSUES FALL 2015\n\nAs a CI-HW subject, 21W.011 has an oral presentation component. Our focus in\nthese short oral presentations (15 min.) will be on strategies for effective writing in both\nnarrative and investigative research essays; students will do presentations in pairs. Our\ngoal in these presentations is to improve your skills in developing, organizing and\npresenting material orally to audiences.\nPresentation pairs are encouraged to select topics particularly relevant for them as\nwriters. These topics can be general issues, such as dealing with writer's block or\nprocrastination tendencies. Presentations can also focus on specific issues such as writing\ndialogue, crafting intros and conclusions, using metaphors, editing choppy and run-on\nsentences, avoiding cliches or correcting common grammatical and usage errors (e.g.,\nusing commas and semicolons effectively, avoiding homophone errors, etc.).\nProposal: Due Monday 9/28. Students will first submit a short (1 pg.) proposal over\nemail, listing TWO possible topics and your reasons for choosing them, your\npresentation partner (if you have one) and TWO possible presentation dates. The\navailable dates for presentations are listed on the topics handout. If you do not have a\npresentation partner, we will pair you with another student.\n\nProcess:\nPre-Presentation: Students (as a pair) are required to meet with Louise Harrison\nLepera in the process of planning their presentations. In addition, students are asked to\nemail a presentation plan/outline to me and Louise Harrison Lepera for feedback at least\na week before the presentation. Post-Presentation: A week after the presentation, email\nany presentation slides (e.g., Powerpoint or Prezi) as well as a joint self-evaluation of\nthe quality of pre-presentation preparation, delivery and handouts/materials distributed to\nthe class. (You are not required to produce presentation slides, although some students\nfind them helpful.) Self-evaluations are due over email a week after the presentation.\nEach student pair will present one or two writing issues to the class; your joint\npresentation should be about 15 minutes long. For each presentation, the students will\nwrite, photocopy and distribute a well-designed sheet of information on their topic. The\nsheet should include several examples that demonstrate the problem or describe the issue\nand strategies for resolving or correcting it. Use creativity and humor in your\npresentations. In the last section of your presentation, be sure to give your classmates\nadequate time to correct the problem or discuss the issue through an exercise(s).\nIf possible, when creating handouts, try to pick examples from your own writing or\ncreate sentences that relate to MIT life. In addition to Easy Writer, I have several writing\nguides that are available for borrowing. Also check the library's electronic resources, the\ncourse website and the Writing Center website for additional weblinks and resources. Be\nsure to author your own information sheets and exercises; if quoting from sources,\ninclude citation information in your handouts. If you are using A-V projection,\ncheck that your computer connections and A-V in 8-119 are working the day before\nyour talk. When using a MAC, you will need a special connector (\"dongle\").\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: Writing Tips for a Grant Proposal",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/6133ca9f62c47ee27c82f37e470a1760_MIT21W_011F15_writing.pdf",
      "content": "21W.011 Fall 2015\nWriting Tips: Grant Proposal (#1 and #12 are for revised version)\n\n1. Check that your abstract presents the grant proposal argument \"in miniature\".\n\n2. If you are asking for funds for an organization, be sure to provide an organizational\nprofile. A profile should include such facts as: year of founding, mission of\norganization, number of members/staff, budget, successful past endeavors.\n\n3. Define any key terms that you use in the proposal.\n\n4. Check that your statement of the problem is clear and dynamic. As a writer, you\nwant to create a sense of urgency. Before you finish your proposal, underline\nclaims without evidence. If a claim seems too broad for the evidence you find,\nmodify the statement. If you lack evidence to support your claim, provide some.\n\n5. Check to see if you can organize any statistical data into charts or graphs (inserted\nin a page or appended to the end).\n\n6. Check if you need to address counterargument. In grant proposal writing,\ncounterargument can take different forms from a research essay. Some readers\nmay question your definition of the problem, while others may question the value\nof your proposed program. The most common counterargument is to question the\nvalue or practicality of your program.\n\n7. If you quote from any outside sources, be sure that you introduce a speaker and\nhis/her identity (\"Human rights activist A\") before starting a quotation.\n\n8. Change 75% of your \"being\" (is/are/were) verbs to action verbs, passive verbs to\nactive verbs.\nActive verbs are especially important in grant writing.\n\n9. Insert subheads into your piece, and then decide if they are helpful. (General rule:\nGrant proposal writers commonly use subheads, while essay writers may use them\nmore sparingly. The subhead should match the grant proposal outline.)\n\n10. Perform the \"mind's eye test\" Can the reader clearly visualize the problem and the\nprogram/service to address it?\n\n11. Check that your budget is comprehensive and realistic. Be sure to include \"in-\nkind\" expenditures.\n\n12. Be sure to have an evaluation plan that seems realistic.\n\n13. Check that you have a consistent citation form and separate bibliography/Works\nCited page.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: Essay 1 Workshop Instructions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/c5c85b95fddfecdbf83d0e9a3d5dcc28_MIT21W_011F15_essay1work.pdf",
      "content": "21W.011 Fall 2015 Workshop Instructions Essay #1 Version 1- Tues. 9/22\nDue: Marked-up workshop essays and individual response letters to classmates, with copies of\nletters for instructor. Do not email response letters to classmates before workshop.\n\nStudents will have three essays to review for Tuesday's workshop; I will email out the essays\nto the class over the weekend. This workshop has a dual purpose: (a) to provide individual\nfeedback to writers; (b) to identify common writing concerns, as students prepare to revise\nessays.\nReview each essay twice, carefully and critically; type a letter (1-1 1⁄2 pages, double-spaced)\nto each writer. (On Tues., bring in two copies of each letter, to the writer and instructor.) Make\nmarginal comments on the essays, in addition to the letters.\nReviewing three essays usually takes about two hours. It's best to read an essay first, without\ncommenting. After a second reading, comment in the margin and write a response letter. Many\nreviewers are most effective if they break editorial work into two parts, reviewing one or two\nessays first, and then returning to the essay(s) remaining.\nYour letters should identify two or three specific strong points in each piece, and two or three\nspecific things that you think need work. Make clear, specific suggestions for revision; respond\nproactively. (Rather than \"This paragraph is confusing\", you might ask, \"Can you explain the\nidea of ___more clearly\"?) Our primary focus is on strengthening the essay as a whole; a\nsecondary focus is on more minor problems of \"polishing\" (e.g., grammar, punctuation).\nWe are aiming for constructive criticism to help your peers craft better essays. Most writers\nlearn more from constructive comments than being \"slammed\"; it's best to acknowledge first\nwhat you appreciate about a piece, before identifying problems and suggesting changes.\nSome questions to consider:\n1. How well do the title/introduction engage you? Does the writer's voice/tone seem\nappropriate? Does the introduction set a context for understanding the essay?\n\n2. How well does the essay vividly present and reflect upon life experience? Are there any\naspects of the experience that seem unclear or undeveloped? How well does the writer tie the\nexperience into the theme either of (a) developing an ethical framework or awareness of social\nissues or (b) acting ethically?\nWhat else do you, as a reader, want to know? Does the essay connect this experience with\nbroader issues of interest to a readership?\n\n3. Is the piece clearly organized? Identify any weak transitions or sections or paragraphs that\nwould work better if reordered or omitted.\n\n4. How effective is the conclusion in (a) dynamically closing the piece and/or (b) opening up\nreflection to broader issues?\n\n5. Are there any ways to strengthen the essay on the paragraph or sentence level?\n\n6. Other suggestions for improvement in revision (e.g., narrating in flashback, using dialogue)?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: Essay 1: Reasons To Believe: Reflections on Ethical Values and Social Awareness",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/2c89dae845956e5e0fdd88fbe173b1a3_MIT21W_011F15_essay1.pdf",
      "content": "21W.011/Walsh Fall 2015\nWriting and Rhetoric: Rhetoric and Social Issues: Essay #1 Sequence: Revised 10/8\n\nEssay #1: Reasons To Believe: Reflections on Ethical Values and Social Awareness\nDue Dates: Exercise 1(see p.3) Mon. 9/14 by noon over email to instructor\nEx.1 Peer Review Thurs. 9/17\nFirst Version Sun. 9/20 by noon (by email) with cover letter\n\nWorkshop: Tues. 9/22\nRevision: Tues. 10/13 (submit with revision cover letter). Bold\nchanges!\n\nDirections for Submission: Place your name, course section, assignment, version and date (single-spaced) in right-\nhand corner of page one (e.g., Name, 21W.011.01, Essay 1, Version 1, 9/20/15). Double space the rest of the essay; use\nTimes New Roman font, 12 pt. First Version: Email your essay (Word document or PDF) with a cover letter (separate\nfile) describing your view of the strengths and problem areas of the piece. Revision: When emailing your revision,\ninclude a new cover letter describing the changes made in response to instructor and peer feedback and your sense of\nthe strengths and problem areas of the new version. When revising, bold any changes from the original; revisions\nshould have at least 250 words (about one page) that have been added to or differ from the first version.\n\nESSAY #1 Suggested length: 1250-1300 words (about 5 pgs.) typed, double-spaced.\n\nThis essay asks you to reflect on your own ethical values. As a writer, you have two choices\nin crafting this essay:\n\n(a) You can narrate and reflect on the process of \"coming to consciousness,\" focusing on a personal\nexperience(s) leading to a deeper awareness of a social or ethical issue or a more general\ncommitment to social justice. For example, you might write about one or two key influences on\nyour ethical development. The influence(s) may be person(s), experience(s), religion(s) or text(s)\n(e.g., books, films). For Essay #1, some students write about the development of a generalized\nsocial consciousness (like Edelman in \"A Family Legacy\" and Shepherd in \"Daughters Without\nBorders\"); others focus on their experiences of becoming aware of social issues such as climate\nchange, hunger, gender inequality or unemployment.\n\n(b) You can focus on \"ethics in action,\" reflecting on an experience or moral choice that affirmed a\npersonal commitment to particular ethical or social values. Some writers may choose a pivotal life\nchoice or moral decision, while others focus on \"everyday ethics,\" smaller expressions of ethical\nvalues such as compassion, cooperation or integrity in daily settings such as colleges, workplaces,\nhomes, houses of worship or playing fields. Some students write about the difficulty of living up to\ntheir ethical standards, while others narrate their internal struggle or confusion about what they\nbelieve in respect to a particular question or issue.\n\nThe challenge of this essay is to work with the complex elements of personal narrative as\nevidence to support an argument in a piece written for a public readership. In creating your\nnarrative, be richly descriptive in your prose. Take the reader inside the experience(s) to appreciate\nits power. When focusing on an individual or a setting, for example, use rich description; include\n\ndialogue, if appropriate. Alternately, if you are writing about a film, book or political speech, select\nvisual images, scenes, quotations or excerpts to communicate the power of the text(s).\nThe first version should be at least 1000 words (about four pages) in length; the revised\nversion should be 1250-1300 words (about five pages). With the revision, include two outside\nsources and a separate \"Works Cited\" page attached to the last page of the essay. In class, we\nwill review the use of outside sources in personal narrative.\n\nWriting Ideas\n\nIf you are (or have been) involved in community service, this assignment enables you to draw\non that experience. If you have a strongly held position on a social issue (e.g., for or against capital\npunishment, gun control, or abortion rights), Essay #1 offers you the opportunity to trace the roots\nof that stance or show how your position on this issue influences your daily life. Remember that\nwriting about internal ethical conflict or confusion is an option.\n\nWriting Challenges for This Assignment\n\nA. Crafting a Reflective Essay\n\nThe challenge in this essay is to move beyond purely personal narrative or unprocessed\nexperience. When writing an experiential narrative for a public readership, be sure that you are\nreflecting upon, shaping and framing your material for a wider audience. In crafting your essay,\nthink about motive. Why do you want to tell this story -- to inspire readers, to challenge their\npreconceptions, to motivate them to care about an issue or, more generally, social justice (however\nyou define the term)? Successful experiential essays bridge the gap between the personal and the\npublic. Essays like this can inspire readers to ponder the sources of their own beliefs, recognize\ndifferent pathways to social engagement, question preconceptions about particular kinds of issues\nor ponder the complexity of a specific problem.\n\nB. Questions of Argument and Structure\n\nAlthough Essay #1 focuses on personal experience, you are still making an argument, i.e.,\nsupporting a claim with evidence. For example, you might support an assertion that a specific event\nwas \"highly influential\" by presenting examples of the power of that experience in a clear,\nreflective and well-structured format. If you state, \"this experience changed my life\", you need to\nsay what that means for you. Remember: \"argument\" takes many forms!\n\nC. Voice and Style:\n\nIn essays like this, you can often be more conversational than in more formal\nacademic prose. However, be sure that your language expresses the power of the\nexperience(s) that you are narrating. Be clear and dynamic in your language. Consider your use of\nsymbol and metaphor; vary sentence length, structure and word usage.\n\nPrewriting:\nExercise 1: Due over email by Mon. 9/14 by noon. Suggested length: 375-500 words (one and\none-half to two typed, double-spaced pages), Word document or PDF.\nThis exercise has TWO parts:\n1) Write a vivid description (250-375 words or 1- 1 1/2 pg., double spaced) of either (a) a central\ninfluence upon your own sense of ethics, morality or social consciousness or (b) an important\nexperience in which you made (or struggled with) an ethical decision or acted in a way that\nexpressed your core moral values.\n2) Write a separate paragraph, titled \"Appeal for Readers\" (125-150 words or half a page)\ndescribing why this story could appeal to a readership. If you decide to write essay #1 about this\nexperience, what do you hope your audience would learn from your piece? Are there particular\nkinds of readers you want to reach? Note: Part #2, the \"appeal to readers\" is a note to yourself,\nintended to help you focus on your audience for this pre-writing exercise.\nPart #2 should not appear in the first version of the essay submitted on Fri. 9/18.\nResources in Writing Essay #1:\n\nWriting Tips, Essay #1\nThe Use of Outside Sources in Personal Narratives\nStrongly Recommended: Review these examples of published student essays that successfully\naddress themes of personal ethics and social responsibility. These pieces reflect different ways\nstudents might successfully fulfill this assignment.\n\nHailey Lee, \"Memoirs of a Modern-Day Abolitionist\" (2011)\nSusan Shepherd, \"Daughters Without Borders\" (2008)\nJoseph Gregg, \"Que Sera, Sera\" (2008)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: Writing Tips for Essay 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/b1b4e205321295ebb8e92362a4fe7448_MIT21W_011F15_writing1.pdf",
      "content": "21W.011/Walsh WRITING TIPS: ESSAY 1\n\n1.Introductions: Good introductions engage readers. Some pieces begin very\neffectively by starting in the middle of an experience; include enough orienting\ninformation so readers can follow the movement of thought.\nSome writers craft \"framing introductions,\" setting the narrative immediately in\ncontext. With this approach, a creative frame is best. Avoid: \"I will tell you a (sad,\nfunny) story.\" Let emotion emerge from the narrative and weave in your commentary.\nFraming introductions can begin in the present and flash back or start with an issue.\nRemember to focus on your development of ethical or social awareness. Think about\nthe difference between \"you then\" (when the experience occurred) and \"you now.\"\n\n2. Proportionality and Focus: In narrating one experience, identify the part of that\nexperience that seems central. Allocate the most space in the narrative to that central\naspect. Slow down narration of the most significant part of your experience. Concentrate\non both the observable aspects (what does this experience look like?) and inner emotions\n(how does it feel?) In narrating more than one experience, be sure that the space allocated\nto each experience is proportional to its meaning.\n.\n3. Intro/Conclusions; Check the \"bookends\" of intro/conclusion. How does the\nconclusion show the movement of thought within the essay? Watch cliches in the\nconclusion. Feel free to end in experience, as long as you weave a larger meaning into it.\nAvoid \"preachy\" or didactic endings.\n\n4. Sources: For the revision, you need two secondary sources.\nIf you make a claim in the first version that needs evidence (e.g., \"Homelessness is on the\nrise in the U.S.\"), you should provide recent statistics from a reliable source and a citation\nin the revision. You can use any citation style in Easy Writer; MLA is preferred. Don't\nworry about correctness of citation style in the first version; we will address this in\npreparing for revision. In class, we will discuss some creative ways to incorporate\nsecondary sources into experiential writing.\n\n5.Sentence-level Editing: Vary your sentence length and structure; avoid repetition in\nword usage. Try for dynamic topic sentences in each paragraph. Change at least 50% of\n\"being\" verbs (any form of the verb \"to be\") to action verbs; (b) passive voice to active\nvoice. This strategy usually results in clearer, more powerful, direct prose. Watch for\ncorrect use of commas and semi-colons!\n\n6. DO NOT USE Microsoft Word grammar checker! The program makes consistent\nand serious errors. If you have usage questions, consult Easy Writer or the instructor.\n\n7. Writing Aids: Use a thesaurus and dictionary when you write.\n\n8. Visual Images: Consider including photographs in the first version or revision\n(obviously adjusting for page length!)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: Course Information Sheet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/c0b1d34a01604597f926405f1c9da8aa_MIT21W_011F15_Course.pdf",
      "content": "21W.011/WALSH FALL 2015\nCOURSE INFORMATION SHEET (Use back of sheet as needed)\nNAME\nE-MAIL ADDRESS\n\nYEAR IN SCHOOL\nMAJOR (IF ANY)\n(Identify by name and number)\nFOR FIRST-YEAR STUDENTS: POTENTIAL MAJOR\n1. List up to FIVE adjectives that describe you as a writer.\n2.What do you like to read (authors, types of writing)?\n3. What has been your best writing experience(s) thus far?\n\n4. What was the topic of your college admissions essay?\n\nWhat was it like to write that essay?\n5. Have you taken other college-level writing courses (at MIT or elsewhere)? If \"yes\", list the\ntitles (or MIT numbers) of these courses.\n6. How did you select this class? How would you like to improve as a writer and speaker?\n7. What other courses are you taking this term?\n8. What social problems or ethical issues concern you?\n9.What other activities (e.g., jobs, UROPs, sports, community service) are you involved in?\n10. What else would you like me to know about you as a learner/thinker/writer/speaker as you\nbegin the course?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: Example of Notes on a Scholarly Articles",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/bc3fcbc80d8e065a8a50cef6dfb2da4d_MIT21W_011F15_notes.pdf",
      "content": "Example of notes on a scholarly articles\nNo Evidence that MMR Vaccine Causes Autism\nThe article:\nWilson, Kumanan, Ed Mills, Cory Ross, Jessie McGowan, and Alex Jadad. \"Association of autistic\nspectrum disorder and the measles, mumps, and rubella vaccine: a systematic review of current\nepidemiological evidence.\" Archives of Pediatrics & Adolescent Medicine 157, no. 7 (2003): 628-634.\n\nThe question:\nWhat is the evidence for and against an association between Autustic Spectrum Disorder (ASD)--autism\nand related disorders--and the measles, mumps, and rubella (MMR) vaccine?\n\nThe study:\nThis study reviewed the evidence from publicshed articles available until January, 2003 for and against\nan association between ASD and the MMR vaccine. The authors searched English and non-English\nlanguage articles on medical-literature databased and found 12 epideomiological studies on MMR and\nASD.\n\nThe findings:\nNone of the 12 studies provided evidence of an associated between ASK and MMR vaccine. \"The current\nliterature does not suggest an association between ASD and the MMR vaccine,\" the researchers wrote.\n\"However, limited epidemiological evidence exists to rule out a link between a rare variant form of ASD\nand the MMR vaccine.\"\n\nThe bottom line/ relevance:\nNo epidemiological evidence exists of an association between ASD and the MMR vaccine in the medical,\npeer-reviewed literature.\nThe authors wrote, \"Given the real risks of not vaccinating and that the risks and existence of variant\nASD remain theoretical, current policies should continue to advocate the use of the MMR vaccine.\"\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: Final Reflection Letter",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/9df1f19d8b55cb67f576907801818ccd_MIT21W_011F15_final.pdf",
      "content": "21W.011 Fall 2015\n\nCOMPLETING THE TERM: FINAL SUBMISSIONS; FINAL LETTER\nDue: With Revision #3 by the end of Thurs. 12/10.\n\nFor final submissions, include revision #3 and a final letter (1 pg.).\nYour final letter (two or three paragraphs) should describe:\n\n(1) changes you made in revision to your grant proposal (#3)\n\n(2) how you have seen your writing (process and product) and communication skills improve\nover the course of the term. You may want to focus on such aspects of writing and\ncommunication as (no need to cover all points):\n\npre-writing (brainstorming, crafting proposals and outlining)\nthe revision process\nwriting engaging introductions and conclusions\ncrafting clear and persuasive prose\nsupporting claims with evidence\nusing secondary sources effectively\norganizing an essay\nediting at the paragraph and sentence-level (e.g., correcting for overuse of \"being\" or passive\nverbs, run-on sentences, grammatical errors, etc.)\nlearning to write in new genres (e.g., grant proposal)\nlearning to use new elements in an essay (e.g., epigraph quotations)\ncommenting on your peers' writing\npreparing for and delivering oral presentations\n\nWhat aspects of your writing do you want to continue to work on? (This last question\nconcerns both academic writing and creative writing - fiction and nonfiction).\n\nNote: The final letter should take you no more than a half hour to complete. I am not looking for\nmini-essays!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: In-class Writing on Consuming Kids",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/b965e30b877d4aba8985ad05e2e89fef_MIT21W_011F15_CONSUMING.pdf",
      "content": "21W.011 Fall 2015\nName\nIn-Class Writing: Write for about ten minutes. Use \"bullet points\" to express as many ideas\npossible; write on the back of the form, if needed.\nConsuming Kids (Media Education Foundation, 2008)\n1. How do you relate your own childhood relationship to media and consumerism to this film?\n\n2. What's the most important thing that you learned from this documentary?\n\n3. For the filmmakers, what are the most troubling aspects of \"wrap-around\" or immersive\nmarketing to children, which appears on multiple screens (TV, internet, etc.)? Name three or\nfour issues/social problems the filmmakers identify.\n\n4. How does this documentary compare to Food, Inc.?\n\n5. Consuming Kids was produced in 2008. How would you update this film for 2015?\nWhat stance would you take toward the subject of commercial advertising directed toward\nchildren? What other topics/issues would you include? Do you agree with the filmmakers'\n(a) diagnosis of the problem(s) and (b) potential solutions?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: Not Saturday's Child",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/e39e441979bf919b3778ade11b9e9b86_MIT21W_011F15_NOT_SAT.pdf",
      "content": "NOT SATURDAY'S CHILD\n\nPeople often ask me if I am depressed or sad or if I miss my parents. These would\nbe sympathetic and expected questions if my parents had recently died. But they haven't.\nThey're very alive and well and live together with me, my brother and sister in a suburb\nof Boston. Why these questions, you ask? I'm adopted.\nBy \"adopted,\" I don't mean that I was one of \"Saturday's Children\" in the Boston\nGlobe who at 10 or 13 or even older are adopted into a family. I came to my parents at 5\ndays old, the newborn son of a teenager and her ex-boyfriend from Milwaukee, a couple\nwho simply weren't mature enough to become parents. They made a good decision and I\nam grateful that they did.\nPeople often assume that I am unhappy because I am adopted or that I am or should\nbe frantically searching for the once-teenage couple, now, I guess, in their late 30s and\napproaching middle age. One friend in middle school kept asking me \"Who are your real\nparents? Don't you want to find out?\" A girl I dated briefly last year asked me if I\nwanted to search for my birthparents. \"There are searching services, you know,\" she said.\n\"People often feel more at peace with themselves if they know their roots.\" To placate\nher, I said I didn't have enough money. She offered to pay half the cost.\nWhy are so many people so worried about me? My parents are certainly \"real\" to\nme and to my younger brother, also adopted. (My older sister is my parents' biological\nchild. But why am I telling you this?) My brother and I (predictably) look a little less\nlike my parents than my sister. (My parents are Italian-American and Mexican-American;\nI am Lithuanian-American and Polish-American.) But this doesn't bother me or take up\nmuch of my mental space.\n\nSometimes I feel curious about my birthparents, but the curiosity is fleeting. I am\nabout as interested in finding them as I am in someday visiting Seattle, which, I've heard\nfrom friends, is a really beautiful city. But I am in no rush to go and only think of it once\nin awhile. If I found my birthparents, I am not sure what I'd say or do. Do I want a\nrelationship, a \"reunion\", as my former girlfriend put it? No. I have a pretty happy family\nand I don't need another.\nSo, I ask, why all the concern, all the misplaced sympathy? Maybe because many\npeople believe that biological families are superior to adopted families, that all adoptees\nare like \"little orphan Annies\" or \"Oliver Twists.\" Perhaps it's not their fault. If we look\nat the daily newspaper obituaries, we often see adoption presented as \"special\" or worth\nnoting. (\"Stanley Smith, 72, is survived by his wife Mary and his two adopted daughters,\nAnn and Marie.\" Would an obituary ever say that Stanley was survived by his two\n\"biological daughters?\" I don't think so.) Often TV movies present tragic adoption\nstories in which pathetic adult adoptees spend all their time, money and psychic energy\nsearching desperately for a birthparent who abandoned them long ago.\nI'm not denying that some adoptees experience a deep sense of sadness or want to\nsearch for their birthparents. All I am asking, though, is that people not assume that I am\nin need of their help or support because of my \"special situation.\" Direct your sympathy\nand concern elsewhere. Think about the language you use when you talk about adoption\n(I never want to hear \"real parents\" again). Consider the possibility that your \"caring\"\nmay have its roots in prejudice. Adoption isn't a second-rate way to have a family; it's\njust a different way.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: Research And The Note-Taking Process: Managing And Understanding Sources",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/52ae594552c6324488bfa74c3b605de7_MIT21W_011F15_research.pdf",
      "content": "Name\nWRITE FOR ABOUT FIVE MINUTES\n\nRESEARCH AND THE NOTE-TAKING PROCESS: MANAGING AND UNDERSTANDING SOURCES\n\nWhen you are doing research for a paper, how do you track and record knowledge learned from\nsources? Check all that apply.\n\n-\nHighlighting and writing in the margins\n-\nKeeping notecards (written or typed)\n-\nWriting summaries of articles/books\n-\nUsing digital highlighting/marking e.g. Mendeley\n-\nDrawing maps of ideas and authors\n-\nTrying to remember the ideas in sources (no written system)\n-\nOther (specify)\n\nWhat strategy works best in the practices you checked above?\n\nWhat strategy is least effective?\n\nIn the research/discovery phase of essay writing, what would be your ideal form of note-\ntaking/recording research findings?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: Some Logical Fallacies",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/b8a4284061398fdc0375c1dfd1049c62_MIT21W_011F15_SOME.pdf",
      "content": "SOME LOGICAL FALLACIES:\nA. BROAD GENERALIZATIONS--Working from a limited sample; Repressing contrary evidence.\nB. POST HOC ERGO PROPTER HOC--After this, then, because of this\nEconomy enters a recession; rates of teen pregnancy rise. Assume one is caused by the other.\nIssue of correlation and causation\nC. NATURALISTIC FALLACY--If something is \"natural\" (i.e. it occurs in nature) it is assumed to be\neither good or inevitable.\nD. STRAW PERSON--Create a caricature of your opponents' argument to dismantle it.\nE. AD HOMINEM--You read an article in a management journal about the importance of\ndemocratic and participatory styles of management. However, the author is your boss who has\nan autocratic style in your workplace. You conclude that the argument is complete hypocrisy\nand worthless.\nF. INEVITABLE SLIPPERY SLOPE--If this changes (legalization of physician-assisted suicide), then a\nwhole host of other negative changes (e.g., killing people with disabilities, etc.) will inevitably\n(and sometimes quickly) occur.\n(\"Modified slippery slope\" - possible consequences--may be acceptable e.g., if workers lose the\nright to protection against mandatory overtime, other limitations on workers' rights may be on the\nhorizon.)\nG. PREDICTION (related to \"Inevitable Slippery Slope\")--If change X occurs, then Y is inevitable. If\nthe U.S. implements a new tax policy and jobs program, the country will eliminate poverty in\nthirty years. (A writer can speculate, however, about the possible impacts of changes in tax\npolicy and the implementation of new jobs program.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: The Pitch",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/666d7412159636dae077a5bd4acfb7d6_MIT21W_011F15_the_pitch.pdf",
      "content": "21W.011 Fall 2015\nThe Pitch\nDates: Thursday 12/3/15, Tuesday 12/8/15, Thursday 12/10/15\n\nAs part of this assignment, each student will prepare a three minute talk (no longer!) that (a) describes\nyour grant proposal project and (b) tells your audience why it is very important to fund this project. Be\ncreative and dynamic in your approach. Your goal is to motivate your listeners (as fictive members of a\nfunding organization) to consider seriously the value of your proposal and to want to review it more\ncarefully. Start your speech with a solid introduction, a \"hook\" that will engage listeners and inspire\nthem to want to know more about your project.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: The Use of Outside Sources in Narrative Essays",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/62acd5871eb25cc2a1c5a29406a19f99_MIT21W_011F15_Narrative.pdf",
      "content": "21W.011 Fall 2015\n\nThe Use of Outside Sources in Narrative Essays\n\nSince narrative essays primarily employ the art of storytelling, secondary sources do\nnot play as prominent a role as they do in research and persuasive essays. However,\nsome use of secondary sources can help to provide an interpretive frame for\nunderstanding an experience, to inspire or challenge the reader and to include necessary\nreferences for information outside the writer's experience.\n\nSome common use of secondary sources in narrative essays include:\n\nEpigraphs: Usually placed under the title or subtitle, epigraphs can frame a piece and\nsuggest a larger interpretation of an individual experience. If the writer is focusing on an\ninternal conflict or expresses a divided opinion about an experience, two \"dueling\nepigraphs\" can capture that sense of conflict. Epigraph form: Use italics, no quotation\nmarks. Only indicate the name of the author/speaker of the quote. You do not need to list\nsources for epigraphs in a \"Works Cited\" page.\n\nExample of epigraph:\n\nService is the rent we pay for living.\nMarian Wright Edelman\n\nInformational Source: These sources provide information beyond our personal\nknowledge. In a personal essay, depending on the nature of the narrative, the writer may\nwant to add a few sources to establish that his experience is representative of a larger\ntrend or that her story is unusual and not the norm, but nonetheless important.\n\nExample of the use and citation of an informational source (MLA style):\n\nMartin was one of the many homeless vets I met at the shelter last winter.\nHomelessness among military veterans in X (City) had been on the rise over the last few\nyears (Smith).\n\nCite the source in the body of the essay and include the source (book/article) in a\nseparate \"Works Cited\" page attached to the end of the essay.\n\nIf you want to include additional information, you can add a footnote that will appear at\nthe bottom of a page or an endnote that will appear at the end of the essay. See\nEhrenreich's \"Nickel and Dimed\" for an example of the use of informational footnotes in\na personal narrative.\n\nPreparing a Works Cited Page:\n\nSee second citation handout.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Writing and Rhetoric: Rhetoric and Contemporary Issues: Utopia Writing Exercise",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-011-writing-and-rhetoric-rhetoric-and-contemporary-issues-fall-2015/4fec7ac5e67e382689d806658972cc7d_MIT21W_011F15_Utopia.pdf",
      "content": "21W.011 WALSH FALL 2015\nNAME\n\n10 MINUTE WRITING ASSIGNMENT: Assume, for the purposes of this\nassignment, that you have the magical power to solve social or ethical problems.\nUse \"bullet points\" to express yourself more quickly; use back of page as needed.\n\n1. If you had the magical power to solve one social or ethical problem in the world, what\nproblem would you choose? Why?\n\n2. If you had the magical power to solve one social or ethical problem in the U.S. or\nanother country, what problem would you choose? Why?\n\n3. If you had the magical power to solve one social or ethical problem in your home\ncommunity, what problem would you choose? Why?\n\n4. If you had the magical power to solve one social or ethical problem in the MIT\ncommunity, what problem would you choose? Why?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.011 Writing and Rhetoric: Rhetoric and Contemporary Issues\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}