{
  "course_name": "Writing and Experience: Exploring Self in Society",
  "course_description": "The reading and writing for this course will focus on what it means to construct a sense of self and a life narrative in relation to the larger social world of family and friends, education, media, work, and community. Readings will include nonfiction and fiction works by authors such as Maya Angelou, James Baldwin, Andre Dubus, Anne Frank, Tim O’Brien, Flannery O’Connor, George Orwell, John Steinbeck, Amy Tan, Tobias Wolff, and Alice Walker. Students will explore the craft of storytelling and the multiple ways in which one can employ the tools of fiction in crafting creative nonfiction and fiction narratives.",
  "topics": [
    "Humanities",
    "Literature",
    "Creative Writing",
    "Criticism",
    "Fiction",
    "Nonfiction Prose",
    "Humanities",
    "Literature",
    "Creative Writing",
    "Criticism",
    "Fiction",
    "Nonfiction Prose"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nOverview\n\nOur reading and writing for this course will focus on what it means to construct a sense of self and a life narrative in relation to the larger social world of family and friends, education, media, work, and community. What does it mean to see ourselves as embodying particular ethical values or belonging to a certain ethnic, racial, national or religious group(s)? How do we imagine ourselves within a larger family narrative? In what ways do we view our identities as connected to and expressed by our educational and work experiences? How do we see ourselves as shaping and shaped by the popular media culture of our society? How do we think about our social responsibility to our smaller and larger human communities? Readings will include non-fiction and fiction works by authors such as Maya Angelou, James Baldwin, Andre Dubus, Anne Frank, Tim O'Brien, Flannery O'Connor, George Orwell, John Steinbeck, Amy Tan, Tobias Wolff, and Alice Walker.\n\nThroughout the semester we will explore the craft of storytelling and the multiple ways in which we can employ the tools of fiction (e.g., character, setting, dialogue) in crafting creative non-fiction and fiction narratives. We will also examine the multiple ways in which students can build arguments from both experiential data and secondary sources.\n\nRequirements\n\nCourse requirements include:\n\nregularly attending and participating in class\n\nsubmitting four major writing assignments as well as regular short writing exercises\n\nresponding in workshop (in writing and orally) to one another's writing\n\nmeeting with the instructor in individual conferences at least twice during the term\n\ngiving an oral presentation and a reading of your work at the end of the term.\n\nThe four major writing assignments (first and revised versions) are three essays and a short story (or fourth essay).\n\nService Learning Option\n\nThis course offers a service-learning option so that you can address some of the social and psychological issues within the community (such as poverty, health care issues, educational inequality or other issues of interest) that we read about and discuss in class. Students often find that they do their best writing when they focus on the experience of active engagement with real-world problems. The service-learning option reflects MIT's mission that the Institute \"seeks to develop in each member of that community not only the ability to work wisely, creatively and effectively for the betterment of humankind, but also the passion for doing so.\" While service-learning is not mandatory to fulfill course requirements, it is encouraged.\n\nHandout on the service-learning option. (\nPDF\n)\n\nWriting Assignments\n\nThe primary goal of this course is to develop your ability to translate the material of life experience into vivid, reflective, well-organized and persuasive prose that expresses a clear perspective or central idea. By the end of the semester, you will have written about 25 pages of revised prose, as well as your regular journal writing assignments.\n\nWe define \"experience\" quite broadly in this class. In your writing for the course, you can draw upon a wide variety of types of experience:\n\nyour own life story\n\nlife narratives of or interviews with family members, friends, co-workers, and mentors\n\nobserved or witnessed experience\n\nexperiences that you've read or heard about in books or viewed in films or on television\n\nIn writing from experience, it is crucial that you shape your material to motivate a wider reading public. In other words, there needs to be something at stake for readers in your writing about, for example, your annual Halloween rituals or your grandmother's dedication to her job. The motive for readers might be the desire to meditate on some universal human fears, desires or developmental stages or to understand a particular social problem or issue from an individual's perspective.\n\nThere will be four major writing assignments; you will submit each assignment in a first version (not a \"rough draft\") and later, in revised form. In the first three creative non-fiction essay assignments, you will have the opportunity to write autobiographical (or biographical) narratives. In the first essay, you will focus on a significant aspect of personal identity. The second and third essays, in which you will connect your experiential narrative with outside research, focus on topics of your own choice. For outside research, students will draw upon both primary and secondary sources. In writing a specific essay, a student may do library research, conduct interviews, engage in field observation or do service learning. For the fourth and last writing assignment, you can choose to write either a short fiction piece or another creative non-fiction essay. These four major assignments, as well as other writing exercises in your reader/writer notebook, are at the center of the course. Each writing assignment will build upon the skills of the previous piece(s) that you've crafted. In each unit, reading assignments and preliminary writing exercises will prepare you for the essay or short fiction piece that you will be crafting. Over the course of the semester, you will revise each piece that you write. Throughout the semester, our class will focus on writing as a process of initial crafting and revising to create works that are lively, clear, engaging and meaningful to a wider audience.\n\nYou will also keep a typed reader/writer notebook of writing exercises and will give at least one oral presentation and a reading from one of your pieces of writing at the end of the term. As the semester ends, you will submit a final portfolio of all four writing assignments, first versions and revisions. The portfolio is due at the last class with the revision of the fourth piece.\n\nClass Participation and Attendance\n\nTo foster a sense of intellectual community, this course is structured as a seminar. Throughout the term, we will be discussing the work of professional, as well as student, writers. It is crucial that you come to class prepared to offer thoughtful comments on assigned readings as well as helpful feedback to your peers. A vital, ongoing intellectual conversation - about our writing and that of published authors - is at the heart of the course. To be effective as a seminar participant, you will need to complete reading and writing tasks by their due dates. Please arrive at class on time and bring assigned texts with you.\n\nWriting Workshop\n\nThe writing workshop - in which students respond to their peers' essays and stories - is a very important part of the course. For all four major writing assignments, we will have an in-class workshop after first versions have been submitted. We will also workshop some shorter pre-draft writing assignments. My expectation is that you will respond to each other's work seriously and critically and approach each essay or story with sensitivity, insight and imagination. For each workshop, you will be asked to read several essays or stories, discuss them in groups with your classmates and respond to each piece in the form of a individual letter to the writer. The ethical norm of our class is that all student writing (including your comments) is considered confidential; you should store other student's works-in-progress in a secure place and not discuss your peer's writing outside the classroom. This ethic enables us to develop the trust and security we need as a small writing community.\n\nSince our class functions as a writing community and the first \"public\" for your essays and fiction, it is essential that you attend class faithfully.\nIf you have more than two unexcused absences, it will affect your final grade. Under Writing Program policy, you cannot pass the course if you have more than five unexcused absences.\nThree latenesses (more than ten minutes) count as an absence. If you miss class because of a personal or medical emergency, please contact me (or have a dean contact me) as soon as possible. Save your absences until the later part of the term. Do not miss workshop classes except in cases of emergency; workshop absences count as two absences.\n\nCommenting and Grading\n\nThis semester you will write four pieces, each with a different focus. Each piece will be initially submitted as a first version and later, in revised form. In reviewing first versions of your essays and stories, I will make extensive comments and suggest some options in revision. I am also available to meet with you to discuss your writing. Only the revised versions are graded. Pre-draft exercises will be acknowledged with a check and/or brief comments.\nIt is important that you submit work on the due date\n. In the event of a personal or medical emergency, please contact me (or have a dean contact me) as soon as possible. Late submission of work without an extension may result in a lowered final grade. To pass the course, all required work must be submitted. Your final grade will reflect the quality of your revised essays, the thoughtfulness of your reader/writer notebook exercises, your oral presentations, your attendance, preparation for and participation in class, and your contribution as a reader for your peers.\n\nWriting Objectives\n\nIn commenting on your writing, I will encourage you to:\n\ndraw upon life experience to create vivid and readable prose\n\naddress an intelligent, public audience in a graceful style\n\nadapt the tools of fiction (setting, character, dialogue) to creative non-fiction\n\ndevelop your ideas and narratives in an interesting, original and coherent manner\n\nsupport your arguments with evidence and use sources creatively and appropriately\n\nexpress yourself clearly in language that uses the conventions of grammar, punctuation, word usage and source citation\n\nexperiment with different narrative styles and structures\n\ntitle your work in a thoughtful and entertaining fashion\n\nManuscript Form\n\nEssays and stories should be typed, double-spaced, on one side of white paper, with margins of about an inch all around. In the upper right-hand corner of page 1, type your name, course title, the date, number and type of assignment (e.g. First Version, Essay #1), single-spaced. Your title should be in\nupper case\n, centered and placed about two double spaces beneath this block of information. Paragraph 1 should begin about two double spaces below the title; please number pages! Each essay should be submitted with two copies and a cover letter describing what you see as the strengths and weaknesses of your piece.\n\nSample Essay Form (\nPDF\n)\n\nFaculty Conferences\n\nOver the course of the semester, I am available to meet with you in conferences to discuss a particular piece or more general strategies for improving your writing. My role is as a writing coach, to offer feedback and suggest options to you as a writer, as you make decisions about how to plan and revise your work. Conferences offer a rich opportunity to extend the conversations of the seminar about strategies for successful writing. You should come well prepared to conferences to discuss your strategies for a particular essay or type of writing. You may find it helpful to see me in conference at the pre-writing stage of brainstorming and idea generation, at the stage between the first version and revision, or at the midterm point to discuss your progress for the course and your goals for the rest of the term. You can schedule conferences with me in class or through email.\nTwo conferences are required for the semester\n. I will schedule one with you early in the semester; you should also plan on setting up a conference time later on in the term.\n\nAcademic Honesty and Originality\n\nAs a MIT student, member of our class and the larger community of writers, you are expected to abide by the norms of academic honesty. Borrowing someone else's language and/or ideas without proper acknowledgement is academically dishonest and a form of plagiarism, which can have serious academic consequences at MIT.\n\nIn class, we'll discuss how to acknowledge sources and how to avoid plagiarism. For different styles of citing sources (MLA, APA), see\nEasy Writer\n,\nThe Mayfield Handbook\n.\n\nWriting Center/Writing Resources\n\nThe Writing and Communication Center\n, also offers consultations on student writing. You may visit the Writing Center at any point in the writing process: prewriting, drafting or revising a piece of writing. In addition, The Writing and Communication Center offers advice on preparing oral presentations. It's best to schedule an appointment by calling the Center.\n\nThe\nProgram in Writing and Humanistic Studies\nWeb site also has information on a range of topics of interest to writing students: other writing classes, program advising, requirements for majors, minors and concentrators, and lectures and readings by authors on campus. Each spring the Program awards the Ilona Karmel Writing Prizes for student writers. More information on the Karmel prizes at the Program office.\n\nWriting Portfolio\n\nPlease keep all four assignments (first versions and revisions) and my comments together in a writing portfolio. At the end of the semester, with your final revised piece, you will submit your portfolio, together with a final writer's letter, in which you will reflect on the themes in your writing, the ways in which your writing process and style have changed throughout the course of the semester and your plans for the future. Please note: your writing portfolio should be kept separately (in a binder with pockets or ring notebook) from your other material for class.\n\nPublishing Your Work\n\nStudents are strongly encouraged to craft their essays and stories with a goal of publication. During the semester we will discuss strategies for planning for publication. Some MIT student publications include:\n\nCounterpoint\n- The main college campus magazine at MIT and Wellesley, published eight times a year. Since 1991, this magazine has served both academic communities - a combined population of 15,000 - addressing topics from a broad spectrum of social, political, and cultural issues.\n\nThe Tech\n- MIT's newspaper.\n\nRune\n- A biannual journal of arts and letters containing original work by MIT students, staff, faculty, and affiliates.\n\nThe publication websites will include information on submission guidelines. Students can also browse through back issues of\nCounterpoint\nand\nRune\nin the instructor's office.",
  "files": [
    {
      "category": "Resource",
      "title": "oral_presen.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-731-1-writing-and-experience-exploring-self-in-society-spring-2004/1e2e966a4f09d936048f6e98659ce385_oral_presen.pdf",
      "content": "21W. 731\nSPRING 2004\nThurs. 3/18: ASSIGNMENTS: WRITING AS WORK;ORAL PRESENTATIONS\nReading: Common Reading: Orwell, \"Politics and the English Language\"\nAnna Quindlen, \"The Eye of the Reporter, the Heart of\nThe Novelist\"(distributed in class)\nIndividual Reading: Each student will have a different piece from the\n\"Writers on Writing\" series, New York Times\n(distributed in class)\nFor Thursday's class, we will all discuss the Orwell and Quindlen pieces. Then each\nstudent will present an article from the \"Writers on Writing\" series. In this series, fiction\nand nonfiction authors discuss a wide range of issues related to writing as work:\n*rhythms of the writing life\n*using writing technology (pens, computers)\n*imagining the audience\n*dealing with the \"inner critic\"\n*the process of revising and rewriting\n*relationship of fiction and nonfiction\n*learning the art of storytelling\n*storytelling and family/ethnic tradition\n*creating characters and narratives\n*characters as alter egos\nFor Thursday, each student should introduce his or her article, summarizing it and\nreading one or two representative paragraphs to the class. Presentations should be about\n3-5 minutes. There is no notebook assignment for Thursday."
    },
    {
      "category": "Resource",
      "title": "read_write_nb.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-731-1-writing-and-experience-exploring-self-in-society-spring-2004/6d048168ebe67e4406180381a8e4f6f8_read_write_nb.pdf",
      "content": "READER-WRITER NOTEBOOK/JOURNAL - 21W.731 SPRING 2004\nRESPONDING TO ESSAYS/CREATIVE NONFICTION\nThe purpose of the notebook/journal is to help you to \"read as a writer,\" paying\ncareful attention to the ways in which authors craft their pieces to address an intended\naudience(s). Each class you usually will submit one short journal entry (approx. 1-1 1/2\ntyped pg., double-spaced) on an assigned reading. Some journal assignments will be\ngiven out in class. However, in other journal entries, you can choose how to focus on one\nor more aspects of the writer's craft. These entries will help prepare you for class\ndiscussions as well as your own writing. Sometimes I will ask one or two students to\ndistribute copies of a journal assignment(s) to the class to stimulate discussion.\nHere are some general questions to consider in reading essays for class. In writing\n(unassigned) journal entries, you will probably only focus on a few of these questions.\nHowever, thinking about all of them will help you prepare for class. Later in the term, I\nwill distribute a response guideline sheet for the short stories that we read.\n*************************************\nWhat is/are the potential meanings of the title? How does the writer introduce the essay?\nWhat is the general tone of the piece -persuasive, angry, informative/neutral, ironic,\nhumorous? What kind of language(s) does the writer use--direct and simple, colloquial,\nabstract /\"high academic\", personal/confessional, humorous? Does the tone shift over the\ncourse of the essay? What's the effect(s) on you as a reader? What is your impression of\nthe writer/narrator?\nHow vividly does the writer draw upon memories of personal experience or the\nexperiences of others? In what ways does the writer employ the tools of fiction (setting,\ncharacter, dialogue)? How does the writer use imagery, symbol and metaphor?\nWhat sections, paragraphs, words or sentences seem especially significant? Why?\nHow does the writer use repetition--of words, phrases, sentences or passages--in the\npiece?\nWhat's the central point of the piece?\nHow does the writer end the essay? What do the introduction and conclusion as\n\"bookends\" of the piece suggest about how to read the essay?\nHow do you see this essay as connecting with other readings (for the course or outside),\nexperiences you've had, and issues that you've thought about?\nWhat have you learned as a writer from this piece? Are there any narrative techniques\nthat you are working with (or would like to work with) in your own writing?"
    },
    {
      "category": "Resource",
      "title": "sample_essay.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-731-1-writing-and-experience-exploring-self-in-society-spring-2004/7105969af3769d888f90f9a229e93671_sample_essay.pdf",
      "content": "Tony Sanchez\n21W.731.01:Writing and Experience\nRevision, Essay 1\nDate\nTITLE GOES HERE\nParagraph I starts here............."
    },
    {
      "category": "Resource",
      "title": "writers_letter.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-731-1-writing-and-experience-exploring-self-in-society-spring-2004/2e0b62d4455fc07399f07f7e6548b48e_writers_letter.pdf",
      "content": "21W.731\nSPRING 2004\nWRITING AND EXPERIENCE: EXPLORING SELF IN SOCIETY\nWRITER'S LETTER ASSIGNMENT\nDue: Thurs. 2/5. Suggested length: 1-1/2 typed pages, double-spaced.\nThroughout the semester, I will ask you to keep a constant finger of the pulse of your\nown work with each writing assignment. As I read your work, I will do so\ndevelopmentally, considering your progress from the previous assignment and your goals\nfor the next one. We open the term, then with a reflection on your own experiences with\nwriting: what has worked for you so far as a writer, what aspects of your writing are\nsatisfying to you versus those which are less so, what you hope to accomplish in this\ncourse and so on.\nPlease take a half-hour to an hour to create a portrait of yourself as a writer. These\nquestions are intended as a guide. Don't answer these questions in a list-like fashion!\nCreate an engaging and readable narrative.\nSOME QUESTIONS TO CONSIDER:\nHow often do you write (a) for courses/assignments (b) for pleasure (c) for other\npurposes (e.g. job, student publication)? How often do you wish you wrote?\nWhat do you like to read? Are there any specific authors who have inspired you as a\nwriter?\nDoes the experience of writing vary for you with different types of writing (e.g.,\ntechnical, expository, diary, fiction)? If \"yes\", say more.\nHow would you characterize yourself as a writer (this characterization may differ with\nspecific kinds of writing such as technical and scientific writing, poetry, science fiction,\netc.)? How do you think others see you as a writer?\nWhat \"writing rituals\" (e.g. place to write, music, etc.) do you have?\nWhat influences have been most helpful for you as a writer (e.g. friends/family, classes,\nreligious, political)?\nWhat has your experience in writing or English classes been like?\nWhat are your goals for yourself as a writer this term?"
    },
    {
      "category": "Resource",
      "title": "essay1_wkshp.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-731-1-writing-and-experience-exploring-self-in-society-spring-2004/8f83b2f97ebfe04fe2625c144209821d_essay1_wkshp.pdf",
      "content": "21W.731\nSPRING 2004 Workshop #1:Draft, Essay #1\nDue: THURS 2/19: Marked-up drafts and individual response\nletters to classmates, with copies to instructor.\nDear \"Writing and Experience\" Students:\nWe have several essay drafts to review and comment on for\nour writing workshop next class.\nThis workshop has a dual\npurpose: (a) to provide individual feedback to some of you and\n(b) to help identify common writing concerns, as all of you\nprepare to revise your essay drafts.\nYour assignment for this workshop is to review each draft\nessay twice, carefully and critically, and type a letter (1-1 1⁄2\npages, double-spaced) to each writer. (Bring two copies of each\nletter to class, one for me and one for the writer.) You should\nalso make marginal comments on the essays, in addition to the\nletters.\nThis editing task should take about 2 -2 1⁄2 hours. It's best\nto read an essay draft through first, without putting pen or\npencil to paper. Then, after a second reading, comment in the\nmargin and write a response letter. Many readers find that they\nare most effective as responders if they break up this editorial\ntask into two parts, reviewing one or two essays first, and then\nreturning to the essay(s) remaining.\nthree\nYour letters should let your fellow students know two or\nspecific strong points in this draft, and two or three\nspecific things that you think need work or that you have\nquestions about. We are primarily focusing here on the essay as\na whole and how it might be strengthened, rather than more minor\nproblems of \"polishing\" (e.g., grammar, punctuation, etc.).\nWhat you're aiming for here is constructive criticism that\nwill help your peers craft better revised essays.\nSince most\nwriters learn more from constructive comments rather than being\n\"slammed,\" it's best often to acknowledge first what you like\nabout a draft, before identifying its weaker or more problematic\nareas.\nHere are some questions for you to consider:\n1.\nHow well do the title and introduction engage you as a\nreader? Does the writer's choice of voice/tone seem appropriate\nto the topic? How well does the writer establish a context for\nunderstanding the essay in the introduction?\n2.How well does the draft vividly present and reflect upon life\n\nexperience? Are there any aspects of the experience that seem\nunclear or undeveloped? How well does the writer use the tools\nof fiction (setting, character, dialogue)?\nWhat else do you, as a reader, want to know? Does the draft\n(a) connect this experience with wider human concerns (b)\npresent a clear perspective on the experience presented? (\"B\"\nconnects with what we might call \"argument\" in an expository\npiece.)\n3.Is the draft clearly organized so that you can follow the\nmovement of thought?\nAre there any sections or paragraphs that\nwould work better if reordered or omitted?\n4. How effective is the conclusion in (a) dynamically closing\nthe piece and/or (b) opening up reflection to broader issues?\n5.Are there any ways in which the author might strengthen the\ndraft on the paragraph or sentence level?\nIn class, we will spend equal amounts of time on each essay.\nSince we can't possibly cover all suggestions in 20-25 minutes,\nthese letters are critical in providing feedback. At the end of\nthe class, you'll return the marked-up essays with your letters\nto the writers, and copies of the letters to me.\nThanks in advance for your hard work. See you in class next\nweek.\nAndrea Walsh\nP.S. It may be helpful to have a copy of the essay assignment\nsheet (or \"prompt\") as you review these drafts."
    },
    {
      "category": "Resource",
      "title": "essay1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-731-1-writing-and-experience-exploring-self-in-society-spring-2004/34f0c5746c8473516f37982d21cc3494_essay1.pdf",
      "content": "21W.731/Walsh\nSpring 2004\nEssay #1\nDue Dates: First Version: Fri. 2/13--Two copies + cover letter (and Ex. 1.1, if\napplicable) at my office. (Workshop students: email drafts to the class as\nWord attachments.). Class Workshop: Thurs. 2/19.\nRevision: Fri. 2/27 at my office (2 copies + cover letter+marked-up first version +Ex.\n1.1, if applicable)\nSuggested length: 4-5 typed pg., double-spaced. For both the first version and revision,\nplease submit two copies with a cover letter to me reflecting on the strengths and\nweaknesses of the piece. If you develop your draft from exercise 1.1, please include your\nmarked-up exercise. When you submit your revision, please include the marked-up first\nversion with my comments, ex. 1.1 (if applicable) and a cover letter commenting on the\nways you've responded to the comments/suggestions of your peers (and myself) and the\nchanges you've made in revision. (While it's important to consider everyone's\ncomments, I don't assume that you will necessarily agree with all the revision\nsuggestions of your reviewers.)\nAssignment:\nThrough exploring a central aspect of your own identity (or the identity of someone\nclose to you), write an essay that reflects on your (or your subject's) experience(s) to\nconnect with issues that speak to a wider audience. In essays like this, it is often most\neffective to ground your discussion of your (or your subject's) identity in such\nexperience(s)as:\n*a critical event(s) or turning point(s) in life;\n*a specific symbolic moment(s) within a close family or personal relationship;\n*a family or personal ritual or \"rite of passage\";\n*a meaningful artifact (photo, sentimental object, family heirloom or keepsake).\n* a special or \"sacred\" place or meaningful journey\nReflect carefully on the voice that you adopt as a writer. Don't assume that first-\nperson narration is your only option; you can write about yourself in the third person, if\nyou wish. Be vivid and descriptive in your prose; use the tools of fiction -character,\nsetting and dialogue. Shape your narrative so that it clearly conveys a perspective or\ncentral idea. You may choose to incorporate secondary sources, although they are not\nrequired in this piece.\nThe challenge of this assignment is to shape and frame the raw material of experience\nand memory for a reading public. Using the lens of experience, you have a rich\nopportunity as a writer to communicate with readers about a wide variety of topics that\nevoke a shared sense of humanity.\nNote: You may decide to expand or elaborate upon Exercise 1.1. Alternately, you can use\n1.1 as a warm-up assignment for another essay or piece of short fiction and write about a\ndifferent experience for Essay 1."
    },
    {
      "category": "Resource",
      "title": "exerc_1_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-731-1-writing-and-experience-exploring-self-in-society-spring-2004/65cf012b4fe2901c07fda4c348888abc_exerc_1_1.pdf",
      "content": "21W.731/Walsh\nExercise 1.1\nSpring 2004\nDue: Thurs. 2/5. Please bring SIX copies of this exercise to class with you. We will\nshare these exercises for feedback in small groups. Suggested length: 1- 1 1/2 typed\npages, double-spaced.\nEXPLORING IDENTITY\nThis short assignment should help to prepare you for essay #1 or another piece of\ncreative nonfiction or short fiction that you will write during the term. The aim of this\nexercise is to narrate an individual experience in vivid language and motivate the reader\nto engage with your writing. If you develop 1.1 into a longer piece, you'll have the\nopportunity to reflect more profoundly about this experience and connect it with wider\nhuman issues.\nIn this exercise, your goal is to begin to explore the roots of your own identity or the\nidentity of someone you know well. As you begin this assignment, identify what's most\nimportant in life to you or your subject (core ethical or religious beliefs, social ideals,\npersonality traits, national, cultural or ethnic identity, goals or commitments, career\ngoals). Write about the roots of your (or your subject's) identity through narrating one\nexperience such as:\n*a particularly meaningful incident or event;\n*a specific symbolic moment within a close family or personal relationship;\n*a meaningful artifact (photograph, family heirloom, sentimental object or keepsake). If\nyou choose a photograph, you may want to append a copy to your exercise.\n*a special or \"sacred\" place or meaningful journey.\nBe vivid, detailed and descriptive in your prose; use dialogue when appropriate.\nTry to recapture the power of lived experience in the language that you use in\nportraying yourself (or other characters) or depicting a setting. For most writers,\nthis means slowing down your narration so that the reader can vicariously\nexperience the emotion of the piece.\nPOSTSCRIPT (a few sentences): How might this piece be interesting for a wider public\nreadership or a specific smaller audience (e.g., the MIT community)? How might you\nshape this piece so that it speaks effectively to your chosen readership? What larger\nhuman issues does your experience raise? How can you connect this experience with a\ncentral idea or perspective?\nNote: In this type of writing, it's often best to allow ideas and perspectives (what we\nmight call \"argument\" in expository writing) to emerge from the experience, rather than\nfitting an experience to meet the demands of a preconceived idea."
    },
    {
      "category": "Resource",
      "title": "essay2_prop_rev.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-731-1-writing-and-experience-exploring-self-in-society-spring-2004/3ffcf0a2f3315b5c809a45e8224472d4_essay2_prop_rev.pdf",
      "content": "21W.731\nSPRING 2004\nQuestions for Proposal/Intro Review:\nStudent_________________\nReviewer________________\nEssay 2 asks student writers to \"explore an issue through the lens of a past or current\nexperience(s).\" The experience can be yours, or someone else's. As you review one\nanother's proposals for these essays, consider the following questions:\n1. In what ways has the writer begun to define the relationship between a life\nexperience and a social or psychological issue? Does this connection between\nexperience and theme make sense to you as a reader?\n2. Does this piece sound like it will be interesting for a wider audience (or a\nnarrower audience)? How well does the introductory paragraph begin to engage\nthe reader?\n3. What advice do you have for the writer ? (Advice may be how to \"frame\" the\npiece, secondary sources, choice of narrative style, etc.) What challenges will the\nwriter need to confront in this essay?"
    },
    {
      "category": "Resource",
      "title": "essay2_wkshp.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-731-1-writing-and-experience-exploring-self-in-society-spring-2004/54e63e38ee43d8c3c8bb31f641a3b24b_essay2_wkshp.pdf",
      "content": "Writing Workshop: First Version, Essay #2 21W.731\nSpring 2004\nWorkshop Letters Due: Tues. 3/16. Essays should be emailed to small group workshop members\n(see handout) on Friday 3/12 as Word attachments. Do not mail the cover letter that you send to the\ninstructor.\nYour assignment for this workshop is to review each essay carefully and critically. Responding to the\nquestions below, type a 1- 1 1⁄2 page letter to each writer. (Bring two copies of each letter to class, one for\nthe instructor and one for the writer.) You should also make marginal comments on the essay, in addition\nto the letter. This reviewing assignment should take about 2-2 1/2 hours.\nYour letters should let your fellow students know two or three specific strong points in their essays, and\ntwo or three specific things that you think need work or that you have questions about. We are primarily\nfocusing here on the essay as a whole and how it might be strengthened, rather than more minor problems\nof \"polishing\" (e.g., grammar, punctuation, etc.).\nHere are some questions for you to consider:\n1. Do the title and introduction engage you as a reader and establish a context for the essay? Do the\nwriter's form of narration (first person, third person) and voice (e.g.humorous, angry, sad) seem\nappropriate to the topic? Are there alternate forms of narration (e.g. diary/journal or letter format) that might\nbe more effective?\n2.How well does the essay vividly present and reflect upon an experience (that of the author and/or\nsomeone else)? Comment on the author's use of the tools of fiction: time, setting, character and dialogue\n(when appropriate). Are there any aspects of the experience that seem unclear or undeveloped? Does the\npiece need more \"backstory\"?\n3.Does the essay (a) connect this experience with a broader psychological or social issue (b) offer a clear\nperspective on the experience presented? Are there any secondary sources (or types of sources) that you\nmight suggest? If writer has already integrated outside sources, comment on the ways in which the student\nuses these source(s) in the essay: Does the connection between the source(s) and the\nexperience/argument seem clear? Are excerpt quotations well-selected and appropriate in length? (As a\ngeneral rule, it's best to avoid long block quotes in short experiential essays.)\n4.Is the essay clearly organized so that you can follow the movement of thought? Are there any sections,\nparagraphs or sentences that would work better if reordered? Does the writer transition effectively within\nand between paragraphs and sections?\n5. How effective is the conclusion in (a) dynamically closing the piece and/or (b) opening up reflection to\nbroader issues?\n6.Are there any ways in which the author might strengthen the essay on the paragraph or sentence level?\nMark any grammatical errors (or potential errors) that you notice.\nP.S. It may be helpful to have a copy of the Essay #2 assignment sheet (or \"prompt\") as you review these\npieces."
    },
    {
      "category": "Resource",
      "title": "essay2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-731-1-writing-and-experience-exploring-self-in-society-spring-2004/a96f1132fe75b0302f1d444d86a52175_essay2.pdf",
      "content": "21W.731\nWRITING AND EXPERIENCE\nA. Walsh\nSPRING 2004\nESSAY #2 SEQUENCE\nEssay #2: Suggested length: 6 pg., double-spaced. Please submit two copies with cover letter to\nme reflecting on the strengths and weaknesses of the piece.\nWith revision, please include the marked-up draft (with my comments).\nDue Date: First Version: Fri. 3/12:Email as Word attachment or drop at my office.\nEmail to small group workshop members.\nWorkshop: Tues., 3/16\nRevision: Fri. 4/2 at my office. Include cover letter, two copies, marked-up draft and\ncomments.\nINTRODUCTION: Writers often use their (and others') experiences to reflect on a broad range\nof social and psychological issues relevant to a wider readership. This essay builds upon and\nextends the skills of Essay #1.\nASSIGNMENT: Explore an issue (psychological, social, ethical) through the lens of a past or\ncurrent experience(s). The individual experience can be yours or that of someone else. As you\nnarrate that experience to your readers, think carefully about your voice as a writer and the ways\nin which writing voice helps to establish your perspective for readers. In crafting the essay, pay\ncareful attention to your narrative strategies:\n- choices in narration (varieties of first person, third person, mixed narration);\n- setting(s) as establishing a context for your essay;\n-developing character and using dialogue;\n-(if relevant) working within multiple time frames;\n-using figurative language (metaphor, simile) when appropriate;\n- providing a clear sense of the larger meaning of your piece while avoiding didacticism.\nIn this assignment, you should use at least two secondary sources in the revised version. As\na writer, you can integrate these sources in one or both of these ways:\n(a) as support or clarification of your point of view\n(b) as counterargument to your perspective.\nBe sure to cite your sources (use MLA form) and include a bibliography.\nYour revision cover letter should explain how you chose these sources and how they influenced\nyour thinking.\nIf you relate to other sources (from the course or your own reading) as \"deep background\"\ninforming your writing style, approach or perspective, note in your cover letter (first version\nand/or revision) which readings influenced either your thinking about this topic or your style as a\nwriter."
    }
  ]
}