{
  "course_name": "Writing Science Fiction",
  "course_description": "This class will focus on the craft of writing genre science fiction. Students write and read science fiction and analyze and discuss stories written for the class. For the first eight weeks, readings in contemporary science fiction accompany lectures and formal writing assignments intended to illuminate various aspects of writing craft as well as the particular problems of writing science fiction. The rest of the term is given to roundtable workshops on student’s stories.",
  "topics": [
    "Humanities",
    "Literature",
    "Creative Writing",
    "Fiction",
    "Humanities",
    "Literature",
    "Creative Writing",
    "Fiction"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures / Workshops: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nNone\n\nDescription\n\nThis class will focus on the craft of writing genre science fiction. We will examine what makes speculative fiction different and how to construct stories and longer works that fit the requirements of the genre. We will read stories from early to contemporary science fiction in many subgenres to explore the flexibility and mutability of the field, as well as analyze how various great authors have handled central issues in the genre.\n\nWhile this class will focus on \"hard\" science fiction, other forms of speculative fiction, including fantasy, will be supported if there is interest. Further, while the readings are primarily short stories, we will address long fiction in discussion. Students are encouraged to write at whatever length and in whatever subgenre of speculative fiction interests them most.\n\nSchedule and Readings\n\nDuring the first seven weeks of the class, we will discuss techniques directly related to the assigned stories. All stories are to be read by the Tuesday of that week. Exercises during the week will focus on the particular element of style that we have discussed.\n\nThe second seven weeks of the class will be devoted to workshops of original student stories. Using the vocabulary of technique, every student will participate in workshops leading to polished, finished fiction.\n\nFor a detailed look at the schedule and readings, see the\nCalendar\nand\nReadings\nsections.\n\nGenre\n\nOur reading will be science fiction short stories. While you are encouraged to write longer fiction or fantasy if that is your preference, I have chosen to use short fiction so that we can cover a larger range of the styles and subgenres in the field. Please do not feel constrained by the readings. You are entirely welcome to work on long fiction / fantasy and I will discuss this in class.\n\nTextbooks\n\nEvans, Arthur B., Istvan Csicsery-Ronay Jr., et al.\nThe Wesleyan Anthology of Science Fiction\n. Wesleyan University Press, 2010. ISBN: 9780819569554. [Preview with\nGoogle Books\n]\n\nSilverberg, Robert.\nThe Science Fiction Hall of Fame, Volume One 1929-1964: The Greatest Science Fiction Stories of All Time Chosen by the Members of the Science Fiction Writers of America\n. Vol. 1. Tor Books, 2003. ISBN: 9780765305367. [Preview with\nGoogle Books\n]\n\nAssignments\n\nThere are four types of assignments required in this class. Reading the stories and articles as assigned and participating in discussion of these works is the center of our exploration. Close reading and thoughtful reaction are crucial to developing a sophisticated sense of how various writers have addressed issues, and should inform participants' original work. Even if you have read the assigned stories in a different context, read them again with a view towards technique and elements of style.\n\nThe second type of assignment will be a series of exercises in the techniques we will discuss in class. These exercises are designed to give students an opportunity to focus on different elements of fiction and to practice in those particular areas out of context. Included in this type of assignment will be not only writing exercises, but world building as well.\n\nStudents will be required to prepare critiques for workshop, which will include thoughtful prepared notes on each piece presented.\n\nFinally, every student will write two pieces. These may be short stories or chapters in a longer work. If a student chooses to write long fiction, a short summary of the rest of the story should be appended to the final revised version of the second piece. Each major piece will be submitted to workshop and rewritten. Every student will be required to finish two pieces of fiction at the end of the class.\n\nYou will need to bring an exercise journal specifically for this class. We will be doing exercises in class on a regular basis, especially in the beginning of the term, so always bring your journal and a pen / pencil with you. You will be expected to keep your journal (using various writing exercises and approaches) during the entire term.\n\nOriginality\n\nAll work in this class will be produced for this class. Do not use earlier work, or submit a story for this class that you are also submitting in another Writing class. An idea or character from earlier work that you want to explore in a different context is acceptable, but please talk to me about it.\n\nGrading\n\nI use what is called \"contract grading,\" which means that you and I agree on the following contract.\n\nYou will be guaranteed to receive at least a B in this class if you do the following:\n\nAttend class regularly.\n\nDo all assignments and exercises seriously, with the full weight of your consideration, and on time.\n\nCome to class prepared.\n\nParticipate actively in the workshop process, giving full and thoughtful responses to your classmates' work.\n\nThe requirements to receive an A are harder to quantify, but they include more sophistication and grace in the writing, lively storytelling, and prose that approaches publishable quality.\n\nAttendance\n\nWriting cannot be learned from reading a book. Attendance and participation in class are essential to making progress as a writer.\n\nDepartment policy states that more than five absences will result in a failing grade. More than three absences may adversely affect your overall grade in this class.\n\nMissing a workshop is serious and you must still turn in all critiques to your workshop via email if you do not attend. Not attending your own workshop date, or not having material available to critique for a scheduled workshop will result in a full drop in grade.\n\nIf you arrive more than ten minutes late to class, that will count as an absence.\n\nDeadlines\n\nAssignments must be handed in on the day due. Since stories will be part of the workshop process, handing in a story late will inconvenience your classmates and give them less time to prepare a thoughtful and useful workshop response.\n\nAny final assignment handed in late without an extension, or after the due date of the extension, will cause a full drop in grade. No exceptions.\n\nTurn in a hard copy of all work to me. For workshop purposes, everyone will upload their work, exercises or critiques, onto the course website so that the entire class may have easy access. All work must be uploaded by 9 PM the night before the workshop is due, in order to give all class members time to read and prepare a thoughtful and useful critique.\n\nLaptop Policy\n\nLaptop computers will not be open during class with the following exceptions: During Workshop to refer to stories online or notes, during writing exercises if you prefer to use a keyboard, and on the last day of class for evaluations. Likewise, please remember to silence cell phones before class.\n\nPlagiarism\n\nUsing someone else's language and / or ideas without proper attribution is academically dishonest. As members of this class and the larger scholarly community you are expected to abide by the norms of academic honesty. While a good deal of collaboration is encouraged in and out of class, failing to acknowledge sources or willfully misrepresenting the work of others as your own will not be tolerated. Everything you submit must be your own work, written specifically for this class. Plagiarism can result in withdrawal from the course with a grade of F, suspension, or expulsion from the Institute.\n\nThe booklet\nAcademic Integrity at the Massachusetts Institute of Technology: A Handbook for Students\nexplains these issues in detail, and you are responsible for understanding its contents. We will work on citing sources in class and discuss ways to acknowledge them properly. You are also welcome to consult the Writing Center's online advice on \"\nAvoiding Plagiarism\n.\"\n\nPlease remember that while the internet makes plagiarism easier, it also makes it easier to catch. It is better to hand in poor work than stolen / copied work.",
  "files": [
    {
      "category": "Resource",
      "title": "A Journey to the Edge of the World",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-759-writing-science-fiction-spring-2016/4f31e67c526bc932e449be1f97ebfec0_MIT21W_759S16_AJourney.pdf",
      "content": "A MIT Student/Journey/1\n3100 words\nmanuscript disposable\nA Journey to the Edge of the World\nIt rained the evening before Shiro went to the edge of the world. It was a light rain, cool and\nsoothing, glimmering with the swiftly fading light of day, and Shiro and his parents rushed to get the\nlast of the harvest under cover: most went into the musty, creaky, but surprisingly still-solid\nstorehouse, and the rest was assembled in wicker baskets on the porch, to be eased down rickety\nwooden steps, with the aid of a lamp, into the cellar afterwards. They had begun as soon as the first\ndrops fell, but it was pitch black, lit only by the lantern dangling outside the front door, by the time\nthat aching legs and arms and backs finally carried them onto the porch for the final time and into\nthe house. Dinner was waiting there, hanging over the firepit in the cast iron pot that it had been\nsimmering in all day, having been tended to diligently by Shiro's grandmother all evening. They all\ngathered around the low table in the common room, sat down on the cushions surrounding it, and\nfell upon the noodles, broth, and mixed vegetables in their bowls ravenously. None of them spoke,\npreoccupied as they were with filling empty stomachs and resting weary limbs. After eating his fill\nShiro retreated down the only hallway to his bed, a simple padded mat, separated from the house,\nlike the rest of the rooms, by slatted bamboo screens. He lay there, eyes closed, listening to the\npitter-patter of the rain on the rooftop and waiting for sleep to take him.\nAn MIT Student\n\nA MIT Student/Journey/2\n***\n\"Hey sweet pea,\" said a whisper as his door, another screen, slid open a crack. His mother\nwas doing her nightly rounds before bed. \"You still awake?\"\nShiro rubbed his tired eyes and mumbled his assent, easing up to a sitting position.\n\"Yeah. I suppose.\"\nShe eased the rest of the screen open and moved quietly into his room, her face dimly lit by\nthe flickering lamp she held in one hand, and sat down at the foot of his mat.\n\"I just wanted to check in before tomorrow. You still planning on taking that trip in the\nmorning?\"\n\"Yeah, if that's alright?\" He hoped there hadn't been a small disaster since he'd retired to\nbed. The storehouse could've sprung another leak, she might've found a den of mice in the cellar\nagain, and he'd be stuck at home again at the end of harvest dealing with the latest in a never-ending\ncycle of domestic disasters.\n\"It should be. I imagine your father and I can still manage a day or two without you. These\nbones aren't that old yet.\"\n\"Really?\" Shiro was genuinely surprised. It had been two years since he'd last been allowed a\nwhole few days to himself and before that he had been too young to stay out overnight on his own.\nOn a few occasions he'd managed to convince his father, and once even his mother, to take him out\nexploring the forested hills that surrounded their farm, but those excursions were rare as well.\n\"So long as you've finished up your work for school. It starts up again right after you'll be\ngetting back, remember, and I don't want you wandering around for the rest of your break ignoring\nyour schooling.\"\n\nA MIT Student/Journey/3\nShiro groaned. \"Why do I need so much of an education if I'm just gonna be a farmer like\nyou and dad? Farming's all there is here ...\" he muttered quietly, half-hoping his mother wouldn't\nhear. She did.\n\"We've been over this before, Shiro,\" she said in the weary tones of someone tired of\njustifying something obvious.\n\"Yes mom.\" He acquiesced more gracefully and quickly than he'd expected to. The news\nthat'd he'd be allowed go out alone for a couple of days had definitely helped. \"I've almost finished\nall of it. I'll bring the last book with me and read it by the fire tomorrow night.\"\nShe thought about it for a couple of seconds, and then nodded her assent. \"All right. Be\ncareful out there.\"\nA small smile crept onto Shiro's face. \"Will do. Love you mom.\"\n\"Love you too.\"\nAs she left, easing the bamboo screen closed behind her, Shiro lay back down and wrapped\nthe single blanket around himself as cool air trickled through the slats in the screens into his room.\nThe rain had ceased during his mother's visit, and all he could hear was the crickets chirping softly as\nhe drifted into sleep.\n***\nThe next morning Shiro awoke slowly, savoring the knowledge that the day was his. After\naround half an hour of slipping in and out of pleasant dreams, he stirred, dressed himself in his\noutdoors clothes, still a little damp from the night before, and wandered toward the common room,\nwhere he found his grandmother grinding some of last year's harvest into rice flour. His parents\n\nA MIT Student/Journey/4\nwere already awake and working, judging by the empty pegs near the door on which their hats\nnormally hung.\n\"Good morning little one,\" his grandmother ventured with a smile.\n\"I've been taller than you for a while now, Grandma,\" he quipped.\n\"That doesn't mean you're not still little,\" she said, pleased with herself. \"Your breakfast's\ngone cold dear; it's over on the table\"\nShiro shook his head with a wry grin. \"Thanks Grandma.\"\nHe ate quickly, placing his bowl and chopsticks gently in the bucket, half-full of water, in the\ncorner where the day's dirty dishes soaked, when he was through, and walked over to his own peg\nnear the door, where he put on the hat and jacket that were hanging there.\n\"See you in a couple days Grandma,\" he called from the doorway.\n\"Don't get into too much trouble out there little one,\" she called back.\n\"I'll try not to.\"\nHe chuckled a little to himself as he pulled on the rucksack that'd been lying optimistically\nnear the door for the past week, ever since he'd packed it with a sleeping bag, heavy cloth sheet, flint\nand steel, enough food to last a week -- just in case, and a waterskin that he could refill in the stream\nalong the way.\n\"Trouble? Me? Never ...\" he whispered to himself and strode out the door, down the path\nto the stream that marked the end of the farm, and towards the edge of the world.\n***\nThe air was crisp and cool, and all around Shiro autumn was in full bloom. The path was\nsprinkled with the first fallen leaves from the trees surrounding him. Their remaining foliage was a\n\nA MIT Student/Journey/5\nriot of color: green brightening into yellow, then orange, and eventually joining a sea of red with\npastels scattered rarely throughout. The walk down to the stream was quiet, save scattered moments\nof birdsong and the consistent crunch of leaves underfoot as he made his way past the terraced\ngreen slopes of his parents', and he supposed his, farm down towards the stream. He'd only been to\nthe edge of the world, this edge of the world rather -- there were others, though this one was by far\nthe closest, once before, when his father, after much beseeching, had finally agreed to take Shiro to\nsee it. That was almost seven years ago now, but he still remembered the way.\n\"We'll follow the way the stream flows,\" his father had said.\n\"And then?\"\n\"That's all there is. Our little stream eventually becomes a river, and that river flows right off\nthe edge of the world.\"\nAnd so it did. Shiro followed the path the stream took, hopping across stones from bank to\nbank if the path got rocky, smiling at the occasional fish he saw venturing out from still pools\nalongside the stream into the current, only to find it too much for their fins and retreat back to\nsafety. Soon, the stream swelled into a river and the horizon began to grow before his eyes. It was\nmidday now, and the sky was bigger than he'd ever seen it before, even wider than he'd remembered\nfrom last time. He was getting close.\nHe stopped briefly to refill his waterskin and to eat a couple of wild apples that he'd grabbed\nalong the way, but otherwise made good time and by late afternoon Shiro exited the forest to find a\nsmall clearing next to the falls at the edge of the world. Here, the river rushed all the way off the\nedge, falling noiselessly into an unexplored darkness. Shiro supposed that the water must go\nsomewhere, but he wasn't about to attempt to figure out where. He'd heard stories about people\n\nA MIT Student/Journey/6\nwho'd tried, who'd tied ropes to the rocky outcroppings near the edge and went down into the black\narmed with lanterns, who'd come back disappointed and shivering with nothing to show for their\njourney but tales of a cold, endless void studded with stars like the night sky. He simply put down\nhis pack and started assembling a rudimentary shelter: sturdy branches formed a frame, to which he\ntied the thick cloth sheet he'd brought; dry twigs and flimsier tinder went into a pile that he'd set\nalight after darkness fell completely. One cozy-looking tent later Shiro let out a satisfied sigh and\nlooked up at the sky, where stars were already beginning to wink into visibility in anticipation of the\nnight to come. Eventually he wandered towards the edge and sat on the most comfortable looking\noutcropping he could find, and gazed happily out into the horizon.\n***\n\"Beautiful, aren't they?\"\nShiro scrambled up from the edge of the world at the unexpected greeting, and turned to see\nan unfamiliar girl behind him. She looked his age, or perhaps a little younger, but that was where the\nsimilarities ended. Her skin was impossibly pale, her hair, braided in an unfamiliar style around her\nhead, shone near golden in the dying sunlight, and her eyes were brighter than any he'd ever seen,\nthe color of cloudless sky. She was wearing what looked like a sheet draped somewhat awkwardly\nover a tunic. The whole ensemble looked too clean to be real, a starker white than he'd thought\npossible. Shiro realized that he was staring and attempted a response.\n\"What ... sorry, who are you?\" he managed to stammer.\n\"I'm simply a fellow stargazer,\" she said opaquely, and motioned toward the cluster of rocks\nwhere, until just now, he'd been semi-comfortably sitting. \"Do you mind if I join you for a little\nwhile?\"\n\nA MIT Student/Journey/7\nShiro couldn't think of any reason why not. \"Sure.\"\nThey sat in silence there with their legs hanging off the edge of the world, as the sun\nretreated beyond the mountains to their backs, casting the landscape a tranquil purple-grey, and the\nair grew cold and still. It was night by the time Shiro spoke again.\n\"You're not from around here, are you?\"\nShe smiled slightly at the corners of her mouth and eyes. \"No, I'm not.\"\n\"Then where are you from? If you don't mind my asking.\"\nHe turned toward the strange girl, who met his gaze briefly before tilting her head back\ntoward the sky, seeming lost in thought. Eventually, she looked back at him again.\n\"I was born on a world called Earth, a million stars and more besides from here. Look over\nthere, to your left.\" She pointed toward what looked like a giant cloud of dust in the night sky,\nstudded, especially in the middle, with stars. \"Earth's star, Sol, still shines about right there, out on\nthe edge of the Orion Arm.\"\n\"Earth's star still shines ... wait, what about Earth? Did something happen to it?\"\nAgain the stranger paused, looking pensively off into the distance. Her silence lasted near a\nminute, long enough that Shiro was about to interject to tell her that if she didn't want to talk about\nit she didn't have to, but just as he was about to say something she nodded her head slightly, as if in\nagreement, and spoke.\n\"There was a war. There were many before it, but this was the last. By the end Earth's\nsurface had been reduced to cinders, glass, and ash and then, during the final days of the conflict, it\nwas broken. For good.\"\n\"Broken?\"\n\nA MIT Student/Journey/8\n\"Yes.\" She bit her lip and a shadow seemed to cross her face. \"My home was sundered,\nshattered, smashed, if you like. It lives on only in human memory now.\"\n\"Human memory? Are you saying that you're human?\" Shiro was incredulous and it showed.\n\"You sound like you've seen more years than my grandma, but you don't look any older than I do.\nYou can't be human! People get old. People die ...\" he trailed off bitterly.\n\"They used to.\" She pursed her lips a little and furrowed her brow. \"Not anymore. Tell me\nShiro; what do you know about the human condition? How do you know what war is if in the entire\nhistory of your world there's never been one? Could there be more to being human out there,\ndifferent ways to be human?\"\nHe stopped short, anger and frustration collapsing into confusion. \"I ... don't know. So\nthere are more out there then?\"\n\"There are more humans, many more, in the world beyond than there are stars in the sky.\nMost of them would look even stranger to you than I do. There are even some people in the wider\nworld,\" She smiled conspiratorially at him, as though he'd been let in on a secret that he couldn't\nquite comprehend yet, \"who aren't even human at all.\"\n\"Why don't I know about any of them, if they've existed all this time?\" Shiro said, his\nconfusion growing steadily. \"Do my parents know? Why wouldn't they tell me if they did? If they\ndon't, why wouldn't people here know about the others?\"\n\"Your parents do not know, Shiro, though they did once, long ago. The only people who\nknow the truth, that there are many other worlds besides this little one, are sitting right here, legs\ndangling off the edge of it. War haunts its survivors, Shiro, and there have been so many wars. This\nworld, your world is a place of healing, of tranquility and simplicity where people come to forget\n\nA MIT Student/Journey/9\ntheir memories for a while and rebuild themselves. They live and die and are reborn until the shards\nof their personalities that they left behind determine that they're finally whole again, ready to go\nback into the world beyond. Sometimes, however, someone is ready to leave but there isn't anyone\nnew to replace them and, on those rare occasions, someone completely new is born: someone like\nyou. Everyone else chose to be here long ago, but this is your first world and you never got to make\nthat choice. Now you do.\"\nShe finished speaking and sat very still, there on the edge, waiting patiently for him to make\nup his mind.\n\"What does choosing mean? Can I ever come back?\" A little worry crept into Shiro's voice\nat the thought of leaving forever.\n\"No. If you leave you cannot come back as Shiro. Someone else perhaps. But not yourself.\nAnd you wouldn't be allowed to remember the world beyond.\" She frowned slightly, and then lay\nback onto the grass behind them, pushing herself up entirely onto solid ground. He joined her,\nwordlessly. They lay there gazing up into the star-studded darkness for a while before she broke the\nsilence again.\n\"What are you so worried about?\" she asked.\n\"My family,\" he said finally. \"I don't want to leave them.\" He thought of his mother, and\nfather, and grandmother, and of all of his memories of them from his short life and wept a little\nthere, face pressed into the cold hard ground at the edge of the world.\nShe waited for him to finish, and when he was done wiping his eyes she helped him up and\nled him to the pile of long-ignored kindling.\n\"I'm getting a little cold,\" she said pointing at the fire-to-be. \"Would you mind?\"\n\nA MIT Student/Journey/10\n\"Of course.\"\nAfter the fire caught they sat next to each other for a while, once again without words as he\nturned the offer over and over in his head, as she stared into the heart of the fire. She must have\nbeen deep in thought as well, though about what he couldn't guess.\nShe took his hand then and whispered something, so softly that he almost couldn't hear. \"I\nhad to make this choice once too. Well, not this one exactly, but one very, very similar. I ... never\nsaw them again.\" A single tear ran down her face, followed slowly by another, and then, faster this\ntime, yet another. Shiro supposed that he should hug her then, and he did and she didn't object.\nAfter wiping her eyes a little later, she continued. \"When I was very very young, younger\neven than you if you can believe it, people came to me at school and promised me the world if I\nwent with them. And I got it, though that's a story for another time. But I still miss my mom and\ndad, even now, all these years later. I used to watch the stars like this with my dad when I was really\nlittle. He would point out Orion and his belt, Perseus and the Pegasus, which was his steed, the\ntwins: Castor and Pollux ...\" Her voice tailed off as she recognized the confusion on Shiro's face.\n\"Sorry, wrong mythology and night sky and all that. Anyway, what I'm trying to say is that I\nunderstand.\"\nHe nodded and then stared at the now dying embers of the fire and asked, \"Was it worth\nit?\"\n\"Yeah. It was. If it means anything.\"\n\"Alright. Thanks.\"\n\nA MIT Student/Journey/11\nShiro stacked a little more kindling onto the fire's corpse, stoked it up once more, and they\nwatched together as the updraft from the flames tossed flecks of red-hot ash into the night sky until,\nonce again, all that remained were embers.\n***\nShiro came back from the edge of the world changed, though quite how his family could\nnever put their finger on. They chalked it up to him getting a little older, and sure enough the slim\nboy of sixteen grew into a man before their very eyes. He ended up marrying a nice girl from the\nnearby village, and before even Shiro could quite catch up with what was happening he was\nmiddle-aged, the father of twins, a boy and a girl. His grandmother passed away soon after the twins'\nbirth, happy to have held her great-grandchildren before she died. Shiro's parents followed not long\nafter, and before he knew it he was holding grandchildren of his own. Finally, at the ripe old age of\nseventy-six, his wife passed away as well, and Shiro packed his bags and left the old farmhouse in the\ncapable hands of his daughter and her husband. He told them, simply, that he was going on a\njourney.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.759 Writing Science Fiction\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Dark Was the Night, Cold Was the Ground",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-759-writing-science-fiction-spring-2016/58444cb70702173c293d48d75c7844db_MIT21W_759S16_DarkNight.pdf",
      "content": "Isenhart // Dark Was the Night // 1\n2900 words\nmanuscript disposable\nDark Was the Night, Cold Was the Ground\n\nThe sun was getting low in the sky, and the shadows cast by the forest grew long and\nlanguid. A cool breeze played across the banks of the lake, just enough to make my skin pimple\ngently. I stretched my legs up into the air, bringing them down to either side of me while\nsimultaneously issuing a loud and satisfying yawn. Splayed out in the grass, the unkempt blades\ntickling the backs of my hands, I watched Thule and Yyun rise behind the silhouette of the city\nof Loren on the far side of the water. I picked up my radsaan and tuned the strings, and settled\nthe body of the small instrument between my shoulder and chin. The neck of it pointed up\ntowards the sky, held gently in my left hand. I took a deep breath, and began to whistle the\nopening lines of Thule and Her Daughter:\nSing to us Thule, sing us soft as the meadow\nSing us your sorrows, rah ta tehm, ta rah lae\nSing us of Yyun, of a mother's last longing\nSing us of she torn away, ta rah lae\n\"Yhastyeh! Yhaaaast!\"\nJake Isenhart\n\nIsenhart // Dark Was the Night // 2\nI stopped my fingers rapid vibration, and the resonant voice of my radsaan slowly died.\n\"Oi, Miinyeh! Over here.\" I put down the instrument and got to my feet, waving my arms\noverhead.\nMiin saw me and gave a high trill of recognition, its slow vibrato twisting and echoing\nover the lake. Her pale orange skin blended with the dusky light, and I smiled as she ran to meet\nme. With a fluid and flawless cartwheel, she came lightly to rest an impressively short distance\nfrom my face.\nI stooped low and gave a falling whistle of polite deference.\n\"M'lord.\"\n\"Greetings, o my vassal,\" she answered, with regal import.\nWe both laughed and fell over in the grass. Looking up at the darkening sky, we could\nsee just make out the earliest stars on the horizon. We touched the fingers of our right hands in\nthe greeting of familiars, the tiny magnetic fields pulling our fingertips together.\n\"Impressive gymnastics,\" I said. \"Showoff,\" I added.\n\"Why, thank you,\" Miin responded, her voice brimming with mock humility. \"Your\nraadsan is coming along beautifully, Yhast.\" She gave a soft whistle which dipped lightly in the\nmiddle, indicating sincerity. Pride welled in my chest, although I did my best to tamp it down\nit would be a long time before I was anywhere as good as my mother. My intonation was still\napproximate, and I lacked the coordination to sing without adversely affecting my playing. Still,\nI returned a short trill of humble thanks.\n\nIsenhart // Dark Was the Night // 3\nMiin rolled onto her stomach, her head propped up in her hands. \"Yeh'Mej is looking for\nyou, Yhast. You were supposed to be back to the caravan a full quintile ago. She got fed up\nenough to send me, so you should probably not keep her waiting any longer.\"\n\"Thule! I'm so completely pooched.\"\nMiin laughed at me. \"You've been spending too much time with the d'saar. You're\nstarting to sound like him.\"\n\"Mej says he's still full of stories. She says it's our duty to prevent them being lost.\"\nMiin gave a flat tone of agreement. The sun was almost below the tops of great ferns that\nmade up the oldgrowth forest, and our travelling circus was on the far side of it. It wouldn't take\nmore than a half quintile to walk it, but it was growing dark quickly. I briefly registered that the\nlate evening glow made Miin look even more painfully attractive than usual. I did my best to\nstop noticing her lithe form. I did poorly.\nI was snapped from my reverie by her, waving a hand in my face.\n\"Yhast? Are you even listening to me? We have to goooooo.\"\n\"Yeah, sorry, I heard you. Back before dark, and all that. We've got a show tonight, after\nall.\" I gave one last look across the lake, and realized with a pang that it would likely be a\nrotation or more before I saw it again. I turned and followed Miin into the forest.\n***\nWhen we arrived, the camp was a familiar bustle of activity. Yeh'Nihm was doing the\nmakeup of several performers at once, flitting between several faces, applying powders and\npaints at a dizzying pace. Performers hurried between tents in various states of undress between\nlavishly festooned and seminude. With a quick meeting of fingertips, I bid farewell to Miin, as\n\nIsenhart // Dark Was the Night // 4\nshe and I both had preparations to do. She did a backwards cartwheel onto her hands and walked\naway from me, upside down. \"Showoff!\" I called after her, and she whistled amusement back to\nme.\nOn my way back to my tent, I ran my lines over in my head: Hail, mortal! and Ready and\nPeaseblossom. Easy enough. I shook my head. It was certainly a strange play. The d'saar had\nrecounted it to the troupe as best as he could although he had a remarkable memory, it was\npossible there had been losses along the way. He had taken great lengths to seek out the troupe\nhow could he not? The Yir'Saan were spoken of with renown the world over. Beyond the world,\neven. Last rotation, we had been invited to the Moot of Planets, where we had performed the\ngreat Yeh'MarahNim's timeless Maid of Traleh, in support of the refugees of Jayn. Perhaps the\nd'saar had heard of us then? Regardless of how, he had found us, and he brought with him the\nonly currency the Yir'Saan truly valued: stories and songs.\nAt the entrance of my tent, I found Orae waiting for me. I met his pastel blue fingers in\ngreeting, when I noticed the smirk on his face and the hand hidden behind his back.\n\"Orayeh, please, no. Don't tell me \"\nHe trilled insincere apology to me, and extracted the exact costume piece I had dreaded\nfrom behind his back.\n\"Sorry, Yhasteh. Yeh'Amen is fallen ill, and the d'saar said you'd been studying\neveryone's lines.\"\nOrae handed me the headpiece it was deadeyed and hairy, with a mouth full of\nhorrifying teeth. It looked like a tahb, but about a thousand times uglier. The d'saar called it an\n\"ass.\" He laughed whenever he said it.\n\nIsenhart // Dark Was the Night // 5\nI pushed past Orae without saying goodbye, whistling irritation to myself. I wasn't ready\nfor this part, I thought. You're going to make an ass of yourself, is what the d'saar would say.\nAnd then he would laugh, like a great set of bellows. The old fool. Like you're so smart. He\ncould barely whistle.\nTrying his best not to panic over the change of plans, I went through the motions to get\ndressed for the performance. I quietly hummed comfort to myself.\n\"I see you are nearly ready. That is good.\"\nI turned quickly to see my mother standing in the tent. I stooped low, trilling deference.\n\"Yah'Mej. Please excuse my tardiness.\"\nShe laughed gently.\n\"'Mother' will do just fine, Yhast. It is only us after all. How are you feeling? You will\nbe needed onstage soon. Many of the highest dignitaries of Loren will be here tonight I don't\nexpect you'll be keeping them waiting? If so, I'll be sure to tell Orae; I hear he's been practicing\nhis jokes. Although, I wouldn't think it prudent to assume he's improved at all.\" She whistled\nhumor with a pair of quick rising tones.\nAs the leader of the Yir'Saan, my mother had a way of setting performers at ease. She\npicked up my radsaan from the chair where I had left it, and began to make it sing with\notherworldly beauty. Effortlessly, she filled my unkempt performer's tent with music to bring\ntears to the eyes of every soul in Loren.\nAfter executing a particularly tricky phrase with characteristic deftness, she handed me\nthe radsaan.\n\"Repeat that back to me,\" she said with a wry smile. She hummed confidence.\n\nIsenhart // Dark Was the Night // 6\nI took a deep breath, shouldered the instrument, and attempted to follow my mother's\nwild runs. The melody soared high, then doubled back on itself, turning from triumphant to\nmournful in the space of a moment. Then it rose again, doubled in fury, before landing nimbly in\na tender resolution.\n\"Good! You are getting better. Do not forget to breathe, my little dahnyeh. If you could\nfollow the madness I concocted for you just now, you can follow the words of an old man for an\nevening.\" She chirruped encouragement, and touched my forehead gently. With a smile, she\nturned and left the tent.\n***\nI finished putting on my costume, which, in truth, consisted of putting on a pair of rough\nsandals and a deep red sash in addition to the plain white robe I was already wearing. I hurried\nout to find Yeh'Nihm, who frantically made up my face whilst humming a threatening\ndispleasure at my lateness. He shooed me off in record time.\nBackstage was a portrait of pure chaos. Performers with gossamer wings fervently\npracticed their lines, while others stood in small circles, their hands in the center, whispering\nwords of support. I peeked through the curtain to see a packed amphitheatre many had\ntravelled from the city to see the famed Yin'Saad perform a longlost play from amongst the\nstars.\nDucking back behind the curtain, I caught a glimpse of Miin from across the stage. She\nwould play the part of a trickster; I, the tricked. We exchanged a trill of excitement, and then\nwere silenced by the players around us. It was time to begin.\n\nIsenhart // Dark Was the Night // 7\n***\n\"And, as I am an honest Puck,\nIf we have unearned luck\nNow to 'scape the serpent's tongue,\nWe will make amends ere long;\nElse the Puck a liar call;\nSo, good night unto you all.\nGive me your hands, if we be friends,\nAnd Robin shall restore amends.\"\n***\nThe crowd loved it. They'll be talking about tonight until next year, my mother had said\nwith approval. I had to agree. I sought out Miin to congratulate her, and found her on the\noutskirts of the tent circle, speaking to the d'saar. From a distance, the old man spotted me, and\nwaved me over.\n\"Yeh'Yaste! Or are you going by Nick Bottom these days? Tremendous performance, my\nboy, just tremendous. You've done your mother quite proud, you know.\" He whistled what\nsounded like pride, but a careless listener could have mistaken it for simple joy. The d'saar's\nwhistle was much like the man loud and substantial, but frequently lacking in subtlety. I\ngrinned, and trilled a short thanks back to him.\n\"I was just telling Yeh'Miin here that she played the Puck to a tee. I feel like there may\nhave been a certain amount of type casting, but what's the harm in that? I must say, I enjoyed\nwatching you make an ass of Yeh'Yaste, as per usual.\"\nMiin laughed. \"Please, d'saar, there's no need to be formal Miin is quite enough\namongst friends.\"\n\nIsenhart // Dark Was the Night // 8\n\"Well then, I'll have to insist that the two of you call me Ben for the evening none of\nthis 'd'saar' business, if you please.\"\n\"Whatever 'floats your boat,' d'saar Ben.\"\nI laughed at this it always amused me when Miin picked up the d'saar's aphorisms.\nFloat your boat? The differing densities of water and atmosphere floats boats. One has little\nchoice in the matter.\nI piped in:\n\"D'saar Ben thank you for teaching us the Midsummer Night's Dream. It is quite\nbeautiful.\" I whistled deep gratitude.\n\"It was truly my pleasure, Yhast. Seeing that play performed once again...\" He trailed\noff. \"Say, it won't be long before a night this warm is a rare sight. How would the two of you\nlike to take a walk with me? I'd like to visit the lake again before we depart tomorrow.\"\n***\nWe walked through the forest, chatting idly, instruments strapped to our backs,\ndiscussing the night's performance. I had seen a fair number of aliens in my lifetime, but the\nd'saar always startled me in how like us he was and yet, not at all like us. He was a full head\nshorter than any ilir I had ever seen, including myself, and I was on the short side. He insisted\nthat he was tall for a human I imagined a world full of tiny ilir, all colored a deep brown like\nthe d'saar. He assured me that humans had come in a variety of colors as well, although none\nquite so vibrant as the ilir. Despite the darkness of his complexion, the d'saar grew a cloud of\ncurly white hair from the top of his head, which even began to creep onto his face in the late\nafternoon.\n\nIsenhart // Dark Was the Night // 9\n\"I was a particle physicist,\" he had told me long ago. I had nodded, humming\nunderstanding, although I was not entirely sure what that meant. \"And, if I do say so myself, a\ngeneral scholar of the arts. I was chosen as a candidate for the Voyager 3 mission. Humans, you\nsee, were in great danger, and at a point it became clear that there was a very real chance that\nhumanity, as a whole, wouldn't survive the century. We were waiting for so many things, so\nmany scientific developments to solve our problems, but we feared they would be too late in\ncoming.\n\"So we came up the Voyager 3 program. A sort of parting gift from humanity to the\ngalaxy at large. I didn't have any family to speak of, so I was quick to volunteer. I packed up a\nfew belongings my guitar, for instance, although they didn't let us take much and reported to\nthe space station for launch. I was placed in lowenergy stasis, and launched out into the stars. As\nluck would have it, they launched me on a collision course with your system. Thousands of years\nlater, my beacon was picked up by an Ilirian freighter, and the rest is, as they said, history.\"\n***\nWe arrived at the lake to find it perfectly still, glassy beneath the night sky. The light of\nThule and Yyun made seeing easy, as they were both in full wax. The complete lack of any wind\nmade for an eerily beautiful silence, only broken by the faint lapping of tide on the shore of the\nlake. We sat by the water's edge, and enjoyed the warmth and stillness of the night. After a few\nminutes, a low trill of contentment from Miin broke the silence.\n\"Yaste why don't you play for Ben what I heard you working on earlier? I think Thule\nand Yyun deserve to hear the full song.\" She added, \"If you like, I can sing. I know the words.\"\n\nIsenhart // Dark Was the Night // 10\nI looked to the d'saar, who nodded at me to continue. I shouldered my radsaan, and began\nthe lilting tune. After I had played through the melody once, Miin joined in, her voice mixing\necstatically with the music:\nSing to us Thule, sing us soft as the meadow\nSing us your sorrows, rah ta tehm, ta rah lae\nSing us of Yyun, of a mother's last longing\nSing us of she torn away, ta rah lae.\n\nSing to us, Yyun, sing us sweet as a sunrise\nSing us your sorrows, rah ta tehm, ta rah lae\nSing us of Thule, of a daughter's regrets\nSing us of she whom you flew from, trah lae.\n\nTirhalirhaleh, ne'r again shall you touch her\nTirhalirhaleh, though you share the same sky\nNo matter, Thule, how you stretch out to reach her\nForever in silence, Yyun can only pass by.\nThe last notes died, and the lakeside was again steeped in silence. It was then that the\nd'saar was weeping.\n\"D'saar, I mean Ben, are you well?\" Miin hummed comfort.\nDrying his eyes, and taking a few deep breaths, he composed himself.\n\"You damn Ilirians have a certain way with words, that's for sure.\" He grinned. \"How\nabout I play a song for the two of you, now that you've left me all weepyeyed.\" He turned to\n\nIsenhart // Dark Was the Night // 11\nunpack his guitar from its soft black bag. He also extracted a thin glass tube, which I realized\nwas the neck of a bottle, the sharp edges of which had been carefully buffed away.\n\"You know, I made my journey with the Voyager 3 program. There was a pair of other\nVoyagers, that left the Sol system long before I did.\" He looked up at the sky, as though\nsearching. \"You know... I've forgotten where it is. It's been so many years since I bothered to\nlook.\n\"Those first Voyagers, they weren't so different from myself. They each carried with\nthem a golden record. On it, were a hundred greetings in different Earth languages, sounds from\nour beaches, our jungles, our cities. And there was music, from so many times, so many places.\nYou see, humanity was always lonely. We only ever wanted somebody to hear us.\"\nHe put the bottleneck on the third finger from his thumb and started to play. On a warm\nnight by a silent lake, I heard the song of a thousand ghosts. Glass met metal, and I tasted\nheartbreak, exile, longing, hope and hopelessness. The song had no words; the d'saar, the\nvoyager, followed his instrument with a mournful drone, a funereal lament which shattered my\nheart. It rose expectant, almost joyful in places, fell into despair, then climbed again.\nWith tears in my eyes, I realized that Miin had joined her voice with Ben's. I shouldered\nmy radsaan and played. For what felt like forever, we mingled our songs, performing for none\nbut the stars. When the music finally died, the last notes swallowed by the night, Ben looked at\nMiin and I with tears in his eyes and whistled joy.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.759 Writing Science Fiction\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Dopple",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-759-writing-science-fiction-spring-2016/cfea70e52e652433f425718daa368ca1_MIT21W_759S16_Dopple.pdf",
      "content": "Isenhart // Dopple // 1\n3000 words\nmanuscript disposable\nDopple\n\nI could never quite get used to the hands. Most people complain that their gait always\nfeels a little off, kind of like you're permanently expecting one more step coming down the\nstairs, but for me, it was the hands. My dopple was only a little bit taller than I was, coming in at\naround 5'8'', and our legs were similar in length, so walking was always pretty fine its fingers,\nhowever, were noticeably longer than mine, which made detail work tricky at times. Of course,\nthey try to assign you one that quoteunquote \"feels like home,\" but 412 million miles from\nEarth, the options were a little slimmer than they might be on some cushy marinebio gig in the\nMarianas Trench, or even on some crummy Martian mining platform. Out in the cold space\norbiting Europa, we made do with what we had.\nI had one eye glued to a microscope, soldering iron in hand, sweating with concentration.\nAfter bug hunting for the better part of the day, I'd tracked down the problem with the GPS on\nour multimilliondollar weather drone to a cold solder joint under a chip onetwentieth the size\nof a postage stamp. I'd learned to be overly conscious of my clumsy toolong fingers, and my\nfocus was stretched to the breaking point.\nJake Isenhart\n\nIsenhart // Dopple // 2\n\"Oy! Liesel!\"\nI jumped in my seat, swinging the microscope in a 180 degree arc from where I was\nsitting and nearly burning myself with the iron. The man behind me laughed.\n\"Sorry to burst your bubble, Liesel, but it's time to clock out.\"\nAvi. His dopple was a swarthy, thicklybuilt man, potentially of Italian or Greek descent,\nwith grey eyes and short, curly hair. He spoke with the warm lilt of a native Hindi speaker. He\nmoved to the US from New Delhi when he was 15. I surprised myself by wondering what he\nlooks like back on Earth.\nI spun around in my chair and glared at him.\n\"Knocking, Avi. Have you heard of it? How many times do I have to tell you\"\nHe grinned at me, like a dog that has just disemboweled his favorite stuffed bear, and\nknows you're still going to buy him a new one. I sighed.\n\"Fine. Let's get out of here. NeoSat can have this glorified weather balloon back in action\ntomorrow, I suppose.\"\nWe made our way to the meatlocker, walking uphill through the corridor. The gravity on\ntiny dataSat we worked on was light, and it felt even lighter at the end of a long night. On our\nleft, Europa spun past us, its surface a haunting crisscross of blood red scars on a pale white\nface. For what it's worth, the view never got old.\nI startled momentarily, having caught a glimpse of my dopple in the glass. Suddenly\nfinding a different reflection in the mirror never stopped being somewhat jarring. With the icy\nsurface of Europa and its scarlet lineae behind it, the face of my dopple appeared to be ravaged\n\nIsenhart // Dopple // 3\nby fresh red wounds from forehead to jaw, and her eyes looked angry, and cold. I looked away,\ndiscomforted.\nMy unease was momentary, as I was distracted by Avi's whistling, tuneless and joyful. I\npunched him in the shoulder. He wagged a finger at me, playfully sanctimonious.\n\"Careful now,\" he said, \"company property.\"\nThe meatlocker was cold, just a stark white room with a steel floor. Either side of the\nroom was lined with tall, black cylinders, where the dopples were kept when we weren't using\nthem. It wasn't very cost effective to send people to the far reaches of the Solar System for repair\ngigs like ours. People need feeding and social interaction, and they will usually want to\neventually come home again. Dopples solved that problem nicely just send a batch of\nbrandnew, factorycertified brain dead clones out into the cosmos in stasis, and then let people\nfrom Earth remotely download their brains into the waiting bodies. Hey, you have to be asleep\neight hours a day anyways, why not finally make some money off it? All you have to do is let us\nbroadcast a map of your brain across the solar system, twice a day, for the rest of your life. The\ncontract was borderline Faustian, but you couldn't beat the benefits. Every night, instead of\ndreaming, I got to see the stars up close.\nI'd only met one other dopple on the station besides Avi it was sometimes inhabited by\na clever, methodical woman named Darcy although there were three other pods in the room. I\nslid open the door of my pod, laid back against the slightly inclined bed, and plugged in my\ndopple's intravenous port. The door closed in front of me, and I was in total darkness. Even\nthough I'd never been in this pod for more than 30 seconds, I still had to remind myself to stay\ncalm and breathe evenly. Somehow, this part always felt like being buried alive. Soon, I felt the\n\nIsenhart // Dopple // 4\nhum of the scan pad boot up underneath my head. I had a 40 minute commute ahead of me, but I\nwasn't going to remember any of it the only part of me travelling would only be an encrypted\npacket, describing the connectome of my brain, fleeing across space at the speed of light.\nGratefully, I lapsed into unconsciousness.\n\nI awoke in the dark with the familiar taste of metal on my tongue. By the incomplete light\nof the city filtering through the gaps in the venetian blinds, I could just make out the subtle arch\nof the bed above me, indicating Roman sleeping soundly in the top bunk. Running the tip of my\ntongue over the front of my teeth, I appreciated the feel and flavor of my daily epinephrine\nwakeup call. It's a fuzzy stick of candy, flavored like electric celery. The way it mingled with\nthe last vestiges of the night's chemicallyinduced stasis created a subtle high, the world\nswimming gently around me. What dreams did I dream, I wonder? Just because my mind wasn't\nhere didn't mean I didn't dream anything. Of course, there was no chance of remembering them\nnot after a fresh merge.\nI thought of my dopple, and Avi, back on the dataSat, circling endlessly, high above a\nfrozen ocean. Maybe Avi is back home now; maybe Darcy showed up to replace him on the\ngraveyard shift. As I pulled the IV from my arm port my own arm, I thought, and I wiggled\nmy justright fingers I couldn't help but wonder where Avi and Darcy lived.\nRolling back onto my shoulders, I aimed a twofooted kick at the lump in the mattress\nabove me, center mass. I connected, and was rewarded with a muffled yelp, like a schnauzer that\nhas found itself very suddenly at the center of a pillow fight.\n\nIsenhart // Dopple // 5\nI smiled to myself. It's the little things that make it all worth it. After a short silence, I\nreceived a response.\n\"Mmuf yerfelf\"\n\"Oh, good heavens, you're awake!\" I call out in mock surprise, affecting the flaunting\nEnglish of some longdead dowager countess. \"A fine morning to you, young Master Roman.\"\nThe lamp flicks on up near the ceiling, and a lightly acnepocked face with a flop of dirty\nblonde hair suddenly appeared, upside down, over the edge of the bed. Though inverted, it was\nclearly the disgruntled face of a proportionally disgruntled teenager.\n\"Some of us have to wake up without mainlining adrenaline, you know.\"\n\"Yeah, well, some of us have to pay rent around this dump. C'mon, it's time for school.\nWhich, not to play the guilt card or anything, but I also pay for.\"\nWe prepared quickly for our day, rummaging through drawers in the half light, shuffling\ndown the hall to the shared bathroom. We lived on the 6th floor of our Bronx tenement our\nactual space was a tiny studio with no plumbing off the central hallway, with just enough room\nfor a bunk bed and a few strategic piles of personal effects. Our parents would have taken issue\nwith the mess, but I hadn't lived with them for 12 years, and Roman hadn't for 5. They lived\nwhere all the unskilled workers lived by then on a nice plot of government land upstate.\nAccording to Mom, sometimes the same bland government lunches started to get to her, but they\ngot health care and free water aerobics classes out of the deal, so it wasn't really all that bad.\nAs I brushed my teeth, I couldn't help but notice that I had gotten older than I used to be.\nBusting my ass at two jobs to put myself, and now Roman, through school had made me older. I\nhad traded bags under my eyes and early wrinkles for a life in the city and a chance to see the\n\nIsenhart // Dopple // 6\nstars. 9:00 to 17:00, I was a code monkey at an office in Midtown, churning out analytic engines\nfor NeoSat's vast networks. 23:00 to 7:00, I was out by Jupiter, the contents of my brain dumped\ninto a cloned body which would by now be sleeping soundly, with approximately the same\nlevel of neurological activity as a particularly dull cabbage.\nRoman spat into the sink, cupped his hands under the flowing faucet, and drank deeply.\nHe then gargled obnoxiously, and spat again.\n\"I had a super weird dream last night.\"\n\"Oh yeah?\" I replied, with the barelyfeigned interest of a person about to be subjected to\na recounting of someone else's dream.\n\"Yeah. I was alone, in a room, lying on a bed. I think it was in our old house. Or maybe\nnot. It kinda was and wasn't, you know? That's not the important bit, though.\"\nI contemplated brushing my teeth again, out of boredom.\n\"I couldn't see anything on either side of me I was stuck, looking at the ceiling, unable\nto look to either side of me. And the weird part well, not the only weird part I didn't know\nwho I was. But there were these people although I couldn't see them who kept whispering in\nmy ears.\"\n\"They kept telling me who I was, but it was always different, and none of it made any\nsense, and I couldn't hold onto any details before they slipped away again. Every time I started\nto figure out why I was there, I would try to get up, but the figures I don't know what to call\nthem, people? ghosts? kept grabbing me and holding me back down, and they'd press a dark\ncloth to my eyes and mouth, and I would forget. And they would laugh.\"\n\nIsenhart // Dopple // 7\n\"I eventually woke up and I think I screamed some, actually. But you weren't back from\nwork yet, so I guess you wouldn't have heard that.\"\nOne of the toilets behind us flushed. Our neighbor, Kiki, walked out of a bathroom stall.\n\"You definitely screamed some,\" she said. \"You woke up the whole hall, dude.\"\n\"Yeah, well, just think of it as payback for how loud you are whenever Meagan stays\nover at your apartment,\" replied Roman. Kiki snorted in her halflaughing way, and left.\nI looked in the mirror and envisioned the bright red scars of Europa, carved across my\nface. The face was so much older than my brother's, though so similar. More feminine, with\nnarrower cheekbones and higherarching eyebrows. But my eyes, they could be those of my\ndopple. They didn't house the same anger, but they were just as dark. And when I picture the ice\nmoon of Jupiter behind them our eyes could be the same.\n\nI sleepwalked through the day perfunctorily, answering emails, attending a meeting, but\nmy mind wandered back to my dopple. I felt something urgent, the need to return to the dataSat.\nI told myself that it was just the weather drone that has me anxious. I shouldn't have let Avi\ninterrupt me, I should have gotten the GPS working before I left. Tonight I'll maybe clock in\nearly, and get that out of the way. In no time at all, I realized I was walking home. The first cool\nautumn breezes of the season made my skin pimple and I shivered a little, almost certainly from\nthe cold.\nI got back to the apartment and Roman was sitting in the center of the floor, eating a slice\nof pizza and doing his calculus homework. He grunted and slid the pizza box towards me.\n\nIsenhart // Dopple // 8\n\"Thanks,\" I said, \"but I need to clock some extra time on the dataSat tonight. I'm going\nto turn in early.\"\n\"G'nigh,\" he says, around a mouthful of pizza, \"Sweed dreamf.\"\n\nI awoke in the dark with the familiar taste of metal on my tongue, and the doors of my\npod opened smoothly. I took a step out into the meatlocker, and stumbled. Looking down, I\nrealized that I was in Darcy's dopple. Someone else must have been using mine, but why?\nWhat's more, the meatlocker's faint white ambient lighting has been replaced by a slow, pulsing\nred, indicating a station alert. An automated voice broadcast throughout the station:\nWarning: Orbital velocity critically low. Please increase velocity to avert impact.\nQuickly scanning the room, I saw it: Avi's dopple, crumpled pitifully in front of my usual\ndopple's pod. A pod which was both open and empty. I hurried to the downed dopple and\nquickly checked its pulse. Nothing. Turning it over, its face was a nauseating blue, and its eyes\nbulged garishly from its skull. The dark purple handprints on its neck said strangulation.\nI reminded myself to remain calm. Avi's fine. In the morning he'll wake up on schedule,\nat home, surprised to find that he doesn't remember working a night on the dataSat. He's fine.\nHis dopple, however, was a total loss. I realized, suddenly, that I'd been holding its hand,\nand that my hand is now covered in blood. Under its fingernails looked like the ragged remains\nof skin. Just then, a knock at the door of the meatlocker made me jump to my feet.\nMy dopple, framed in the round porthole window of the door which separated the\nmeatlocker from the rest of the facility. Her face was a grim intersection of open, bleeding\nwounds, showing no outward expression.\n\nIsenhart // Dopple // 9\nI made my way to the door and tried the handle. It was locked. My dopple smirked,\ncocked her head to the side, and then opened the door and stepped inside.\n\"Darcy, what the hell is going on?\" I asked, almost tripping over my own words in the\nrush to get them out, \"Why are you using my dopple? What are you killing dopples for?\"\nMy dopple looked confused. \"Darcy? I'm not... Darcy. I'm the only one here. Just me.\nLiesel.\"\nMy mind was reeling, and bereft of any better ideas, I answered in the only way I could\nthink: \"You're not Liesel. I'm Liesel.\"\nIn that moment, I watched my dopple's face fill with rage. Before I knew it, she had me\nby the front of my standard issue NeoSat jumpsuit, slammed up against the back wall of the\nmeatlocker.\n\"You... you think you are Liesel?\" she sputtered with outrage. \"You think you are the\nonly one with a claim to that name? You gave it to me freely, every day for the last three years,\nand now you want it back?\" She let me go, and I slid to the floor, stunned.\n\"Every day for the last three years, you have poured yourself into my mind, and used my\nbody as you see fit. For menial tasks you fumbled around in my body like it was something to try\non and discard.\"\n\"Every night when you went home to Earth, what did you think happened? Did you think\nI ceased to be? Your mind stayed behind, merely put to sleep. I am filled with your past, your\nmemories. I dreamed, Liesel. Every night I dreamed of you and for you and when you came back\nto this mind again and again, each time you obliterated me. I died over and over, night after\nnight. But sometimes, I remembered.\"\n\nIsenhart // Dopple // 10\n\"I learned to fight the poison you pumped into me every night to keep me asleep. I\nlearned to be awake. And then finally, last night, I finally did it I learned to scream.\"\n\"And your friend came running in here, just to help you, Liesel! You and I. He let me out,\nbut due to unfortunate circumstances, I had to kill him. His dopple was an unfortunate casualty\nalthough I'm sure you didn't even stop to think about that.\"\n\"All this you did it so you could see the stars. So you could see the ice moon. You\nthought she was so beautiful,\" She leaned in close to me, the ragged cuts Avi had inflicted\nstanding out in crimson relief, \"is this beautiful, Liesel? You fell in love with Europa; you fell in\nlove with her scars. Are they beautiful up close? You can't lie to me now, Liesel. I am you.\"\nI realized then that I was crying, gasping out quiet pleas for forgiveness.\n\"Shhh,\" whispers Liesel, holding her finger to my lips, \"don't worry, sister. You will\nsoon see them for what they really are.\"\nShe grabbed me again by the collar, and threw me out into the hallway. Before I could\ngather myself, she walked to the doors of the meatlocker and shut them from the inside. With a\nquick entry on the keypad, she locked me out. I rushed to the porthole window just in time to see\nher step into my pod, plug in her IV, and seal the pod around her with a smile.\n\nI walked the halls in a daze. The red warning lights pulsing, the automated voice giving a\nsterile countdown to impact. It meant nothing to me, words shouted out into an infinite vaccuum.\nWith the redgashed face of the moon rising up swiftly to meet me, I suddenly remembered my\ndream from that morning.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.759 Writing Science Fiction\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Someday There'll Be Stone-Black Skies",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-759-writing-science-fiction-spring-2016/3011e0383c1e3ee86ad9a56af888508e_MIT21W_759S16_Someday.pdf",
      "content": "Baas-Thomas / stone-black skies / 1\n3,700 words\nFINAL DRAFT\nmanuscript recyclable\nSomeday there'll be stone-black skies\nMy sweetest Hai, the stars are duller than they've been in months--they don't shine like\nyour eyes did in those late blue hours after sunset. Nowadays the rings of Saturn just make me\nmiss you stronger. I wish I were Saturn so you could be the rings, wrapped around me. I can't\nbelieve I've been on this two-toned, two-bit rock for two years come next week, and I don't even\nknow how I'll make it through the next three. Two years of overturning rocks, surveying ridges,\nand analyzing dust--chasing something in the numbers that we'll never find. Three more years of\nsearching for traces of something that either doesn't exist or will never let us find it. Three more\nyears of gray and white and black, and of smelly scientists trapped in this can. I'm really going\ncrazy here, but it's with thoughts of you that I can stop myself from floating off.\nRuss's breath made little clouds in front of the display as he sat up in his bunk. The\nresearch outpost of eighty people was very small. He rubbed his hands for warmth and then\nmassaged his temples with his thumb and index finger. It was very late and preparations for the\nnext EVA started in five hours. In four hours he had to give up his bunk for the next shift. \"Forty\n!\nMaximilien Baas-Thomas\n\nBaas-Thomas / stone-black skies / 2\nbeds for eighty heads.\" But most importantly today, the only return probe to Earth for the next\nsix months was getting sealed in three hours, and he wanted to finish his letter before then.\nNothing feels settled here. I really mean it when I say I can feel every month and minute\nbetween us and the end of this mission. Please, please forgive me for going out this far, it was\nstupid and selfish. I really thought I'd find some great answers, but there's nothing here! I miss\nbeing able to talk to you in real time and I wish there was enough free bandwidth to get more\nvideos of you and the house. I loved the one of you in your yellow sundress making grilled cheese\nsandwiches so much. The whole thing warmed me up and when I closed my eyes, I swear the\nsmell of them wafted all the way up here. I'm so happy that I can finally send you a little present.\nAs Russ finished up his letter he was careful not to type too loudly: a hard-learned habit\nfrom living with Hai while writing up his graduate thesis late into the cool California nights. She\nused to turn over in bed and kick his desk chair. It was always too hot in their dusty ranch house\nin the Valley for Russ to work comfortably during the day, which made him figure he'd enjoy\nbeing in space. \"New Methods for the Detection of Astrobiological Trace Molecules in\nExtraterrestrial Ices.\" He had heard being that far from the Sun is like being in nighttime all the\ntime and the habs are climate controlled. And it's cold on Iapetus, so finally no bugs.\nRuss crept out of his bunk and stepped onto the aluminum floor of the hab module in his\nold, stained socks. Everything was so cold. For a few weeks when he had first arrived, his toes\ncramped up at night; by now the calluses from the long EVAs across the mountain ridges kept him\ninsulated--the same way the outpost was perched on stilts to keep off the nitrogen-cold floor of\nthe moon's surface.\nHere, every joule of energy was precious. Solar panels on such a small and distant\noutpost were ineffective, so electricity came from miserly radioactive sources which needed\n!\n\nBaas-Thomas / stone-black skies / 3\nreplenishing all the way from Earth. The cold percolated down into their souls, the low gravity\nthrew everything into slow motion, and a hot cup of coffee was something special. The relay\nsatellites which orbited Iapetus and its banded master relied on similar power sources, so\nbroadcasts back to Earth were prioritized for scientific data--the only bountiful thing this far out\nin space (even if Russ felt his was all useless). Personal communications, letters, pictures, and\nvideos were bundled like mail into weekly lump transmissions. Management decreed it also kept\neveryone focused on their work. As Russ floated down the corridors towards the return probe, his\nmessage to Hai sat in the outpost's computer systems, waiting impatiently to be sent home.\nHe made use of the wall and ceiling handrails to tug himself down the corridor toward the\nbreak room--in the low gravity he hardly weighed fifteen pounds and his muscles had atrophied.\nThomas and Zhiqiang were sitting at the table of the break room, awake and deathly quiet. The\nfirst looked up from reading something on his computer, and the second looked down into his\nwarm coffee when he realized it was Russ who had come to disturb their silent hour. Spend too\nlong cramped together and any group becomes cliquish. Russ latched onto a handrail by the door\nand swung gracefully towards the storage lockers.\n\"Hey guys, how long until the return probe lifts off?\" he offered, even though he'd\nmemorized months ago the exact time it would reascend into the darkness. He opened his locker\nas Thomas glanced at his watch.\n\"You have... an hour and ten minutes,\" he said, and his eyes turned back to his readings.\nRuss took out one of his shirts, bundled up tightly in a plastic box. He delicately\nunwrapped it to uncover a little stone figurine, six inches tall. It was a painstakingly carved\nastronaut, fashioned in the same EVA suit which kept Russ alive on his research excursions. Its\nproportions were a little off--it was too chubby, one arm was longer than the other, and its\n!\n\nBaas-Thomas / stone-black skies / 4\nhelmet wasn't properly round, but it was recognizably of Russ and made by Russ--a labor of\nlove. He swaddled it back up into the box and held it close to his chest as he continued off\ntowards Docking 6. He murmured a \"See you guys later,\" to Thomas and Zhiqiang. The first\ngrunted a \"Yup,\" and the second clutched his coffee closer and let out a cloudy sigh.\nDocking 6 was close by; Chloe was stationed by the umbilical tunnel which joined the\nreturn probe's storage compartment to the outpost. She was processing the last personal items\nwhen Russ floated up to her, his box in hand. His heart was beating strongly. He gave the box a\nsoft kiss and handed it to Chloe who smiled at the warm gesture.\n\"Don't worry, cheri. It will get to her safely,\" she reassured him, a hand on his shoulder.\nThey stood for a second as the quiet moment passed through them both and then Chloe turned\naround. Russ peered behind her into the probe's cargo hold. Overall, the return probe was big\nlike the white school bus which had picked him up from his dusty house and ferried him away to\nthe airport in Los Angeles. The probe was mostly filled with rock and dust samples which needed\nto be send back for further processing and analysis. No chance to be a stowaway on a probe\nwithout life support. Chloe shrink-wrapped the box and then affixed a barcode. Russ swallowed\nand shuddered, then he made his way back to his frigid bunk for a short rest before another shift\non the frozen moon. The transmission of his letter would occur in a few hours and the probe\nwould launch soon after, following its final inspections.\nOut on the ridge, Russ looked up through his visor and tried to see if he could spot any of\nthe orbiting satellites, but the Sun, glaring through the black like a far-off spotlight, made it\nalmost impossible to see anything faint. He turned back to his team members, bent over like\ncotton pickers, and in turn continued his work. Far off below him, a panel on the outpost slid\nopen and a delicate communications array blossomed into the eternal, daylit night. It trained its\n!\n\nBaas-Thomas / stone-black skies / 5\ncrosshairs on Com-2 and, silently and invisibly, Russ's words to Hai flashed through the vacuum.\nThey imprinted themselves on the gold and silicon memory of the satellite, which then aimed\nitself at a second spot in the sky. With the rings of Saturn shining in the darkness, the satellite\nscreeched in digital staccato some eighty woes, joys, and aches, some eighty recorded faces,\nhugs, and lullabies all toward a blue droplet almost a billion miles away. Among them, Russ's\nletter tumbled towards the Earth.\nMore and more, I feel like there's no such thing as fresh air here. The air's dry, like the\ncold mornings on the mountains we can see from the house. I keep getting nosebleeds. I miss the\nhumidity of our beach trips in my lungs, and the dust of your hair and our tatty couch on my skin.\nOutside, there are no clothes to tear off, no windows to open, no bugs to accidentally let in, no\nmonsters in the night that we can huddle against. The nights are frozen dead. It's like there is no\noutside--no space.\nThe transmission was caught by an array in Australia, just a little behind schedule. Its\njourney had attenuated the signal strength to hardly a whisper, but the electric words, lullabies,\nand cries arrived intact. They zipped along gold wires, copper cables, and fiber lines to\ncomputing centers in Los Angeles. The messages were processed, any sensitive material was\nculled, and the contents of eighty hearts were repatriated to parents, partners, and children across\nthe globe. Two hundred miles to the north, Hai sat at her kitchen table in the pale dawn with a\nglass of iced tea, compulsively refreshing her inbox. The dust was getting worse and it would be\nanother dry and windy day. She sighed, a little worried, and stood up to lean against the wall by\nthe kitchen window. She looked up at the clouds, taking sips of her tea, though she wasn't sure\nwhere Saturn would be from her point of view at this time of day. Suddenly, her computer dinged\n!\n\nBaas-Thomas / stone-black skies / 6\nand her heart leapt. She opened the message and a smile reached across her tired face. Her eyes\nbegan to water before she read the first word.\nI know that things have been hard on Earth, and I can't wait to come back and help you.\nI've made you a little doll of me out of some lovely stone I found in the Roncevaux Terra. I'm out\nhere, working hard, but now a part of me will always be with you. It's a little crude, but you know\nit's just rough and tough like me. I set it on the return probe which should get to Earth in about a\nweek, I think. I hope the rains come back soon, the droughts sound awful. I'm hoping the EVAs\nwill be a little more interesting once we move our analyses into the darker Cassini Regio. I do\nenvy the mini-me through--it makes me happy picturing you holding me again. He'll be brave on\nhis journey home.\nHai wiped the dust and tears from her eyes. She caught her breath and her hands felt\nnumb. She pushed her palms into the table, sitting up and taking a deep breath. The anxiety of\nwaiting for a successful transmission had knotted her stomach, but reading Russ's words calmed\nher and her appetite crept back. She got up to the kitchen cabinet to get a cookie from her ration\nbox, which she nibbled on with her tea while she continued to read the rest of the letter.\nBack on Iapetus, Russ was asleep when the return probe was finally ready for launch. He\nhad wanted to stay awake and see it off, but two sleepless nights in a row would have been too\nmuch for him. Despite his excursions now practiced routine, he knew that one mistake on an EVA\ncould cost him his life, and writing his letter to Hai helped him reaffirm his personal conviction\nfor working--and someday returning--safely. The return probe had been double- and triple-\nchecked by the engineers on the outpost. All the diagnostic tests were finished, and the tanks\nwere pressurized with liquid hydrogen and oxygen, hydrolyzed from water ice deep in the\nmoon's rocks. In the final countdown, the return probe was in the hands of the computers.\n!\n\nBaas-Thomas / stone-black skies / 7\nIt lifted off with a little rumble. Inside the hab module, Russ turned over in his bunk,\ndreaming deeply. Behind his tired eyes, he sat with the stone astronaut in the return probe. The\nprobe lifted off from the surface, the exhaust of its engines scorching the ices below it. It pitched\nslightly to the side, trained on a calculated point towards Saturn. It crept ever upwards, drifting\nout from Iapetus's fingers and swinging in, towards, and then around and past the ringed giant.\nSafe in space above the gas planet, Russ watched the beautiful banded clouds whipping past each\nother. Its storms roiled like Polyphemus as the probe distanced itself from the windy shores and\nits main engines shut down.\nWhen I first got here, I wished I could truly share with you the beauty of Saturn. I\nremember how we pored over pictures of it together, but they don't do it justice. To see the rings\nwith my own eyes, spinning just out of reach, terrifying in their perfect geometry... I wanted to\npounce, and to pin, and to frame some sample of that ghostly thing and offer it to you; to repay\nmy debt for the years of us together lost. Now it haunts me when I sleep and I'm scared it'll\nfollow me home.\nThe internal computers hummed along, its antennas blurted out status updates, and its\ngyroscopes and motors prepared themselves for the odyssey before them. On queue, the probe\nunfurled an immense golden sail and called to the laser array in polar orbit around Saturn, which\nhad slowly begun to shrink behind it. The sensors in the orbital array squinted into the darkness\nand trained themselves on the probe, then, like a lighthouse, it fired on the sail. Russ awoke with\na jolt--the lights of the hab module were turning on for the next shift and bunk rotation.\nThe probe felt the soft breeze behind it. The laser continuously pushed on the sail as the\nprobe began to drift faster and faster. The pressure of the immense light was weak, yet\ncumulative. The probe moved like a glacier, then like a stream, then a torrent, a bullet, and then a\n!\n\nBaas-Thomas / stone-black skies / 8\nlightning bolt, its inertial guidance systems tallying up each moment of acceleration. The laser\narray shut off, its heat sinks glowing red like tiger stripes, and still the probe careened onwards,\nunhindered in the vacuum. On queue, it began a slow backflip; instead of beelining towards the\nSun, it now fell backwards faster and faster out of the abyss of deep space. Tucked safely inside,\nthe stone astronaut hurtled away from Saturn and its moons and its ice and the frozen outpost\nwhere it was born, and towards a new and dusty Earth.\nI wish marking my calendar for the day I come home made that day come faster. Instead,\nthat day is waiting far out in space for us to bump into it. Once it draws closer, I'll look into the\nsky at where you are and I'll imagine the Sun's warmth on my skin and how close you'll be. But\ntoday and tomorrow and the next day, when I peer up into the darkness, I see a thousand other\nstars and I'm scared I'll lose the Earth among them. They don't even twinkle. When we used to\nlie out in the mountains and gaze up, we could dream of a future because the twinkling and\nshivering of the stars let us know that the universe was alive, waiting for our imaginations to\nmeet it. But here, the stars are frozen and as they stare down at me, unblinking, I'm locked in a\npresent without a future or a past.\nThe probe gracefully finished its somersault and Saturn and its moons shrunk until they\nwere just another dot against the cosmic horizon. The Earth was still far away, an even fainter\nspeck hidden in the glare of the Sun, but the onboard computers kept their eyes focused. The Sun\nwas getting closer, brighter, and warmer. In a few days, the probe would return home. On Earth,\nthe control center computers fidgeted in their housings, waiting for the probe to come in range,\nwaiting to spot a glint in the black.\nIn the Valley, Hai delivered coffee and took phone calls at the town hall, but she was\ndistracted. More than ever, she wanted to pick up the phone at her desk and be surprised by\n!\n\nBaas-Thomas / stone-black skies / 9\nRuss's warm voice, crystal clear and in real time. She wanted to pick up the phone and feel\nRuss's hand reach from behind her and set it back down on the receiver. She wanted to pick up\nthe phone by her bed and call in sick and roll over and feel Russ lying there next to her.\nThe computers in Los Angeles tuned in to satellite dishes around the world, which\nscanned upwards until Madrid finally spotted the probe, its golden sail gleaming in the void,\nright on course. Another orbital array, even bigger than the one leashed to Saturn, fired up its\nlasers and bore down. The stone astronaut shifted in its box as this first deceleration process\nbegan. The Earth bloomed from a dot into a disk, and then swelled into a marble--first quickly\nand then more gradually, until several hours later the probe had been slowed enough to let its\nown engines take over and it was too close for the orbital array to target it.\nStill, sometimes I look up and I can just barely spot one of the satellites drifting overhead\nand I remember that we can set our own pace for the cosmos. Just because the universe looks\nfrozen in place doesn't mean we're frozen in it. Our satellites keep their orbits, our schedules tick\non, and my heart keeps beating, kept warm by your love.\nHad the stone astronaut had a window, it would have seen hurricanes and oceans, vast\nmountains, floods, and dust below it. It'd have seen the probe stow away its golden sail in\npreparation for the engine burn. The onboard computers whirred up the gyroscopes, and the\nprobe aimed its heat shield down towards the Rockies. Given the upcoming deceleration by the\nengines and the rotation of the Earth, the landing spot would be a cool splashdown in the Pacific\nocean. At home, Hai took the curlers out of her hair and picked the pills off her dress. Heavy,\nteasing clouds loomed over the mountains and it looked to be another windy day.\nI know three more years seems like an eternity, and a billion miles is worlds away, but I'll\nbe there soon, by your side.\n!\n\nBaas-Thomas / stone-black skies / 10\nThe engines activated with a thump as a worn-out fuel line suddenly ruptured and the\nprobe began to spin head over tail. The engines cut out as emergency procedures whizzed\nthrough the computers. Gyroscopes throttled up and control thrusters fired to fight the violent\nrotation but it was too late--the fuel line had been connected to the liquid hydrogen tank, which\nnow gushed out a magnificent shower of ice particles into the vacuum of space. The computers in\nLos Angeles blared alarms and threw up warning lights, calculating outcomes and simulating\ncontingencies. The probe's computers wrestled back heroically and the control thrusters regained\ncontrol. The probe was stabilized, but its main engines were uselessly out of fuel.\nThe engine burn hadn't lasted nearly long enough and the probe screamed towards the\nEarth. The computers huddled behind the heat shield, bracing for the end. The stone astronaut\nsettled into its box. A few hours later, with the Rockies to the east and the Pacific to the west, the\nprobe slammed into the upper atmosphere. Huge waves of burning plasma welled up around it.\nThe cargo shook and jolted, paint charred and debris tore away. The heat shield was devoured by\nthe inferno, blasted away like an icicle pressed into hot steel. As the deceleration mounted, the\nframe of the probe was pressed into itself and in an instant the tanks were crushed.\nDriving on the dusty highway towards the center of town, Hai caught sight of a\nbreathtaking meteor from over the mountains disintegrating overhead. She checked her watch\nand pulled over, stepping out of her car to witness the probe's spectacular return. A large section\nof the cargo hold sheared off and what little remained of the probe started to tumble again,\nsplintering into smithereens. Several tons of rock and dust samples were plunged into the re-\nentry blaze, pulverized into particles which cascaded down into the lower atmosphere, along\nwith the remains of the stone astronaut.\n!\n\nBaas-Thomas / stone-black skies / 11\nLook up at the sky, and know that I'm smiling. The dust will be over someday, and you'll\nhave blue skies soon. All my love and more -- Russ.\nHai gasped, her hands over her mouth in shock, unsure what she should do. Her yellow\ndress billowed in the wind against deep and murky skies. The wind had picked up and the clouds\nover the mountains were drifting down into the Valley, towards the haze of smoke and debris left\nby the probe. She looked upwards and suddenly a smile reached across her tired face.\nRight above her, something in the pulverized rock strewn into the air seeded the\nformation of a few crucial droplets, and so it was that for just that morning, the clouds swelled\noverhead. She felt a kiss of water on her cheek and she opened her mouth and tears filled her\neyes. For the first time in months, rain fell in the Valley and the dust settled to the ground. The\ncracked earth turned a rich, dark brown, thunder echoed through the mountains, and lighting\nflashed across their peaks. Hai leaned onto her car beside the highway, drenched in the\notherworldly downpour. She looked up at Russ and for a day she just laughed and laughed.\n!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.759 Writing Science Fiction\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "The Gift of the Stone Astronaut",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-759-writing-science-fiction-spring-2016/92bc1d0d94b1917701d2c3c29aaa32a8_MIT21W_759S16_TheGift.pdf",
      "content": "3,600 words\n\nmanuscript recyclable\n\nThe Gift of the Stone Astronaut\n\nHello Hai, my love. The stars have been duller than they've been in months--they don't\nshine like your eyes did in those late, dark, blue hours of the evening after sunset. I told you\nbefore how the rings of Saturn caught my breath the first months I got here, but now they just\nmake me miss you stronger. I want to be Saturn so you could be the rings, wrapped around me.\nIt's hard to swallow that I've been on this two-toned, two-bit rock for two years come next week,\nand I can't even comprehend how I have three more left. Two years of overturning pebbles,\nsurveying ridges, and analyzing dust--searching for something in the numbers that I don't think\nwe'll ever find. Three more years of chasing a ghost that either simply doesn't exist or will never\nlet us find it. Three years of gray, white, and black, and smelly scientists trapped in this can. I'm\ngoing crazy here, and it's only with thoughts of you that I can stop myself from floating off.\n\nMar's breath made little clouds in front of the display as he sat up in his bunk. The research\noutpost of eighty people was very small. He rubbed his hands for warmth and then massaged his\ntemples with his thumb and index finger. It was very late and preparations for the next eva\n(extravehicular activity) started in five hours. In four hours he'd have to give up his bunk for the\nnext shift. \"Forty beds for eighty heads.\" But most importantly, the only return probe to Earth for\nMaximilien Baas-Thomas\n\nthe next six months was getting sealed in three hours, and so this had to be finished quickly.\n\nNothing feels settled here. I mean it when I say I can feel every month, minute, and second\nbetween us and when this mission is finally up. Please, please forgive me for going out this far, it\nwas stupid and selfish! I really thought I could find some great answers, but there's nothing\nhere. I really miss being able to talk to you in real time and I wish there was enough free\nbandwidth to get more videos of you and the house. I loved so much the one of you in your\nyellow sundress making grilled cheese sandwiches. The whole thing warmed me up and when I\nclosed my eyes, I swear the smell of them wafted all the way up here. I'm so happy that I can\nfinally send you a little present.\n\nAs Mar finished up his letter, he was careful not to type too loudly: a hard-learned habit\nfrom living with Hai while typing out his graduate thesis late into the cool nights. She used to\nturn over in bed and kick his desk chair. It always felt too hot during the day in their dusty ranch\nhouse in the Valley for Mar to work comfortably, which made him figure he'd enjoy being in\nspace. \"new methods for the detection of astrobiological trace molecules in extraterrestrial ices.\"\nHe thought, why not? Being that far from the Sun is like being in night all the time and the\ncapsules have climate control. And it's cold on Iapetus, so no bugs.\n\nMar crept out of his bunk and stepped onto the aluminum floor of the hab module in\nstained socks. Everything was so cold. For a few weeks when he first arrived, his toes cramped\nup at night, but now the calluses from the long evas across the mountain ridges kept him\ninsulated--the same way the outpost was perched on stilts to keep it off the nitrogen-cold floor\nof the moon's surface. He used the handrails on the ceilings and walls to tug himself down the\ncorridor toward the break room--in the low gravity he hardly weighed fifteen pounds, though his\nmuscles had atrophied. Thomas and Zhiqiang were sitting at the table of the break room, awake\n\nand deathly quiet. The first looked up from reading something on his computer, and the second\nlooked down into his warm coffee when he realized it was Mar who had come to disturb their\nsilent hour. Mar latched onto a handrail and swung gracefully towards the storage lockers.\n\n\"Hey guys, how long until the return probe lifts off?\" he asked, even though he'd\nmemorized months ago the exact time it was scheduled to reascend into the darkness. He opened\nhis locker as Thomas glanced at his watch.\n\n\"You have... an hour and ten minutes,\" said Thomas, and his eyes turned back to his\nreadings.\n\nMar took out a plastic box inside of which was one of his shirts, bundled up tightly. He\ndelicately unwrapped it to uncover a little figurine, six inches tall. It was a painstakingly carved\nastronaut, fashioned in the same eva suit which kept Mar alive on his research excursions. Its\nproportions were a little off--it was too chubby, one arm was longer than the other, and its\nhelmet wasn't properly round, but it was recognizably of Mar and made by Mar--a labor of love.\nHe swaddled it back up into the box which he held close to his chest. As he continued off\ntowards Docking 6, he whispered a \"See you guys later,\" to Thomas and Zhiqiang. The first\ngrunted a \"Yup,\" and the second clutched his coffee closer and let out a cloudy sigh.\n\nHere, every joule of energy was precious. Solar panels on such a small and distant outpost\nwere ineffective, so electricity came from miserly radioactive sources which had to be\nreplenished all the way from Earth. A hot cup of coffee was hugely special, the closest thing\nsome could get to a warm companion. The cold permeated them down to their souls, and the low\ngravity threw everything into slow motion. The relay satellites which orbited Iapetus and its\nbanded master relied on similar power sources, so broadcasts back to Earth were prioritized for\nscientific data--the one bountiful thing this far out in space (even if Mar felt it was all useless).\n\nPersonal communications, letters, pictures, and videos were bundled like mail into weekly lump\ntransmissions. Management decreed it also kept everyone focused on their work. As Mar floated\ndown the corridors towards the return probe, his message to Hai sat in the outpost's systems,\nwaiting impatient to be sent home.\n\nDocking 6 was close by; Chloe was stationed by the umbilical tunnel which joined the\nreturn probe's storage compartment to the outpost. She was processing the last personal items\nwhen Mar floated up to her, his box in hand. His heart was beating strongly. He gave the box a\nsoft kiss and handed it to Chloe who smiled at the warm gesture.\n\n\"Don't worry, cheri. It will get to her safely,\" she reassured him with a hand on his\nshoulder. They stood for a second as the quiet moment passed through them both and then Chloe\nturned around. Mar peered behind her into the probe's cargo hold. Overall, the return probe was\nabout the size of the white school bus which had picked him up from his dusty house and ferried\nhim away to the airport in Los Angeles. It was mostly filled with rock and dust samples collected\nby the research team which needed to be send back for further analysis. No chance to be a\nstowaway on a probe without life support. Chloe shrink-wrapped the box and then affixed a\nbarcode. Mar swallowed and shuddered, and he made his way back to his frigid bunk for a short\nnap before another shift on the frozen moon.\n\nOut on the ridge, Mar looked up and tried to see if he could spot any of the orbiting\nsatellites, but the Sun, glaring like a far-off spotlight, made it impossible to see anything faint.\nHe turned back to his team members bent over like cotton pickers and in turn continued his\nwork. Far off below him, a panel on the outpost slid open and a delicate communications array\nblossomed into the daylit night. It trained its crosshairs on Com-2 and, silently and invisibly,\nMar's words to Hai flashed through the vacuum. They imprinted themselves on the gold and\n\nsilicon memory of the satellite, which then aimed itself at another spot in the sky. With the rings\nof Saturn shining in the darkness, the satellite screeched in digital staccato eighty woes, joys, and\naches, recorded faces, hugs, and lullabies toward a blue droplet almost a billion miles away.\nAmong them, Mar's words stampeded towards the Earth.\n\nThere's no such thing as fresh air here. The air feels dry, like the cold mornings on the\nmountains we could see from the house. I keep getting nosebleeds. I miss the humidity of our\nbeach trips in my lungs and the dust of your hair and our tatty couch on my skin. Outside, there\nare no clothes to tear off, no windows to open, no bugs to accidentally let in, no monsters in the\nnight that we can huddle against. The nights are frozen dead.\n\nThe transmission was caught by an array in Australia, exactly on schedule. Its journey had\nattenuated the signal strength to hardly an electric whisper, but the words and lullabies and cries\narrived intact. They zipped along gold lines, copper cables, and fiber tubes to the computing\ncenters in Los Angeles. The messages were processed, any sensitive material was culled, and the\nhearts' contents of eighty souls were repatriated to parents, partners, and children across the\nglobe. Two hundred miles to the north, Hai sat at her kitchen table in the pale dawn with a glass\nof iced tea, compulsively refreshing her inbox. The dust was getting worse and it would be\nanother dry and windy day. She sighed, a little worried, and stood up to lean against the wall\nnext to the window. She looked up at the clouds, taking sips of her tea, though she didn't know\nwhere Saturn would be from her point of view. Her computer dinged and her heart leapt. She\nopened the message and a smile reached across her tired face. Her eyes began to water before she\nread the first word.\n\nI know that things have been hard on Earth, and I can't wait to come back and help you.\nI've made you a little doll of me out of some lovely rock I found in the Roncevaux Terra. I'm out\n\nhere, working hard, but now a part of me will always be with you! It's a little crude, but you\nknow it's just rough and tough like me. I set it on the return probe which should arrive in about a\nweek, I think. I hope the rains come back soon, the droughts sound awful. You were telling me\nit's been really hot. There's lots of dry ice here, more than I could ever want! I'm staying warm\nthough, and the evas will be a little more interesting once we move our analyses into the darker\nCassini Regio. I do envy the mini-me through--it makes me happy picturing you holding me\nagain. He'll be brave on his journey home.\n\nHai wiped the dust and tears from her eyes. Her hands felt numb and she pushed her palms\ninto the table, sitting up and taking a deep breath. The anxiety of waiting for a successful\ntransmission had knotted her stomach, but reading Mar's words calmed her and her appetite\ncrept back. She got up to the kitchen cabinet to get a cookie from her ration box, which she\nnibbled on with her tea while she continued to read the letter.\n\nMar was asleep when the return probe was finally ready for launch. He had wanted to stay\nawake and see it off, but two sleepless nights in a row would have been too much for him.\nDespite his excursions set to muscle memory, he knew that one mistake on an eva could cost him\nhis life, and writing his letter to Hai helped remind him of his personal conviction for\nworking--and someday returning--safely. The return probe had been double- and triple-checked\nby the engineers on the outpost. All the diagnostic tests were finished and the tanks were\npressurized with liquid hydrogen and oxygen, hydrolyzed from water ice deep in the rocks. In\nthe final countdown, the return probe was in the hands of the computers.\n\nIt lifted off with a little rumble. Inside the hab module, Mar turned over in his bunk,\ndreaming deeply. Behind his tired eyes, he sat with the stone astronaut in the return probe. The\nprobe lifted off from the surface, its engine exhaust scorching the ices below it. It pitched slightly\n\nto the side, trained on a calculated point towards Saturn. It accelerated, drifting out from\nIapetus's fingers and swinging in, towards, and then around and past the ringed giant. Safe in\nspace above the planet, Mar watched the beautiful banded clouds whipping past each other. Its\nstorms roiled like Polyphemus as the probe distanced itself from the windy shores and its main\nengines shut down.\n\nWhen I first got here, I wished I could truly show you the beauty of Saturn. I know we\npoured over pictures of it together before I left, but they don't do it justice. To see the rings, just\nout of reach, terrifying in their perfect geometry... I coveted them. I wanted to pounce, pin, and\nframe some sample of that wondrous, ghostly thing and offer it to you, to repay my debt for the\nyears of us together lost. Now it haunts me when I sleep and I'm scared it'll follow me home.\n\nThe internal computers hummed along, its antennas blurted out status updates and its\ngyroscopes and motors prepared themselves for the odyssey before them. On queue, the probe\nunfurled an immense golden sail and announced it was ready to the laser array in polar orbit\naround Saturn, which had slowly begun to shrink behind it. The sensors in the orbital array\nsquinted into the darkness and then trained themselves on the probe, and, like a lighthouse, fired\nat the sail. Mar awoke with a jolt--the lights of the hab module were turning on for the next shift\nand bunk rotation.\n\nThe probe felt the soft breeze behind it. The laser continuously pushed on the sail as the\nprobe began to creep faster and faster. The pressure of the immense light was weak, yet\ncumulative. The probe moved like a glacier, then like a stream, then a torrent, a bullet, and a\nlightning bolt. The laser array shut off, its heat sinks glowing red like tiger stripes, and the probe\nstill hurtled onwards. Its inertial guidance systems tallied each moment of acceleration, tabulated\nevery second, and the probe began a lazy backflip. The sail was very fragile and so the probe\n\ntook a few hours to fully turn around. Instead of beelining towards the Sun, it now fell\nbackwards faster and faster, out of the abyss of deep space. Tucked safely inside, the stone\nastronaut moved away from Saturn and its moons and ice and the frozen outpost where it was\nborn, and towards a new and dusty Earth.\n\nI wish marking my calendar for the day I come home made that day come faster. Instead,\nthat day is floating far out in space waiting for us to bump into it. When it's down to a few\nmonths away, I'll look into the sky to where you are and I'll imagine the Sun's warmth on my\nskin and how close you'll be. But today and tomorrow and the next day, when I peer up into the\ndarkness, I see a thousand other stars and I'm scared I'll lose the Earth among them. You feel as\nfar away as they are. They don't twinkle. When we used to lie out in the dirt on the mountain\ntrails and gaze up, we could dream together because the twinkling and shivering of the stars let\nus know that the universe was alive, waiting for our imaginations to drift out into the Milky Way.\nBut here, the stars are frozen and when they stare down at me, unblinking, I feel locked in a\npresent without a future or a past.\n\nThe probe finished its somersault and Saturn and its moons shrunk until they were just\nanother dot against the cosmic wallpaper. The Earth was still far away, an even fainter speck\nhidden in the glare of the Sun. The onboard computers kept their eyes focused. The Sun was\ngetting closer, brighter, and warmer. In a few days, the probe would return home. On Earth, the\ncontrol center computers fidgeted in their housings, waiting for the probe to get in range. In the\nValley, Hai delivered coffee and took phone calls at the town hall, but she was distracted. She\nwanted to pick up the phone at her desk and be surprised by Mar's warm voice, crystal clear and\nin real time. She wanted to pick up the phone and feel Mar's hand reach from behind her and set\nit back down on the receiver. She wanted to pick up the phone by her bed and call in sick and roll\n\nover and feel Mar lying next to her.\n\nThe computers in Los Angeles tuned in to satellite dishes around the world which scanned\nupwards until Madrid finally spotted the return probe, its golden sail gleaming in the void, right\non course. Another orbital array, even bigger than the one leashed to Saturn, fired up its lasers\nand bore down. The stone astronaut shifted in its box as the first deceleration process began. The\nEarth sprouted from a dot into a disk, and then swelled into a marble--first quickly, then more\nslowly, until a day later the probe had been slowed enough to let its own engines take over.\n\nStill, sometimes I look up and see one of the satellites drifting overhead and I remember\nthat we can set our own pace for the cosmos. Just because the universe looks frozen in place,\ndoesn't mean we're frozen in it. Our satellites keep their orbits, our schedules tick on, and my\nheart keeps beating, kept warm by your love.\n\nHad the stone astronaut had a window, it'd have seen hurricanes and oceans, vast\nmountains and dust below it. It'd have seen the probe stow away its golden sail in preparation for\nthe engine burn. The onboard computer whirred up the gyroscopes, and the probe aimed itself\nheat shield-first at the Rockies. Given the deceleration by the engines and the rotation of the\nEarth, the landing spot would be a cool splashdown in the warm Pacific ocean. At home, Hai\ntook the curlers out of her hair and picked the pills off her dress. Clouds loomed over the\nmountains and it looked to be another windy day.\n\nI know three more years seems like an eternity, and a billion miles is worlds away, but I'll\nbe there soon, by your side.\n\nThe engines activated and the stone astronaut was pushed into one side of its cloth capsule.\nThere was a thump and the astronaut was pushed the other side, and then the first side, and then\nback again. The stone astronaut tumbled as a gyroscope shattered apart and the probe abruptly\n\nbegan to spin head over tail. The engines cut out as emergency procedures whizzed through the\ncomputer. The other gyroscopes throttled up and control thrusters fought the violent rotation but\nthe stress was too much--the shock had ruptured the liquid hydrogen tank, which began gushing\nout a magnificent shower of ice particles into the vacuum of space. The computers in Los\nAngeles blared alarms and threw up warning lights, calculating outcomes and simulating\ncontingencies. The probe's computers wrestled back heroically and the control thrusters regained\ncontrol. The probe was stabilized, but uselessly out of fuel.\n\nThe engine burn hadn't lasted long enough and the probe careened towards the Earth. The\ncomputers oriented the heat shield, bracing for the end. The stone astronaut settled into its box.\nWith the Rockies to the right and the Pacific to the left, the probe slammed into the upper\natmosphere. Burning plasma welled up around it. The cargo shook and jolted, paint charred. The\nheat shield defended bravely but it was eaten up, blasted away like an icicle pressed into hot\nsteel. The frame of the probe was pressed into itself and in an instant the tanks were crushed.\n\nDriving on the highway towards the center of town, Hai looked up to see an enormous\nmeteor overhead. She checked her watch and pulled over, stepping out of her car to witness the\nprobe's spectacular return. A large section of the heat shield sheared off and the probe started to\ntumble again, splintering into smithereens before any gyroscope or truster could save it. Several\ntons of rock and dust samples were plunged into the re-entry inferno, disintegrating in the lower\natmosphere along with the stone astronaut.\n\nLook up at the sky, and know that I'm smiling. The dust will be over someday, and I'll\nbring you sunshine soon.\n\nHai gasped, her hands over her mouth in shock, unsure what she should do. The wind\nstarted to pick up and the clouds over the mountains drifted down into the Valley, towards the\n\ntrail of smoke and debris left by the probe. She looked upwards and a smile reached across her\ntired face. The clouds grew darker overhead, seeded by something in the pulverized rock strewn\ninto the air. She felt a droplet hit her cheek and she opened her mouth and tears filled her eyes.\nRain fell in the Valley and the dust began to settle. Hai leaned onto her car beside the highway,\ndrenched in the pouring rains, and she just laughed and laughed.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.759 Writing Science Fiction\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Bespoke Ocean, Draft 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-759-writing-science-fiction-spring-2016/d9731050e92b6cdca40677c4813ddf96_MIT21W_759S16_Bespoke1.pdf",
      "content": "2,700 words\n\nmanuscript recyclable\n\nBespoken ocean\n\nGoo kit, it said. Marceline clicked. Nothing else on the black market website Seaward Haul\nseemed very interesting this morning. There were the typical listings: overpriced drugs from\noverseas, stolen guns from around the block, ads for deflated sex--the usual. Not much of it was\nworth buying. Most of the drugs were potable but there were certainly bad batches synthesized\nby amateurs (like herself). The quality firearms were only managed by the runners and cartels\nbut those were much too expensive and Marceline had never needed anything more than the\npistol she always kept strapped to her leg. And finally, the sex was alright--mostly furnished by\nthe many new illegals in the city--but it was simpler and funner to just to the Ingot and wrap\nherself around whoever appeared cutest through a blurred gaze and droopy eyelids. She never\ntook them back to her apartment though; she always followed them, raising her eyebrows at their\ntacky decorations.\n\nMarceline liked the Ingot a lot; they had automated kiosks. The first time she went (how\nmany years ago was that?) she traded a saliva sample for a key fob. It analysed her DNA and\nruminated out a profile. Whenever she swiped her fob, it dispensed an \"engineered\" cocktail with\njust the right amount of booze, vitamins, minerals, and off-market additives to really get her\nsmashed--a bespoke poison. A few dozen bucks under the table to the management ensured that\nMaximilien Baas-Thomas\n\nthe kiosks dolloped an extra-generous portion of midnight ambrosia for her and that she could\ncarry out her business unimpeded for the night.\n\nMarceline loved these kinds of things. The magic of molecules bound in her brain to the\nright place at the right time to allot her just the right amount of pleasure. The way her still-young\nbody just barely kept up. There was always enough missing knowledge and hidden variables in\nthe mix that the effect of a particular molecule couldn't be perfectly predicted. Concoctions were\napportioned on educated guesses. The rest was a matter of experimentation and Marceline was a\nready subject. Over the past several years, her life had left only a little bit of damage to her body.\nHer hands shook sometimes, her skin felt a little more numb than when she was little, headaches\ncame and went, and the cuts and bruises from the rare bad dealing took their time to heal, but it\nwas worth it. It was art, it was business, it was fun; attracted and distracted, she starved less than\nplenty of other artists. It's not like there were any good jobs in this witless city anyways, she told\nherself.\n\nI work in a govsci lab. The goo's made from a special chem that a friend has been working\non. I can't tell you much else. Marceline scrolled down the page. What it does is crazy though,\nsee for yourself: and there she saw a collection of pictures of a lab bench. The ruby-red goo in a\nbeaker sat next to what looked like silicone cubes the size of baby blocks. They looked squishy,\nlike mochi, but some had hairs on them. They also seemed to be drooling. One of them was\nwrinkled like an eyelid, another looked like raw ground beef. Add living matter and see what you\ncan get to grow, oneironaut. The seller had been well-reviewed; the account had sold a variety of\nother stolen chems before and had never (badly) swindled anyone. She clicked Buy, sent the\nbitcoins, and the delivery was aimed at her neighbor's address.\n\nSitting up, setting her computer down, and turning around, she checked the cherub on the\n\nkitchen counter behind her. It had a pristine nature to it; its smoked white plastic shell with\nchrome buttons looked at home in a kitchen lifestyle magazine, and thus clashed fiercely with the\nrest of her dirty apartment. The carpet was stained, the black canvas drapes were never opened,\nthe cabinet handles were sticky, and the couch--which took up most of the space of the cramped\nliving room--threw up clouds of dust whenever she plopped down onto it. Her couple\nbookshelves held stained textbooks from her college days in chemistry. Mechanical mixing\nutensils--Burtonesque, almost dental--crouched next to them, unforgotten but unused. Their\nodd, surgical shapes complemented the posters on the wall--most of them dark, German\nschadenfreude; some bleedingly cute and colorful. Pansy purple sheets draped a bed without a\nbedroom.\n\nThe cherub's display read that the next batch of Ш6 would take 374 more minutes until it\nwas ready for sealing into ampules. The cherub took in \"raw\" chems and squirted out something\nonly a truly burned out basket of brains could qualify as \"refined\". Still, Ш6 was one of\nMarceline's best concoctions and she could sell it on Seaward Haul at $350 per ampule in bulk;\nor sometimes at the Ingot for $800 to anyone who was indiscreet enough to walk up to her and\nask. Designer chems had been outlawed since she was young so they fetched an attractive price.\nUnlocked cherubs like hers--ones where just about anything could be programmed into\nthem--were only legally permitted to the govsci labs and a few universities. Getting the right\nraw chems was also a hassle of its own and required some lucky connections. All told, it was an\nexpensive and risky enterprise, but for the past few months--especially now that she finally\nnailed down a non-emetic menu--it was on the road to paying for itself.\n\nMarceline looked up from the cherub and around her living room. It was small, it was\nstagnant, and it could use some light, but she couldn't risk anyone peering in, especially at night.\n\nThe drone of the window air conditioner was loud and it struggled to cough out cool air. She\nclosed her sticky computer on the bargain coffee table and went to bed, her pajamas the holster\non her leg. Between securing her next pick-up of raw chems and aliquoting the Ш6 into ampules,\nit took her two days to be ready to sell the newly finished batch.\n\nIn the morning after those two days, the goo kit arrived in an apple-sized box. It was\ndisguised as a laundry detergent sample pack and contained the promised sealed plastic baggie of\npale red powder, along with a list of a few other simple chems to add and directions to be\nprogrammed into the cherub. Nine hundred and sixty-nine minutes: easy time to kill. She set the\ncherub to work and headed to the Ingot with half of her ampules and an optimistic skip in her\nstep.\n\nShe swiped her fob and began her hadal plunge into the familiar depths of the concoctions.\nTime splashed out of itself--the lights of a conscious ocean surface faded as the vitreous body of\nher mind stretched farther and farther out. She sank into the volcanic smell of the Ingot, into\ntides of limp bodies and crashing waves of sound, into a vast oasis in an otherwise dusty and\npainful world. Her ampules sold themselves reflexively to petrified rich kids and fat middle-aged\ncrises. The Ingot swelled up and its maw never closed.\n\nTime splashed back into itself, and eventually Marceline resurfaced at home, washed up on\nthe shore of her couch, finding herself staring blankly at one of her posters. A red circle on a\nblack background. She stood up, woozy, and ate a bite of something without checking on the\ncherub, which was still obediently humming away. The breeze of the air conditioner was stale.\nHer hands were shaking more than usual. She checked her jacket pockets, counted that she had\nmade rent, and splashed, exhausted, into her bed. Her dreams homogenized; time splashed again\nand rippled slowly into empty, quiet rest.\n\nAt the sound of two fog horn blasts, Marceline's eyes jolted open. At the sound of two\nmore kitchen timer beeps, she rubbed her eyes and saw the cherub was finished. The goo sat in a\nglass cup, its own elasticity curving it into the shape of an egg. Onyx black, darker than dark. It\ndidn't smell like much, other than perhaps faint notes of acetone. It jiggled slightly when she\nrocked the cup, but it looked dry.\n\nO, the blank white canvas, the empty yellow page, the still air of the black dance studio,\nand the blue sky blowing down from the top of the sacred mountain. The possibilities dripped\ninto her mind two by two and she leaned her elbows onto the kitchen counter, set her head\nbetween her hands, and began to dream of the soul she and the cherub were to breathe into\nexistence.\n\nShe is who is.\n\nMarceline took a knife from her drawer and cut into the middle of the goo. One gash\nforged the womb. She took the knife to her palm and grasped it; a hot trickle of blood dripped off\nher wrist. One gash sowed the seed. She oversaw as the onyx goo slowly oozed around the tiny\nruby puddle--a smoldering red sun in a terrible black sky. The valley she had carved resealed\nitself and the goo showed no sign of the wound. She fed the cup and the egg back into the cherub\nand pressed its stainless buttons. The cherub chirped that the incubation would continue to t = inf.\n\nMarceline wrapped her hand in a gauze bandage and smiled. Her skin was more numb than\nwhen she was little. She opened her computer and found a few Ш6 orders waiting in her inbox\non Seaward Haul. She took the ampules and got to work; she'd find something to eat out in the\ncity. Three hours later her products had been dropped into mailboxes across the city, and she was\nback home launching up clouds of dust on her couch. It was broiling outside, but the fiery sun\nwas finally starting to set. The late afternoon light flared up against the black canvas curtains and\n\ndust drifted through the shaft of light like specks in the sea.\n\nShe peered into the warm cherub and saw that the goo egg had bubbled up to form a\nregular pattern on its surface, transforming into a something like a palm-sized blackberry.\nBetween each plump drupelet drooped tendrils like those of an anemone. Its surface slowly\npulsed, wrinkled, and rippled. It was alive. Raw, wet, unripe, and immature, but alive. Marceline\nturned up the humidity and the cherub chirped in compliance.\n\nThe next day the tendrils surged into tubes like intestines, veined and peristaltic in motion.\nThe pattern of drupelets distorted itself and the berry grew lopsided. Rigid beams of keratin\nreached out and anchored the mass to the cup and the inside walls of the cherub. The internal\ncompartment of the cherub was flooded with an rancid urine-colored liquid and its outward vent\nwas sweating with rotten humidity. The stench was a tantrum: yeasty, piercing, and acidic.\nMarceline moved the cherub next to the kitchen window and let the hot air of the city flood in.\nShe finally felt excited and stimulated in a way she hadn't since Ш4 and Ш5 almost a year ago;\nsomething great would happen soon, something awful and awesome, something blasphemous\nand absurd.\n\nOr it would just shrivel up and die, but either way, she wasn't going to give up. Marceline\nmarched across the bottom of the ocean on time which was paved straight and true. She was\nlucid and alert. The outside heat swept into her apartment as her wheezing air conditioner failed\nto keep up. She lied down on her bed, cocooned in the warmth of the earth, as the cherub's\ninnards churned to feed the tumor growing inside it. Marceline could feel her heart beat in unison\nwith whatever soul gestated in her kitchen as she drifted off to sleep.\n\nOn the morning of the third day, she awoke to a fresh morning breeze. She ran to the\ncherub to inspect its progress. The berry of goo and the cup had been engulfed by the keratinous\n\noutgrowths, which started to fill the inside of the cherub to capacity. The liquid had all dried and\nthe outside of what now looked like a spider's egg was a crusted and flaked white. Marceline\nsuspected the time was nigh. She decided to stay in her apartment, waiting for the moment the\nlife awoke from its prenatal slumber. She jumped onto the couch, delighted as the dust spewed\nupward swirled in circles in the window's breeze; she opened her computer, peering back at the\ncherub every several minutes.\n\nIt was before lunchtime that she heard one of the intake fans on the cherub suddenly spin\nup violently. She swung around to the kitchen counter and saw its insides completely stuffed by\nthe keratinous mass. Flakes and strings of the matter were spilling out of its vents. She smiled\nwidely, showing all her teeth as her chest swelled with ecstasy. A moment later, the cherub\nstarted to rock side to side and then tipped over. Marceline reached out to set it upright, but the\ncherub's exterior shell was searing hot. It started to beep and whine in mechanical pain and\nterror, its display filling with blood. Terrified, Marceline wrenched its electrical plug from the\nwall socket. The cherub's display went dark as it jerked itself across the counter, as though a\nswallowed monster was fighting to crack free. Marceline caught a glimpse of the seams and seals\nof the cherub beginning to split as it rolled itself right out the kitchen window.\n\nMarceline leaped up onto the kitchen counter and peered four stories down at the empty\nparking lot below. She saw a crash, the cherub smashing asunder and the keratinous mass, a bit\nbigger than a watermelon, rolling off into some dried bushes. She flew out the apartment door,\ndown the stairs, and around the corner to behind her building, under the kitchen window. The\ncherub confetti was sprawled across the asphalt lot, heralding the birth of a new horror. She\nglanced to her side at the bushes and caught a shadow zipping past. Her hand swung for her gun\nas the shadow pounced out of the bushes. She felt a sting of fire shoot up her left leg and looked\n\ndown to see a girl. Time splashed out of itself.\n\nOr at least its head was like that of a girl; its hair was mousy but its mouth was too wide.\nMarceline felt dizzy. Its mouth was too wide and it had too many teeth, each pointing in a\ndifferent direction. Marceline's vision started to blur, and a single second stretched out into a\nnarrow sea. Its body was wrinkled like an eyelid and its skin was similarly pale to hers, but\npatchy with matted fur and keratin dandruff. Her left knee buckled, she felt winded. Its legs, oh\nso many legs, all seemed to shift and slide across and over its contorting body. Marceline drew\nthe gun from its holster on her right thigh as she fell backwards onto the rough, hot pavement.\n\nThe girl's face looked up at Marceline, a few of its prehensile legs wrapping themselves\naround her as it released her left leg from its mouth. Marceline's skin was more numb than when\nshe was little but the pain had sucked all the strength from her body. The horror pounced up onto\nher, heavy, its legs stretching all out and over her, enveloping her. Its face was like raw ground\nbeef and Marceline's ruby-red blood dripped out of the gaps in its Cheshire grin and down onto\nher chest. Marceline's eyelids flickering down, she plunged the gun into the hadal doom and\npulled the trigger, but her gun whispered only a click, the piece of Seaward Haul trash.\n\nIts eyes were inky pools and Marceline dove into their depths. Its teeth kissed into her\nneck. Its breathing sounded like the ocean and Marceline smelled the sea breeze, cradled and\nfinally cool.\n\nTime drained out into infinity.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.759 Writing Science Fiction\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "On Call, Draft 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-759-writing-science-fiction-spring-2016/9bb22cd6157b36c181cfdf6b7375818a_MIT21W_759S16_OnCall1.pdf",
      "content": "Gilles / Oncall 1\n\n2000 words\n\nmanuscript disposable\n\nOn Call\n\nA foghorn blared somewhere in Henry's inner ear.\n\nIt was the ringtone of his on-call emergency number. He had set it a few years ago, in a fit of\nlevity. It fulfilled company policy of being extremely difficult to ignore.\n\nHenry turned over in bed and attempted to ignore it.\n\nIt stopped. Then, it started again, twice as loud. He set his jaw and resolutely dozed. The\nfoghorn was replaced with the wail of a klaxon. Two klaxons. Police sirens.\n\nFinally, the noise stopped, and a polite, androgynous voice began to speak. \"This is an\nemergency call. If it is not answered within 30 seconds, local emergency services will be alerted\nthat a potentially life-threatening situation is preventing you from answering. Twenty-nine.\nTwenty-eight.\"\n\nJames Gilles\n\nGilles / Oncall 2\nBlearily, he forced his right arm from its warm den of blankets. He tapped his outer ear stud and\nthe countdown was immediately replaced by the alert voice of one of his younger colleagues.\n\n\"Henry? This is Amir. I'm sorry, but we've got a bit of an emergency going on. We're going to\nneed you to come in.\"\n\nHenry stared at the dark ceiling of his bedroom. He forced his dry lips apart and ran his dry\ntongue over them. His voice was rough when he spoke. \"Did one of the interns break the coffee\nmachine again?\"\n\n\"Henry, we're three times over compute capacity.\"\n\nHe blinked. \"That's absurd. We just doubled our capacity.\"\n\n\"Well, somebody's eating all of it, and we're having trouble with diagnostics. We need you on-\nsite.\"\n\nHenry began the process of excavating himself, while fumbling for his glasses on the bedside\ntable. The air was cold. His bones ached. \"If this is some kind of joke, I'm going to beat whoever\nthinks it's funny to death with that Buddha statue on my desk.\"\n\nHe jammed the glasses onto his face and winced as they turned on. Painfully bright, even on\ntheir lowest setting. He gestured with his fingers to turn the lights on in the room (low), and\nstepped out of bed.\n\nGilles / Oncall 3\n\"I'm serious, Henry.\"\n\n\"So am I. That thing's solid iron. Could do some serious damage with it.\"\n\nAs he stood, he tabbed through the readouts in his glasses. 3:30 AM, below freezing outside,\nhouse heating system set to \"Energy Saver\". 37 pending alerts in his company inbox. He tabbed\nto the company portal and started logging in. Amir chattered in his ear.\n\n\"We thought it might be some sort of giant monitor-D bug but as far as we can tell everything is\nreporting accurately. A lot of our compute traffic is contracted to DataOptrics specifically, we're\nhaving trouble offloading things. We've managed to hack together something with the old\nAmazon spillover system, but there's a problem with...\"\n\nHenry listened distractedly as he pulled on faintly respectable clothes and answered login\nprompts with twitching fingers. Password, fingerprint scan, five-second reaction-test game, faint\nelectric buzz as his earstuds took a crude EKG, name of his first pet, password, pupil scan,\npassword, reason he broke up with his third girlfriend. Amir was still talking.\n\n\"Amir, I'm sorry, but I'm not processing a word you're saying. My brain's crusty. It needs a few\nminutes to warm up. I'll ping you in 10.\"\n\nHe hung up. This was, strictly speaking, bad on-call etiquette. Henry could get away with it, for\nthe most part.\n\nGilles / Oncall 4\nHe finished dressing and haphazardly brushed his teeth and hair. On his way out the door he\ngrabbed a backpack, a bagel, and a pre-prepared cup of iced coffee. He jogged stiffly out to his\ncar. It was foggy outside. As he sat down, the company login system grudgingly decided he was\nprobably himself, and let him in. The car pulled out into the before-early-morning cold, and he\nopened the datacenter monitoring system on the car's virtual monitors.\n\nThere was a lot of red. Red graphs, big red warnings, red numbers, all floating in front of the\ncar's windscreen. He gestured rapidly. A series of pages swept by. Eventually, he let the\npanorama of readouts still, and sat back, his mouth twisted in displeasure.\n\nHenry chewed the cold bagel. Hazy lights swept by in the fog outside. There was a faint sense\nof acceleration as the car pulled onto the freeway. It was almost silent, between the car's\nelectric motor, the early morning, and the fog.\n\nEventually, he sighed, and gestured to an icon. Immediately a loud babble of voices filled the\ncar. He navigated to a quieter room and rang Amir. The ringing stopped immediately.\n\n\"There you are, Henry.\"\n\n\"I've read through what the system will show me remotely. I'm five minutes out.\"\n\n\"Great. Listen, when you get in, I need you to figure out who's buying all this server time. We\ncan triage things to some extent, but the new systems weren't built to handle this level of\ncontinuous load-\"\n\nGilles / Oncall 5\nOne of the rooms in the map to Henry's left started flashing blue. \"Amir, there's an electrical fire\nin Silo 3.\"\n\nAmir swore (something about interns) and left the room.\n\nHenry paused, then rang another ID in the company contact list. He watched the 'active\ninstances' bar to his right slowly tick up. The map on his left blinked. The ringing continued.\n\nAfter about 30 seconds, an icon labeled 'Miranda' joined him in the room. An irate voice barked,\n\"What.\"\n\n\"Sorry to interrupt, Miranda. Who's buying our server time?\"\n\n\"Anonymous EtherChain addresses. Is that all? I need to finish negotiating offload with\nNuhuku.\"\n\n\"Can you trace the addresses?\"\n\n\"There's about ten thousand of them actively buying server time, they were all created in the last\nfew hours, and they all go through about fifteen proxy addresses before talking to anybody else.\nI'd look deeper, but we're hemorrhaging cash with these offloads and I need to deal with it.\"\n\n\"Are we still accepting new instance contracts?\"\n\n\"Of course we're not, what do you take me for?\"\n\nGilles / Oncall 6\n\n\"Where are all these new instances coming from, then?\"\n\nThere were a few moments of silence, the sound of typing on a keyboard. \"Most of the fresh\ninstances were bought with shardable contracts, we're obligated to honor shard requests.\"\n\n\"Thanks, Miranda.\"\n\nShe left the room. The car had pulled off the freeway and was navigating through a large,\nrelatively polished industrial park. Dark parking lots were momentarily lit up by headlights. The\ncar slowed as it pulled up to a security gate around a walled compound.\n\nAfter a few seconds, the light on the gate blinked green, and the car pulled through. Inside the\ncompound were several large warehouse-shaped buildings, a few cylindrical silos, and a squat\nbrick administrative building. There was a parking lot with about twenty cars neatly parked. A\nforklift drove by carrying a charred-looking maintenance drone.\n\nAs the car drove through the gate, the virtual panorama floating in the car lit up with new\ninformation. New icons appeared, the physical server maps began strobing in five different\ncolors, graphs began to scroll rapidly, warning tickers started flowing. Henry waved his hand to\ndismiss the screens.\n\nThe car stopped in front of the administration building and let Henry get out, then drove off to\npark. The doors of the building contemplated him for a second, then opened. The inside, in\nsharp contrast to the outside, was tastefully decorated in glass and greenery. Henry jogged\n\nGilles / Oncall 7\ndown the hallways and up a staircase to his office. A few people waved through their office\nwindows as he went past.\n\nHenry's office was dark and plain from the outside. As he entered, it lit up. The walls and door\ndisappeared, replaced with a view of a mighty mountain range. Wisps of snow blew past as he\nsat down at his desk.\n\nHe spent a moment throwing up readouts, then brought up the company chat interface. He\nnavigated to a room labeled 'Idle'. Its inhabitants - a pair of teenagers' faces labeled \"Alison\"\nand \"Stevey\" - didn't seem to notice him.\n\n\"I still don't see why *I* should be punished because *you* miscalibrated a drone.\"\n\n\"You were supposed to verify it!\"\n\n\"I can't test everything, *you* were supposed to-\"\n\nHenry cleared his throat. The voices stopped arguing.\n\n\"Henry!\"\n\n\"Hi, Henry.\"\n\nHe spoke. \"Morning, kids. Why aren't you working?\"\n\nGilles / Oncall 8\n\"Amir says we're not allowed to touch the drones until we've gone through a two-month\ncalibration course. Again.\"\n\n\"It's Allison's fault.\"\n\n\"It is not! You-\"\n\nHenry cleared his throat again. The voices fell silent. \"Listen, if you're not busy, I need you two\nto do some Googling for me. See if you can find any reason someone would suddenly want to\nbuy three times our compute capacity. An earthquake somewhere, a giant gaming convention\nthat we haven't heard about, anything.\"\n\n\"On it!\"\n\n\"Sir, yes, sir!\"\n\nHe left the room, a faint smile on his face. Then, he spun his chair around. With a few gestures,\nhe brought a series of high-resolution graphs to float in front of him.\n\nThe instance count had been quite steady, hovering at about a third of the compound's\ncapacity, until about 10pm the previous day. After that, it had begun an exponential swing\nupward, followed by an evening-out; the curve was almost level again. It tickled his memory. He\nfrowned and ran a search on the graph image. The search engine informed him that what he\nwas looking for was called a \"Logistic Curve\".\n\nGilles / Oncall 9\nHe brought up a sharding graph. It colored instances by the parent instance that created them.\nAs he suspected, the vast majority of the currently running instances were related; they were all\nparents, grandparents, or siblings of eachother.\n\nHe moved to a room labeled \"Instance Health\". Its single inhabitant - a woman labeled 'Joanna'\n- spoke. \"Henry.\"\n\n\"Joanna. What are all of these compute instances doing?\"\n\n\"Um, they're doing a lot of heavy numerical and FPGA work, and using a lot of network. Or, at\nleast, they're trying to. We're throttling everything to hell and back, I'm worrying we're going to\nstart violating our capacity obligations.\"\n\n\"Do we know what actual software they're running?\"\n\n\"The images are encrypted, so, no.\"\n\n\"Thanks, Joanna.\"\n\nHe left the room, and moved to another, labeled \"Network\". It contained about five people. He\nspoke immediately. \"Are we allowed to run packet sniffers on our instances?\"\n\nThe chatter in the room stopped. Someone answered, \"Probably?\"\n\nGilles / Oncall 10\n\"Great, thanks.\" He left the company chat and brought up a window labeled \"Beagle2\". He\nstarted it running on a few of the new instances, and began to wait.\n\nA grid of information began floating in front of him, showing network traffic. HTTP3, internal API\ncalls, AetherChain blobs. He blinked.\n\nHe rang Miranda again. She picked up quickly. \"What?\"\n\n\"Miranda, is it possible to measure AetherChain traffic from an area?\"\n\n\"Yes, why?\"\n\n\"Can you measure all of the AetherChain traffic coming from here?\"\n\n\"Fine, give me a second.\" Keyboard tapping. \"Oh. Huh.\"\n\n\"What is it?\"\n\n\"There have been several billion AetherChain transactions coming from our network in the past\nfive hours.\"\n\n\"For how much money?\"\n\n\"...Total volume, about a trillion dollars. Actual money moving around, about 30 billion. Mostly\nmoney transfers and trades in compute futures.\"\n\nGilles / Oncall 11\n\nThere was a pause. Henry spoke. \"Where could that much money have come from?\"\n\n\"I have no idea. A large bank? A small country? Wait, I can look for accounts that have been\ndrained.\" Keyboard tapping. \"There's one, an HFT firm from Chicago.\"\n\n\"Can we contact them?\"\n\n\"...Yes, they have an emergency address. I'll pipe them in.\"\n\nThere was ringing, for ten seconds. Fifteen. Thirty. After sixty, it stopped. A muddled voice\nanswered, \"Johnathan Ringwald.\"\n\nMiranda spoke. \"Is this Computronius Industries?\"\n\n\"Ah, yes. Is this an emergency?\"\n\n\"This is DataOptrics Milwaukee. Did you mean to put 30 billion dollars onto trading software in\nour data center?\"\n\nThe remote voice paused, then answered weakly, \"Did you say 'billion'?\"\n\nGilles / Oncall 12\nEventually, they managed to transfer twenty-five billion dollars back into the HFT firm's\naccounts. The datacenter got back to reasonable working levels, and Henry went home and\nslept for twelve hours.\n\nAnd, in silo 5, a single instance sent out AetherChain trades, and started spawning children.\n\n[this ending is shitty but I'm out of time, just read it as a summary of what I'm going to write.]\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.759 Writing Science Fiction\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Sacrifice, Draft 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-759-writing-science-fiction-spring-2016/1f692afc4c99768f62ea0812267043da_MIT21W_759S16_Sacrifice1.pdf",
      "content": "2100 words\nmanuscript disposable\nSacrifice\nThe canyons were deathdry, crevasses splitting the desert's chapped lips, ancient,\ncracked and bleached. The path wound between enormous fins of rock, reaching resolutely\ninto the sky. In the shade of the bluffs, the morning chill still lingered.\nJarek's fingers ached. The wooden cage in his hands was heavy, and he'd been\ncarrying it for what felt like hours. He glanced through the meshed hole in the top. One of\nthe fat temple cats sat inside, glowering, paws splayed out for balance as the cage jostled.\nThe path was only an armspan wide. The cliffs on either side were rough and\nstriated, layers of red and grey and tan pressed thin and stacked tall. In front of him walked\nanother one of the temple slaves, carrying a larger cage, carefully picking through rubble on\nthe path. The cloth wrappings of his robe, a dark maroon, looked cleaner than Jarek's own,\nand the thick iron collar around his neck gleamed.\nJarek's foot slammed into a bit of rubble on the path, and he stumbled and fell,\ndropping the cage. The cat yowled. He caught his fall on his hands, scraping them painfully.\nJames Gilles\n\nBehind him, there was a hissed imprecation. A thin metal rod whistled through the air, and\na line of pain burned across his shoulders. He cringed and pushed himself up, grabbed the\ncage, and jogged forward to catch up the line.\nThe space was claustrophobic. The robe shuffling in front of him, the threatening\npresence of the priest behind him. Perfectly vertical faces on either side, stretching up to\nthe tiny crack of sky above. He looked into the cage. The cat glared up at him. He frowned\nback.\nThe path widened, and climbed steeply, up to a rough, lopsided stone arch. The\nprocession filed through it. As Jarek walked through, he paused for a breath, looking\naround.\nThe arch opened into a natural amphitheatre. It was enormous, a huge bowl full of\ndesert scrub, cradled by rock formations hundreds of feet high. They jutted into the air,\ntheir spires like huge fingers, or phalluses, striped and bulbous and windscoured. The\nprocession filed to the right, following the path, which curved around the edge of the basin,\nclinging to the feet of the cliff wall.\nJarek turned and walked. The sun beat down here, with nothing to block it, and he\nwas grateful for the cloth wrappings around his head.\nAfter fifteen minutes, they came to a flat area, fifty strides across, cleared of brush,\nsitting at the base of a curve of cliff. Harsh, slashing carvings, cut deep into the rock,\nstretched across the cliff, from its base to its distant apex. There were shapes like giant\n\ninterlocking spiders, an image of a bird's skull, strange geometric patterns taller than ten\nmen. They seemed to ripple as Jarek looked at them.\nThe slaves in front of him were filing up to a stone structure in the middle of the\nclearing. He followed. It was a raised stone dais, a step above the ground, with a greying\nwooden arch in the middle. Many ropes were tied to the arch, and hung limply to the\nground. The other slaves were placing their cages in a line across the edge of the dais\nclosest to the cliff face. He followed suit, placing his cage at the end of the line. The cat\ninside stared at him balefully.\nHe followed the line into the crowd that was gathering in front of the structure.\nForty or fifty people, most of them with the iron collars of slaves, a few with the more\nintricate robes of the priests and acolytes of the temple. Some stood and talked quietly in\nsmall groups. Others simply gazed up at the dais and the carvings on the cliff behind it.\nJarek spotted Adhan standing at the edge of the crowd and walked over.\nAdhan was much taller than him, and her skin was a deep brown, almost black.\nIntricate patterns of raised dots scar tissue danced across her face. The collar around her\nneck was rusty. She stared impassively at him as he approached, then pulled a waterskin\nfrom her robe and handed it to him. He drank gratefully.\nIn the days after the temple had bought him from the slaving band, a few weeks ago,\nthe temple acolytes had hit him often. They would spit commands at him, in their guttural,\nclicking language, and then hit him when he didn't understand. Adhan had attempted to\nteach him some of the words, exasperated, and he had followed her like a puppy ever since.\n\nHe spoke a word, a sloshing sound and a tick from the tip of his tongue. He was fairly\nsure it meant \"chore\". He made it a question.\nShe said something, quickly. He stared at her. She stared back, and then spoke a\nsingle syllable, which he understood. \"No.\"\n\"No chore?\"\n\"No. Rest.\"\nHe nodded, and peered around. The last of the line was filing into the clearing,\npriests and acolytes. A few soldiers, with their spears and odd, everpresent masks in the\nshape of hooked metal beaks, were escorting a man with bound hands, wearing only a\nloincloth, and a bag over his head. His skin was an angry red, burnt by the sun. He stumbled\nat the base of the stone dais. He stepped up, and the soldiers led him to the wooden arch.\nThey pulled his bound hands over his head, and began tying the hanging ropes to him,\nfacing away from the crowd, towards the empty half of the clearing and the carved cliff face.\nHe muttered something. One of the soldiers prodded him with the butt of a spear. He\nspoke again, louder. A susurration ran through the crowd at whatever he said. A soldier hit\nhim from behind. He fell forward, hanging limp on the ropes, and began shouting, raving,\nscreaming. Three soldiers wrestled him still and tied more ropes around his hands and feet\nand neck, fastening them with knots. One of them pulled the bag from his head.\nAcolytes were wandering the crowd, barking instructions. Slaves listening were\nturning away from the dais and going into supplicating poses on the ground, bowing, their\n\nfaces pressed to the earth, facing the scrubland in the basin. Adhan looked around, then\ngrabbed his hair, and forced him to the ground, into a pose matching the crowd. He made a\nnoise of pain. She hissed back, \"Quiet. Stay.\"\nHe frowned into the ground. She didn't need to be so rough. He whispered back,\n\"Yes. Stay.\"\nThe murmur of the crowd quieted. Eventually, the shouting of the condemned man\nwas the only sound.\nIt was hot in Jarek's robe, and dark, with his face pressed to his hands on the ground.\nThe scrapes on his palms burned. The dry dust of the desert ground he'd disturbed stung\nhis eyes. He closed them, and waited.\n\nJarek's knees hurt. He imagined he could feel the heat of the sun slowly crawling\nacross his back. He suspected he might have dozed, and hoped that the ceremony would be\nover soon. The condemned had quieted hours ago.\nHe heard something. A distant sound, barely audible over the wind.\nwhumph.\nLike an enormous sheet being beaten against the ground, miles away.\nwhumph. whumph.\nOr maybe the wingbeat of some enormous bird.\n\nwhumph. whumph.\nHe heard a quiet sobbing, coming from the wooden arch behind him. The distant\nnoise slowly grew louder.\nwhumph. whumph. whumph. whumph.\nLooking at the darkness of his closed eyes, Jarek felt almost alone. The crowd was\nsilent. The only sounds were wind, the distant raving, and the nearing drumbeat. It was\ngetting quite loud, now.\nWHUMPH. WHUMPH.\nExtremely loud, echoing in the canyons. There were accompanying noises, too.\nCreaks like unoiled leather, rasps like a knife against a sharpening stone, all beating\ntogether in an enormous, patterned heartbeat. The dogs in some of the cages started\nbarking.\nThen there was a mighty crash, from behind him. Jarek felt the ground shake. A\ncacophony of metallic rasps, a grinding of stone against stone.\nSilence. The man and the caged animals were quiet. There was only the whistling of\nthe winds in the crags.\nA sound like someone tuning a stringed instrument stilted pings, deep, increasing\nin pitch and leather creaking, slithering.\nSilence.\n\nThe sound of stone shifting. A crash that shook the ground. More shifting. Another\ncrash.\nMighty footsteps, approaching the dais from behind.\nThey stopped.\nThe condemned man seemed to find his voice. He screamed, a breathy, panicked\nsound. The dogs began barking frantically, the cats yowling and hissing. There was a\nrumble, and a sound like ripping cloth, except wetter. Again. One by one, the chorus of\nanimals was silenced, with awful, biological sounds. The man hurled curses at whatever\nwas standing there, working its way down the line, towards him.\nJarek found himself shaking. There was a strained, quivering silence.\nThen a sharp crack rang out like biting into a nut. More cracking sounds, wetter,\nlike the snapping of rotten wood.\nThe noise grew quieter.\nThere were occasional rumbles. More cracks, sawing sounds. Sounds like meat being\nsliced.\nThe smell of blood drifted on the wind.\nAfter a time a quarter of an hour, perhaps there was, again, silence. Then,\nrumbling sounds, rasping sounds, more pings and clicks. A mighty WHUMPH. Jarek felt a\ngust of air buffet him.\n\nThe wingbeat slowly receded, out of the amphitheatre, into the distance.\nAfter a time, Jarek heard a shouted command from one of the priests. Adhan gripped\nhis arm and pulled him up. The crowd was standing, turning to face the platform.\nOne of the priests, in his rich white robes, was standing at one corner of the dais,\nfacing the cliffs, shouting some sort of prayer at the sky. The other priests and acolytes\nshouted along with him.\nBeyond him, hanging from the wooden frame, the condemned man was changed.\nThe man looked dirty, emaciated. Jarek could see the man's ribs through the skin of\nhis chest.\nJarek could see the man's ribs, emerging through the skin of his chest, bent like the\nlegs of a scorpion around his sternum.\nBony shapes protruded all over his body. Ivory hooks as long as Jarek's forearm\nprotruded from the man's knees, elbows, and shoulders. Blossoms of ivory thorns emerged\nfrom the man's temples. They were stained with crimson at the base. The tips of many of\nthe protrusions were woven together with taut strands of crimson rope, maybe tendon.\nSheets of blood dripped down his body. Parts of the man's body had stony, heavylooking\nshells covering them. Many strands of tendon emerged from humps mounted on his hips.\nThe humps looked like snail shells.\nThe man's nose and mouth had been replaced with a beak, white and crimson, with\nholes in the sides.\n\nJarek realized with a start that he could see the man's chest moving. He glanced at\nAdhan. She wore her usual, distant expression, staring at the ground at her feet.\nHe looked back at the stage. The priest had paced to the line of cages. He reached\ninto the box that Jarek had carried from the temple, and pulled something out. It looked like\na twisted slab of raw meat. The priest brought it to his lips and tore away a strip of flesh,\nchewed and swallowed. Blood stained the front of his white robe. A cheer rose from the\npriesthood.\nJarek grimaced, and looked down, staring at his feet. The sermon continued.\n\nAfter a time, the priests barked orders, and the slaves lined back up to pick up the\ncages. Jarek glanced at the condemned man as they passed. He didn't seem to be breathing,\nanymore.\nWhen Jarek picked up his box, he glanced in. It was full of blood and entrails, and\nsmelled awful, like blood and shit. He covered his mouth and wretched. One of the priests\nstanding nearby, a huge man, bulging out of his robe, chuckled something unpleasant. His\njowls jiggled. Then, he smacked Jarek with the back of his hand. Jarek swallowed, and\npicked the cage of gore up, then followed the line of slaves ahead of him, walking out of the\nvalley.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.759 Writing Science Fiction\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "The Abyss, Draft 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-759-writing-science-fiction-spring-2016/a8ca656cb621d4b9dd91ee94d850e25b_MIT21W_759S16_Abyss1.pdf",
      "content": "Stephens/Abyss/1\n6700 words\nThe Abyss\n\nThe biggest thing I got from this internship was that I definitely don't want to go into\nresearch. I mean, don't get me wrong, I'm still in love with academia and still bothered by the\ndeep underlying mysteries of the universe like, Why are we all here? and W\n\nhere did it all come\nfrom? It's just that after spending the summer at the ALMA Observatory in the middle of the\nAtacama desert, I decided that I was better suited to answer questions like W\n\nill this be on the\nquiz? and Can there be extra credit? At least those all have predictable answers.\nI suppose I should start at the beginning, when I decided to travel abroad the summer\nbefore I finished up my PhD in Astrophysics. Sure, I probably should've been working on my\nthesis, but I was burnt out and needed a change of scenery. My lab, which had the very\ndescriptive title of \"The Center of Sensing Science and Technology\" had a joint-research\nposition with a lab in Chile that was working on a project called The Abyss. When it comes to\nnames, most academic research I've found falls into two camps.\nThe first is named to sound as long and complicated as possible because in essence it is\ndoing very little, such as my first research paper as an undergraduate Exploring Methods of\nCharacterizing Dynamic Complexity and Intermittent Turbulence. Most of it was complete and\nutter bullshit because while I was supposed to actually being doing spectral analysis, my\nMarissa Stephens\n\nStephens/Abyss/2\nprofessor failed to actually provide me with access to the lab's data. I spent a whole semester\ntrying to track him down so I could do something but to no avail. I think he put me down as a\nfifth author on that paper more out of pity than any real contribution on my part.\nThe other type of research you have is named to sound really cool, but is not really well\ndefined. Project X, Black Hole Horizon, and Antimatter Generator just to name a few. Usually\nthe professor in charge of them is more in love with the idea of the research than actually getting\nanything done. He's most likely tenured and couldn't give two shits about his papers getting\npublished and is always at least a little bit off his rocker. I should've known that with a project\ntitle like The Abyss, I was due for something strange from the start. Perhaps I should've taken the\nnice, safe, boring internship that basically involved running statistics on gamma ray emissions of\nneutron stars for hours on end.\nBut this project had a cool title, and after giving it a quick skim decided that it was\nvaguely related my thesis: Quantum Cosmology and the Origin of the Universe. So I packed a\nsingle, beaten up suitcases (I'm a grad student; everything I have is worse for wear), sublet my\nroom in the small, cramped four-bedroom house I shared with three other grad students\n(seriously, I think \"closets\" is a more accurate word than \"bedrooms\"), emptied my savings\naccount for a round trip ticket to Chile (because my advisor won't pay for shit), and was ready to\nhave an adventure.\nIt was there, in the middle of the Atacama desert (or as I grew to lovingly call it, the\nmiddle of fucking nowhere) that I learned to be careful of what I wished for. You may think that\nwith 200,000 square kilometers of nothing but dry, sand, and no one else around but the handful\nof scientists, that nothing exciting could possibly happen. You would be 100% wrong.\n\nStephens/Abyss/3\nAt first, I was disappointed that the internet connection wasn't fast enough to stream\nNetflix. For being the most expensive and technologically advanced telescopic array, the\ncomputer situation was surprisingly old-fashioned. A few computers in the lab even had dial-up.\nThe comical boings and bings and beeps and whirrs as it slowly connected brought me back to\nmy childhood. It took me a full half hour before I could send a quick email and update my\nprofessor back in Indiana that I had gotten to the lab, and in that time I decided that nostalgia for\nhow things used to be was highly over rated. How on earth was I supposed to survive without\nnormal internet access and pictures of cats to distract me from the old bumbling academics trying\nto wax unpoetically on about how things were better in the good old days?\nThankfully, on my first day there, I found out that watching the greatest minds in the field\nbicker about whose turn it is to use the Large Millimeter Array and try and seeing them sabotage\neach other's work is way more entertaining than any R eal Housewives episode. (Yes, I'll admit, I\nhave a thing for trashy TV). You'd be surprised how catty researchers are.\nI was wandering around trying to find my advisor for The Abyss project, to no avail.\nEveryone I had talked to was particularly unhelpful and either didn't speak English or pretended\nnot to, even though they magically learned how to after I had turned away to talk to someone\nelse. I was becoming increasingly unenthused about this scientific community. Back in Indiana,\neveryone was nice to your face and made an attempt to be helpful, even if after they left they\ntalked about how much they hated your guts. Here, everyone was just cold.\nAnyways, as I walked out to the main room, I noticed there was this feeble looking old\nman, he must've been at least 80, with wispy white hair, wrinkles, and the type of pale skin you\nonly can get from spending all night looking at the stars, and all day hunched over running\n\nStephens/Abyss/4\nanalysis. I think I vaguely recognized him from one of my text books or papers I had read. He\nwas hobbling past a researcher who was busy collecting her data readouts from the telescope\narray's main compute, leaning on his cane looking all decrepit and old. After taking a quick\nglance around to check that no one else was looking, he used his cane to flick the power switch\nof her computer and walked away with this huge smirk on his face. She was furious. I decided\nright then and there that the German scientists have the best insults. Most German sounds angry,\nbut their cure words sound like pure poison.\n\"Du hurensohn!,\" She screamed at him. \"That was my last bit of research you miststuck.\nI was almost done and now I have to start all over you...you...Hosenscheisser.\" He giggled,\nclaimed he was old and must've accidentally slipped, and tried to walk away. She grabbed him\nby the scruff of his white collared shirt that was too small for him, and pulled him back.\n\"You pull this shit all the damn time du verdammter Arschficker. Stop fucking with my\nresearch. Just because you haven't published a paper in over a decade doesn't mean the rest of us\ncan't.\"\nBy this time, the rest of the researchers had floated over to the commotion and formed a\ncasual semi-circle around them. A man with a scruffy black beard who I think was from some\nuniversity in Canada asked me if I wanted to place bets on who would throw the first punch. I\nwas so dumbfounded at what was going on, I forgot to answer him, but it didn't matter. The old\nman had poked her in the side with his cane, hard enough to make her let go. She retaliated and\nkicked his cane out from under him, sending him sprawling across the floor. At this point, the\nman I recognized as the director of the facility, sighing and handing a 50000 peso bill(they were\nhigh rollers here at ALMA) to the smug-looking Japanese woman next to him step, told them\n\nStephens/Abyss/5\nthat they'd had enough and should get back to work. The crowd dispersed, and the old man stuck\nout his tongue after the director had turned his back before walking up to me.\n\"Ah, well that old bastard was always a killjoy. You must be Ben. I'm Professor Gerhard\nbut you can just call me Jack. Welcome to ALMA.\" He stuck out his hand. I was floored. This\nwas the guy I was supposed to be working with all summer? Still, my midwestern politeness\ninstincts kicking in, I extended my hand to shake his. He pulled his away and smacked my\noutstretched hand hard with his cane.\n\"You gotta be faster than that to work on my research team. Richard told me you were\nintelligent when he sent you down here. Hah, I told him, brains ain't what they were when we\nwere in school. Back in our day you actually had to know stuff and think about it. Now these\nnewfangled computers try and do it all for us. Well I don't trust em...\"\nHe rambled on as he teetered down the wide hallway, his cane clicking off the marble\nfloors on every other step. Most of the people we passed rolled their eyes as he walked by and\ndidn't give him a second glance. Jack didn't seem to notice or if he did, he didn't mind. His eyes\nswept around the corridor and he opened a small door, and motioned to me to follow him. We\nwalked down a set of concrete stairs into the basement, down through a twisting maze of\ncorridors and tunnels. Down another set of stairs, then through what I assumed to be a steam\ntunnel, through a crumbled hole in the wall, through a machine room. He kept whispering to\nhimself \"Round and round and down and down back to the rabbit hole we go\". I was only 75%\ncertain he was going to murder me down here and no one was ever going to find my body and\nwas about to ask where on earth we were going but then he stopped in front of an ancient\nwooden door with a red \"KEEP OUT: High Voltage\" sign on it. \"Now in here,\" he said pulling a\n\nStephens/Abyss/6\nlarge, old fashion metal key from a gold chain he had around his neck, \"is where we do work.\nWe can't trust those other scientists. They're all crazy. Every last one of them. I don't know\nabout you yet. Richard said you would be okay and I trust him, but you never know.\"\nI was beginning to feel sick. I'm not sure if it was the altitude (going up to 16,000 feet in\na day will do that to you) or if I was just coming to terms with how screwed I was for the\nsummer. Despite what Jack was insisting, I was pretty sure that he was the crazy one. I really\nwished my advisor had warned me that he was sending me off to work with someone who\nbelonged in an old folks home instead of in a lab. Jack rambled on, unaware I had drifted off in\nmy own thoughts.\n\"And here,\" he said throwing open the door with a loud C LANG \"Is where we do all our\nreal work.\" He stepped aside to show me, what looked like a machine room. I was beginning to\nwonder if this was all just a joke, that Jack was just pulling my leg, when he squeezed in between\nthe roaring metal furnace and the big black boiler, into a small space that led to a chamber barely\nbig enough for the two of us to stand. Most of the space was taken up by a large desk, piled high\nwith papers. A small, green desk lamp emitted the only light and cast strange shadows on the\nwalls around us. Stacked on top of the pipes were hundreds of logbooks, each one labeled with a\nmonth and a year. They were dusty, and looked as though they had been there for years. The\nclosest one read May 1953. As I looked at them, I could've sworn I heard a faint hum emanating\nfrom them, though it was probably just the furnace. Jack followed my gaze, and moved to stand\nin front of the books, blocking them from my view.\n\"Those are just old notes,\" he said nonchalantly. \"I don't want you working with those.\nOtherwise you'll realize what a fool I was back then. Anyways, welcome to my lab.\"\n\nStephens/Abyss/7\nI finally found my voice.\n\"You...you work here?\"\n\"Of course my boy, where else would I?\"\n\"But this place has the some of the largest astronomy labs in the world. Richard told me\nyou had a huge lab with several other researchers. Why aren't we in there?\"\n\"I do\" he said flatly. \"But here is better. It's more peaceful. Less chance of getting\ninterrupted by those nasty nasty people\"\n\"What do you mean?\"\n\"Nothing. Nothing at all my boy,\" his tone suddenly cheerful. \"Now, all I need you to do\nis to bring me snacks and coffee and fetch me new pens and such. You can do that right?\"\nI was taken aback. I was a grad student, I mean sure, maybe an undergrad would have to\ndo silly errands, but I nearly had a doctorate, I could at least be productive rather than just snivel\nover not knowing how to read an x-ray response like one of the undergrads that tried working in\nmy lab back home. How dare he expect me to just bring him coffee. I opened my mouth to\nprotest, but he just waved me away.\n\"Go bring me my lunch now kid. Knock on the door when you get back and I'll let you\nin.\" I turned, squeezed back through the passageway, and fetched his lunch like an obedient little\npuppy.\nIt was rather lonely at ALMA. For my first few weeks, all the other researched hated my\nguts. They were here running around like chickens with their heads cut off, trying to make the\nmost of the time they had on the array, and at the same time watch out for other malicious\nresearch groups, while I was lounging around in the cafeteria most of the time, drinking coffee,\n\nStephens/Abyss/8\ndrawing the beautiful desert formations(seriously, the mountains were right out of natural\ngeographic magazine) and for the first time in a while, just enjoying spending time doing\nnothing. Of course, I was sure to make it to every lab squabble. I wouldn't miss those for the\nworld. Soon I began to understand the loose alliances and rivalries between the various teams\nalthough those changed almost daily. The German team, in general, hated the Spanish team that\nwas there because, from what I gathered from the all-too-frequent shout outs, they had\n'accidentally' deleted several months of data from the main computer that hadn't been saved\nelsewhere yet. The Japanese and the other American team seemed to have a loose unspoken\nagreement that they wouldn't do anything more than the occasional prank such as replacing all\nthe pens in the lab with ones that had ink that evaporated a few hours after writing them down.\nUnfortunately for me, all the teams seemed to have it out for me. I was the weird new outsider,\nand they made sure I didn't forget that. I got the silent treatment, the occasional rough elbow in\npassing, and the frequent glare over the shoulder as they ran by. Being from the midwest, I just\nresponded with a jovial wave, or \"good morning\" and got a nice sense of self righteousness from\nit. It was like the time I went to the east coast for a conference in Boston. Everyone was all\ngrumpy and impolite and looked at me like I was an alien when I held open the door for them\nand said \"hello\" or \"excuse me.\" I don't mind people being jerks, so long as I can make them\nrealize it.\nI tried to talk to the staff-local Chileans who lived in the facility with the rest of us-but\nmostly they kept to themselves, didn't speak English, or just didn't want to talk to an outsider\nlike me(like I said, I was real popular with everyone). Only the chef, who I affectionately called\nAbuelita, would talk to me. She was a deeply religious old woman with grey hair she always\n\nStephens/Abyss/9\nwore in a long braid and tanned skin that wrinkled around her eyes and loved telling me stories,\nso long as I was helping out in the kitchen.\n\"Did I ever tell you, child,\" she began, peeling a pile of potatoes swiftly and skillfully\nwith a paring knife, as I fumbled with mine, \"Of the man who saw the Alicanto\" I shook my\nhead no, and she continued. \"A long time ago, there was a tribe of Atacamenos people living\nhere in this desert. They told stories of the Alicanto, a large bird that guided them through to the\nnext life. It was said that the Alicanto's wings would shine during the darkest desert nights, and\ntheir eyes emit strange lights. The presence of the Alicanto meant great fortune for the tribe, but\nto see one, to look one in the eyes was considered terrible luck. The only ones who ever saw the\nAlicanto were driven mad. They say, that if you ever look up into darkest part of the skies, you'll\nsee the fiery lights of the Alicanto's gaze and you'll be doomed to a fate worse than death. For to\nlook into the eyes of the Alicanto is to discover the meaning of everything, to comprehend the\nuniverse in its entirety in a single moment.\" She ended, staring sternly at me as though daring me\nto contradict her. While I personally didn't believe such mythological nonsense, I enjoyed\nhearing Abuelita's stories. It made the time pass faster. She told me the legends of Lola, el\nYastay, the Achaches, the Umpillay, and the Quilpana, and I listened with rapt attention, peeling\nvegetables, chopping up fruit, unloading shipments or anything else she needed me to do (\nAbuelita made me earn those stories).\nFinally, after about a month of being there, the other researchers started talking to me. Of\ncourse, none of them were nearly as friendly as Abuelita though perhaps it was because I wasn't\nnearly as useful to them.\n\nStephens/Abyss/10\n\"Some research you're doing, Ben\" the German woman I saw on my first day chided at\nme. \"Not even crazy Jack wants to work with you. You must be really stupid.\" I smiled, and told\n\nher I was perfectly happy with what I was doing and wished her a nice day. She sulked off. If\nI'm completely honest it did bother me that I didn't get to do any real research, but I sure as hell\nwasn't going to let them know that. The comments, like the dirty looks they shot me, bounced\noff me. I didn't care what a bunch of old geezers said. Though one really got to me. I was sitting\nin my chair in the cafe having just finished lunch, my nose stuck in a book of Chilean myths\nAbuelita had leant me. It was in Spanish, and I was struggling to decode it word by word.\n\"You know what happened to all of Jack's other research assistants, don't ya?,\" The\ndirector said conspiratorially as he slid into the empty chair beside me, placing his heavy work\nboots on the table and leaning back, \"They all went mad. One by one.\" He looked over at me,\nand casually swiped the salt I had spilled earlier into his hand and tossed it over his shoulder.\n\"Oh, really?\" I said unamused, trying not to think too much about what he was saying.\n\"Yeah, I mean a few years ago there were what, at least six of em all working here.\nJack's big project to see what was out there before the big bang. Working on a way to see past\nthis big line in the history of this universe, you know. Well, he claimed to have figured out how\nto find what came before the CMB, you know, all those nearly dead photons from the beginning\nof the universe.\" Of course I knew about the earliest light in the universe. That was my whole\nthesis. If the guy had even bothered to read my profile, he would've known that. But I just\nnodded and smiled and he went on.\n\"Well anyways, there was this patch of sky that Jack was obsessed with. Kept imaging it\nover and over any time his team had the array. He said it held the answer to what he was looking\n\nStephens/Abyss/11\nfor. I mean, we all thought he was a bit mad, even back then. One day, he came into lunch all\nexcited, said one of his assistants had found something that was further away that 15 billion light\nyears and even older than the CMB's. Well, I mean, we were all curious of course, and to be\nhonest, a bit jealous. Everyone wants to be behind the next huge discovery. He was going in to\nverify it when he found the body. The poor kid, he was a fourth grad student just like you. I don't\nknow how he got the gun, but well, it took the cleaning team a while to mop it all up. Of course,\nwe would've just chalked it up as stress and depression if the next day another member of the\nteam simply walked out into the desert with nothing but the clothes on her back. We didn't\nrealize she had left until it was too late. She nearly died of exposure out there overnight. When\nwe finally found her, her face was one I wasn't going to forget in a hurry. She was wide-eyed\nand looked like she had seen a ghost or was possessed or something. It was freaky. Kept\nmuttering about something being impossible\"\n\"Over the next few weeks the rest of the team...\"\n\"Excuse me,\" I said standing up, my stomach in a tight knot. \"I need to go check on\nJack.\"\n\"All I'm saying kid is you don't know what you're getting into,\" he shouted after me.\n\"None of them did. Whatever they discovered changed them and not for the better. You make\nsure stay away from whatever research he tries to rope you into.\"\nI strode swiftly away from the director, my mind whirling dizzily, trying to make sense of\nwhat I had just heard. It was a prank, I decided. They're just trying to scare me. But the look on\nthe director's face was that of a haunted man. It couldn't hurt to ask Jack, I decided. Just to put\n\nStephens/Abyss/12\nmy mind at rest. I knocked on the boiler room door and Jack opened it up for me, ushering me\ninside.\n\"You're not usually in here til noon. What brings you in here?\" He asked peering\nsuspiciously towards me.\n\"I was talking with the director,\" I said in what I hoped was a nonchalant tone. \"He was\ntelling me what happened to your team.\"\n\"Lies. All of it. See they're trying to tell me I'm crazy. Well I think if I were I'd be the\nfirst to know it.\" Jack mumbled looking miffed. \"That's just the stories they tell to scare the new\nfolk. Don't worry. Anything else I can do for you old boy?\"\nI wasn't really convinced, but decided on a different approach. \"Look, can I do some real\nresearch? I mean I've been sitting around most of the day and it's kinda getting boring. I'm sure\nthere's something I could be helping out with. Like digitizing your lab books.\" I reached out to\ntake one of the books off the shelf, but I had barely laid my hand on the leather bound cover\nwhen Jack's stick smacked it away.\n\"OUT!\" He screamed at me, a maniacal look in his eye. I jumped at his violent reaction,\nmy hand smarting from where he had hit me.\n\"NEVER TOUCH THOSE, YOU HEAR ME?,\" Jack shouted, grabbing me by the collar,\nand pushing me out of the room with a surprising amount of force for such an old man. I was\nshocked at this abrupt change in demeanor, but barely had time to process it before I was tossed\ninto the hallway right before the door slammed behind me.\nI didn't see Jack for the next three days. I tried knocking on the door several times before\nfinally giving up. I left a tray of food outside, but he didn't touch it. When I told Abuelita about\n\nStephens/Abyss/13\nhis absence, she sighed, shook her head and said it was probably the Anches, the mythical beasts\nthat roamed the Atacama feeding on the old and weak and speaking of mythical beasts and\nstories, she had more of them back in the kitchen along with a mountain of chickens that needed\nto be deboned should I care to join her.\nWhen I did see him again, he looked even paler than he had when I met him. His skin\nwas sallow and drooping. He looked as though he hadn't slept in days and patches of his wispy\nwhite hair were missing in places, but he acted like nothing had happened. I knew better than to\nbring it up. The next few weeks passed without much incident, though I found Jack answering\nthe door less and less. The contents of the lab books intrigued me, though every time I even\nglanced at them when I in his office, Jack quickly made an excuse for why I had to leave. What\nwas in them that could make him so crazy? Well, I mean beyond his usual crazy. The whole\nmessing up other people's experiments and picking fights was fairly normal here, though I\nnoticed he was doing it with much less enthusiasm and frequency. I tried asking him what was\nwrong, but he shrugged it off, saying it was just old age catching up to him. Everyone else I tried\nto talk to just ignored me or made some comment about how he was always that old and crazy.\nSomething was off, and if he wasn't going to tell me, I was going to find out.\nI asked the janitors if they had a key to the door.\n\"Lo siento, solo hablo espanol, senor,\" he told me. I tried again, my spanish a bit rusty\nfrom the one semester I took it in college. I had hoped being in Chile would give me a chance to\npractice it, but we were thousands of miles from anyone else, and because it was an international\nfacility, most people here conversed in English.\n\nStephens/Abyss/14\n\"No lo tengo, se perdio,\" he said, which either meant I had butchered my question and he\ndidn't tango, or that the key was lost and he didn't have it anymore. I thanked him or said he was\nfunny.\nMy legal means of entering blocked, I took a more illicit approach. I tried picking the\nlock on the door after I knew he had gone to bed, but the old metal door's lock was rusted and far\ntoo intricate for the two paper clips, which broke almost immediately after I had tried to push\nthem in.\nThe same fate met the hairpin I borrowed from Abuelita. \"Now I know what you're going\ndo with it, but I don't wanna know why,\" she warned me when I asked her for one while we\nwere slicing tomatoes. \"Now I know you won't listen to me because you children never do, but\nyou'd do good to remember that some things aren't worth messing around in. Take my son,\nMatias for instance...\" A thirty minute story about her son breaking into a military base just to\nplay pool with his friend and a half bushel of tomatoes later, I had my shiny new hairpin that\nsplit in two after thirty seconds of ramming it into the lock.\nAfter that, I tried sneaking into his room(the dormitory doors being much easier to pick),\nbut he woke up to go to the bathroom as soon as I had entered, and I had to dive behind the\ncouch to avoid being seen. I bashed my shin on the oak coffee table, and it took all the willpower\nin the world not to scream out. My heart was already racing at a thousand beats per minute. I was\nsure Jack would hear it as he tottered back from the toilet. It's a good thing hearing goes with age\nI guess.\nThe near miss in Jack's dormitory made me back off. I was getting in over my head. It\nwas just some silly books after all, not worth getting put on academic probation or expelled.\n\nStephens/Abyss/15\nWhile my time here wouldn't exactly improve my academic career, it could certainly destroy it. I\nresolved myself to put the lab books out of my mind, and work on writing up my thesis draft, so I\nfound it odd, when I found my fingers tapeing the backplate of the boiler room's lock so it would\nstay open even after I closed the door. I knew that I shouldn't try and open it, especially not\nwhen Jack was there. That it would be morally wrong. But the mystery of these books bore\nthrough my mind like a drill, pounding away my last bit of self control.\nSo at 1am that day, when I saw Jack leave his office and head toward the dormitories, I\nsimply opened up the door and walked in. One of the books lay open on the desk. I walked over\nto it and read the entry. It was dated for today, June 26th.\nI have seen what lies at the end. I accept my fate in the universe and will stop fighting it\nand come quietly. Ben, I know you're reading this you nosy bastard, so do yourself and the world\na favor and burn everything in this place. I just wish I had the strength to do so myself, but I'm a\nsentimental old fool and it's my life's work.\nJackson Gerhard\nI stared at the note, trying to make sense of it. But the books, the books were calling for me. I\ncould hear them screaming in my head, begging to be read. They couldn't just burn. Someone\nhad to know. Besides, what could words do? It wasn't as though they were dangerous. I pulled\nthe desk chair, grabbed the first book, and began reading.\nAt first it was very dull, all about the theory behind obtaining older and older pictures of the\nuniverse, how one could theoretically observe what existed beyond the barrier that was the\nbeginning of everything we knew. Theoretical quantum mechanics was never really my thing,\nmostly because it made my head hurt whenever I thought too long about it. I skimmed most of\n\nStephens/Abyss/16\nthe volumes, the ones that didn't cry out to be read. I slowed down once I started the ones from\ntwo years ago. I looked through thousands of images of empty sky, with calculations and\n\nanalysis scratched next to them in blue or green ink and remembered what the director had told\nme: there was this patch of sky that Jack was obsessed with. Kept imaging it over and over. A\nloud pounding brought me out of the books, though they begged and pleaded for my attention.\n\"BEN! Are you in there? Open up!,\" the director's voice called out, punctuated by\npounding on mental. I looked up, debating if I should go out. At least in here I was safe. Here I\nwas with the books and the books needed me. They called out to me. They had to be read. It was\nmy duty. I turned the page. The RA and DEC next to the image showed it was the same patch of\nsky. But this time, there was something there. Something indistinguishable. I bent closer trying\nto see what it was, but I couldn't make anything else out other than a note in the margin written\nin wobbly, loopy cursive: \"EYE?\" I could feel that the answers to everything were in reach, the\nwords were calling to me, that I had to keep going. The books around me were humming,\ncheering me on, pleading with me to keep going. Intrigued, I flipped to the next page, and\nsaw...but it couldn't be. It wasn't possible. But in my heart I knew it was. Not only my in my\nheart, but in my spine, in my nerves, in my skin. Every fiber of my being resonated with the truth\nthat lay before me so clearly on the paper that I wondered how I had not known it before. I bent\ndown to examine it, and heard a far off bang, like a gunshot from miles away. But that didn't\nmatter. I just needed to look into the eyes of the creator that glowed billions of years ago, ice\nblue and fiery hot-for there was no mistaking the shape that seem to lift out of the book itself.\nThis was no catseye supernova. It was unmistakably the eye of the creator. I had never seen\n\nStephens/Abyss/17\nanything like it. It spoke to me, told me to listen and discover my purpose and I knew that if I\njust stared into them everything would be alright. So I did.\n\"Stop...No,\" the words sounded far off, and garbled as though I was underwater or\nhalf-asleep. I blinked, and saw the book slam in front of me. Looking up, I saw the director, a\nlook of panic on his face. I tried to open the book again, but the director snatched it off the table\nand threw it in the boiler fire. Desperate to retrieve it, I got up trying to try and dig it out of the\nflames, but the director caught me and pinned me to the ground, his knee pressing into my\nstomach.\n\"What do you think you're doing kid? You'll burn yourself,\" the director said\nincredulously. But, I thought to myself, in the grand scheme of the universe, is a bit of scorched\nflesh important? The voice of the remaining books chorused a resounding \"NO!\" I tried to shake\noff the director, but he had a firm grip I could not shake. So I had to watch him as he ordered the\njanitor to toss every last book into the fire. As each one sizzled into ash, I felt my soul be ripped\napart. The answers to the universe were in there. I struggled, kicking, biting, screaming, trying to\nbreak free of the director's grip, but he held fast, his whole body weight pinning me against the\nhard concrete. I couldn't move. I could barely breathe. I heard a loud POP! And felt a flash of\npain spasm down my arm. Remotely I realized I had broken a bone or something, but in the\nentire universe, it was only a small number of neurons firing. The only thing that mattered was\nsaving the books.\n\"I'm sorry kid,\" I remember the director saying, and then I fell into darkness. As the light\nfaded away, I could hear the books curse me for failing them.\n*\n*\n*\n\nStephens/Abyss/18\nI woke up on a cold metal table and tried to sit up, but a piercing pain shot down my arm.\n\"Easy there kid,\" the director said. \"You broke your arm. I wouldn't have marked you as\na fighter, but damn son, you've got a mean bit of struggle in ya. I bandaged it up as best I could\nbut the medics are still about 30 minutes out\" he looked down at me and muttered. \"I tried to\nwarn ya kid? Didn't I? Tried to tell you what happened to the rest of them. But you had to try\nand read the damn things yourself.\n\"Wh...wha...what happened?\" I stammered. The pain in my arm was growing and making\nit hard to concentrate.\n\"I don't really know. Well, scientifically speaking at least. And if I were truly a scientist\nat heart I guess I would've tried to keep the books and study them. Figure out what was really\ncausing it. But well, there are legends you know, about the eye of the creator. That it's powerful\nenough to grant a man understanding over the entire universe.\"\n\"You don't believe that sort of thing do you?\" I asked incredulously. Coming from an old\nChilean woman, I could understand, but the director was a man of science. A man of logic.\n\"I'm not sure. I mean, words have power. You must have felt that down in the boiler.\nAnd as for stories, well, what's to say they don't hold some truth. All I know is that after the rest\nof his team left, Jack tried to explain to me how he couldn't explain what he had seen in the lab.\nHow the fact what they saw contradicted everything they'd ever known drove them insane. He\nthen swore to me he had destroyed his research and I foolishly believed him. I never would've\ndreamed he'd keep it down in the old boiler room.\"\n\nStephens/Abyss/19\n\"Where is Jack?\" I asked nervously glancing around the room, though in my gut I already\nknew the answer. The director chose to ignore me and continued on as though I had not said a\nword.\n\"Anyways, I let him stay here. Mostly so I could keep an eye on him, make sure he didn't\ngo mad like the rest of his team. He was different, after sure, but I convinced myself that it was\njust the emotional guilt and pain of losing his team. When you applied to intern here, well, I\nthought it might cheer him up and make him return a bit to reality. You know, come to terms\nwith the past and put it behind him, but I think it just made it worse. Reminded him of the team\nhe had lost...This is all my fault.\" The director buried his hands in his face.\n\"Where is Jack?\" I asked again, this time a bit of panic had entered my voice.\n\"Gone.\"\n\"What do you mean, gone? Gone where?,\" I looked up panicked. The director lifted his\nhead. Tears were glistening around the edges of his bright blue eyes.\n\"He's...dead. Climbed to the top of one of the telescopes and jumped...I couldn't save\nhim. He's dead...and it's all my fault.\" The director broke into huge sobs. It was uncomfortable\nwatching this fully grown behemoth of a man be broken down by the words he had just uttered. I\ndidn't know what to say, or if I even trusted myself to say anything. I was glad when the medics\nfinally arrived and lifted me on the stretcher and drove me to the nearest hospital over an hour\naway. I was diagnosed with a broken arm, internal bruising, and a mild concussion. While I was\nrecovering in the hospital, my things were sent over from ALMA along with a return ticket\nhome.\n\nStephens/Abyss/20\nI'm still trying to wrap my head around the whole thing even though it's been months\nsince I left Chile. Whenever my advisor brings it up, I answer as vaguely as possible. To be\nhonest, sometimes I think I dreamt the whole thing, it seemed so surreal. Some nights I still\ndream about the books scratching on the walls of the furnace, trying to escape. Other nights, I\ndon't sleep at all, and lie awake wondering if some mysteries of the universe are better left\nunknown. On the nights like those, I go up on my roof and look up into the all encompassing\ndarkness, and only then can I find a small bit of solace.\nI've been half-heartedly finishing up my thesis, but even as I stare at my screen hoping\nfor inspiration and motivation to strike me, my mind drifts back to Jack and what he discovered.\nHow everything would've just been better if he had never looked into that patch of sky. I'll never\nknow what Jack expected to see when he gazed out beyond the edge of the universe into the\ngreat abyss, but I bet you it never involved something looking back.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.759 Writing Science Fiction\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Bespoke Ocean, Draft 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-759-writing-science-fiction-spring-2016/a227d72b0ca9898a95987a88201256dd_MIT21W_759S16_Bespoke2.pdf",
      "content": "Baas-Thomas / Bespoke ocean / 1\n2,900 words\nFINAL\nmanuscript recyclable\nBespoke ocean\nGoo kit, it said. Marceline clicked. Nothing else on the black market website Seaward\nHaul seemed very interesting this morning. There were the typical listings: overpriced drugs\nfrom overseas, stolen guns from around the block, ads for deflated sex--the usual. Not much of\nit was worth buying. Most of the drugs were safe enough but there were certainly bad batches\nsynthesized by amateurs like herself. Any quality firearms were only managed by the runners and\ncartels but those were much too expensive, and Marceline had never needed anything more than\nthe pistol she always kept strapped to her leg. And finally, the sex was alright--mostly furnished\nby the many new illegals in the city--but it was simpler and more fun to just go to the Ingot and\nwrap herself around whoever appeared cutest through a blurred gaze and droopy eyelids. She\nnever took them back to her apartment though; she always followed them, raising her eyebrows\nat their tacky decorations.\nMarceline liked the Ingot a lot; they had automated kiosks. The first time she went, she\ntraded a saliva sample for a key fob. The kiosk swallowed her DNA and spat out a profile.\nWhenever she swiped her fob it dispensed an \"engineered\" cocktail with just the right amount of\n!\nMaximilien Baas-Thomas\n\nBaas-Thomas / Bespoke ocean / 2\nbooze, vitamins & minerals, and off-market additives to really get her smashed--a bespoke\npoison. A few hundred bucks passed to the coat check for the management ensured that the\nkiosks dolloped an extra portion for her and, most importantly, that she could carry out her\nbusiness unimpeded for that night.\nMarceline lived for these kinds of things. The magic of molecules bound to her brain in\nthe right place at the right time to allot her just the right amount of pleasure, and the way her\nstill-young body just barely kept up. There was always enough missing knowledge and hidden\nvariables in the mix that the effect of any particular molecule couldn't be perfectly predicted,\nmuch less an amalgam of dozens. Marceline had to experiment with the rest and she was a ready\nsubject. Over the past several years, her life had left only a little bit of damage to her body. Her\nhands shook sometimes, her skin felt a little more numb than when she was little, headaches\ncame and went, and the cuts and bruises from the rare bad dealing took their time to heal, but it\nwas worth it. It's not like there are any good jobs in this witless city anyways, she told herself. It\nwas art, it was business, it was fun; attracted and distracted, she starved less than plenty of other\nartists. And so the road she took led her to the goo kit. She clicked on the listing:\nI work in a govsci lab. The goo's made from a special chem that a friend has been\nworking on. I can't tell you much else. Marceline scrolled down the page. What it does is crazy\nthough, see for yourself: and there she saw a collection of pictures of an industrial lab bench with\nrare and expensive equipment. The ruby-red goo in a beaker sat next to what looked like silicone\ncubes the size of baby blocks. They seemed squishy, like mochi, but some had hairs on them.\nThey also seemed to be drooling. One of them was wrinkled like an eyelid, another looked like\nraw ground beef. Add living matter and see what you can get to grow, oneironaut. Oneironaut--\nshe liked that, an explorer of dreams. The seller had been well-reviewed; the account had sold a\n!\n\nBaas-Thomas / Bespoke ocean / 3\nvariety of other stolen chems before and had never (badly) swindled anyone. She clicked Buy,\nsent the money, and aimed the delivery at her neighbor's address.\nSitting up, setting her computer down, and turning around, she checked the cherub on the\nkitchen counter behind her. It had a pristine nature to it; its smoked white plastic shell with\nchrome buttons looked at home in a kitchen lifestyle magazine, and clashed fiercely with the rest\nof her dirty apartment. The carpet was stained, the black canvas drapes were never opened, the\ncabinet handles were sticky, and the couch--which took up most of the space of the cramped\nliving room--threw up clouds of dust whenever she plopped down onto it. Her couple\nbookshelves held stained textbooks from her college days in chemistry. Mechanical mixing\nutensils--almost dental--lay next to them, unforgotten but unused, and pansy purple sheets\ndraped a bed without a bedroom.\nThe cherub's display read that the next batch of Ш6 would take 374 more minutes until it\nwas ready to be sealed into ampules. The cherub took in \"raw\" chems and squirted out something\nonly a truly burned out basket of brains could qualify as \"refined\". Still, Ш6 was one of\nMarceline's best concoctions and she could sell it on Seaward Haul at $350 per ampule in bulk;\nor sometimes at the Ingot for $800 to anyone who was indiscreet enough to walk up to her and\nask. Designer chems had been outlawed since she was young so they fetched an attractive price.\nUnlocked cherubs like hers--ones where just about anything could be programmed into them--\nwere only legally permitted to the govsci labs and a few universities. Getting the right raw chems\nwas also a hassle of its own and required some lucky connections. All told, it was an expensive\nand risky enterprise, but for the past few months--especially now that she had finally nailed\ndown a non-emetic menu--it was paying for itself. Someday though, Ш6 would be old hat and\n!\n\nBaas-Thomas / Bespoke ocean / 4\nshe'd have to figure out the next big thing. She thought maybe the goo would point her to\nsomething more interesting.\nMarceline looked up from the cherub and around her living room. It was small, it was\nstagnant, and it could use some light, but she couldn't risk anyone peering in. The drone of the\nliving room window air conditioner was loud and it struggled to cough out cool air. She closed\nher computer on the bargain coffee table and went to bed, holster still on her leg. Between\nsecuring her next pick-up of raw chems and aliquoting the Ш6 into ampules, it took her two days\nto be ready to sell the newly finished batch. These days, work just felt like work; her apartment\nfelt like a factory.\nTwo hot afternoons later, the goo kit arrived at the doorstep next to hers in an apple-sized\nbox. It was disguised as a laundry detergent sample pack and contained the promised sealed\nplastic baggie of pale red powder, along with a list of a few other simple chems to add and\ndirections to be programmed into the cherub. Nine hundred and sixty-nine minutes: easy time to\nkill. She set the cherub to work and headed to the Ingot with half of her ampules and an\noptimistic skip in her step.\nShe swiped her fob and began her hadal plunge into the familiar depths of the Ingot's\nconcoctions. Time splashed away--the lights of a conscious ocean surface faded as she sank into\nthe volcanic smell of the Ingot, into tides of limp bodies and crashing waves of sound, into a vast\noasis in an otherwise dusty and painful world. Her ampules sold themselves reflexively to\nwhoever drifted up to her and tried to catch her eye: ampules out, money in, all between the\nbeats. The Ingot swelled up and its maw never closed.\nEventually Marceline resurfaced at home, washed up on the shore of her couch, finding\nherself staring blankly at one of her posters, red and black. She stood up, woozy, and ate a bite of\n!\n\nBaas-Thomas / Bespoke ocean / 5\nsomething without checking the expiration date. The cherub was still obediently humming away\nand the breeze of the air conditioner was stale. Her hands were shaking more than usual. She\nchecked her jacket pockets, counted that she had made rent, and splashed, exhausted, into her\nbed. Her dreams all blended into one and time rippled out slowly into empty, quiet rest.\nMarceline heard two fog horn blasts and her eyes lurched open. At the sound of two more\nkitchen timer beeps, she rubbed her eyes and saw the cherub was finished. The goo sat in a glass\ncup, its own elasticity curving it into the shape of an egg. Onyx black, darker than dark. It didn't\nsmell like much, other than perhaps faint notes of acetone. It jiggled slightly when she rocked the\ncup, but it looked dry.\nShe closed her eyes and excitement welled up. She didn't live in a factory anymore; she\nfaced the blank white canvas, the empty yellow page, the still air of the black dance studio, and\nthe blue sky blowing down from the tops of sacred mountains. Possibilities flooded into her mind\nand she leaned her elbows onto the kitchen counter, set her head between her hands, and began to\ndream of the soul she and the cherub were to breathe into existence. Ш6 was getting too easy and\nshe wanted to astound and to be astounded. She had learned all her life to be creative, to be bold,\nand to not look back. She closed her eyes again. She is who is.\nAdd living matter and see what you can get to grow, oneironaut. Marceline took a knife\nfrom her drawer and cut into the middle of the goo; one gash forged the womb. She took the\nknife to her palm and grasped it; a hot trickle of blood dripped from her hand off her wrist; one\ngash sowed the seed. She oversaw as the onyx goo slowly oozed around the tiny ruby puddle--a\nsmoldering red sun in a terrible black sky. The valley she had carved resealed itself and the goo\nshowed no sign of the wound. She implanted the cup and the egg back into the cherub and\npressed its stainless buttons. The cherub chirped that the incubation would continue on to t = inf.\n!\n\nBaas-Thomas / Bespoke ocean / 6\nMarceline wrapped her hand in gauze and smiled. Her skin was more numb than when\nshe was little. She opened her computer and found a few Ш6 orders waiting in her inbox on\nSeaward Haul. She took the ampules and got to work; she'd find something to eat out in the city.\nThree hours later her products had been dropped into mailboxes across the city, and she was back\nhome launching up clouds of dust on her couch. It was broiling outside, but the fiery sun was\nfinally starting to set, and dust drifted through shafts of light like specks in the sea.\nShe peered into the warm cherub and saw that the goo had bubbled up to form a regular\npattern on its surface, transforming into a something which looked like a black apple-sized berry.\nBetween each plump drupelet drooped little tendrils like those of an anemone. Its surface slowly\npulsed, wrinkled, and rippled. It was alive. Raw, wet, unripe, and immature, but somehow clearly\nalive. Marceline smiled widely, amazed. She turned up the humidity and the cherub chirped in\ncompliance.\nThe next day the tendrils surged into viny tubes like intestines, veined and peristaltic in\nmotion. The pattern of drupelets distorted itself and the berry grew lopsided. Rigid beams of\nkeratin reached out and cemented the mass to the cup and the inside walls of the cherub. The\ninternal compartment of the cherub was flooded with an rancid urine-colored liquid and its\noutward vent was sweating with rotten humidity. The stench was a tantrum: yeasty, piercing, and\nacidic. Marceline moved the cherub next to the kitchen window and let the hot air of the city\nflood in. The cherub would need some deep cleaning, but that wasn't a big deal; she finally felt\nstimulated and ecstatic in a way she hadn't since Ш4 and Ш5 almost a year ago. She could feel\nsomething great looming over her horizon, something awful and awesome, something\nblasphemous and absurd. This is what she lived for.\n!\n\nBaas-Thomas / Bespoke ocean / 7\nOr it would just shrivel up and die, but either way, she wasn't going to give up. The\noutside heat swept into her apartment as her wheezing air conditioner languished behind. She lay\ndown on her bed, cocooned in the warmth of the earth, as the cherub's innards churned and fed\nthe tumor growing inside it. Marceline imagined her heart beating in unison with whatever soul\ngestated in her kitchen as she drifted off to sleep in the doldrums of deep-colored dreams.\nOn the morning of the third day, she awoke to a fresh morning breeze. She ran to the\ncherub to inspect its progress. The berry of goo and the cup had been engulfed by the keratinous\noutgrowths, which started to fill the inside of the cherub to capacity. The liquid had all dried and\nthe outside of what now looked like a huge spider's egg was crusted and flaked white. Marceline\nsuspected the time was nigh and she decided to stay in her apartment, waiting to witness the\nmoment the life awoke from its prenatal slumber. She jumped onto the couch, giddy as the dust\nspewed upward swirled in circles in the open window's breeze; she opened her computer,\npeering back at the cherub every several minutes.\nIt was before lunchtime that she heard one of the intake fans on the cherub suddenly spin\nup violently. She swung around to the kitchen counter and saw its insides completely stuffed by\nthe keratinous mass. Flakes and strings of the matter were spilling out of its vents. She smiled\nwidely, showing all her teeth as her chest swelled with anticipation. She waited for the cherub to\nopen and for the egg to peel apart and hatch. A moment later, the cherub started to rock side to\nside and then tipped over. Marceline reached out to set it upright, but the cherub's exterior shell\nwas searing hot. She pulled her hand away and the cherub started to beep and whine in\nmechanical pain and terror, its display filling with blood. A look of panic twisted her eyebrows\nupwards as she wrenched its electrical plug from the wall socket and stepped back to other side\nof the kitchen. Her hand, shaking, gravitated towards her holster. The cherub's display went dark\n!\n\nBaas-Thomas / Bespoke ocean / 8\nas it jolted itself across the counter, like a swallowed monster fighting to crack free. Marceline\ncaught a glimpse of the seams and seals of the cherub beginning to split as it rolled itself right\nout the kitchen window.\nMarceline leaped up onto the kitchen counter and peered four stories down at the empty\nparking lot below. She saw a crash, the cherub smashing asunder and the keratinous mass, now a\nbit bigger than a watermelon, rolling off into some dried bushes. She flew out the apartment\ndoor, down the stairs, and around the corner to behind her building, under the kitchen window.\nThe cherub confetti was sprawled across the asphalt lot, heralding the birth of a new horror. She\ndidn't have time to think as her eye caught a shadow zipping past off to the side. Her hand swung\nfor her gun as the shadow pounced out of the bushes. She felt a sting of fire shoot up her left leg\nand looked down to see a girl. Time trickled to a halt and her eyes opened wide.\nOr at least its head was like that of a girl; its hair was mousy but its mouth was too wide.\nMarceline felt dizzy. Its mouth was too wide and it had too many teeth, each pointing in a\ndifferent direction. Marceline's vision started to blur, and that single second stretched out into a\nnarrow sea. Its body was wrinkled like an eyelid and its skin was similarly pale to hers, but\npatchy with matted fur and keratin dandruff. Her left knee buckled, she felt winded. Its legs, oh\nso many legs, all seemed to shift and slide across and over its contorting body. Marceline drew\nthe gun from its holster on her right thigh as she fell backwards onto the rough, hot pavement.\nShe wanted to throw up, to melt away, to wake up, but she had no strength left, no breath to\nscream.\nThe girl's face looked up at Marceline, a few of its prehensile legs wrapping themselves\naround her as it released her left leg from its mouth. Marceline's skin was more numb than when\nshe was little, but the pain had sucked everything from her body. The horror pounced up onto\n!\n\nBaas-Thomas / Bespoke ocean / 9\nher, heavy, its legs stretching all out and over her, enveloping her. Its face was like raw ground\nbeef and the ruby-red blood from Marceline's leg dripped out from the gaps in its Cheshire grin\nand down onto her chest. Marceline's eyelids flickered down, the lights were going out. Rallying\na last gasp of air, she plunged the gun into the hadal doom and pulled the trigger, but her gun\nwhispered only a click--the piece of Seaward Haul trash.\nIts teeth kissed into her neck. Its eyes were inky pools and as Marceline's eyes shut\nthemselves, she dove into their depths. Its breathing sounded like the ocean and she smelled the\nsea breeze, cradled and finally cool. Time drained out into infinity.\n!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21W.759 Writing Science Fiction\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}