{
  "course_name": "Writing About Literature: Writing About Love",
  "course_description": "This course is designed around analyzing intimate bonds and the permutations of heartbreak. Through the analysis of a set of relations in novels, short stories, poetry, music videos, and live theatre, we will consider the transformative states of the lover’s (un)becoming, for how consciousness is constituted by bonds yet how the lover transcends crisis in the moment of the epiphany that surfaces in love’s very failure; indeed, love itself becomes narcissistically yet optimistically illuminating, even in its oppressive hold.",
  "topics": [
    "Humanities",
    "Literature",
    "Criticism",
    "Drama",
    "Fiction",
    "Poetry",
    "Humanities",
    "Literature",
    "Criticism",
    "Drama",
    "Fiction",
    "Poetry"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nNo formal prerequisites however, students should do the following to prepare for the course:\n\nSee the music video by Sia, titled \"\nElastic Heart\n\" feat. Shia LaBeouf & Maddie Ziegler\n\nListen to YouTube lecture by Judith Butler called \"\nSpeaking of Rage and Grief\n\"\n\nRead two chapters from Herman Melville's\nMoby Dick\n: Chapter 4, \"\nThe Counterpane\n\" and Chapter 72, \"\nThe Monkey-Rope\n\"\n\nCourse Description\n\nFrom the beginning, we are already in the hands of the other, a thrilling and terrifying way to begin.\n- Judith Butler\n\n\"Read for love,\" as Seulghee Lee suggests, which is what we'll do in this course that is designed around analyzing\nintimate bonds\nand the permutations of\nheartbreak\n. How is love characterized on the fictional page and screen? And what might the lover's break-up and his/her spinning into narcissistic despair teach us about the self and how we love? \"Who am I without you?\" as Judith Butler prods us to ask, and we might very well turn to Emily Dickinson's pessimism, \"Parting is all we need to know of hell.\" Confounding us still is Shakespeare's query, \"What 'tis to love?\" and we often turn to Chaucer's courtly dictum as an answer, \"Love is blind.\" Now, Facebook offers us even more chaos: \"It's complicated.\" What of reading for love for only its optimism?\n\nThrough the analysis of a set of relations in novels, short stories, poetry, music videos, and live theatre, we will consider the transformative states of the lover's (un)becoming, for how consciousness is constituted by bonds yet how the lover transcends crisis in the moment of the epiphany that surfaces in love's very failure; indeed, love itself becomes narcissistically yet optimistically illuminating, even in its oppressive hold.\n\nThe course's primary goal is to turn students into responsible readers, critical thinkers, and clever writers. Through the selected archive that traverses genres, periods and cultures in order to investigate more broadly racial love, gendered love, and queer love, as a class we will carefully reflect on the relationship between wooing-author and swooning-reader, that is as a bond that relates to you as a writer and me and your classmates as your readers. On your pages, too, there may surface a playful flirtation, (false) promises, a tantrum or two, passion, intimacy, heartache, sarcasm, even humor. Essentially, in this course, you will write for love.\n\nConversation & Attendance\n\nImagine our class like a book club, and based on the idea of a semester-long conversation on one theme--\nlove\n--that will lead us to many other topics, but also, how we might approach love by actually\nwriting\nabout its representations on and off the page. The class can only succeed if each of us commits to conversation--to listening and valuing the unique perspective that each of us brings--and to this end, attendance is mandatory.\n\nCI-HW Subjects\n\nCI-HW\nsubjects are a subset of CI-H\nsubjects and conform to the CI-H requirement that students complete a minimum of 5,000 words of polished writing, revise an essay based on feedback, and develop facility in oral presentations and discussions. CI-HW subjects concentrate particularly on writing and revising.\n\nBook List\n\nFitzgerald, F. Scott.\nThe Great Gatsby\n. Scribner, 2004. ISBN: 9780743273565. [Preview with\nGoogle Books\n]\n\nBechdel, Alison.\nFun Home: A Family Tragicomic\n. Reprint edition. Mariner Books, 2007. ISBN: 9780618871711. [Preview with\nGoogle Books\n]\n\nMorrison, Toni.\nBeloved\n. Reprint edition. Vintage, 2004. ISBN: 9781400033416.\n\nMelville, Herman.\nBenito Cereno\n. CreateSpace Independent Publishing Platform, 2016. ISBN: 9781536864175. [Preview with\nGoogle Books\n]\n\nCisneros, Sandra.\nWoman Hollering Creek: And Other Stories\n. Vintage, 1992. ISBN: 9780679738565.\n\nDiaz, Junot.\nThis Is How You Lose Her\n. Reprint edition. Riverhead Books, 2013. ISBN: 9781594631771. [Preview with\nGoogle Books\n]\n\nHarris, Joseph.\nRewriting: How To Do Things with Texts\n. Utah State University Press, 2006. ISBN: 9780874216424. [Preview with\nGoogle Books\n]\n\nGardner, Janet E.\nReading and Writing About Literature: A Portable Guide\n. 3rd edition. Bedford/St. Martin's, 2012. ISBN: 9781457606496. [Preview with\nGoogle Books\n]\n\nAnd A Musical\n\nDirected by Diane Paulus, with music and lyrics by Sara Bareilles,\nWaitress\n(funded by\nMIT School of Humanities, Arts, & Social Sciences\n)\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nA Love Letter & Close Readings\n\n10%\n\nEssay 1\n\n20%\n\nEssay 2\n\n20%\n\nEssay 3\n\n15%\n\nPortfolio\n\n15%\n\nPresentation\n\n10%",
  "files": []
}