{
  "course_name": "Writing and Rhetoric: Designing Meaning",
  "course_description": "This course takes rhetoric as a system for designing meaning that helps us understand complex situations and ideas, enlighten and persuade others to act, and thus reshape our world. We’ll study rhetoric systematically and empirically, both analyzing how it works on us as readers, and testing how we can make informed rhetorical choices as we design our own texts.",
  "topics": [
    "Humanities",
    "Literature",
    "Criticism",
    "Nonfiction Prose",
    "Rhetoric",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Communication",
    "Humanities",
    "Literature",
    "Criticism",
    "Nonfiction Prose",
    "Rhetoric",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Communication"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 2 hours / session\n\nPrerequisites\n\nThere are no prequisites for this course.\n\nCourse Description\n\nMichael Hyde and Craig Smith, prominent scholars of contemporary rhetoric, emphasize that \"the primordial function of rhetoric is to 'make-known' meaning both to oneself and to others. Meaning is derived by a human being in and through the interpretive understanding of reality. Rhetoric is the process of making known that meaning.\" (1979)\n\nThis course takes rhetoric as a system for designing meaning that helps us understand complex situations and ideas, enlighten and persuade others to act, and thus reshape our world. We'll study rhetoric systematically and empirically, both analyzing how it works on us as readers, and testing how we can make informed rhetorical choices as we design our own texts. Through reading contemporary rhetorical theory and evaluating practices of rhetoric--in political speeches, debates, and visual images--we'll study rhetoric as a body of knowledge that offers a means of developing persuasive arguments, a method of analyzing written, oral, and visual texts, and a mode of human inquiry. Along the way we'll consider how rhetoric shapes issues such as political and cultural beliefs, the acceptance or rejection of new technologies, policies on energy and economics; in short, we'll investigate how rhetoric shapes our material world. We'll write analyses that consider how other writers use rhetoric, and we'll apply rhetorical principles as we construct our own persuasive arguments, both written and oral. Throughout the semester, we'll investigate rhetoric in a weekly \"rhetoric laboratory,\" in which we'll investigate and experiment with tools of rhetorical analysis, design, and production.\n\nCourse Requirements\n\nThree essays, a speech, a debate, and an oral presentation. Each essay must be revised at least once. The speech, debate, and oral presentation will be accompanied by a meta-analysis of the rhetorical choices that informed the design of the presentation. (1st: 1000 words; 2nd: 1250 words; 3rd: 1750 words; meta-analyses: 250-500 words). All essays and drafts must use MLA style for formatting text and referencing sources.\n\nEach essay will be graded according to the following scale:\n\nA: Exceptional, focused argument presented in a thoughtfully structured essay, fully developed with vivid, sufficient evidence and compelling analysis, and written with excellent style, grammar, and mechanics.\n\nB: Very good ideas developed in a logical and appropriate structure, with interesting evidence and strong analysis, written with proper grammar and mechanics.\n\nC: Satisfactory ideas supported with adequate evidence, structured clearly on both a sentence and essay-level.\n\nD: Work with insufficient or unsatisfactory development, focus, evidence, structure, or style.\n\nF: Work that exhibits serious deficiencies in focus, evidence, structure, or style; incomplete work of any level.\n\nConferences\n\nFor each essay, you will have a private conference with me between the draft and the revision, so that we can discuss your ideas, and the structure, content, and mechanics of your essay. This is the time for you to ask questions, seek guidance on how to develop your rhetorical knowledge and abilities, develop your argument, and clarify your meaning. You should come to conference prepared to participate in a discussion about seriously revising your draft.\n\nOther opportunities for individual help with your writing (for MIT students)\n\nThere are two more ways to receive outside help with your writing. The first is by coming to my office hours. When you come to office hours, I will expect you to be prepared to discuss the ideas you're considering writing about, the revisions you plan to make, or problems or questions you have about assignments or the writing process. The other avenue for help with your writing is the\nWriting and Communication Center\n, which offers\nfree\none-on-one professional advice from lecturers who are published writers about all types of academic, creative, and professional writing and about all aspects of oral presentations.\n\nClass attendance and preparation (for MIT students)\n\nThis is a small class and active participation is essential. Attendance is mandatory, and only fully prepared and active attendance meets the attendance requirement: More than three unexcused absences will result in your course grade being lowered; more than five will result in your being withdrawn from the course. Lateness for class, if extreme or chronic, will be counted as an absence.\n\nPolicy on Academic Integrity\n\nAcademic integrity is the foundation of all scholarship, because being able to trace how our ideas have developed in relation to other people's theories, research, and evidence, as well as our own, is what ensures the soundness of our research. Thus university communities have a collective investment in ensuring that the practices of academic integrity are thoroughly learned and carefully practiced. In this CI-HW\nsubject, we'll study many features of academic argument that will help you to understand how scholars make use of sources, and distinguish their own ideas from those of other scholars. You'll learn to read sources carefully, to assess their validity and usefulness to your own thinking, to use some kinds of sources as evidence that you'll analyze and argue about, and other kinds of sources as a theoretical foundation or counterargument to extend or deepen your own ideas about a subject. You will also learn the mechanics of source use: how to accurately quote, paraphrase, and cite sources according to one of the common systems of citation.\n\nAs members of this class and the larger scholarly community you are expected to abide by the norms of academic integrity. Everything you submit must be your own work, written specifically for this class. While a good deal of collaboration is encouraged in and out of class, all sources--of ideas as well as words and images, whether from a friend, a text, or the internet--must be acknowledged according to the conventions of academic citation. Willful disregard for these conventions--i.e., plagiarism--can result in withdrawal from the course with a grade of F, and/or suspension or expulsion from the Institute. For more information about policies and practices, please refer to the\nMIT Policy on Academic Integrity\n.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nFirst essay\n\n20% (5% for the draft + 15% for the revision)\n\nSecond essay\n\n25%\n\nThird essay\n\n30%\n\nSpeech\n\n5%\n\nOral presentation\n\n5%\n\nMeta-analyses (one each for the speech, debate, and oral presentation)\n\n5%\n\nClass participation, debate, workshop reviews, and laboratory notebook\n\n10%",
  "files": [
    {
      "category": "Resource",
      "title": "MIT21W_016F16_Essay1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-016-writing-and-rhetoric-designing-meaning-fall-2016/287fe47a8e78df71f0f510789d287ad2_MIT21W_016F16_Essay1.pdf",
      "content": "21W.016 Essay 1 Assignment: Argument Analysis\nThe Next Four Years of Values\nOn January 20, 2009, Barack Obama delivered his Presidential Inaugural Address.\nMarking the 44th president's beginning as the leader of the United States of America, Obama\nspoke about what he envisions the country should be like. This speech sets the stage for Obama\nto create an improved union. In the address, Obama highlights the successes in America's past\nusing Stasis Theory's \"cause\" stasis and emphasizes new changes for the present through the\n\"policy\" stasis to underscore the necessary values for the fighters of a better America.\nTo begin, Obama explains why he is up there. He mentions that there have now been 44\npresidents who have taken the oath, and that establishes his reason for standing in front of his\nfellow Americans. Furthermore, he expresses gratitude for the Americans because they were the\nones who indirectly allowed him to step on that podium and deliver the address. With these\nacknowledgements, Obama has used ethos, which are features that makes a rhetor more credible,\nto establish his authority as president (Selzer 284). He establishes that he was the one chosen to\nbe up there, hoping to gain America's attention for the remainder of the speech and their support\nfor his plans for the future.\nThroughout the entire speech, Obama also creates a concept pair regarding time. Concept\npairs, as described by Scott Consigny, are related to the \"Art of Topics\" when someone uses the\ncorrect arrangement of a few ideas to produce a persuasive point (Consigny 182). The \"past\nversus present\" concept pair inserts a juxtaposition that helps Obama establish a point and\nstructure his speech. Although he does not have a fix past-present-future structure, he flows\nfrom time to time quite well by extracting the successful aspects of the past and the present and\nexplaining how to develop them for the future. In talking about the past, Obama praises the men\n\nand women who have put in the labor and sacrificed to improve lives of future generations. He\nputs the work of the Founding Fathers in positive light, and he suggests the \"we are ready to lead\nonce more\" (Obama). Obama believes that the past has led its people, and he hopes to continue\nthat for the present. He wants to persuade America to retain the values and ideals that have made\nAmerica rise up as a powerful nation.\nThis \"past versus present\" concept pair uses Stasis Theory's stasis of \"cause\" to\nemphasize America's past fighters and founding leaders. Obama mentions that Americans have\nbeen using the ideals of its forebearers, such as maintaining an \"enduring spirit\" and pursuing a\n\"full measure of happiness\" (Obama). The words \"enduring\" and \"full measure\" illustrate the\nreasons why America is at its current successful state. This demonstrates the stasis of \"cause.\" In\nStasis Theory, there are multiple stages--fact, definition, cause, value, and policy--that are\nentered when discussing an idea (Fahnestock 428). In this case, the \"cause\" stasis helps Obama\nconnect the past forebearers to the present because they are why America is the way it is today.\nObama discusses a lot about the past and the impact forebearers had on the country, which may\nhave weakened the arguments since this is an Inaugural Address that should highlight his hopes\nfor the next four years--not the past. Despite that, however, this use of the \"cause\" stasis allows\nObama to give the forebearers recognition for the building of America, which appealed to ethos\nto give his speech more credibility while setting up the transition into the present and future.\nMeanwhile, Obama also wants modifications to the past in the \"past versus present\"\nconcept pair by creating new plans for the future, which he conveys through the \"policy\" stasis\nof Stasis Theory. By jumping into the stasis of \"policy\" with this, he urges people to realize that\nhe wants to help America take action. While the past has values that he highly respects, he does\nnot believe that the current state of America is where it should be. He wants to fix problems such\n\nas less creative and innovative minds, narrowed interests, and lowered confidence in people\n(Obama). Mentioning this during his Inaugural Address implies that his presidency is the time to\nmake changes. Despite the remarks of critics who do not believe that his goals are achievable,\nObama demonstrates his confidence through two sentences: \"All this we can do. All this we will\ndo\" (Obama). The succinctness in these two short sentences helps appeal to ethos, giving the\naudience trust that Obama will push forward the modifications he wants for the future. Whether\ndiscussing the past that he honors or mentioning the present that needs changes, Obama\nsuccessfully weaves the stasis of \"policy\" into the concept pair to persuade people about his\ndesires for his presidency.\nWith the constant references to the past and the present, Obama uses the appeal of ethos\nwith the word \"we.\" In talking about the past, he indicates that the forebearers have helped shape\nAmerica, and he specifically emphasizes that \"We the People\" have continued to follow the\nforebearers' ideals. When discussing the present and future throughout the speech, Obama uses\n\"we\" as a linkage word between him and his fellow Americans. Instead of using \"you\" or \"I\" to\nrefer to the people or himself, he uses \"we\" to say that he and the people of America are one\nentity--they're all Americans who want the best for the country. This is a powerful way of\ngaining the audience's support with ethos. When he mentions that \"we\" have remained faithful\nto what the forebearers established, he uses ethos for people to agree that the forebearers deserve\nthe recognition he gives them. In fact, the word, \"we,\" would appeal to ethos to ensure that\nAmericans will agree with Obama for the rest of the speech because he is one of the many\nAmericans he is addressing. The repetition of the word \"we\" makes Obama, someone who is\nserving his people, appear to be a credible, approachable, and understanding leader.\n\nUsing \"we\" also adds another layer of importance to the speech, for it invokes several\nuses of active voice. As mentioned by Dr. Annabelle Lukin, who describes the role of grammar\nin rhetoric, the active voice and passive voice can highlight the agency or story of a sentence\n(Lukin). Different voices and grammar structures can achieve various goals (Lukin). Whether\nObama says \"we are the keepers of this legacy\" or \"we will defeat [former foes],\" he is certain\nthat America will take action (Obama). The subject of these sentences containing active voices is\nthe American population. In other words, Obama believes that the story of America is the story\nof \"we.\" Obama wants to address the Americans. He acknowledges America's past by indicating\nthat \"we\" have stayed faithful to their beliefs, refers to America's current status by mentioning\nthat \"we\" are still the most powerful nation, and says that \"we will do\" when discussing\nAmerica's to-do list for the future. He wants them to know that he will help shape the story of\nAmerica.\nWith so many hopes for the future, there are cynics who question whether his changes are\nviable, and this prompts Obama to introduce a new idea of \"cynics versus fighters.\" Cynics do\nnot believe in the revisions that Obama desires for his nation. Fighters are the people who have\nfought in the past, fight in the present, and will fight in the future. Although Obama does not use\nthe concept pair of \"cynics verses fighters\" throughout the entire speech, which may weaken his\nclaims about the two groups, he clearly expresses his hope to be a fighter. In order to support his\ncase for being a fighter who will achieve the goals that he established, Obama appeals to logos\nand pathos. He uses logos, which are features that use reasoning, by explaining that cynics are\nunreasonable (Selzer 284). He logically argues that the cynics have forgotten what this great\ncountry has already achieved in the past, and he believes that they simply fail to understand the\nproblems that the nation needs to address (Obama). Meanwhile, he mentions fighters and their\n\nvalues. This appeals to pathos, which are persuasive features that creates urgency for the\naudience, for values and morals can resonate with the audience and cause it to take action for the\nchanges Obama hopes to implement (Selzer 284).\nObama's choice to use pathos with the \"cynics versus fighters\" concept pair exemplifies\nan excellent use of the stasis of \"value.\" In Stasis Theory, \"value\" comes before \"policy\"\nbecause it is necessary to set up the same values before defining policies (Fahnestock 428). Thus,\nObama connects with the people based on morals anyone should hold and uses that to shape his\npolicies for the next four years. By mentioning that the people of America should have values\nsuch as \"kindness,\" \"selflessness,\" \"courage,\" and \"willingness,\" Obama makes a connection\nwith people based on basic morals (Obama). In order to be a fighter for a better America, Obama\nbelieves that these values, which America already contains, are incredibly important. He wants\nAmerica to support him with these shared values. He even sets up his goal of his speech to be for\nAmerica to develop better values as a nation. Through the use of ethos and pathos, the \"past\nversus present\" concept pair, and the fighters and cynics contrast, Obama persuasively introduces\nnew values for America to embody. This will prepare America for the policies under Obama.\nWith these new values that the success of America relies on, there are also duties for the\npeople. Obama appeals to pathos and logos to logically argue that people should retain the values\nof the country to attack every difficult task that is presented. The speech then goes full circle\nwith the title, \"What is Required, The Price and Promise of Citizenship\" by mentioning that\nthese duties are the price and promise of citizenship (Obama). The use of the word \"citizenship\"\nhelps unite all of America to increase support for Obama. Moreover, by going back full circle\nand discussing what the title of the speech is, Obama presents the speech as a way of providing\nAmerica with the values and duties that they should have for a better union.\n\nBy the end of the speech, Obama has reached his goal: to instill trust into his fellow\nAmericans and communicate the expectations he has for his nation. This success was achieved\nthrough the linkage of the \"cause\" stasis of Stasis Theory that highlighted the past of America\nand the \"policy\" stasis that pinpointed the necessary actions for the future. By praising fighters in\nAmerica as people who hold good values, Obama also use the stasis of \"value\" to further\nemphasize his point. With such a powerful Inaugural Address, Obama successfully puts\nAmericans in the same mindset to stress certain values. Obama is on that stage as the new\npresident to help his people change for the future. He wants people to know that.\n\nWorks Cited\nConsigny, Scott. \"Rhetoric and Its Situations.\" (n.d.): n. pag. Print.\nFahnestock, Jeanne, and Marie Secor. \"The Stases in Scientific and Literary Argument.\" Written\nCommunication (1988): 427-43. The Stases in Scientific and Literary Argument.\nSage Journals. Web. 21 Sept. 2016. <http://wcx.sagepub.com/content/5/4/427>.\nLukin, Annabelle. \"Reporting War: Grammar as Covert Operation.\" Forum for Australian\nIslamic Relations, n.d. Web. 26 Sept. 2016.\nObama, Barack Hussein. \"First Presidential Inaugural Address.\" First Presidential Inaugural\nAddress. Capitol, Washington D.C. 20 Jan. 2009.American Rhetoric. Web. 26 Sept.\n2016.\nSelzer, Jack. \"Rhetorical Analysis: Understanding How Texts Persuade Readers.\" What Writing\nDoes and How It Does It: An Introduction To Analyzing Texts and Textual\nPractices (2004): 279-308. Print.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21W.016 Writing and Rhetoric: Designing Meaning\nFall 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21W_016F16_Essay2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-016-writing-and-rhetoric-designing-meaning-fall-2016/5309d614700fdd7746d3b2ffcf8318b8_MIT21W_016F16_Essay2.pdf",
      "content": "Analysis of Trump v. Clinton debate on Gun Control\nDuring this year's Third Presidential Debate, Chris Wallace of Fox News opened up a discussion about\nthe issue of gun control in the United States. The candidate's views on gun control was one of the top\nvoted questions for the debate, and so the discussion was opened up for both Donald Trump and Hillary\nClinton to make a clear and final clarification of their views and suggest policies that they would or\nwould not enact. Despite the framing of the questions within the debate, the nature of the topic, and\nTrump's lack of debate experience, Clinton delivered a strong argument by employing strong rhetorical\ntechniques. The Democratic candidate won the debate due to her ability to re-‐open stases, make strong\nappeals to pathos, and construct backed up claims using Toulmin's structure, resulting in a clear\npresentation of values and policies on the issue of gun control. Unfortunately, despite her expert use of\nrhetorical tools, the debate fails to work as a whole, as opportunities for clash are missed and potential\narguments dismissed by both the Moderator and the Republican Candidate.\nThe debate begins with a question to Clinton about her position o the second amendment and the\nSupreme Court's application of it. The Moderator (Wallace) questions her views by contrasting two\nquotes, one said by Clinton last year, \"the Supreme Court is wrong on the 2nd amendment\", and the\nother by late republican Supreme Court justice Scalia, in which he said that the court ruled that there\nwas a constitutional right to bear arms, but a right that is reasonably limited. After presenting both\nquotes, Wallace asks the question, \"what's wrong with that?\". This question is based in the stasis of\nvalue, as it requires Clinton to state her position and clarify her opinion on whether the supreme court\nwas correct in their decision. Within a debate, it is useful to work through the five stases: fact,\ndefinition, value, policy and procedure; as it help describe the logic inherent in the development of an\nargument (Fahnestock, Secor 1988). The way the question is phrased, however, highlights the first\nhurdle Clinton must overcome. Wallace frames the questions in a negative light which doubts Clinton's\nviews and requires her to defend her position. Instead of asking a more neutral question such as, \"do\nyou still hold this opinion?\", or even \"why are you right?\", the Moderator's question requires Clinton to\nexplain herself before building on her position, putting her a step back in the debate.\nTo move the debate back towards a positive light, and present her values in her own words, Clinton\nanswers in three strategical stages: She defines her position of the issue of gun control, states the\nreason for policies and what they should be, and clarifies her stance on the Supreme Court decision. She\nmust re-‐open the stasis of value, and close it before moving onto the stasis of policy, to ensure the\naudience is happy with her logic.\nClinton is clear when defining her position within the stasis of value. She states \"I support the second\namendment\" and makes an argument from the position-‐to-‐know argument scheme to back this up.\nClinton does this by providing her history of living in Arkansas and representing Upstate New York as an\nexample to show that she \"understand[s] and respect[s] the tradition of gun ownership\". By providing\nan example of where she's lived, she shows herself as being in a position to know about the gun issues,\nand can therefore provide an opinion that can be believed by the audience.\nShe uses this same background and position to know to introduce her belief in \"reasonable regulations\".\nClinton uses the statistic of 33,000 annual deaths due to guns to strengthen her suggestion of policies,\nwhich she reads through briefly, as she wants to focus on the reason for policies rather than their exact\n\nnature. Never the less, her policies (comprehensive background checks, closing the online loophole and\nclosing the gun show loophole) are clear and well defined in an attempt to close the stasis of policy.\nTo counter the Moderators negatively bias question about the Supreme Court Decision, Clinton gives a\ndirect and well defined response. She creates a micro-‐argument to back up her claim that the Supreme\nCourt was wrong in their use of the second amendment in the Heller case. To strengthen her claim,\nClinton follows Toulmin's structure, which suggests that data and warrants are needed to strengthen the\nvalidity of a claim (Toulmin 1922). Clinton makes her claim based from the data that the District of\nColumbia was trying to protect toddlers from guns. She warrants her claim, that the Supreme Court was\nwrong in their application of the second amendment, by stating that the District of Columbia wanted a\nreasonable regulation to be put in place, which was for guns to be stored safely. Stating that the\nregulation was reasonable shows the audience her logical step leading to the claim that the court was\nwrong not to allow the regulation. She additionally provides a reservation, \"but they've accepted many\nothers\", to support the claim that they were wrong in this one case, but not in all of them. This\nreservation further strengthens the validity of her claim. Presenting this micro-‐argument allows Clinton\nto state that she agrees with the Supreme Court in other cases when judge Scalia's words \"a right that is\nreasonably limited\" are followed.\nThe Moderator introduces Trump into the discussion at this point. He asks Trump about how he will\nensure the second amendment is protected, and whether Clintons answer was persuasive. There is a\nclear contrast between the tone of this question presented to Trump and the previous one given to\nClinton, highlighting the fundamental problem with the nature of this topic. The 2nd Amendment is a\ntroublesome topic for Democrats who wish to introduce policies such as safety checks, yet an easy topic\nfor Republicans who strongly believe that the amendment should have no restrictions. This is due to the\nopinion shared by many citizens, that the wording of the 2nd is clear and there is no place for policies to\nrestrict gun ownership or a citizens 'right to bear arms'. The means that questions directed to right-‐wing\nrepublicans never question their values, as a politician following the exact words of the 2nd amendment\nshouldn't be doubted... whereas a democrat attempting to restrict the extent of the amendment should\nbe met with speculation and scrutinized for questioning the constitution. This attitude is evident when\ncomparing the questions given to both Trump and Clinton. Wallace's phrasing is much more positive\ntowards the Republican candidate, and gives Trump the opportunity to talk within the stasis of policy\nand convince the audience of how he will 'protect' the amendment. More over, the question allows\nTrump to easily dismiss Clinton's views and build upon his own position rather than waste time\nexplaining or defending his views like Clinton had to. Simply from the phrasing of the question Trump is\ngiven an advantage in the discussion.\nInstead of using this opportunity to strengthen his position and close the stasis of policy, However,\nTrump focusses purely on Clinton's previous answer and provides a weak rebuttal. It is clear that\nTrump's message is that he was not persuaded by Clinton's answer, due to her reaction after the\ndecision was made by the Supreme Court. He describes Clinton's reaction as very, very angry. An\nargument he makes from position to know, which he claims he has as \"[he] watched\" her reaction at the\ntime. His position-‐to-‐know argument is much weaker than Clinton's in her previous response because of\nthe evidence used. Trump claims he saw a reaction, whereas Clinton talks about her 17 years in\nArkansas, a much stronger set of evidence. Trump's main rhetorical tool within his answer is his strong\nappeal to pathos. He focusses on the extreme reaction of Clinton, and introduces the effect this had on\nthose who believe in the second amendment, which caused them to be \"very upset\".\n\nTrump's first response showcases another weakness in this debate. His lack of experience in this\nsituation resulted in the debate failing to provide strong arguments, and a loss of clash among stases. By\nnot continuing in the same stasis as the question, he stops the flow of the debate, which would see the\nmoderator move the candidates to specific stases for clash to occur. Trump doesn't strengthen his\nvalues or policies and fails to state how he will uphold the 2nd amendment. And instead of providing\nwarrants for his own claims which Clinton could respond to, he only explaines why she was not\npersuasive. The failure of clash prevents the candidates from employing questions against argument\nschemes, which would provide an interesting and strong debate.\nWhen Wallace returns to Clinton, he asks another negatively bias questions \"were you extremely\nupset?\" (Questions of the same nature but asked more neutrally could have been: \"How upset were\nyou?\" Or \"Does Donald persuade you?\" Allowing for an equal and unbiased debate.)\nClinton clarifies that she was upset, but supports this by mentioning that \"toddlers injure themselves,\neven kill people\". By highlighting the young affected by lack of gun control she is appealing to the\nemotions of the audience, and makes an arguments from negative consequences as she shows what\nhappens when there aren't \"reasonable regulations\". Once she gives reason to her emotions, and\ntherefore re-‐instates her values, she moves on to her claim that there is no \"conflict with sensible,\ncommon sense regulation\" and supporting the second amendment. In fact, in her previous answer she\nmade this claim pre-‐emtively, and backed it up with the Supreme Court's expert opinion, that the right is\nreasonably limited. She takes this opportunity to move to the stasis of policy again, stating her wish for\n\"people to come together... to protect and defend the second amendment... in a way that tries to save\nsome of these 33,000 lives that we lose every year.\" While her policy lacks much detail, she is clear with\nwhat she wants to achieve.\nWhen the Moderator turns to Trump for the final answer in the discussion, he asks \"You support a\nnational right-‐to-‐carry law. Why, Sir?\" Once again, the framing of the question determines how the\ncandidate answers. If it is negatively bias, the candidate must provide an explanation, if positively bias,\nthe candidate only needs to agree with the moderator to strengthen their position.\nRather than make an unwarranted claim that gun control results in gun violence, it would have been\nstronger for Trump to support and elaborate his values as asked. Trump provides no answer to the\ndirected question. Instead, he delivers a claim that clashes with the policies supported by Clinton. He\nuses data from the example of Chicago, where there have been tough gun laws, to claim that laws result\nin violence. Unlike Clinton's claim, however, there is no warrant or qualifier or any reservation. Trump\njumps from the data, to the claim: \"So, we have the toughest laws and you have tremendous gun\nviolence.\" His lack of expert opinion or specific statistics in this case hurt his claim, and leave it un\nsupported. Trump then moves to the stasis of policy, as asked in the previous question. His policy is\nquick and basic, with little information, but one that comes from the argument scheme of positive\nconsequences. His logic is: Appoint justices who feel strongly about the second amendment, and it will\nnot be damaged. Trump finishes his response without ever answering the directed question.\nBy following the flow of stases, it is unfortunate to see that there was little clash among the stasis of\nvalue or policy. This is due to Trump's lack of debate experience and failure to address the questions\nbeing asked. Clinton, on the other hand, provided strong use of rhetoric. She re-‐opened and closed\nstases with ease and provided logical and warranted claims, another rhetorical tool that Trump used\npoorly. Clinton's responses become even more impressive when we understand the hurdles she had to\n\novercome within this debate - specifically the nature of the topic and phrasing of the questions. Clinton\ndelivers strong reasoning for her values and presents possible policies, unlike Trump, who never\nprovides explanation for his views. This results in the audience having a better understanding, and\ntherefore a higher chance of being persuaded by Clinton's values which demonstrates that her skilled\nuse of rhetorical techniques won her the debate, even if the debate itself wasn't very strong.\nWork Cited\nClinton, Hillary. \"The Final Trump Clinton Debate Transcript\" Washington Post, Oct. 19. 2016. Web.\nTrump, Donald. \"The Final Trump Clinton Debate Transcript\" Washington Post, Oct. 19. 2016. Web.\nWallace, Chris. \"The Final Trump Clinton Debate Transcript\" Washington Post, Oct. 19. 2016. Web.\nFahnestock, J., and M. Secor. \"The Stases in Scientific and Literary Argument.\" Written Communication\n5.4 (1988): 427-‐43. Web.\nToulmin, Stephen. \"The Layout of Arguments\" Professing the New Rhetorics 105-‐125. (1922) Print.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21W.016 Writing and Rhetoric: Designing Meaning\nFall 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21W_016F16_Essay3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-016-writing-and-rhetoric-designing-meaning-fall-2016/e4e753e64d3e297ccf08b518d446236c_MIT21W_016F16_Essay3.pdf",
      "content": "21W.016: Designing Meaning Essay 3\nA Community of a Thousand Influences\nThe Massachusetts Institute of Technology (MIT) is a research institution that constructs\nmany messages about itself through its homepage (mit.edu). Whether it is through words or\nimages, MIT has always associated itself with excellence and innovation because of its ability to\neducate students and its impressive breakthroughs in various fields. MIT is about knowns and\nunknowns, learning and researching, and education and discovery. After the exploration of the\n2016 homepages, especially the homepages from September 2016 to November 2016, there is\nanother common theme present. Although MIT is an institution full of impressive education and\ntechnical research, this institution is also an accessible community that has a magnificent amount\nof influence on society. This is seen through the use of a \"known vs. unknown\" concept and an\nidentification mechanism.\nAt MIT, there are contrasts between known and unknown factors in experiments and\nstudies, allowing for a \"known vs. unknown\" concept pair. Concept pairs, as\ndescribed by Scott Consigny, help a rhetor produce a persuasive point with\nthe correct arrangement of a few ideas (Consigny 182). In the case with MIT,\nthe arrangement of what is \"known\" at MIT is juxtaposed with what is\n\"unknown,\" and this contrast paints a clearer picture of the influence that\nMIT has on society. MIT shows the \"known\" side of the concept pair by\ndisplaying elements about education. For example, in the image of Professor\n!\"#$%& ()'!%*+\nJeffrey Grossman teaching solid-state chemistry in a lecture hall from\n,*-&+.&% (/0 12(3)\n456+78& *9 :;&\nNovember 18, 2016, knowledge and knowns are seen through the\n7;<=\">68 >;&+\">68\n=:%$>:$%& 6?@ .86>A\n.*6%@'B%\":\"?#C\nbackground chalkboards full of chemical formulas and the physical chemical\nDE*$%:&=< *9 FGHC I=&@\nB\":; 7&%+\"==\"*?CJ\n\nstructures that are present in the photograph (MIT Spotlight). Moreover, the idea of a professor is\na metaphor for knowledge, for professors are known to deliver information. Education and\nknowledge are usually associated with learning and teachers. The use of metaphors is seen\nthroughout many of the other homepages, as metaphors condense large-scale concepts into\nsmaller ones that are more tangible for an audience. Furthermore, the different successful results\nproduced under MIT also display a wide range of knowledge and knowns, for the end products\nconvey the success and skills present at this institution. Thus, it is evident that the \"knowns\" in\nthe \"known vs. unknown\" concept pair underscore MIT's success with faculty and products that\nare changing people and society.\nThe wide range of knowns conveyed through the homepages also has another effect, for\nthe knowledge appeals to ethos and establishes credibility for any audience. MIT, as implied by\nits name, is a research institution that assists its students in developing interests in science,\ntechnology, engineering, math, and humanities. By demonstrating its\nknowledge and excellence through passionate professors, advanced\nlabs, and remarkable products, MIT appeals to ethos. This excellence\ncan be shown through the photograph from November 18 of Professor\nGrossman teaching from a low and unplanned angle (MIT Spotlight).\nThe genuine smile reveals that the professor teaches with passion and\nspirit, indicating that the MIT faculty does care about the quality of\nstudents' education and knowledge. Excellence is also displayed\nthrough a photograph of an organized laboratory with clean\nmicroscopes and white lab coats on October 24, 2016 (MIT Spotlight).\nLabs in the photo bring to light the technicality and hard work that is pursued at MIT. The white\n!\"#$%& 1) !%*+ ,*-&+.&% (/0\n12(3)'K%*9&==*% L%*==+6? \"='\n:&6>;\"?# B\":; 6 =+\"8& 6?@ ;6?@\n#&=:$%&=C DE*$%:&=< *9 FGHC I=&@\nB\":; 7&%+\"==\"*?CJ\n\nand clean conditions in the photo also show the sharpness and focus of MIT's education. These\nexamples of skills and excellence at MIT appeal to ethos because the audience is shown that MIT\nhandles problems very seriously and uses technical approaches to achieve practical solutions.\nWith its finished products, such as an airplane wing or nanosensors, and knowledge spreading all\nover the world, MIT achieves credibility. This allows the audience to obtain a better sense about\nthe influence this institution has.\nHowever, MIT is not only about \"knowns\" and achievements, especially because it is\nmainly the \"unknowns\" that make MIT a research community. Although MIT is able to obtain\nmultitudes of accomplishments within different fields, those accomplishments have been\npossible because of the exploration of the \"unknowns.\" The cutting-edge research that occurs on\na daily basis along with the uncertainty that comes with problems that MIT researchers face\nhighlight the importance of the \"unknown.\" This uncertainty is seen through many of the\nhomepage images. For instance, the image from October 24 with the two people in the laboratory\ncontains elements that can create a feeling of ambiguity (MIT Spotlight). First, the yellow\nbackground light provokes\nquestions in an audience's\nmind, for it would make\nsense that a laboratory be\nlit and bright. However,\nthe choice to use a gold-\nyellow light places the\nresearchers in a more\nunknown position, and it\n!\"#$%& ()'!%*+ M>:*.&% 1N0 12(3)'HB* %&=&6%>;&%= 6%& >*886.*%6:\"?# \"? 6 86.*%6:*%<C\nDE*$%:&=< *9 FGHC I=&@ B\":; 7&%+\"==\"*?CJ\n\ncontributes to the \"unknown\" part of the concept pair. Furthermore, the blank lined paper on the\ntable is near the focus of the photograph, and the lack of writing on the paper stimulates more\nuncertainty. With the light and paper, the laboratory presents many unclear and indefinite\nfeelings of the work done at MIT. The idea of uncertainty is also evident in many of the other\nhomepages. Besides people and research, products are also depicted through animations, such as\nthe one about computer screenings on September 22, 2016. This animation contains a child and\nmother painted in a dark and intimidating purple, showing the thought-provoking unknowns at\nMIT (MIT Spotlight). As can be seen, there are also many factors of ambiguity that are present\non the MIT homepages.\nThe ambiguity and uncertainty conveyed on the homepages also serve to convey the\ncommunication and influences that MIT embodies.\nAlthough it is effective to show the \"knowns\" present\nat MIT to explain how this institution is capable of\ninfluencing society through professors and products,\nit is even more powerful when MIT reveals and works\ntowards the \"unknowns\" to create a larger impact for\nother communities. The main reason why the\n!\"#$%& 1)'!%*+ O&7:&+.&% 110 12(3)'P? 6?\"+6:\"*?\n>*?:6\"?\"?# :B* =;6@*B='6?@ >*?:%6=: .&:B&&? @6%A\n7$%78& 6?@ <&88*BC DE*$%:&=< *9 FGHC I=&@ B\":;\n\"unknown\" picture creates a stronger message is that\n7&%+\"==\"*?CJ\nwhen there are unknowns, there is also the idea of research and communication, and that is the\nonly way that solutions are achieved. For example, in the October 24th photograph of the serious\nand focused researchers in the lab, the female in the photo is doing a lot of hand gestures to the\nmale in the lab coat. These hand gestures indicate a communication of ideas, which is especially\nimportant when there are so many unknowns and problems needed to be solved. Additionally, in\n\nthe animation from September 22, there is a speech bubble, and the mother and child are on a\nfloor full of alphabet letters. The child is also pointing to the mother's bag. With the simple\nspeech bubbles, alphabet letters, and pointing from the child, MIT is conveying an idea about\nchildren and speaking. This is confirmed by the photo's caption about MIT producing computer\nsystems that may help detect early child speech disorders. MIT is able to successfully show their\ncomplex ideas through simple images. From these two examples and many other homepage\nimages, it is evident that the students and faculty at MIT are constantly working together to\ncommunicate ideas, and the easy-to-understand animations that are open to the public\ndemonstrate how MIT is an accessible institution that is willing to communicate its knowns and\nunknowns. MIT does excellent research to influence society with the knowns, while also\ncommunicating with and impacting the public through the unknowns.\nHowever, the \"knowns\" and \"unknowns\" at MIT are not two separate components of the\ninstitution, for they can be connected to paint a clearer picture of MIT as a community. On one\nhand, MIT is about education; it spreads its wide range of knowledge of definitions and facts\nabout this world. This is the material that the faculty teaches students, whether it is through hand\ngestures, physical structures, or blackboards. At the same time, there is a research aspect. As a\nresult of all the unknowns at MIT, there is a push for more research and discovery to positively\ninfluence society. Uncertainty in certain fields is the reason why there is research at MIT, and\nresearch is the linking factor between the unknowns and knowns. MIT is about both teaching and\nexploration; it a community about both education and research. Whether it is spreading\nknowledge to students in education or discovering new ideas to help society through research,\nMIT has a tremendous influence on society. The institution is a community that collaborates to\n\ngo from the unknowns to the knowns by emphasizing values such as communication, teamwork,\nand impact.\nAs MIT delivers a consistent message about its influence as a community on other\ncommunities, the values that MIT emphasizes appeal to the audience in a form of identification.\nAccording to Kenneth Burke, rhetoric can work through identification, for rhetoric can connect a\nrhetor and an audience based on their experiences (Burke). With the different messages about\ninnovation, community, and impact that the MIT conveys about the itself, there are forms of\nidentification that connect MIT and its audience. The idea of communication and influence from\nMIT is emphasized through idealistic identification. Idealistic identification is identification\nthrough values, beliefs, or cultural tastes (Burke). Because MIT has values that allow it to\npositively impact communities through the use of impeccable communication skills, people also\nend up acknowledging the importance of MIT's role in society. Communication and influence\nare ideals that most people value and hope to embody, and the presence of those ideas on the\nhomepage makes MIT more appealing to the audience. This is significant since MIT would want\nto construct a positive image of itself to the public. Thus, because the public can identify the\nvalues that MIT construct on its homepages, MIT is able to effectively deliver messages about\ncommunity and influence.\nAs can be seen, whether MIT is a college about education or an institution about research,\nthere is an overwhelming theme about community and influence that ties together everything\nabout MIT on its homepages. This theme is conveyed to the audience through the \"known vs.\nunknown\" concept pair that the links college and research institution into a large community of\ncommunication. These values of community and communication further appeal to the audience,\nas the audience is able to connect with MIT through idealistic identification. All in all, MIT is a\n\ncommunity of professors influencing students, mentors influencing research, and researchers\ninfluencing technology. MIT's positive impact on society is what makes it a top-notch institution.\nWorks Cited\nBurke, Kenneth. A Rhetoric of Motives. Berkeley: U of California, 1969. Print.\nConsigny, Scott. \"Rhetoric and Its Situations.\" (n.d.): n. pag. Print.\nFahnestock, Jeanne, and Marie Secor. \"The Stases in Scientific and Literary Argument.\" Written\nCommunication (1988): 427-43. The Stases in Scientific and Literary Argument. Sage Journals.\nWeb. 21 Sept. 2016. <http://wcx.sagepub.com/content/5/4/427>.\n\"November 2016.\" MIT Spotlight Archive. MIT, n.d. Web. 11 Dec. 2016.\n<http://spotlight.mit.edu/archive/2016/11/>.\"\nOctober 2016.\" MIT Spotlight Archive. MIT, n.d. Web. 11 Dec. 2016.\n<http://spotlight.mit.edu/archive/2016/10/>.\n\"September 2016.\" MIT Spotlight Archive. MIT, n.d. Web. 11 Dec. 2016.\n<http://spotlight.mit.edu/archive/2016/9/>.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21W.016 Writing and Rhetoric: Designing Meaning\nFall 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21W_016F16_Debate101",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-016-writing-and-rhetoric-designing-meaning-fall-2016/e5739d6570a5bbd8e2501f2037f51e96_MIT21W_016F16_Debate101.pdf",
      "content": "Debate 101:\n10 Steps to Successful Debating\n\nStep 1: Analyze the type of\nproposition you are debating\n- Claims are the starting point of\nargument.\n- Different Types of Claims entail\ndifferent obligations and require different\ntypes of support.\n- Compare \"You should believe X\" to \"We\nshould do X\" to \"X should be the general\npolicy\"\n\nIdentify the potentially open stases\n- Fact: X is Y, X was Y, X will be Y.\n- Definition: X falls in category Y; X is\nunderstood to mean Y\n- Causation: X causes Y; X stems from Y\n- Value: X is Good, X is more valuable\nthan Y. Normally includes an ethical\ndimension.\n- Policy: We should or should not do X.\n\nStep 2: Define Relevant Terms\n- Provide definitions of key terms if there\nis risk of misunderstanding.\n- For policy claims, you can operationally\ndefine terms with a specific proposal.\n- Be careful in your use of persuasive\ndefinitions. Normally Pro side (or\n\"Affirmative\") has right to define, but\nCon (or \"Negative\") can challenge if\ndefinitions are unfair.\n\nMore about definition\nAristotelian definition:\nAn X is a class name with these attributes--\ne.g., a bed is furniture used for sleeping\nPersuasive definition:\nA non-neutral X=Y relationship embedded in a\nconcept phrase--e.g. \"tax relief,\" \"crony\ncapitalism,\" \"trickle-down economics\"\n\nStep 3: Organize & Number\n- Debate is an analytical process. It is\npersuasion through reasoning.\n- Your responsibility is to advance clear,\nsupported arguments to support your\nside. Numbering/outlining is key.\nARGUMENTATION SCHEMES and\nTOULMIN can help here\n\nStep 4: Go with the Flow\n- \"Flowing\" is debate terminology for\ntaking notes of debate interaction.\n- Divide your note pad into 4 columns:\n- Prop ➔ Opp ➔ Prop ➔ Opp\n- Flowing is just a way of tracking how\narguments \"flow\" in the debate: What is\nsaid (or not said) in response to what.\n\nDebate Flow\n- Allows your audience to track the\ninteraction between the debaters.\n- Allows you to note which of your\narguments have been answered, which\nhave been \"dropped.\"\n- Also useful as a predictive map of which\narguments your opponents might use\nand in which order\n\nSample Flow (partial)\n(c) Source unknown. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/help/faq-fair-use/\n\nStep 5: Know Your Speaker Duties\n- 4 minutes Prop side presentation\n- 4 minutes Opp side presentation\n- 4 minutes Prop side's further\narguments + rebuttal\n- 4 minutes Opp side's further arguments\n+ rebuttal\n- Each presenter can be questioned twice\nfor 15 seconds each\n- audience vote\n\nInitial presentations\nOrder your arguments in a hierarchy--\nwhich are your best available means of\npersuasion?\nHow much time do you want to allot to\neach?\nWhich critical questions are your\nopponents likely to ask?\n\nRebuttal Speeches\n- 4 minutes Pro side's rebuttal\n- 4 minutes Con side's rebuttal\nargumentatively, important both to extend\nyour original arguments & reply/rebut\nthose of your opponents. Thus, need to\nanticipate opponents' arguments.\n\nStep 6: Construct Your Case\n- A \"case\" is simply your set of arguments\npro or contra the proposition / topic.\n- Should be organized into numbered\npoints; each point should be supported\nby reasoning and evidence.\n\nForms of Reasoning\n-Expert Opinion\n-Position to Know\n-Analogy\n-Sign\n-Positive consequences\n-Negative consequences\n-Correlation to cause\n-Verbal classification\n\nEvidence\n- Quality of evidence is key: Whether\nquoting expert opinion, or data provided\nby researchers, be sure to explain why\nyour source is credible.\n- Resolving an evidential dispute is a\nvaluable skill: Explain why your source\nis superior to your opponent's.\n\nStep 7: Rebut your Opponent\n- Rebuttal speeches require double duty:\nYou need to defend your case but also\nreply to your opponents.\n- Various ways to reply, but the two most\ncommon are to Refute their point as\nfalse; or Admit their point but claim it\ndoesn't support their overall case.\n\nStep 8: Provide Criteria\n- By \"criteria,\" we mean a way to resolve\nthe issue. A heuristic for argument\nanalysis & resolution.\n\nPolicy Case Approaches\n- Two primary approaches:\n- Problem ➔ Solution\nShow a need that your policy meets.\n- Comparative Advantages:\nShow how your policy offers a better\nsituation than we have without it.\n\nContra / Negative Approaches\n- Policy is not really Needed.\n- Policy does not really provide the\nadvantages or meet the needs claimed.\n- Policy would cause disadvantages that\nwould outweigh any good the policy\nmight provide.\n\nStep 9: Recognize the Role of\nValues\n- All policy propositions involve\nunderlying values.\n- There are many ethical and value-\noriented theories & norms. The\nchallenge is getting on the same page.\n- The key is to identify your ethical\nframework and be ready to defend it.\n\nValue v. Value\n1) One value maximizes another agreed-upon\nvalue; i.e., one value is a key to another\n(Economic justice facilitates peace).\n2) One value is a prerequisite for the other; i.e.,\nX is a necessary condition for Y.\n3) One value is more important than the other,\ndue to magnitude, frequency, or precedent.\n\nStep 10: See Debate\nas a Means to Truth\n- Since the ancient Greeks started to\nformalize the process of philosophical\ndiscussion known as dialegesthai, we\nhave understood dialogue & debate as\na cooperative exercise in seeking the\ntruth.\n- Give it your best shot, but be prepared\nto let you mind be changed!\n\nLegal Analogy\n- Both sides in legal disputes must\nprovide full disclosure of the arguments\n& evidence they will provide. That is\nbecause the goal is Truth.\n- Similarly, full disclosure should be your\ngoal as well. See your counterparts as\ncollaborators, not \"the enemy.\"\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21W.016 Writing and Rhetoric: Designing Meaning\nFall 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw/mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21W_016F16_DesignMeaning",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-016-writing-and-rhetoric-designing-meaning-fall-2016/faf96a4c5d2b071802ccb3534f87afef_MIT21W_016F16_DesignMeaning.pdf",
      "content": "Designing Meaning\nWhat is the meaning of MIT?\n\nHow does the home page\nrepresent MIT?\n- What is selected, highlighted, and emphasized in\nthese images?\n- What is deflected, hidden and missing in these\nimages?\n\nYour challenge:\nDesign an image that presents a new perspecHve on\nMIT, or represents a facet of MIT that is currently\nmissing or deflected by the MIT homepage\n\nDesign Thinking is a Process\n(c) Hasso PlaJner InsHtute\nof Design at Stanford\nUniversity. All rights\nreserved. This content is\nexcluded from our CreaHve\nCommons license. For\nmore informaHon, see\nhJp://ocw.mit.edu/help/\nfaq-‐fair-‐use/\n\nThe process can be adapted to\ndifferent contexts\n(c) Source unknown. All rights reserved. This content is excluded from our CreaHve\nCommons license. For more informaHon, see hJp://ocw.mit.edu/help/faq-‐fair-‐use/\n\nTo design MIT, first understand\n\nMIT\nUnderstand what MIT is, what it does, how it does it,\nwho does it, and why\n\nStep 1: Empathize/Examine\nWhat \"stories\" of MIT do you hear o9en from\nclassmates, teammates, dormmates, faculty, etc.?\nWhat do people do and say at/about MIT?\nWhat do people think of MIT? How do people feel\nabout MIT?\nLISTEN to your classmates!\n\nStep 1 beyond the classroom:\nEngage with a wide variety of people, in many\ndifferent locaHons and contexts around MIT\nInterview, interact, quesHon, and observe. Listen for\nstories. Take pictures.\nTake notes--what do people say, think, feel, and do?\n\nEmpathy Map: What do people\nsay, think, feel, and do?\n(c) Source unknown. All rights reserved. This content is excluded from\nour CreaHve Commons license. For more informaHon, see\nhJp://ocw.mit.edu/help/faq-‐fair-‐use/\n\nStep 2: Understand/Define\nLook for paJerns:\nWhat terms/concepts were common?\nWhat scenes, actors, agents, acHons were common?\nWhat physical objects were common?\n\nStep 2: Understand/Define\nWhat tensions or contradicHons exist in those\nstories, or between stories?\nWhat has surprised you most about MIT?\nWhat do you \"see\" of MIT (literally or\nmetaphorically) that others may not?\n\nStep 3: Ideate--How might we\nshow\nBrainstorm: generate as many concrete ideas, good and bad,\nas you can. Do Not Edit or CriHque--use the impulse to\nchange one idea as a launch for the next idea. Captur\neverything.\nWhere, how, and with whom \"MIT\" happens?\nHow MIT feels?\nWhat MIT does?\nWhat makes MIT work?\n\nStep 4: Prototype/Experiment\nStart drawing/building--turn the ideas into concrete\nimages. Do not make this\nsecond version of the ideate\nphase\nKeep the work low-‐resoluHon. Resist the urge to\ncomplete and perfec any prototype image\nMake many prototype images--and be conscious of\nwhich \"variables\" you're changing in each (e.g., whether\na \"who\" or a \"what\" is represented; which \"whos\" are\nrepresented, which \"where\" is represented, etc.)\n\nStep 5: Test/Dis@ll/Refine\nLet others interact with your prototype(s) without\nguiding them\nAsk: \"tell me what you're thinking as you look at this\"\nNote: posiHves/alignments wit design\nQuesHons, confusions, misunderstandings\nSuggesHons/ideas for changes\nNew ideas that develop\n\nStep 6: Storytelling and Delivery\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21W.016 Writing and Rhetoric: Designing Meaning\nFall 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw/mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21W_016F16_LogicPersuasion",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21w-016-writing-and-rhetoric-designing-meaning-fall-2016/2a55cf3c2c8211b43d03f895679eaa2f_MIT21W_016F16_LogicPersuasion.pdf",
      "content": "21W.016: Designing Meaning\n\nCultural, Historical\nText--Logos\nand Social Context\nSpeaker/Writer-Ethos\nAudience-Pathos\nAll images are in the public domain.\n\nAudience's\ninitial position\nLogos\nEthos\nPathos\nSpeaker's position\n\nXL pipeline project? What should we do about climate change?\nFact\nwhat happened?\n--what is this?\nFact\nwhat happ\n--what is this?\nExamples: is the ivory-billed woodpecker extinct? What nutrients do carrots provide?\nWhat was the cost of the American Revolution?\nDefinition--what kind of thing is this? (links the concrete to the\nconceptual, or places a thing in a classification system)\nExamples: what does this text say about (i.e., how is it implicitly defining) equality,\nmasculinity, individualism, the American Dream? Does this defendant's action fit the\ndefinition of rape? Should this area be classified as a wetlands?\nCausation--What are the causes, effects, or consequences of this?\nExamples: what caused this outbreak of bird flu? What effect does the history of\nsegregation have on present demographics? What is the influence of environment\non psychology? Why did this plan fail or succeed?\nValue--How should we evaluate or judge it?\nExamples: Is person X a good role model? Which film should win the Academy\nAwards? What's the best process for refining uranium?\nPolicy or Action--what should we do because of this?\nExamples: why should we vote for this candidate? Should we approve the Keystone\n\ne.g.-- \"Climate change is just a theory; there's\nno scientific consensus\" argues that the fact\nstasis is still open, and thus no policy debate\ncan occur\nExcept . . .\n\n! \"Judges make surprisingly little use of verbal indicators of logical\nstructure, and often use obscure or vague indicators\n\"J dges make s rprisingl\nlittle\nse of\nerbal indicators o\n! Judges present only some pieces of the arguments, expecting the\nreader to fill in the rest\n! The pieces necessarily appear in the text in a \"disrupted\" order,\ncompared with their proper relationships in the argument\nstructure\n! When producing their written judgements, judges have multiple\npurposes in addition to clearly conveying a complex structure;\nand the argument is intermingled, in the text, with other material\n! Judges may be more focused on conveying the conceptual\nessence of the argument than the full argument structure.\"\nvan Gelder, 2010\n\nSyllogism\nSocrates is a man\nAll men are mortal\nThus, Socrates is mortal\n\nSyllogism\nSocrates is a man\nAll men are mortal\nThus, Socrates is mortal\nDeductive reasoning\nValid or invalid\nLeads to Truth\n\nSocrates is a man, and thus, mortal.\nSocrates is a man, and thus, has a y chromosome.\nSocrates's y chromosome. . .\nSocrates is a man, and thus, won't ask for\ndirections.\n\nYolanda's grandfather has white hair.\nJohn's grandfather has white hair.\nBecky's grandfather has white hair.\nJulio's grandfather has white hair.\nGrandfathers have white hair. (all? As a general\nrule? For this sample set?)\nWhite-haired men are grandfathers.\nThat white-haired man with Abdul must be his\ngrandfather.\n\nConstruct a\ngeneralization\nNotice a\npattern\nC\nt\nt\nN ti\nState a \"truth\"\nabout an\nindividual\ncase\nWhat was the source of the\noriginal generalization?\nHow well did the generalization\nfit the evidence?\nUse the\ngeneralization\nHow similar is this case\nas a premise\nto the original ones?\nElide the\ngeneralization\nin an\nenthymeme\n\nToulmin's Model of Argumentation (c) Source unknown. All rights\nreserved. This content is excluded from our Creative Commons license.\nFor more information, see http://ocw.mit.edu/help/faq-fair-use/\n\nToulmin's Structure Map (c) Source unknown. All rights\nreserved. This content is excluded from our Creative\nCommons license. For more information, see http://\nocw.mit.edu/help/faq-fair-use/\n\nFig. 3: The layout of arguments: example \"weather forecast\".\nSource: Werner Ulrich, adapted from Toulmin, Stephen. An Introduction to\nReasoning. 2nd edition. Pearson, 1984, p. 124.\n\nData\nQualifier\nClaim\n1 million animals are\nSo, except for\nAnimals should\nkilled each year in\ntreatments\nnot be used to test\ncosmetics testing\nof diseases,\nskin treatments\nRebuttal: human lives matter\nmore than animal lives\nWarrant\nAnimal lives should matter more than profits\nBacking\nStudies have shown that companies use animals\nto reduce the cost of tests\n\nData\nThe man with Abdul\nhas white hair\nQualifier\nClaim\nSo, presumably, The man is Abdul's\ngrandfather.\nWarrant\nMost white-haired men with\nmy classmates are grandfathers\nBacking\nBased on my several observations\nof the white-haired men related\nto my classmates AND a general\ncorrelation of white hair with age\nc\n\nClaim: The man is Abdul's grandfather\nFact 1: The man has white hair\nFact 2: The man is with Abdul's grandmother\nFact 3: This is bring your grandfather to school\nday\nFact 4: Abdul called him \"grandpa.\"\n\nAristotle: Rhetoric is finding in any situation\nthe best available means of persuasion\nArgumentation schemes help us identify the\npossible means of persuasion and whether\nthey can work well in a given situation\n\nIdentify the underlying form of many warrants\nHelps identify what critical questions to ask\nabout specific claims\nIdentify ways in which ethos, pathos, and logos\noverlap\n\nPosition to Know\nExpert Opinion\nPopular Opinion\nPopular Practice\nAnalogy\nCorrelation to Cause\nPositive Consequences\nNegative Consequences\nSlippery Slope\nSign\nCommitment/Inconsistent\nCommitment\nAd Hominem\nVerbal Classification\nWhich of these schemes\nrelate to\nEthos?\nLogos?\nPathos?\nWe should build a wall to\nstrengthen our borders\nWe should raise the minimum\nwage to $15/hour\n\nPosition to Know\nExpert Opinion\nPopular Opinion\nPopular Practice\nAnalogy\nCorrelation to Cause\nPositive Consequences\nNegative Consequences\nSlippery Slope\nSign\nCommitment/Inconsistent\nCommitment\nAd Hominem\nVerbal Classification\nWhich of these schemes\nmight relate to\narguments about\nFact?\nDefinition?\nCausation?\nValue?\nPolicy?\n\nAnalyzing the argument structure of given\ntexts--critiquing strengths and weaknesses\nImproving an argument with stronger proofs\nArguing in response to an argument\nBrainstorming potential proofs for a claim\nDebating multiple sides of a claim\n\n! Who won a debate and why?\n! Did the debate as a whole work to draw out\nthe best arguments on both sides, and thus\nto clarify the options and enable stronger\nchoices between policies?\n\nThe First Presidential Debate: Hillary Clinton and\nDonald Trump (Full Debate) | NBC News\nYouTube\nFinal Presidential Debate: Donald Trump vs\nHillary Clinton - Third Presidential Debate 2016\nYouTube\n\nDesign a counter argument using strategies we've\nlearned:\nAppeals to ethos, pathos, logos\nStasis theory\nArgument structure\nArgumentation schemes\nLabel all of your strategies!\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21W.016 Writing and Rhetoric: Designing Meaning\nFall 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw/mit.edu/terms."
    }
  ]
}