{
  "course_name": "X PRIZE Workshop: Grand Challenges in Energy",
  "course_description": "In 2004, the Ansari X PRIZE for suborbital spaceflight captured the public’s imagination and revolutionized an industry, leveraging a $10M prize purse into over $100M in innovation. Building from that success, the X PRIZE Foundation is now developing new prizes to focus innovation around “Grand Challenge” themes, including genomics, energy, healthcare, and education.\nThis course will examine the intersection of incentives and innovation, drawing on economic models, historic examples, and recent experience of the X PRIZE Foundation to help develop a future prize in Energy Storage Technologies.",
  "topics": [
    "Business",
    "Entrepreneurship",
    "Innovation",
    "Social Science",
    "Economics",
    "Industrial Organization",
    "Business",
    "Entrepreneurship",
    "Innovation",
    "Social Science",
    "Economics",
    "Industrial Organization"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nFaculty and Staff\n\nCourse Director: Dr. Erika Wagner\n\nAssociated Faculty and Staff:\n\nLuis Perez-Breva\n\nProf. Charlie Cooney\n\nProf. Fiona Murray\n\nProf. Dava Newman\n\nDr. Jeffrey Shames\n\nDr. Ken Zolot\n\nCourse Description\n\nIn 2004, the Ansari X PRIZE for suborbital spaceflight captured the public's imagination and revolutionized an industry, leveraging a $10M prize purse into over $100M in innovation. Building from that success, the X PRIZE Foundation is now developing new prizes to focus innovation around \"Grand Challenge\" themes, including genomics, energy, healthcare, and education.\n\nThis course will examine the intersection of incentives and innovation, drawing on economic models, historic examples, and recent experience of the X PRIZE Foundation to help develop a future prize in Energy Storage Technologies.\n\nLearning Objectives\n\nAfter taking ESD.172, students should be able to:\n\nArticulate the features of incentive prizes and contexts in which they are most effective\n\nDescribe incentive prizes in the context of existing economic models of innovation\n\nAnalyze effective areas for investment of limited resources\n\nUnderstand the diversity of opportunities for improvements in energy storage\n\nUnderstand the technological and systems-level blockages to improvements in energy storage\n\nDevelop deep knowledge of a particular issue in energy storage innovation through the term project experience\n\nWork effectively in teams\n\nPresent their concepts clearly and concisely in both written and oral form\n\nCourse Format\n\nThis 9-unit course will be highly action-oriented and interactive, with a team-based term project due at the end of the semester. Twice-weekly workshops include a mixture of lectures and discussions on innovation, incentive structures, and opportunities for revolution in energy innovation.\n\nTeam Project\n\nGroups of 3-5 students will work together to analyze an area of relevance to high-efficiency energy production, distribution, storage, or use, with the ultimate goal of developing a fully-formed X PRIZE concept to incentivize revolutionary breakthroughs in this area.\n\nCourse instructors will work together with the teams to identify local experts as team mentors/advisors. It is anticipated that team members will meet with their advisors a minimum of two times during the course of the semester.\n\nGrading\n\nClass grades will be assigned on the basis of homework, project performance, and class participation, as follows:\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation\n\n15%\n\nHomework\n\n15%\n\nProject milestones\n\n40%\n\nFinal project\n\n30%",
  "files": [
    {
      "category": "Assignment",
      "title": "Historic Prize Summary Assignment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-172j-x-prize-workshop-grand-challenges-in-energy-fall-2009/46b469fef61b0b145ef94fcb7a3544f4_MITESD_172JF09_assn2.pdf",
      "content": "Historic Prize Summary\n- Select a historic incentive prize from the attached list\nor other resources, and summarize the key points using\nthe one-page template below. Final summaries may be\nmade available on our website as a resource for others\nlearning about prize theory, so please take care to use\nyour own words, or cite appropriately.\n- Submit final PPT before class SES #5.\n\nSome Prize Options\nSome historic prizes from which to choose:\n-\nChicago Times-Herald Prize for Motors\n-\nVolta Prize\n-\nLiverpool & Manchester Railway Locomotive Prize\n-\nBright Tomorrow Lighting Prize\n-\nSaltire Prize\n-\nSuper Efficient Refrigerator Program Prize\n-\nVirgin Earth Challenge\n-\nAny of the alphabet prizes: H Prize, M, N, V, IF, etc.. Prizes\nOr feel free to select your own historic incentive prize in the same\nvein. (Existing X PRIZEs and those we've discussed in class are off-\nlimits, as are recognition prizes like Nobel.)\n\nPrize name\n-\nSponsor(s):\n-\nDate Offered:\n-\nDeadline (if known):\n-\nDate Completed:\n-\nDescription and Motivation:\n-\nType of Prize (e.g. First to Achieve, Top Performer, Community-based Incentive, etc.):\n-\nPrize Purse(s):\n-\nNature and Number of Competitors (if known):\n-\nTotal Investment by Teams (if known):\n-\nWinner(s) and Approach:\n-\nImpact of Prize:\n-\nSources:\n\nExample\n\nAnsari X PRIZE\n-\nSponsor(s): X PRIZE Foundation, funded by Anousheh and Amir Ansari\n-\nDate Offered: May 18, 1996\n-\nDeadline: December 31, 2004\n-\nDate Completed: October 4, 2004\n-\nDescription and Motivation: This prize was modeled after the Orteig Prize, which spurred Charles\nLindbergh's flight across the Atlantic. Motivation was to spur private investment in spaceflight, with a\nparticular eye towards commercial space tourism. Privately-funded teams were challenged to design\nand fly a 3-person vehicle to a suborbital altitude of 100 km, and return safely to the ground. A\nreflight had to be accomplished within 2 weeks, replacing <10% of the vehicle's non-propellant mass.\n-\nType of Prize: First to Achieve\n-\nPrize Purse: US$10 million\n-\nNature and Number of Competitors: 26 teams from 7 countries registered to compete, but only\nSpaceShipOne ultimately flew in competition.\n-\nTotal Investment by Teams: ~US$100 million\n-\nWinner(s) and Approach: SpaceShipOne, designed by Burt Rutan and Scaled Composites, funded by\nPaul Allen. The spacecraft was lifted to approximately 50,000 as a payload of the WhiteKnight carrier\naircraft. After being dropped from WhiteKnight, a hybrid \"rubber and laughing gas\" engine was ignited\nto reach the desired altitude. At apogee, the vehicle was reconfigured to a shuttlecock geometry for\npassively stable reentry. Horizontal landing at the original launch complex completed the trajectory.\n-\nImpact of Prize: SpaceShipOne proved the feasibility of private commercial spaceflight, at least to\nsuborbital altitudes. Since the winning flight, estimates are that over US$1.2 billion has been invested\nin the commercial spaceflight industry. The X PRIZE Foundation has expanded to offer other prizes.\n-\nOther Notes: Prize purse was not backed by full cash value, but by a \"hole-in-one\" insurance policy\nthat bet against the competitors. SpaceShipOne broke previous flight altitude record held by X-15\npilot, Joseph Walker.\n-\nResources: http://www.xprize.org ; http://history.nasa.gov/x-prize.htm;\nhttp://en.wikipedia.org/wiki/Ansari_X_Prize\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nESD.172J / EC.421J X PRIZE Workshop: Grand Challenges in Energy\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Historical Prize Summary student work",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-172j-x-prize-workshop-grand-challenges-in-energy-fall-2009/195a2aad8782b3b089f3af6ad7ea566a_MITESD_172JF09_assn2_sol.pdf",
      "content": "Saltire Prize\n-\nSponsor(s): Scottish Government\n-\nDate Offered: Announced April 2008\n-\nDeadline: December 2014\n-\nDate Completed: Winner to be chosen in the Spring of 2015\n-\nDescription and Motivation:\nThe prize was modeled after the Ansari X-Prize and the Virgin\nEarth Challenge to encourage the development of wave and tidal generation technologies in\nScotland. The installations must be located in Scottish waters and generate a minimum\nelectrical output of 100GWh over a 2 year period using only sea power. At the end of the\ngeneration period, the winner will be chosen from the qualifying projects based on the\ntechnology's cost, environmental sustainability and safety.\n-\nType of Prize: Top Performer as judged\n-\nPrize Purse: £10 million\n-\nNature and Number of Competitors : As of April 10, 2009, 100 competitors had registered,\nrepresenting 23 countries on five continents.\n-\nTotal Investment by Teams : Currently unknown\n-\nWinner(s) and Approach: n/a\n-\nImpact of Prize: The current impact is unknown, but the prize is jumpstarting a marine\nrenewable industry in Scotland projected to generate 12,000 jobs and £2.5 billion by 2020.\n-\nSources: http://www.scotland.gov.uk ; http://www.newenergyfocus.com ;\nhttp://www.talentscotland.com ;\n\nH-Prize\n-\nSponsor: Office of Energy Efficiency and Renewable Energy, Department of Energy (DOE)\n-\nDate Offered: February 15, 2010 (Registration)\n-\nDeadline: Dec 2010/Jan 2011 Sample testing;\n-\nDate Completed: February 2011 - Award\n-\nDescription and Motivation: To be awarded for demonstrated advancements in the\ndevelopment of an on-board hydrogen storage material for light-duty vehicles.\n-\nType of Prize: Community-based Incentive\n-\nPrize Purse(s): Single award of US$ 1 million\n-\nNature and Number of Competitors: unknown\n-\nTotal Investment by Teams: unknown\n-\nWinner(s) and Approach: Meeting the following criteria of Hydrogen Storage Material\nbreakthrough:\n-\nMaterial with potential of hydrogen rechargeable material\n-\nMore than 7.5 weight percent gravimetric capacity\n-\nMore than 70 g/liter releasable volumetric capacity\n-\nMore than 4x10-4 g of hydrogen charging kinetics\n-\nMore than 2x10-5 g of hydrogen discharge kinetics\n-\nLife cycle of 100\n-\nImpact of Prize: Stimulate the development of new materials and techniques capable to store\nhydrogen in vehicles and brake the critical barriers for vehicles fueled with hydrogen to\npenetrate in the market.\n-\nSources: www.hydrogenprize.org\n\nBeal Conjecture and Prize\n-\nSponsor: Andrew Beal\n-\nDate Offered: December 1997\n-\nDeadline (if known): none\n-\nDate Completed: active\n-\nDescription and Motivation: This prize is for the proof or disproof of the following number\ntheoretic conjecture: If ax + by = cz, where a, b, c, x, y and z are positive integers and x, y and\nz are all greater than 2, then a, b and c must have a common prime factor. The sponsor has\ncomputationally confirmed the validity of the conjecture for small integers. The conjecture is\na generalization of the Fermat's Last Theorem (for which the Wolfskehl Prize was given), and\nthe sponsor believes that Fermat possessed a relatively simple non-geometry-based proof for\nhis theorem. He hopes to spur related number theoretic advances by posing a generalization of\nthe problem.\n-\nType of Prize: First to Achieve\n-\nPrize Purse: $100,000 (USD)\n-\nNature and Number of Competitors (if known): There is no registration procedure and the\nprize is given after a proof appears in a reputable refereed journal or a counterexample has\nbeen given and verified. The nature and number of competitors is therefore unknown.\n-\nTotal Investment by Teams (if known): unknown\n-\nWinner(s) and Approach: The prize is still active and has no fixed deadline\nImpact of Prize: The prize seems to have had little impact on the mathematical community.\n-\nSources: R. Daniel Mauldin, \"A Generalization of Fermat's Last Theorem: The Beal Conjecture\nand Prize Problem,\" Not. AMS, vol. 44, no. 11, pp. 1436-1437, Dec. 1997.;\nhttp://www.bealconjecture.com/; http://www.math.unt.edu/~mauldin/beal.html\n\nVolta Prize\n-\nSponsor(s): French Government (Founded by Napoleon Bonaparte)\n-\nDate Offered: Established in 1803 to honor Alessandro Volta\n-\nDeadline (if known): continuing (annual)\n-\nDate Completed: N/A\n-\nDescription and Motivation: In 1801, Alessandro Volta was summoned to Paris to present his\ninvention of the Voltaic Pile (the first electric battery). His presentation impressed Napoleon\nso much, he awarded him a gold medal, made him a count, and founded the annual Volta Prize\nin his honor. The Volta Prize is awarded each year for scientific discoveries in electricity.\nPerhaps the most notable recipient was Alexander Bell, who was awarded a Volta Prize of\nUS$10,000 in 1880 for his invention of the telephone.\n-\nType of Prize: Top performer / Recognition\n-\nPrize Purse(s): Varies\n-\nNature and Number of Competitors (if known): Unknown - Ongoing\n-\nTotal Investment by Teams (if known): Unknown\n-\nWinner(s) and Approach: Founded in honor of Alessandro Volta for the invention of the\nelectric battery. Most Notable: Awarded to Alexander Bell for the invention of the telephone.\n-\nImpact of Prize: Various, although this prize is more of a recognition prize and therefore is not\ndirectly responsible for incentivizing social / technological impact. Bell did use his winnings to\nestablish institutions and laboratories around Washington, D.C., which have had far-reaching\nbenefits. Main impact has been to spur ongoing entrepreneurship in electricity research.\n-\nSources:\n-\nhttp://web.fccj.org/~ethall/electro/electro.htm\n-\nhttp://en.wikipedia.org/wiki/Volta_Prize\n-\nhttp://www.thocp.net/biographies/volta_alessandro.htm\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nESD.172J / EC.421J X PRIZE Workshop: Grand Challenges in Energy\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Engagement strategies",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-172j-x-prize-workshop-grand-challenges-in-energy-fall-2009/1f62d4d2abc2713ab1460212d0e65080_MITESD_172JF09_Lec15.pdf",
      "content": "Engagement Strategies\nErika Wagner\n2 Nov 2009\n\nPrize Economics 101...\nPurse\nWinner\nSpent\nTotal\nSpent\nOrteig\n$25K\n$10K\n$400K\nAnsari\n$10M\n$26M\n$100M+\n\n... 5.5 Billion Media Impressions Worth in Excess of $120 Million\n\nName an Ad Campaign\n1) That sticks in your mind\n2) That got you to do or buy something\n3) That successfully changed your behavior\n4) That you loved but forgot the product\n\nEngagement Strategies\n1. Audience\n2. Message\n3. Strategy\n4. Delivery\n(c) Apple, Inc. All rights reserved. This content is\nexcluded from our Creative Commons license. For more\ninformation, see http://ocw.mit.edu/fairuse\n\nAudience(s)\n- Public\n- Teams\n- Insiders\n- Outsiders\n- Funders\n- For prize\n- For teams\nPUBLIC\n- Moms\n- Techies\n- Tweens\n- Sailors\n- Environmentalists\n- \"Explorers\"\n- Pilots\n\nMessage\n- Clear, concise message\n- Ansari - First private spaceflight\n- Genome - Sequence 100 genomes in 10 days\n- Progressive Auto - Cars getting 100 mpg racing\nacross the country\n- Helped by a \"sticky\" image or tagline\n- Think about what you want them to KNOW,\nplus what you want them to DO\n\nTo hasten the day when humanity\nleaves the cradle of Earth\n\"To open a new era where space is no longer\nthe exclusive domain of massive government space\nprograms and ordinary people can now\nrealistically dream of one day reaching for the stars.\"\nTo get Peter (and friends) one step\ncloser to travelling in space\nRATIONALE\n\nSpaceflight X PRIZE\nPrivate suborbital spaceflight\nLow-cost, private orbital spaceflight with wide market\ndemand and ready availability\nPrivate orbital spaceflight\nAffordable and available access to space, ready to support\nwide-scale space-based industry and colonization\nCHALLENGE\n\nSpaceflight X PRIZE\nFirst private spaceflight\nFirst private team to go to\nspace twice in two weeks\nFirst team using 90% non-government funding to fly\na 90% reusable vehicle, carrying 3 passengers, or\ntheir mass equivalent, to 100 km altitude,\ntwice in two weeks\nMaster Team Agreement: 50-100pg contract\nPRIZE\n\nStrategy\n- Launch\n- Sustaining interest\n- Winning moment\n- Building on success\n\nDelivery\n- Tone - guerilla vs mainstream\n- Medium - blogs, Web 2.0 tools, TV (news?\nReality TV?), radio, in-person events, etc...\n- Location\n- Date\n- Spokesperson\n- Gimmick\n\nTeam Challenge\n- Create an X PRIZE marketing campaign for a\n\"green battery\" prize\n(i.e. non-toxic landfill-safe batteries)\n- Include\n- Audience\n- Message\n- Strategy\n- Delivery\n(tone, medium, location, date, spokesperson, gimmick)\n\nBarriers\n- Regulatory\n- Cultural\n- Financial\n- Competition\n- Geography\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nESD.172J / EC.421J X PRIZE Workshop: Grand Challenges in Energy\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Incentivized Competitions and Prizes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-172j-x-prize-workshop-grand-challenges-in-energy-fall-2009/f1f9c8119aca861c0250cfc6a9ff2de1_MITESD_172JF09_Lec11.pdf",
      "content": "Incentivized Competitions and Prizes\nOctober 19, 2009\n\nStrategic Priorities\n\n$335\n$326\n$381 $418\n$490\n$535\n$536 $488\n$395\n$120\n$104\n$104\n$133\n$180\n$252\n$302\n$331\n$449\n1Q08A\nUS Petroleum Imports\nBalance of US Trade Deficit after\nPetroleum Imports\nProven Oil Reserves (1)\nUS Greenhouse Gas Emissions by Source(3)\nUS Historical Trade Deficit(4)\nHistorical\nOther\nElectricity\nTransportation\nPetroleum\nProjected\n(1) Source: BP Statistical Review of World Energy, June 2008. Note: Includes 152 BN barrels of Canadian Tar Sands. Higher USA figure includes 86 BN barrels and 4 BN barrels in the Outer Continental Shelf and Arctic National Wildlife Refuge, respectively according to EIA. Only top producing nations shown.\n(2) Difference between 2007 and 2008 American Energy Outlooks largely attributable to the passage of the Energy Independence and Security Act of 2007 signed by President Bush in December 2007.\n(3) Source: American Energy Outlook 2008, Energy Information Agency.\n(4) Source: US Department of Labor, Bureau of Economic Analysis, International Transactions Accounts. Note: 2008 annualized from Q1 data.\nEISA\nImpact (2)\n(MMTC)\n($BN)\n102 98\nia\nan\naq\nit\nE\na\na\nia\na\na\nil\nl\nA\na\ni Arab\na\nr\nr\nA\ni\nKuw\ne\ny\nco\nI\nI\nU\nu\nz\nLib\nger\nnad\ns\nS\nn\nhi\nus\nU\nxi\ni\nVene\na\nC\nBraz\nN\nR\nC\nMe\nSaud\nOPEC\nNon-OPEC\n67%\n33%\n(Billions of Barrels)\nNational security, environmental and economic goals form the basis for a robust National\nEnergy Policy but historical data demonstrates the magnitude and urgency of the challenge.\nEnergy Security\nEnvironmental Stewardship\nEconomic Competitiveness\n- Diversify our energy mix and\n- Reduce greenhouse gas emissions\n- Create a more flexible, more reliable\nreduce dependence on petroleum\nand other negative environmental\nand higher capacity U.S. energy\nimpacts\ninfrastructure\n- Improve the energy productivity of\nthe U.S. economy\n\nFY\nFY\nFY\nFY\nFY\nFY\nFY\nFY\nFY\nFY\nFY\nFY\nFY\nFY\nFY\nFY\nEnergy\nScience\nNational Security\nEnvironmental Management\nDOE budget authority (2008$, in billions)\nDOE Historical Budget\nNote: FY07 data based on revised request\nFY08 data based on request\n\nDOE Historical Funding for Science & Energy\nMajor increases in Science and Energy in FY 2009 and FY 2010\n'79-\n'81-\n'83-\n'85-\n'87-\n'89-\n'91-\n'93-\n'95-\n'97-\n'99-\n'01-\n'03-\n'05-\n'07-\n'09-\n(Constant FY 2008 dollars)\nNote: 2009-10 includes $27 billion in Recovery Act\n\n2/24/2010\nCommercialization\nScaling\nPublic benefit is only fully realized upon product delivery to\nmarket\nDelivery\nDeployment\nDemand\nPull\nInnovation Pipeline\n\nGovernment-Dominated\nFunding\nIndustry-Dominated\nFunding\nOffice\nof Science\nIncludes\nEnergy Frontier\nResearch Centers\nARPA-E\nBreakthrough; Opportunistic; Focused\nBasic\nApplied\nDeployed\nHigh Risk,\nHigh Payoff\nLow Risk,\nEvolutionary\nLoans\nApplied Offices\nEnergy Innovation Hubs\nBig problem; Stable; Longer-term\nInnovative\nProgram\nCommercial-ready\nProgram\nEnergy Innovation Pipeline\nEnergy R&D Pipeline\n\nDOE is uniquely positioned to promote open\ncollaboration and incentivized competitions\n- Open collaboration\n- Traditionally DOE highly secure, clearance heavy, secret\n- Private sector often incentivized to protect trade secrets, patents and IP to the\ndetriment of moving industry forward\n- Today DOE promotes open collaboration\n- Incentivized competition\n- DOE leverages research and investment dollars by supporting and promoting\ncompetitions\n2/24/2010\nDOE looks to tap into American ingenuity, creativity, and spirit to identify\nalternatives and create momentum to shift away from oil\n\nIncentivized competition drives innovation\n-\nCompetition breeds excellence and is disruptive to the status quo\n-\nIncumbents are best challenged by amplifying results. Our national energy status quo is in\nneed of the type of disruption that only competition and ingenuity can bring.\n-\nDOE has a track record of using prizes\n-\nSpur innovation towards achieving our national goals.\n-\nPrizes Work\n-\nPrizes recognize that the best thinking tends to happen not in Washington or even in a\nlaboratory.\n2/24/2010\n\nPrizes - Vehicles\n-\nChallenge X\n-\n17 teams from North American Universities were challenged to re‐\nengineer a GM Equinox to minimize energy consumption, emissions,\nand GHGs while maintaining or exceeding the vehicle's utility and\nperformance.\n-\nEcoCar: The NeXT Challenge\n-\nNext generation of Challenge X: 3 year competition with Year One\nCompetition Finals occurring this week in Toronto.\n-\nStudents design and build advanced vehicles that demonstrate\nleading‐edge automotive technologies with the goal of minimizing\nthe environmental impact of personal transportation following a real‐\nworld approach.\n-\nProgressive Automotive X PRIZE\n-\nInternational competition to design, build and bring to market 100\nMPG vehicles with a $10 million prize\n-\nHydrogen Storage H‐Prize\n-\nDemonstrate development of an on‐board material that meets or\nexceeds defined performance criteria with an $1 Million Prize\nexpected in October 2010\nH‐Prize\n2/24/2010\n\nPrizes - Buildings\n-\nBuilding America: The Builder's Challenge\n2/24/2010\n-\nBuilders who join the Builders Challenge will commit to\nconstructing homes that rate 70 or better on the EnergySmart\nHome Scale - that is 30% better than typical new home and\nalmost 2x as efficient as an existing home!\n-\nBy constructing 220,000 homes to 70 on the E‐Scale by 2012,\nparticipating builders will take the equivalent of 50,000\npassenger cars off the road for an entire year and will save\nhomeowners $143 million on their energy bills.\n-\nSolar Decathlon\n-\n20 international university teams compete to design, build, and\noperate the most livable, energy‐efficient completely solar‐\npowered house.\n-\nThe 2007 Solar Decathlon crowned the Technische Universitat\nDarmstadt the overall winner.\n-\nL Prize\n-\nChallenges industry to develop high‐performance solid‐state\nlighting products to replace two of today's most widely used and\ninefficient products: 60W incandescent and halogen light bulbs.\nL Prize\n\nSolar Decathlon is a global leader incentivized competition\n-\nPurpose\n-\nThe Solar Decathlon brings attention to one of the biggest challenges we face--an ever‐\nincreasing need for energy. As an internationally recognized event, it offers powerful\nsolutions--using energy more efficiently and using energy from renewable sources.\n-\nIn 2007, 20 international university teams competed to design, build, and operate the\nmost livable, energy‐efficient completely solar‐powered house. Technische Universitat\nDarmstadt was crowned the overall winner.\n-\n2009 Solar Decathlon Contests\n-\nArchitecture\n-\nMarket Viability\n-\nEngineering\n-\nLighting Design\n-\nCommunications\n-\nComfort Zone\n-\nHot Water\n-\nAppliances\n-\nHome Entertainment\n-\nNet Metering\n2/24/2010\n\nPrizes - Business Plans\n-\nCalifornia Clean Tech Open\n2/24/2010\n-\nFrom the past three years, 84% of the Alumni are still viable businesses and have secured\nmore than $125 million in funding, while the prize levels top out at $100,000.\n-\nGlobal Venture Challenge\n-\nHosted by Oak Ridge National Laboratory,\nstudents develop unique and innovative\nproduct ideas that can solve existing market\nneeds and have the potential to become\nsustainable businesses.\n-\nThe event theme for 2009 is Industrial\nEnergy Efficiency and is sponsored by the\nU.S. Department of Energy's Industrial\nTechnologies Program.\n-\nMIT Clean Energy Entrepreneurship Prize\n-\nStimulates relationships between academic,\ncommunity, industry, and government\norganizations to meet the world's energy\nchallenge through innovation and\nentrepreneurship.\n\nFuture Prizes\n-\nFreedom Prize\n2/24/2010\n-\nFocus on strategies to deploy existing technologies and to\nencourage changes in processes, policies, and behavior to\nreduce our dependence on oil\n-\nTap into American ingenuity, creativity, and spirit to\nidentify alternatives and create momentum to shift away\nfrom oil\n-\nThe first competition will focus on school bus fleets, with\n$1.5 million in awards for innovative strategy and\ntechnology changes that have a lasting impact.\n-\nSchools Fleet Challenge launch target is Fall 2009\n\nPrizes - K‐12 Education\n-\nAd Council\n-\nStudents create and produce multi‐media ads\nabout energy efficiency and place on YouTube.\n800,000\n-\nScience Bowl\n-\nHS Students answer questions on topics in\nastronomy, biology, chemistry, mathematics,\nand physics in a highly competitive, Jeopardy‐\nstyle format. Middle School students also\ndesign, build, and race hydrogen fuel cell\nmodel cars. 2,300,000\n\nQUESTIONS ?\n\nPrizes - K‐12 Education\nUniversity level (4 competitions; 1 Awareness campaign)\n-\nHydrogen Student Design Contest (160 students)..................$20,000.\nStudents design a real‐world hydrogen application; themes have included hydrogen fueling station, hydrogen\npower park, hydrogen and fuel cell technologies at airports, and hydrogen and fuel cell technologies on a college\ncampus.\n-\nSolar Decathlon (400 students)............................................$ 4,450,000.\nUniversity students compete by building 800 square foot solar efficient homes.\n-\nEco Car Competition (150 students) ...................................\n$2,000,000\nThree‐year competition to reengineer a crossover vehicle provided by GM that reduces fuel consumption and\nlowers emissions by using advanced vehicle technologies, such as: plug‐in hybrid technology, hybrid technology,\ndiesel technology and other advanced fueling technologies.\n-\nGlobal Venture Challenge ................................................$200,000.\nStudent business competition focused on Industrial Energy Efficiency technologies\n(www.globalventurechallenge.com)\n-\nSmart Power Energy Efficiency Campaign (20,000 students)....$200,000.\nSocial media campaign to link America's Greenest Campus and a YouTube Ad Contest through\nletsgetenergysmart.com, teens and young adults can compete through their universities or through video to save\nenergy and reduce greenhouse gas emissions.\nK‐12 level: (3 Competitions)\n-\nAutomotive X PRIZE Competition (new competition).........\n$3,500,000.\nNational Education/Outreach about advanced, energy‐efficient vehicles with 3 integrated activities: 1) on‐line\nknowledge center ‐‐ www.fuelourfuturenow.com, 2) development of a vehicle telemetry package and integration\nof that package with the AXP online knowledge center, and 3) national content where students design a next‐\ngeneration Dashboard.\n-\nAd Council ..................................................................$800,000\nStudents create and produce multi‐media ads about energy efficiency and place on YouTube.\n-\nScience Bowl..................................................................$2,300,000.\nHS Students answer questions on topics in astronomy, biology, chemistry, mathematics, and physics in a highly\ncompetitive, Jeopardy‐style format. Middle School students also design, build, and race hydrogen fuel cell model\ncars.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nESD.172J / EC.421J X PRIZE Workshop: Grand Challenges in Energy\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Mapping a prospective prize space",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-172j-x-prize-workshop-grand-challenges-in-energy-fall-2009/fd4c5ad993a36549d2542c9932556ab1_MITESD_172JF09_Lec10.pdf",
      "content": "Mapping a prospective\nprize space\n14 Oct 2009\n\nGoal\n- Map out a structured process for rigorously\nunderstanding the domain of your team's\nterm project\n- Grid‐scale storage for renewables\n- Home‐scale storage for distributed generation\n- Affordable storage for the developing world\n- Mobile storage for green aviation\n\nResource Availability\nResource Availability\nResource Availability\nDesired Field of Impact\nClear Metrics\nfor Success\nPublic\nInterest\nPrize‐\nAmenable\nMarket\nTechnical\nFeasibility\nDesired Field of Impact\n\nDeveloping a Roadmap\n- Value chain analysis\n- Market research\n- Technology roadmapping\n- User‐driven design\n- Alternative applications\n\nValue chain analysis\n- What market(s) are you looking to disrupt?\n- Who sells what to whom?\n- Would you hope to displace another player?\nPartner with them?\n- What are the barriers to entry?\n\nMarket research\n- Who are your stakeholders?\n- How do you quantify demand?\n- How is the market segmented?\n- How much money is currently being invested\nin this space? By whom?\n- How do you find this data?\n\nTechnology roadmapping\n- What are the key figures of technical merit to meet your\nmarket needs? (energy, power, etc.)\n- What types of technologies are likely to meet these needs?\n- What are the technical barriers to reaching your desired\nlevel of performance?\n- Who are the lead players in the industry, and what do they\nclaim they can do in 5‐10 years?\n- What are the drivers supporting this innovation? (market,\nsocietal, economic, technical)\n- How do you find this data?\n\nUser‐driven design\n- Who will be using your technology? (Early\nadopters? Early majority?)\n- What do they value most in its performance and\ndesign?\n- What is the relevant proof of concept for them?\n- At what cost would they purchase the\ntechnology?\n- How do you find this data?\n\nAlternative applications\n- As you start to think about a prize\ncompetition, it may be useful to think about\nalternative applications that are more publicly\ncompelling than your primary goal.\n- Given a successful technology in your space of\ninterest, what else could it be used for? (e.g.\nbesides supporting renewables integration,\nwhat could you do with a grid‐scale storage\nunit?)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nESD.172J / EC.421J X PRIZE Workshop: Grand Challenges in Energy\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Open Innovation: Case Not Quite Closed",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-172j-x-prize-workshop-grand-challenges-in-energy-fall-2009/5d7a8adb1b03062674ee25a168d7555c_MITESD_172JF09_Lec02.pdf",
      "content": "Open Innovation: Case Not Quite Closed\nBhaskar Chakravorti\nHarvard Business School and McKinsey & Company\nSeptember 14, 2009\n\nDATA MINING FOR...MORE MINING\n- Goldcorp publicly\n- Three of the finalists\nshared 52 years of\nidentified more than 100\ngeological data from its\nexploration targets, half of\nRed Lake mine\nthem new to GoldCorp\n- As a result, the Red Lake\n- 1400 entries\nmine is now yielding 10\nwere received from\ntimes more gold at 1/6th\nindividuals, businesses\nthe cost of production in\nand universities in 50\n1989, when the company\ncountries\nacquired the site\n- In year 2000, Goldcorp\n- The winners, Fractal\noffered $575K in prizes\nGraphics (of West Perth,\nto identify where the next\nAustralia) never set foot in\n6 million ounces of gold\nthe mine\ncould be found*\n* Similarly, Barrick Gold is offering a 10 million USD US prize in 2007 to anyone who can figure out how to extract the silver from the ore\nat its Veladero gold mine in Argentina\nSource: Reportonbusiness.com; CBCnews\n\nA SWARM OF ANGELS COLLABORATING TO WRITE, PRODUCE,\nDISTRIBUTE AND FUND A FEATURE-LENGTH FILM\nFounded in 2006, A Swarm of Angles (ASOA) is an open source film project that engages its members\nto contribute in various aspects of the movie development process\n- Over 2200* members have helped fund the project by donating $47 each\n- Members have generated music and computer generated animation for a teaser and publicity poster\n- Members were collaborating on two scripts and will vote on which one is ultimately produced\n* Current as of February 2008\nSource: A Swarm of Angels website, Press search\nTotal\nMembers\nMajor\nactivities\nStatus\nProof of\nconcept\nScript\ndevelopment\nPre-\nproduction\nFilming\n- Develop online site\n- Promote via blogs\nand e-mails\n- Completed\n- Develop and\nfinalize scripts\n- Scripts started\n- Scout locations\n- Choose crew\n- Cast roles\n- Not started\n- Production\n- Post production\n- Distribution\n- Not started\nMembers make decisions by voting in online polls\n\nPROCTER AND GAMBLE's GAMBLE: FROM \"R&D\" TO \"C&D\"\nSource: CIO.com; ProductScan; USG; McKinsey\nOverview\n- Taps global talent by enabling inventors to submit product ideas or\nseek solutions for P&G via \"connect + develop\" platform\n- Invite talents to use partner networks to provide solutions\n- Uses platform for enlarging idea pipeline, and killing unsuitable ideas\nWeb 2.0 applications in business processes\n- Allows researchers to submit unstructured documents, give them\ndescriptive tags, and share them as PDFs with all \"Electronic Lab\nNotebook\" users\n- Uses Web services to link up existing system, making lab notebooks\nsearchable/accessible in read-only format to downstream engineers,\nvendors, and patent lawyers\nNovelty\n- Leverages and collects innovations effectively\n- Search function increases productivity by preventing repeat work\n\"Win-win\" value\n- Scientists earn money for their contributions\n- Enterprise efficiently obtains desired solutions\n\nSources: P&G annual report; Datamonitor company profiles; press clippings\nWHEN DONE RIGHT, THE STRATEGY CAN DELIVER IMPRESSIVE\nPAYOFFS\nA.G. Lafley\nChairman, CEO and President\nPriorities:\n1. Grow the core through innovation\n2. Shift P&G's business mix towards beauty\nand health-care categories\n3. Focus on developing markets as another\ndisproportionate engine of growth\n4. Source 50% of innovations from the\noutside\nPriorities:\n1. Grow the core through innovation\n2. Shift P&G's business mix towards beauty\nand health-care categories\n3. Focus on developing markets as another\ndisproportionate engine of growth\n4. Source 50% of innovations from the\noutside\n\nSources: Press clippings; company Web sites\nKey elements\nONE OF THE OPEN INNOVATION SYSTEMS THAT P&G USES\nWAS SPUN-OFF FROM ELI LILY\n- Business venture of Eli Lilly & Co.\nand spun-off\n- Used by companies like Dow, BASF,\nP&G, Boeing, Nestle (including 50\nblue-chip companies) to speed up\ntheir innovation process\n- Over 95,000 registered scientists\nfrom 175 countries from which to\nsource ideas\n- Nearly 40 \"seeker\" companies\n- Up to $100,000 awards for solutions\n- Has awarded 250 solutions a total of\n$1.5M\n- Higher success rate (35%) for\nsolving problems than internal R&D\nand cost is 1/6 that of internal R&D\nINNOCENTIVE\n\nENTHUSIASM FOR OPEN INNOVATION IS DRIVEN BY MULTIPLE\nFACTORS\nProductivity\n+\nCost\nAdvantages\nWhen companies look outside their own boundaries, they may gain better access\nto ideas, knowledge, talent, technology or marketing capabilities than they would\nhave if they relied solely on their own resources. This can potentially enhance\nproductivity or lower costs\nAdded\nBenefits\nOpenness confers other benefits, e.g. faster time-to-market, hedging risk,\nmotivating and developing internal resources, sending a signal to the market,\nbrand-building, building stakeholder support, etc.\nLeveraging\nMacro-\nTrends\nSeveral macro-trends provide added impetus: challenges to centralized decision-\nmaking in companies with complex and globally dispersed operations; new\ntechnologies and new community behaviors favor co-creation mindsets; success of\nplatform-oriented business models have shown companies how to profit from the\ncreativity and entrepreneurship of others.\nOpportunity\nCreated by\nthe Crisis\nAs established companies freeze or cut their internal R&D, product development\nand marketing budgets and as the IPO market remains virtually dormant, open\ninnovation provides opportunities for established players to leverage free-standing\nentrepreneurs and other external parties and for the latter to get funding and explore\nexit opportunities\n\nENABLING TECHNOLOGIES AND BEHAVIORS, SUCH AS WEB 2.0,\nCAN BE POWERFUL ACCELERATORS OF VALUE\nImprove\nR&D efficiency\nReduce operating\ncosts\nIncrease stream of\nrevenues\n- Start from existing, proven\nmaterial\n- Leverage cheap\ncontributions from external\nparties\n- Focus development on\nwhat matters most to users\n- Inject external expert\nknowledge\n- Accelerate process\nthrough shorter feedback\nloops\n- Identify and internalize\nhigh-potential talent\n- Reduce cost of business\nprocesses\n- Streamline supply chain\n- Improve customer\nrelationship and\ncommunication\n- Improve service levels and\nproduct quality\n- Generate higher customer\nfidelity through client\ninvolvement\n- Use customers to push\nadditional sales\n- Extend beyond target market\n- Generate new revenue\nstreams\n- Increase ability to develop\nbreakthrough products\nNOT EXHAUSTIVE\n\nINNOVATIVE USE OF SUCH ENABLERS CAN IMPROVE R&D\nTHROUGHPUT, ...\nStart from\nexisting material\n- IBM leveraged outside resources\nlike Open Source Software to\nspeed up development of an\ninternal community Website\nExample\nImpact\nLeverage cheap\ncontributions\nFocus on user\nneeds\n- Using only existing free software, the group\nmanaged to very quickly go from sketches\nto a working site and provide a\ndemonstration site\nInject external\nexpert\nknowledge\nSource:\nCompany webstites, ntenonline.com, company filings\n- The Humane Society used a\nYoutube video contest to create\nspots against animal fights\n- The campaign generated 22 submissions,\nover 18.000 votes and the winning spot was\nviewed 90.000 times\n- Sports wear company Decathlon\nlaunched many products in co-\ncreation with key sport people to\ncreate consumer oriented products\n- One example of user generated products is\nthe water sports t-shirt Tribord which keeps\nits solar protection even when wet\n- Flexifoil, a kite producer, launched\ncommunity web sites where\nenthusiasts could meet and\nexchange ideas for new products\n- The company managed to lead its niche\nand generated 4M€ revenues in 2007\nAccelerate\nprocess\n- Nokia Beta Labs launched to\nleverage users to test latest\nsmartphone software, rate\napplications\n- Beta Labs generate 1 M page views/month\n- Sports Tracker application had 1+ million\ndownloads\nIdentify talent\n- FogBugz launched a software\nproject for summer interns over\ntheir blog, asking for applications.\nThe whole project was published\non the company blog were readers\ncould offer comments and advice\n- Over 800 applications were received, 4\ninterns hired\n- Project became a successful commercial\nproject: \"Copilot\"\nNOT EXHAUSTIVE\n\n... IMPROVE COST LEADERSHIP ...\nExample\n- The Apache web server leverages\nReduce business\nfree community contribution to\ncosts\nsupport users and maintain the\ncode\nImpact\nImprove supply\nchain\n- Apache is currently the leading web server\nwith market share of 49% in June 2008\n- Digital Cinema Initiatives was\n- Moving movie distribution to theaters from\nlaunched by the major motion\nprints to digital could reduce total production\npicture studios to establish to\ncosts by 10%\npromote digital movie distribution\nCustomer\nrelationship\nSource: Netcraft server survey 2008, media-culture.org, Bloomberg, salon.com\n- Scion is marketed to young drivers\n- Average age of Scion drivers is 39, making\nthrough viral marketing, like a\nit the youngest car brand in the US\ndealership in Second Life, Scion-\nbranded community sites and\nYouTube videos\n- Dell created a wiki for its call\n- The number of clicks to obtain requested\ncenters, where the operators could\ninformation dropped from 20 to 4 and\nthemselves post solutions to\naverage call duration decreased 10-20%\ncommon problems\n- Amazon Mechanical Turk brings\n- Several companies have created automated\ntogether businesses and workers\nworkflows using the site to reduce cost by\nto complete small tasks against\n90% compared to internal treatment\npayment\nNOT EXHAUSTIVE\n- Kroger linked product delivery to\n- Real-time ordering and better forecasting\nreal-time sales data to improve\nreduced spoilage by 1% of sales\ninventory management\n\n... AND INCREASE REVENUES...\nExample\n- Dell launched IdeaStorm, a\ncommunity website where users\ncan post and rate complaints and\nideas to improve service quality\nImpact\n- Over one year negative online coverage\ndecreased from 50% to 23%\nSource:\nPaul Marsden \"Consumer Advisory Panels\", E. van Hippel \"Performance Assessment of the Lead User Idea-Generation Process for\nNew Product Development\", Brand Autopsy, company websites\nImprove product\nand image\nquality\nIncrease fidelity\nthrough client\ninvolvement\n- P&G involves customers in its\n- Customer involvement has been found to\nbusiness processes through the\nincrease sales by 10-30% through advocacy\nTremor network, where they can\nand loyalty effect\nrate marketing and product ideas\nUse customers\nto push sales\n- KarmaLoop online clothes retailer\n- \"Reps\" make up 1% of customers and their\nuses existing customers for making\nreferrals account for 15% of total sales\nadditional sales\nNOT EXHAUSTIVE\n- Hallmark Idea Exchange is a\n- Based on contributions, Hallmark\nExtend target\nprivate social network of mothers\nrecognized Grandparents and Latina\nmarket\nwho offer new ideas for greeting\nwomen as additional promising target\ncards\nmarkets\n- To complement traditional sales,\n- Kodak Galleries had over 50 million users in\nGenerate new\nKodak offers web galleries to store,\n2007 and was chosen as partner by leading\nrevenue streams\nshare and order photos online\ncompanies like Amazon, Adobe and Apple\nBoost innovation\ncapacity\n- 3M uses Lead User in its R&D\n- 3M projects with Lead User involvement\nprojects to improve the degree of\nwere significantly more likely to produce\ninnovation of new products\nbreakthrough products than traditional\ndevelopment\n\n\"PLATFORM\" ORIENTED BUSINESS MODELS SUGGEST A HIGHLY\nPROMISING TREND IN OPEN MECHANISM DESIGN\nImage of iPhone removed due to copyright restrictions.\n\nBUT PLATFORMS ARE ONLY ONE OF SEVERAL DESIGN\nPOSSIBILITIES\nDecision-Making\nCentralized\nDispersed\nMotivation for Participation\nPrimarily Intangible\nPrimarily Financial\nStaples\niPhone\nLinux\nWIkipedia\n\nGETTING THE DESIGN RIGHT INVOLVES CONSIDERING SOME KEY\nTRADE-OFFS\nBenefits\nRisks\n-To Participants: Satisfaction that\nvoice is heard; opportunities for self\nexpression, recognition and fame;\nsense of community and altruism;\nengagement with community\n-To Company: Engagement with\nthe brand; potential to attract a\ndiverse group of participants\n-Hard to sustain interest and\nmomentum\n-With potential thinning of the\nnetwork could lead to diminished\nvalue and manipulation\n-Many commercially valuable ideas\nmay not be offered\nBenefits\nRisks\n-To Participant: Financial gain;\nopportunities for recognition and\nfame\n-To Company: Potential to draw\nlarge numbers of participants;\nalignment of the stakeholder's\nincentives with that of the firm's;\nincrease in creativity due to the\nincentives to win a prize in a \"race\"\nor \"contest\"\n-Collaboration benefits could get\ncompromised by excessive\ncompetitiveness\n-Potentially brings concerns about\nintellectual property rights, fairness,\netc. to the forefront\n-Less engagement with the brand\n-Diminished focus on broader\nobjectives e.g. social,\nenvironmental and political issues\nMotivation for Participation\nPrimarily Financial\nPrimarily Intangible\n\nGETTING THE DESIGN RIGHT INVOLVES CONSIDERING SOME KEY\nTRADE-OFFS\nDecision-Making\nCentralized\nDispersed\nBenefits\nRisks\n-Limit intellectual property leakage\nand potential for erosion of\ncompetitive advantage by\ncontrolling the amount of\ninformation in the public domain\n-Better management of\nmanipulation risk\n-Decision may not represent most\ncompelling value propositions\n-Participants lose interest because\nthey feel disengaged from the\nbrand; de-motivated stakeholders\nmay leave the network\nBenefits\nRisks\n-Shift the costs of making a\ndecision to external parties;\ndecision represents democratic\nchoice by the stakeholders\n-Provides a rationale for balancing\ninterests of different stakeholders\n-Could engender more engagement\nand greater participation\n-Could generate more creative\nideas as participants build on ideas\nof others\n-Potential for leakage of intellectual\nproperty and for competitors to\nbenefit from openly accessible data\n-Potential for manipulation of the\ndecision process\n\nKEY MESSAGES\nThere are multiple drivers behind open innovation and, if\ndone right, it has high potential to create value\nSuccessful open innovators take a systemic view of the\n\"opening\" decision and make an integrated set of choices;\nit is important to figure out how the approach can scale\nDesigning an optimal mechanism for open innovation\nrequires a consideration of multiple trade-offs - prizes may\nor may not play a critical role depending on objectives\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nESD.172J / EC.421J X PRIZE Workshop: Grand Challenges in Energy\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "ESD.172 X PRIZE Introduction",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-172j-x-prize-workshop-grand-challenges-in-energy-fall-2009/53cafeda5cceb503118aa4f1ed59ef20_MITESD_172JF09_Lec01.pdf",
      "content": "ESD.172J\nIntroduction\nErika Wagner\n9 Sept 2009\n\nYou go first ☺\n- Name\n- MIT program & year\n- Area of energy-related expertise or interest\n- \"I believe I'm the only person in the room\nwho...\"\n(3 tries!)\n\nThe Tool\n\nAward Taxonomy\nPost/Award\nInducement\nNobel Prize\nMillennium Technology Prize\nLasker Award\nX PRIZE\nDARPA Grand Challenge\nNASA Centennial Challenges\nMacArthur Grant\nGuggenheim Award\nFellowships\nResearch grants:\nNIH, NSF, NASA\nPre/Grant\nRecognition\n\nTerm Project\n- Design an X PRIZE to incentivize revolutionary\ninnovation in energy storage, targeted at a\nspecific technology or application.\n\n15 minutes of production...\n(Chris Jordan, 2007)\n\nOther applications needing\nstorage breakthroughs\n- Range limited transportation\n- Hybrid & electric vehicles\n- Deep sea submersibles\n- Bionics\n- Mass limited systems\n- Satellites\n- Backpacking\n- Resource limited settings\n- Point-of-care health diagnostics\n- Off-grid lighting\n\nCourse Design\nCreating the X PRIZE, not winning it\n- Improved understanding of what triggers and supports\ninnovation and innovation diffusion\n- Survey of opportunities in energy storage, including\nscience and technology, policy, and economic aspects\n- Deep dive into one area of technology interest\n\"From the universe of important opportunities, pick the\nmost salient and achievable ones.\"\n\nLogistics\n- MW 2:30-4:00\n- Highly participatory and project-oriented\n- 9 units, graded\n- 15% participation\n- 15% homework\n- 40% project milestones\n- 30% final project\n- \"TEAM TIME\" classes\n\nKey Personnel\n- Course Director: Erika Wagner\nAffiliate Faculty:\n- Fiona Murray\n- Jeff Shames\n- Luis Perez-Breva\n- Dava Newman\n- Ken Zolot\n- Charlie Cooney\n\nSyllabus\n- Weeks 1-2: Incentive Prizes\n- Weeks 3-5: Opportunities in Energy Storage\n- Weeks 5-8: Innovation Incentives &\nStrategic Resource Allocation\n- Weeks 9-13: X PRIZE Development\nKey Project Milestones\n30 Sept: Elevator Pitches: Problem Statements\n28 Oct: Mid-term Team Presentations\n9-14 Dec: Final Presentations to X PRIZE Board members\n\nSpecial events\n- 16 September: X PRIZE Energy Forum\n- 5:00-6:30pm, 54-100\n- 4 November: IDEO Brainstorm\n- After 3pm, IDEO office in Central Square\n- Final Presentations (~3 hours)\n- 9 December\n- Week of 14 December\n\nDr. Ray Kurzweil\nRay Kurzweil has been described as \"the restless genius\" by the Wall Street Journal, and \"the ultimate thinking\nmachine\" by Forbes. Inc. magazine ranked him #8 among entrepreneurs in the United States, calling him the \"rightful\nheir to Thomas Edison,\" and PBS included Ray as one of 16 \"revolutionaries who made America,\" along with other\ninventors of the past two centuries. Along with Larry Page, Ray devised the solar-based energy plan for the recent\n\"Grand Challenges in Engineering\" blue ribbon panel of the National Academy of Engineering.\nDr. George Church\nGeorge Church is Professor of Genetics at Harvard Medical School and Director of the Center for Computational\nGenetics. With degrees from Duke University in Chemistry and Zoology, he co-authored research on 3D-software &\nRNA structure with Sung-Hou Kim. His PhD from Harvard in Biochemistry & Molecular Biology with Wally Gilbert\nincluded the first direct genomic sequencing method in 1984. George is a co-founder of LS9, Inc., an industrial\nbiotechnology company developing biofuels made with the power of synthetic biology.\nDr. Saul Griffith\nSaul Griffith has multiple degrees in materials science and mechanical engineering and completed his PhD in\nProgrammable Assembly and Self Replicating machines at MIT. He is the co-founder of numerous companies\nincluding: Low Cost Eyeglasses, Squid Labs, Potenco, Instructables.com, HowToons and Makani Power, which is\nseeking to harness clean energy from high-altitude wind. Saul has received several awards for invention, including the\nCollegiate Inventor's award, the Lemelson-MIT Student prize, and the National Inventors Hall of Fame.\nX PRIZE Energy Forum\n\nSpanish Longitude Prize (1567) Philip II of Spain offered a prize for the discovery of a method of find\nlongitude at sea. In 1598, King Philip III of Spain increased the prize. By one account, the prize was\n6000 gold ducats plus a pension of 2000 ducats a year for life.\nThe Dutch Longitude Prize (1627) Promised by the States General of the United Provinces of the\nNetherlands to anyone who could find a correct method of determining longitude. Reports vary on the\namounts offered by the prize.\nBritish Longitude Prize (1714)\nMeslay Prize (1714) French parliamentarian Rouille de Meslay bequeathed a fund of 125,000 livres for\ntwo prizes to be administered by the French Academie des Sciences. One of the prizes was to determine\nlongitude at sea and discoveries useful to navigation and long-distance voyages. According to one\naccount, \"the Academie made the first navigation award-a substantial 2,000 livres-in 1720, and it\ncontinued to pose research questions and award the Meslay prize into the 1780s.\"144 2,000 livres was\nroughly equivalent to four years of wages for a skilled worker.\nLongitude\n\nHomework\n- Tonight: email instructor with 3 qualities you think\ndefine a good X PRIZE challenge, and 3 types of\nchallenges you think are a poor fit for the model\n- Readings for Monday:\n- Kalil, T. (2006) Prizes for Technological Innovation.\nBrookings Institute Discussion Paper.\n- McKinsey & Co. (2009) \"And the Winner Is...\":\nCapturing the Promise of Philanthropic Prizes.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nESD.172J / EC.421J X PRIZE Workshop: Grand Challenges in Energy\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "ESD.172 Elevator Pitch Assignment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-172j-x-prize-workshop-grand-challenges-in-energy-fall-2009/31156fed64efcaa0b933678a41239528_MITESD_172JF09_pitch.pdf",
      "content": "Elevator Pitch\nPosted: SES #3\nDue: SES #7\nSummary\n1 slide, 60 seconds\nPlease submit a one-slide problem statement (details below). This is the opening of our\nproject marketplace. Each of you will be given 60 seconds to present via this one slide\nwhat you believe to be a particularly compelling technology or application niche in the\nstorage space. We'll vote to determine the top 6 or 7 ideas, then you will have an\nopportunity to rank your top three project choices. We'll use your ranking to formulate 3-\n5 student interdisciplinary teams.\n\nYour 1-slide pitches should include:\n1) The energy storage application or technology that you want to address (This should not\nbe an X PRIZE proposal, but a broad area for you to investigate and build a prize around,\ne.g. \"Integrating renewable generation into the grid\" or \"Compressed air storage\")\n2) At least one piece of quantitative evidence supporting your area of interest.\n3) Any other evidence you would like to present that suggests this area is a good fit for an\nEnergy Storage X PRIZE.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nESD.172J / EC.421J X PRIZE Workshop: Grand Challenges in Energy\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "ESD.172 elevator pitch solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-172j-x-prize-workshop-grand-challenges-in-energy-fall-2009/93a0676706aa07aaf339d3caeae49cf2_MITESD_172JF09_pitch_sol.pdf",
      "content": "Renewable Energy Storage\n-\nThe Mission: develop cheap and effective energy storage technology to\nstore renewable energy (RE) for solar and wind energy.\n-\nAccelerate the integration of RE as practical choices\n-\nComplement current grid system and move towards energy autonomy in niche\narea (20% of the total energy market, currently 8%)\n-\nThe Market for this technology\n-\nMake RE cost effective and reliable\n-\nRealize energy autonomy at residential\nand commercial (only 2.076%)\n-\nWind power generation increase\nrapidly in US (51% increase in 2008)\n-\nThe challenges for RE storage\n-\nThe cost is not competitive (first priority)\n-\nThe density (both power and energy) are not high enough\n-\nThe scale (size) and flexibility of current storage options\nGraph source: EIA website http://www.eia.doe.gov/cneaf/alternate/page/renew_energy_consump/rea_prereport.html\nTable source: http://www.renewable-energy-sources.com/2008/08/12/the-cost-of-renewable-energy/\nSource\nCost KW/h\nCoal\n$0.04\nGas/oil\n$0.08\nWind\nPV\n$0.12\n$0.25 to 0.5\n\nStorage for Intermittent Energy Sources\n- Issue: Energy Demand, Global Warming\n- Need clean (renewable) energy, and lots of it\n- 16 TW additional capacity by 2050 (Nocera, 2009)\n- Most sources are intermittent (solar, wind,\nwave/tidal, etc.)\n- Will be both centralized (legacy) and distributed\n- Storage Need:\n- Bulk storage that can be scaled up/down to meet\ncentralized/distributed storage requirements for\nintermittent energy generation sources\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nESD.172J / EC.421J X PRIZE Workshop: Grand Challenges in Energy\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "ESD.172 Final Project Assignment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-172j-x-prize-workshop-grand-challenges-in-energy-fall-2009/1f94e23c8a266ec986ec3897fa08e73c_MITESD_172JF09_proj_final.pdf",
      "content": "ESD.172J -- TEAM PROJECT, POST-MIDTERMS\nFinal presentations and videos: 11 December, 3-6pm\nFinal papers due NO LATER THAN 18 December\n\nNow that you have a deeper understanding of the area you wish to impact with a prize, design can begin!\n\nThe remainder of the semester will be focused on developing a strong proposal for a future X PRIZE, taking into\naccount not only the desired competitive outcomes, but also public relations, fundraising, team recruiting,\nunintended consequences, ethics, etc.... This proposal will be presented to Board members and advisors of the X\nPRIZE Foundation for possible further development into fully funded prizes.\n\nAssignment: Given a $20M prize cap and the constraints of the X PRIZE model,\ndesign the next X PRIZE with a focus on Energy Storage.\n\nSteps:\n1. Prize Matrix\n\nDraft due by 12noon on 18 Nov\nUsing the template, summarize your top prize idea. Come to class ready to present your basic prize concept\nin 2 minutes or less. We will review and critique the draft prize matrices, with an eye towards improving\nimpact, identifying weaknesses, and strengthening public appeal. Revised matrices are due in time for class\non the 25th.\n\n2. Final Presentations\n\nDry run on 2 Dec, Final pitch on 11 Dec\nFinal presentations will be made to an audience of faculty, advisors, and X PRIZE Board Members. Quality\nof both materials and delivery is expected to be high. The team will be given an opportunity to complete a\nfull dry run in order to work out the kinks.\n\nFormat for the presentation may be of your choosing, but should include the following two pieces:\n-\nA 1-2 minute video pitch of your concept, designed to pique interest in our audience. Delivery\nstyle is your creative choice. Videos will be uploaded to YouTube and should utilize images and\naudio covered under the Creative Commons License.\n-\nA 15-20 minute presentation of your work (plus Q&A), designed to convey your prize concept and\nkey findings in depth, with a focus on selling the prize concept to the X PRIZE Foundation, and\nhighlighting key challenges remaining in its execution.\n-\nPresentations should include, but are not limited to:\no Prize concept, with justification and implementation details as outlined in the prize matrix\no Detailed thinking behind the values you've selected in \"turning the knobs\", including both\nkey rules and purse amounts (e.g. why 100 km? why $10M?)\no Justification behind any new metrics created for this prize (e.g. MPGe)\no Analysis of why you think this area makes a good, near-term X PRIZE prospect (consider\nusing models of innovation and analysis as presented in class)\no Current state of the art in this area, and lead innovators\no Launch strategy for the prize, highlighting one or more key audiences, messages, media,\nand delivery options\no Any further partnerships and/or PR campaigns you'd like to support the prize\n(e.g. Genome 100)\no Any key challenges (besides fundraising) you'd like resolved prior to launch\n\n(NOTE: while you are welcome to present slides on the process by which you reached your final concept, it\nis not required. Those details will be expected in your final reports.)\n\n3. Final Reports (Team & Individual)\n\nDue NO LATER THAN 18 Dec (no extensions)\nFinal team reports are intended to capture details of process, analysis, and research that may not be as\nrelevant or interesting for the presentation audiences. In addition to the materials presented on 11 Dec, the\nteam should turn in one final report, 10-15 pages in length, plus appendices. These reports should include:\n-\nFinal prize matrix and justification, including any reviews you may have conducted on market size,\nexisting solutions in the space, challenges to implementation, etc.\n-\nProcess flow detailing your journey from initial concept to final presented conclusions\n-\nAnalysis for your final prize concept\n\nBy the same deadline, each individual should also submit a 1-2 page summary on where you believe prizes\nfit in the innovation ecosystem. Specifically, highlight 3 situations or market conditions in which you think\nincentive prizes work well, and 3 where you think they fare less well. As in the first assignment of the\nsemester, these should not be prize ideas (e.g. high efficiency cars), but rather characteristics of a space\nneeding innovation (e.g. there is more than one potential competitor). Justify your judgment.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nESD.172J / EC.421J X PRIZE Workshop: Grand Challenges in Energy\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "ESD.172 prize matrix solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-172j-x-prize-workshop-grand-challenges-in-energy-fall-2009/ced97be6dc4b048db9121c3cc88f372a_MITESD_172JF09_matrix_sol.pdf",
      "content": "PRIZE ELEMENT\nDESCRIPTION\nPRIZE CONCEPT\nThe purpose of this X PRIZE competition is to dramatically reduce the costs\nassociated with grid-scale energy storage and accelerate market acceptance and\ndeployment of this technology, particularly with the goal of enabling renewable\nenergy generators to enter the market at a large scale.\nPURSE SIZE AND\nDISTRIBUTION\n$10 Million plus a $15 Million 30-year AMC to a single winning team\nTIMEFRAME\nOpen ended (estimated 5-10 years)\nTARGET\nPARTICIPANTS\nEnergy storage suppliers/manufacturers, startup energy storage device companies\nTEAM\nCOMPOSITION\nOpen to any private group from any nation. Each team may have any number of\nparticipants.\nREGISTRATION\nREQUIREMENTS\nA team must complete a form detailing the storage technology that will be pursued,\npay a $1000 registration fee, be accepted by the X PRIZE Foundation as a team,\nexecute the Master Team Agreement (MTA) once available, and comply with the\nrules and provisions of the MTA.\nGrid‐Scale Storage\n\nPERFORMANCE\nMEASURES AND\nWINNING CRITERIA\nThe prize will be awarded to the first team that can build an energy storage\ndevice with a capacity of at least 150 MWh, a charge/discharge rate of 25 MW,\na ramp rate of at least 2.5 MW/min with a zero-crossing delay of no more than\n10 minutes, and at a demonstrated lifetime annual cost outlay of no more\nthan $500,000 via a repeatable manufacturing process. These metrics will be\ndemonstrated through testing (\"behind the scenes\") as well as a final publicized\nelectric train run at a location TBD by the X PRIZE Foundation with a second unit.\nIf more than one team attempts the competition at the same time, and more than\none team fulfills all the criteria, then teams will be ranked according to roundtrip\nefficiency (by the method outlined in the MTA). No more than three teams will be\nranked and will share the purse in the following manner: $7.5 million and the\nAMC(s) to the winner and $2.5 million to the second place team (if two teams are\nsuccessful) or $7 million and AMC(s), $2 million, and $1 million if three teams are\nsuccessful.\nREPORTING AND\nJUDGING\nREQUIREMENTS\nTeams will make appropriate accommodation to give the judges unfettered access\non a non-interference basis. Teams agree to fully cooperate with the judges during\npre-demonstration testing, verification, and competition requirements, and will\nshare with the judges information about the device, its components, and the\nprocesses used to store energy. Information shared with the judges shall remain\nconfidential. Teams will answer all questions posed by the judges in order to enable\nthe judges to verify the certifications provided by the teams. The intent of the X\nPRIZE Foundation is to protect as fully as possible all trade secrets and technical\nknow-how of the competing teams.\nGrid‐Scale Storage\n\nADDITIONAL\nELEMENTS\nThe storage device developed by the team shall include all necessary power control\nelectronics for AC-in to AC-out \"plug-and-play\" operation. This type of operation will be\nrequired during the testing and demonstration phases of the competition. Construction\nand transportation (if required) of a second storage device to the demonstration site will\nbe the team's responsibility. The first team to announce demonstration readiness will be\nevaluated by the XPF for approximately one month on the first device, after which, if the\nteam is found to be demonstration-ready, the demonstration will be set for one year from\nthat date and all other registered teams will be informed of the demonstration deadline.\nIf other teams become demonstration-ready during that year, they will have the\nremaining time (minus one month for XPF evaluation) for construction/transportation of\ntheir second device. At three months before the demonstration no new teams will be\nexcepted for consideration.\nFUNDING\nGUIDELINES\nThe technology used in the attempt can be developed privately, or under a government\ncontract or grant. However, the device itself and all components related to performing the\ndemonstration, shall be constructed or purchased and operated using private funds.\nTeams attempting to participate by using direct or indirect government subsidies will be\ndisqualified.\nGrid‐Scale Storage\n\nPrize Matrix : Home-Scale Storage\nPRIZE ELEMENT\nDESCRIPTION\nPRIZE CONCEPT\nThe purpose of this X PRIZE competition is to prompt the creation of a large energy storage capacity by\ndeveloping a radically new, minifridge-sized storage device cheaply enough to be compelling for a large number\nof individual homeowners to buy.\nPURSE SIZE AND DISTRIBUTION\n$5 million + a $5 million contract for 50,000 units for the first prize winner; $5 million dollars for a possible\ncogeneration unit.\nTIMEFRAME\nOpen ended (estimated 5 years)\nTARGET PARTICIPANTS\nDesigners and manufacturers of energy storage devices.\nTEAM COMPOSITION\nOpen to any group from any nation. Each team may have any number of participants.\nREGISTRATION REQUIREMENTS\nA team must pay a $1000 registration fee, be accepted by the X PRIZE Foundation as a team, execute the\nMaster Team Agreement (MTA) once available, and comply with the rules and provisions of the MTA.\nPERFORMANCE MEASURES AND\nWINNING CRITERIA\nThe X PRIZE will be awarded to the first team that builds 100 energy storage devices that can store at least 5\nkWh at 70% round-trip efficiency, pass accelerated lifetime testing that indicates an average lifetime of at least\n4±0.5 years, and create a business plan that will show that they can scale up production to at least 25,000 units\nper year within two years. Once a team declares that they will be making a delivery, other teams will have a\nmonth to make a delivery of their product; if more than one team meets the minimum criteria, ties will be\ndetermined by average roundtrip efficiency over the accelerated lifetime testing. Cogeneration devices must\nproduce combined electrical and thermal energy at 70% efficiency.\nREPORTING AND JUDGING\nREQUIREMENTS\nTeams will deliver their devices to an X-PRIZE-run testing site, where they can observe the judges testing the\ndevices. The judges shall monitor all aspects of the attempt, devices, and operations of the devices during the\nattempt period. Teams agree to fully cooperate with the judges in monitoring the attempt and competition\nrequirements, and will share with the judges information about the device and its components. Information shared\nwith the judges shall remain confidential. Teams will answer all questions posed by the judges in order to enable\nthe judges to verify the certifications provided by the teams. The intent of X PRIZE Foundation is to protect as\nfully as possible all trade secrets and technical know-how of the competing teams.\nADDITIONAL ELEMENTS\nThe technology must pass standard home-use generator safety requirements, and the mass of a given raw\nmaterials that goes into an individual device must be less than 4*10^(-7) of the 2007 worldwide production of that\nraw material.\nOPEN QUESTIONS\nWill production of these storage devices produce more greenhouse gases than they remove from the\natmosphere?\n\nPrize Matrix: X PRIZE for Energy Storage (Developing World)\nPRIZE ELEMENT\nDESCRIPTION\nPRIZE CONCEPT\nTo enable a new era of economic and social development in off-grid regions of the world\nby the provision of an affordable energy storage system using renewable energies to\nharvest energy and to replace fossil fuels as the current dominant energy storage\ntechnology.\nPURSE SIZE AND DISTRIBUTION\n$7.5 Million (USD) for grand prize, $2.5 Million for deployment prize, $1 Million for flexible\ngeneration bonus prize, and $1 Million for extremely low-cost bonus prize\nTIMEFRAME\nFor grand prize, winning criterion is first to achieve, but there is a 5-year deadline from\nprize announcement. The clock for deployment bonus prize (also first to achieve) starts\nwhen grand prize is won and has 2-year deadline. The other two bonus prizes have no\ndeadlines.\nTARGET PARTICIPANTS\nLarge energy storage manufacturers, large diesel generator manufacturers [e.g.\nMahindra Poweral], small energy storage manufactureres [e.g. Deeya Energy], hobbyists,\nuniversity teams, government teams [e.g. US DoE or GoI MNRE]\nTEAM COMPOSITION\nOpen to any public or private group from any nation. Each team may have any number of\nparticipants.\nREGISTRATION REQUIREMENTS\nA team must complete a form detailing a description of the proposed energy storage\nsolution (including reliability and manufacturability assessments), pay a $500 registration\nfee, be accepted by the X PRIZE Foundation as a team, execute the Master Team\nAgreement (MTA) once available, and comply with the rules and provisions of the MTA.\nPERFORMANCE MEASURES AND WINNING CRITERIA\n(GRAND PRIZE)\nThe X PRIZE for Energy Storage (Developing World) will be awarded to the first team that\ncan build a device with demonstrated cost of less than $2500 (USD) and use it to\ncomplete the following tasks. Operate 5 business/commercial applications for 10 hours\nnon-stop on 5 consecutive days. Each of the applications will require approximately 5kW\nof power and will be standardized. Each team will have the choice of using any of 5\nstandardized charging stations (solar, wind, hydro, biomass gasification, and waste-to-\nenergy).\nPERFORMANCE MEASURES AND WINNING CRITERIA\n(DEPLOYMENT PRIZE)\nThe X PRIZE for Deploying Energy Storage (Developing World) will be awarded to the\nfirst team that runs energy storage systems in 50 villages (chosen by the X PRIZE\nFoundation) for 5 months meeting the following requirements. System reliability (only\nallowed to fix or change any of the machines up to a total of 7 times) and system\navailability (up to 7 days off out of 5 months); The X PRIZE Foundation will give\ncompetitors access to buy the standardized charging stations used for adjucating the\nGrand Prize.\n\nPrize Matrix: X PRIZE for Energy Storage (Developing World)\nPRIZE ELEMENT\nDESCRIPTION\nPERFORMANCE MEASURES AND WINNING CRITERIA (FLEXIBILITY\nBONUS)\nThe Flexibility Bonus will be awarded to the winner of the grand prize if\nall five charging stations are used.\nPERFORMANCE MEASURES AND WINNING CRITERIA (LOWCOST\nBONUS)\nThe Low-Cost Bonus will be awarded to the winner of the grand prize if\nthe demonstrated cost is less than $1000.\nREPORTING AND JUDGING REQUIREMENTS\nTeams will make appropriate accommodation to give the judges\nunfettered access on a non-interference basis. The judges shall monitor\nall aspects of the attempt, devices, and operations of the devices during\nthe 5-day attempt period. Teams agree to fully cooperate with the judges\nin monitoring the attempt and competition requirements, and will share\nwith the judges information about the system, which comprises the\ndevice and its components. For the Deployment Prize, the teams will\nshare with the judges information about the business plan. Information\nshared with the judges shall remain confidential. Teams will answer all\nquestions posed by the judges in order to enable the judges to verify the\ncertifications provided by the teams. The intent of X PRIZE Foundation is\nto protect as fully as possible all trade secrets and technical know-how of\nthe competing teams.\nADDITIONAL ELEMENTS\nThe technology used in the attempt can be developed publically or\nprivately. The system may also be purchased and operated using public\nor private funds.\nOPEN QUESTIONS\nTechnological innovation solutions here can be potentially proliferated to\nother users who are connected to the grid. The connection of storage\nsolutions to the grid will potentially further cause supply demand\ninbalance to the grid system unless future supply can meet demand;\nnegative reinforcing loop. How can the system address to prevent\ncausing a negative effect to the existing grid infrastructure.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nESD.172J / EC.421J X PRIZE Workshop: Grand Challenges in Energy\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "ESD.172 Prize Matrix Template",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-172j-x-prize-workshop-grand-challenges-in-energy-fall-2009/fbf53e20fb6536592626cc06aac045c8_MITESD_172JF09_matrix.pdf",
      "content": "Prize Matrix Sample:\nThe prize elements for the Archon X P\nCreate a similar matrix for your prize.\nPRIZE ELEMENT\nPRIZE CONCEPT\nPURSE SIZE AND DISTRIBUTION\nTIMEFRAME\nTARGET PARTICIPANTS\nTEAM COMPOSITION\nREGISTRATION REQUIREMENTS\nPERFORMANCE MEASURES AND\nWINNING CRITERIA\nREPORTING AND JUDGING\nREQUIREMENTS\nADDITIONAL ELEMENTS\nOPEN QUESTIONS\n\nArchon X PRIZE for Genomics\nPRIZE for Genomics have been broken down and are listed below.\nDESCRIPTION\nThe purpose of this X PRIZE competition is to develop a radically new technology that will dramatically reduce the\ntime and cost of sequencing genomes, and enable a new era of predictive and personalized medicine. X PRIZE\nFoundation hopes to enable the development of low-cost diagnostic sequencing of human genomes.\n$10 million to a single winning team\nOpen ended (estimated 3-5 years)\nDesigners and manufacturers of genome sequencing instrumentation\nOpen to any private group from any nation. Each team may have any number of participants.\nA team must complete a form detailing a description of proposed sequencing methodology, pay a $1000\nregistration fee, be accepted by the X PRIZE Foundation as a team, execute the Master Team Agreement (MTA)\nonce available, and comply with the rules and provisions of the MTA.\nThe X PRIZE for Genomics will be awarded to the first team that can build a device and use it to sequence 100\nhuman genomes within 10 days or less with an accuracy of no more than 1 error in 100,000 base pairs, with\nsequences accurately covering at least 98% of the genome, and at a demonstrated cost of no more than $10,000\nper genome. If more than one team attempts the competition at the same time, and more than one team fulfills all\nthe criteria, then teams will be ranked according to the time of completion. No more than three teams will be\nranked and will share the purse in the following manner: $7.5 million to the winner and $2.5 million to the second\nplace team (if two teams are successful) or $7 million, $2 million, and $1 million if three teams are successful.\nTeams will make appropriate accommodation to give the judges unfettered access on a non-interference basis.\nThe judges shall monitor all aspects of the attempt, devices, and operations of the devices during the 10-day\nattempt period. Teams agree to fully cooperate with the judges in monitoring the attempt and competition\nrequirements, and will share with the judges information about the device, its components, and the processes\nused to determine genome sequences. Information shared with the judges shall remain confidential. Teams will\nanswer all questions posed by the judges in order to enable the judges to verify the certifications provided by the\nteams. The intent of X PRIZE Foundation is to protect as fully as possible all trade secrets and technical know-\nhow of the competing teams.\nThe technology used in the attempt can be developed privately, or under a government contract or grant.\nHowever, the device itself and all components related to performing the test, including computational tools, shall\nbe constructed or purchased and operated using private funds. Teams attempting to participate by using direct or\nindirect government subsidies will be disqualified.\nContinuing social and ethical discussions center on the proper use of the final sequenced data and the ultimate\ninterpretation of this information for individuals and their families. For example: could insurance companies deny\ncoverage to someone who has discovered they carry a gene that indicates their future possibility of having a\nparticular disease? Do I have the right to expose my immediate family's genome by having my own genome\nsequenced?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nESD.172J / EC.421J X PRIZE Workshop: Grand Challenges in Energy\nFall 2009\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "ESD.172 Project Midterm Assignment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-172j-x-prize-workshop-grand-challenges-in-energy-fall-2009/d46508b1f5d79ebf1a33e4cddc6478a2_MITESD_172JF09_proj_mid.pdf",
      "content": "ESD.172J -- TERM PROJECT THROUGH MIDTERMS\nPrize space analysis outline and key resources summary\ndue by 19 October (one per team)\nFINAL prize space analysis & midterm presentations\ndue by 28 October 2008 (one per team)\n\nYour elevator pitch provides the lens through which you will be attacking the broad topic of energy storage. Now, you need to\ndevelop a thorough understanding of the space you've selected and the opportunities it offers for a prize. Your midterm\nevaluation will focus on how well you demonstrate a deep knowledge of your niche and how the X PRIZE model can be used\nto realize your goals.\n\nFor this assignment, you are to conduct an analysis of the prize space you have selected, examining:\n-\nValue chain in the current marketplace and your projected marketplace\n-\nMarket failures and market size, investors, incentives\n-\nCurrent technology solutions in the space and predicted trends, including estimated key figures of merit (e.g.\nat what price, energy density, power density, etc., does this innovation seem likely to take hold?)\n-\nSurvey of user needs\n-\nAlternative applications for a successful breakthrough\n\nFor your final draft, you will need to:\n1. Discuss your draft with your IDEO mentors and incorporate their feedback.\n2. Identify (with appropriate justification) 3 elements highlighted by the analysis that you believe are ideal\ntargets for future X PRIZEs (i.e. what possible level of performance, proof of concept, or demonstration at\nscale would cause a paradigm shift in this area?) Make use of your key readings, mentors, and other\nresources to back up your claims with more than assumptions.\n3. For your midterm presentation on 28 October, each team will be given 15 minutes to present. Content\nshould focus on describing the problem you are trying to solve, and highlighting the key features of your\nanalysis above. Finally, you should present 4-6 broad concepts for future X PRIZEs that address one or\nmore of your proposed targets. (e.g. if you need to demonstrate high energy density, a prize concept might\nchallenge teams to run a car for maximum distance) At this point, I'm not looking for detailed proposals\nand optimized parameters, just broad brush strokes of the prize in 1-2 phrases or sentences.\n\nFor illustrative purposes, below is a rough example (without the supporting data you will want to bring to bear for\nyour work):\n\nProblem Statement: Access to space is prohibitively expensive\n\nKey Targets: Only governments build rockets.\n\nNo vehicle exists primarily for space tourism.\n\nLower risk reentry technology is needed.\nX PRIZE Concepts: Private orbital human spaceflight.\n\nPrivate suborbital human spaceflight.\n\nPrivate unmanned rocket to orbit.\n\nTrans-Atlantic suborbital cargo delivery.\n\nHalf price Space Shuttle Main Engines.\n\n\"Egg drop\" from orbital altitude.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nESD.172J / EC.421J X PRIZE Workshop: Grand Challenges in Energy\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "ESD.172 Team Contracts",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-172j-x-prize-workshop-grand-challenges-in-energy-fall-2009/15d9b742d0a84819711948d2734f47e6_MITESD_172JF09_contracts.pdf",
      "content": "ESD.172J -- DRAFTING A TEAM CONTRACT\nDue by SES #9 (one per team)\nPLUS Reference and advisor lists (also Due SES #9)\n\nTo ensure that all students on a team are committed to the success of the project, understand the constraints of\ntheir teammates and are on the same page in terms of commitment, each team will draft a team contract.\nFormat and length are up to you.\n\nBoth at mid-term and at the end of the semester, students will be asked to rate the contribution of their\nteammates. Students will be given 100 points to allocate, however they see fit, to their teammates. If a given\nstudent is allocated significantly fewer points than the other members of the team, this will be taken into account\nin final grading.\n\nPlease keep the following in mind as you draft your contracts:\n\nTime Commitment\n-\nWhat is each team member's availability this semester?\n-\nWhen are appropriate times to meet for the team (e.g., working hours only, weekends, cutoff time of X\npm, etc.)?\n-\nShould the team have standing meetings? When?\n-\nWhat is a reasonable amount of time to spend per week on team activities?\nEffort Level/Grading\n-\nWhat does each team member expect to contribute to this project and what grade expectation do they\nhave based on this contribution?\n-\nDo any team members have special considerations re: this project (e.g., future publication, job\nopportunities, etc.)?\n-\nDo team members have any conflicts of interest as a result of other projects or financial/entrepreneurial\ninterests, etc.?\n-\nWhat constitutes a failure to provide effort (e.g., missing team meetings, missing deadlines) and when\ndoes the team expect to confront a failure to provide effort?\nTeam Meetings and Communications\n-\nShould there be an appointed timekeeper, moderator, and/or note taker during team meetings? Will\nthese roles be fixed or rotating throughout the semester?\n-\nHow will the team communicate (e.g., email, listserv, wiki, phone)?\n-\nWhat are the expectations for communication - e.g., responses in 24 hours, etc.?\n-\nHow will the team communicate and coordinate with external advisors?\nDecision-Making\n-\nDoes the team plan to use \"majority rules\" or require consensus before proceeding?\n-\nDoes the team have a plan with regard to conflict resolution - e.g., will external mediators be required?\nIf so, at what point? What is the team's feeling about external (i.e. Instructor/TA) mediation?\nTimeline Management\n-\nShould there be an internal team timeline/due date for deliverables?\n\nNOTE: Also due by SES #9 - each team should submit one key reference per team member and 2 possible\nadvisors to support your efforts for the semester. A list of citations and the names/affiliations of candidate\nadvisors may be submitted as a Word document.\n\nKey references: Each team member should be responsible for reviewing and summarizing one major\njournal article, government report, industry analysis, or other high-quality resource on your area of interest.\n(Popular press articles and Wikipedia entries are not sufficient!) Summaries will be due in two weeks (SES\n#11).\n\nPossible advisors: Each team will be assigned one process mentor from IDEO and one relevant technical\nmentor from academia, government, or industry. To assist us in pairing you with an appropriate mentor,\nplease submit the names and affiliations of 2 possible technical mentors that you have identified in your\nspace. If you know these individuals personally, and would like to contact them directly, please make note\nof that. Otherwise, we will work together to make the cold call.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nESD.172J / EC.421J X PRIZE Workshop: Grand Challenges in Energy\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Using Incentive Prizes to Drive Creativity, Innovation and Breakthroughs",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-172j-x-prize-workshop-grand-challenges-in-energy-fall-2009/9d674da4079b92e65b7a0b2c0186dbe9_MITESD_172JF09_Diamandis.pdf",
      "content": "Peter H. Diamandis, MD / X PRIZE Foundation (c) X PRIZE Foundation, 2009 Pg 1\n\nUsing Incentive Prizes to Drive Creativity, Innovation and Breakthroughs\nBy Peter H. Diamandis, MD, Chairman/CEO, X PRIZE Foundation\nwww.xprize.org\n\nIncentive Prize Overview\nThis paper discusses the use of incentive prizes to drive creativity, innovations and\nbreakthroughs. Incentive prizes offer a large reward upon completion of a specific objective\ntask. Traditionally they are large cash purses awarded to individuals or teams who build and\ndemonstrate a new system (typically technology based) or accomplish a first time feat.\n\nIt is my belief that such prospective prizes that reward innovators for achieving a specific\nmeasurable goal have profound economic and psychological levers for accelerating and\nenabling innovation in areas that might otherwise be stuck for a number of reasons.\n\nWhile prizes are not a panacea for driving innovation, they do provide an enormous amount of\nleverage and should be part of every organizations innovation tool box. Unfortunately, prizes are\nbeing vastly underutilized at this time. My personal objective is to encourage the notion that\n10% of all philanthropic giving and 10% of all research grants should be in the form of incentive\nprizes which will result in additional capital and talent entering into the innovation marketplace.\n\nProperly structured incentive prizes have a number critical attributes worth considering:\n(1) Efficiency: You only pay the winner. The prize stands until the goal is achieved. In one\nfashion it is fixed cost science or engineering.\n(2) Leverage of Resources: Traditionally a well structured prize can drive 10 - 40 fold the\namount of the prize purse spent cumulatively by the teams to win. Prizes cause non-\ntraditional funding sources (philanthropic funds, ego money and corporate sponsorship)\nto enter into a field.\n(3) Industry Creation: Rather than back a single approach to a problem which traditionally\nhappens with venture capital funding where you need to \"pick the winner\" in advance, an\nincentive prize can support a wide variety of approaches/solutions to come into\nexistence to address a challenge, thereby creating an entire industry\n(4) Paradigm Change: A properly structured prize can change what people believe is\npossible... which is the first step to any innovation... You have to believe it is possible.\n\nAs Astronaut Byron Lichtenberg, a close friend and early co-founder of the X PRIZE Foundation\nonce said, \"Without a target you'll miss it every time.\" Incentive prizes offer innovators and\ndoers a target to shoot for and a publically celebrated goal to achieve.\n\nThis paper investigates the fundamental drivers that are necessary to inspire exceptional\ncreativity in science and technology and builds the case that incentive prizes have powerful and\nwide ranging psychological and economic impact on this goal.\n\nSome of the best known incentive prizes (expanded upon in Appendix 1) are:\n-\nLongitude Prize: Over ₤100,000 in purse money offered by the British Government\n(Board of Longitude). Won principally by John Harrison for his chronometers between\n1737 - 1764.\n\nPeter H. Diamandis, MD / X PRIZE Foundation (c) X PRIZE Foundation, 2009 Pg 2\n\n-\nOrteig Prize: $25,000 offered by Raymond Orteig for the first non-stop New York - Paris\nflight. Won by Charles Lindbergh in the Spirit of St. Louis in 1927.\n-\nKremer Prize: Offered in 1959 by Henry Kremer. The first Kremer prize for £50,000 was\nwon by Dr. Paul MacCready in 1977 in the Gossamer Condor for human powered flight\naround a figure eight flown between two markers 1⁄2 mile apart.\n-\nDARPA Grand Challenge: The DARPA Grand Challenge ($1M) and Urban Challenge\n($2M) was a prize competition for driverless cars sponsored by DARPA. The Grand\nChallenge was the first long distance competition for driverless cars in the world. Over\nthe course of the first two years more than 195 different teams registered to compete.\n-\nAnsari X PRIZE: A $10 million purse offered by the X PRIZE Foundation for the first\nteam to fly a privately built 3-person spaceship to 100 km twice within two weeks. The\nprize was won by Burt Rutan's SpaceShipOne funded by Paul Allen.\n\nThe Drivers of Innovation\nTrue innovations are often a radical departure from accepted theories, modes of business and\nbeliefs. As such, early on, they can be considered nonsensical, impossible or worse yet,\nheretical before they are ultimately proven and accepted. For this reason, true innovation\nrequires a willingness to take substantial risk.\n\nSo what are the fundamental drivers that push individuals, groups and organizations to take risk\nand innovate?\ni.\nCuriosity: The desire to find out why? To take on a challenge and find the answer is a\nvery important long-standing driver, but unfortunately it is one of the weakest, especially\nas compared to fear or greed.\nii.\nFear/Defense: Nothing focuses one's mind like fear - the fear of harm at the hands of an\nenemy, the fear of losing in a competition. Extraordinary fear enables extraordinary\nlevels of risk-taking (e.g. \"nothing to lose\"). An excellent example is the incredible risks\ntaken by the Apollo program in response to Soviet successes with Sputnik and Gagarin.\niii.\nWealth Creation/Greed: The desire to create wealth, to multiply one's resources is a\nfundamental driver in the capitalist society. Best exemplified by the Venture Capital\nindustry that will back 10 ideas hoping for one grand-slam winner. On a smaller level,\nPaul MacCready's motivation to compete for the Kramer prize was a desire to win the\nfunds to pay off personal debt.\niv.\nSignificance/Fame/Sport: The need for recognition of colleagues; the desire for fame\nand adoration from the public, or the desire to transition from \"success to significance\".\nThis is one of the fundamental human drivers. There is a basic desire to compete for\nsport and pride. We are genetically predisposed to compete, we enjoy it. What causes\nthe wealthy to spend $80 million (on average) to compete for the America's Cup?\n\nI propose that a simplified way to measure the ratio of \"curiosity\" to \"fear\" to \"greed\" as a driver\nin our society can objectively be measured by the ratio of the government \"science budgets\" to\nthe \"defense budgets\" to the \"corporate R&D budgets.\"\n\nPeter H. Diamandis, MD / X PRIZE Foundation (c) X PRIZE Foundation, 2009 Pg 3\n\nOn the flip side, what are the drivers that block risk-taking and innovation?\ni.\nFear: A fear of failure, and therefore a desire to avoid criticism and embarrassment.\nii.\nProtectionist Attitude: Ultimately, innovation is disruptive and can topple industries and\ninstitutions. Large organizations such as government, corporations, and religious\norganizations desire to maintain the current balance of power in leadership and invested\ninfrastructure.\n\nUltimately incentive prizes promote and focus the positive drivers of creativity and innovation,\nand buffer the negative drivers. Properly structured, prizes can enforce drivers such as\ncuriosity, fame, significance, wealth creation and provide the construct that encourages a\ncompetitive mindset. On May 18th, 1996 at the X PRIZE Foundation Gala dinner, aeronautics\ndesigner Burt Rutan said, \"I've never in my life been so creative as I have been going after this\ngod-damn prize! I'm not going to tell you what I've come up with because I want to win this\nthing!\"\n\nPrizes also offer an \"off balance sheet\" mechanism to deal with fear of failure. An organization\nwishing to try radical approaches without the recrimination of failure can put up a prize. Failures\nof the competing teams don't inure to the detriment of the funder, because they back the entire\ncompetition not any one specific team or approach.\n\nState of Mind\nYour attitude in approaching a problem is perhaps your most important attribute in solving it. A\npositive, \"this is solvable\" approach fundamentally affects all those involved. There are three\nbasic 'states of mind' that an individual has when approaching a possible challenge. Each state\nof mind will affect an individual's creativity, level of risk taking and their ability to marshal the\nresources to solve the problem.\ni.\nSomething is impossible: Someone who believes something is impossible is partially\ncorrect... it is impossible for them. In order for someone to solve a problem, they\nfirst need to be believe that it is solvable. Many \"experts\" in a field become\nconvinced of existing doctrine that then limits their thinking (e.g. pre-Copernican\nthinking that the Earth was the center of the Universe). The definition of an expert\ncan sometimes be, an individual who tell you why something can't be done.\nii. Belief that something is possible: An individual (or group) who believes in their heart\nthat something is possible, but cannot yet prove it, can take on an almost religious\npassion resulting from their faith and their desire to prove themselves right. Also a\ngroup racing to achieve a meaningful objective, especially in a race against another\nteam or against the clock can cause the best ideas and individuals to surface to the\ntop. The early days of the Apollo program had this state of mind. The 400,000\nindividuals who joined NASA on its mission to beat the Soviet Union to the Moon,\nbelieved that the goal was possible, but knew the outcome was far from certain.\niii. Knowledge that something is possible, but needs demonstration: This is the situation for\nan innovator that has seen some convincing expression of a concept and actually\nwants to invent it, or has seen a technology prototype and wants to reinvent and/or\nimprove on how it is implemented, or is convinced that the curve of improvement of a\ntechnology is predictive of what is to come and desires to find the next breakthrough\nrequired to implement the improvement. Figure-1 below (Source: Ray Kurzweil) is\nsuch an example. People have heard of Moore's law that the price/performance of a\ncomputer will double every 18 months. What people fail to understand is that this\n\ncurve has been marching on for the past 100+ years at a fairly consistent pace\nduring times of depression, recession and war. Also that we are now in the fifth\nparadigm of Moores Law (Relays, vacuum tubes, transistors, integrated circuits,\netc.). The technologies to continue this curve into the sixth and seventh paradigm\nstill need to be invented, but this provides a strong incentive to inventors to believe\nthat this is possible.\n\nFigure-1\n\nIncentive prizes have a fundamental effect on the innovator's state of mind helping move people\nfrom \"something is impossible\" to \"belief that it is possible\". Proposing a specific goal in an\nappropriate fashion, \"above the line of super credibility\" (Figure-1) can cause people to begin\ndreaming, wondering, plotting to find a solution, and for capital to begin focusing on the problem\nat hand.\n\nThe concept illustrated in Figure-2 is the notion that \"how\" you announce an audacious idea is\nas critical to its success as the idea itself.\n\nAn audacious idea that is announced to the public \"below the line of credibility\" (1) (a subjective\nmeasure) is immediately doomed to failure. The meme is not transmitted, and everyone who\nhears it discounts it immediately. An audacious idea born \"above the line of credibility\" will\neither die (2a) or live (2b) depending on early actions taken by the participants of the challenge\nand the response given by the public and the media. An audacious idea \"born above the line of\nsuper credibility\" (3) is a success from the beginning. In the minds of the media, the public, and\nthe prospective innovators, the challenge is seen as worthwhile and achievable. The idea has a\nmuch higher likelihood to attract the creative thinkers and capital required for the challenge. As\nan example of being born above the line of super-credibility, on May 18th, 1996, the Ansari X\nPRIZE for spaceflight was announced with tremendous acceptance. On that day, despite there\nbeing no money in the purse and no teams competing, the prize was announced under the Arch\nin St. Louis with twenty astronauts on stage (including co-Founder Byron Lichtenberg and\nApollo Astronaut Buzz Aldrin), the NASA Administrator, the Associate Administrator for\nspaceflight of the FAA, the Lindbergh Family and senior members of the St. Louis community.\nPeter H. Diamandis, MD / X PRIZE Foundation (c) X PRIZE Foundation, 2009 Pg 4\n\nThe media response was global and positive driving believe that the purse was fundable, the\ngoal laudable and the results achievable.\n\nFigure-2\n\nTargeting of Innovation\nOnce the drivers are place to encourage innovation, the next question is how do creative\nindividuals choose where to focus their creative energy? What provides the targeting\ninformation for the innovator? I would propose there are four major mechanisms; each of these\nis resonant with different drivers:\n\n-\nCuriosity: First, there is personal curiosity, intuition and free thought. Perhaps this is\nbest exemplified by the nature of Albert Einstein's work on special relativity... day\ndreaming and asking the question \"what if\".\n\n-\nInstitutional Direction: Guidance from one's mentor or funding institution.\n\n-\nEmergent Conditions: The Nazi threat of World-War II leading to the Atomic Bomb and\nthe Soviet launch of Sputnik leading to the Apollo 11 Moon landing. (Note: both the\nAtomic Bomb development and the first Moon landing were themselves effectively\ncompetitions/races).\n\n-\nGrand Challenges: A publicly recognized target of importance, reinforced by a\nsignificant cash purse, can provide tremendous targeting inspiration.\n\nPeter H. Diamandis, MD / X PRIZE Foundation (c) X PRIZE Foundation, 2009 Pg 5\n\nPeter H. Diamandis, MD / X PRIZE Foundation (c) X PRIZE Foundation, 2009 Pg 6\n\nTeam Composition & Attitudes\nWhat are the dynamics and environment that promote successful creative thinking?\n\n-\nTeam Make-up: The following six attributes of the team make-up promote the maximum\ncreative thinking.\n1. Small groups: Where all the players know and respect each other, where\ncommunications and distribution of knowledge is rapid and complete and an\norganizational bureaucracy is not needed and therefore does not put up\nroadblocks. Small groups also have the propensity to take higher levels of risk\nbecause they have less to lose, and in a winning scenario have more to gain\nsince each individual member stands to get significant recognition, not being lost\nin a large organization.\n2. Isolated Environment: Isolating a small team away from larger pre-existing\norganizations was used in a wide range of successful developments from the\nIBM PC to the Apple iPod. As an isolated population they are free to evolve new\npractices and approaches without criticism.\n3. New teams: New teams of individuals who are brought together for a specific\nobjective that are not saddled with pre-existing biases that need to be protected.\nAs an example, the NASA of 1961 was a vibrant single-mission-oriented\norganization with a clearly articulated goal, \"get to the moon before the end of the\ndecade\" (and, oh by the way... also beat the Soviets there). NASA today is\nsuffocating in the political baggage of its job-centric Field Centers and the\nbloated risk-adverse contractors.\n4. Diversity of background: One of the most critical elements for creative team\ndynamic is diversity of background and thought. \"Stove pipe mentality\" or \"group\nthink\" will often cause likeminded individuals to discount potentially fertile\napproaches because peers all share a common bias or blind spot. In addition,\ntraditionally a breakthrough comes from nonsensical, crazy or orthogonal\nthinking and is best surfaced from brilliant individuals from a different field.\nFinally, many breakthroughs and new approaches come at the boundaries\nbetween fields... This interdisciplinary approach is a critical source of insights\n(e.g. where information theory intersects biology).\n5. Charismatic leadership: Existence of a strong and charismatic leader who is\npromoting the attitude \"yes we can\" such as the work of Werner Von Braun in the\nApollo program can make all the difference in keeping a group engaged.\nSometimes it is not the first, second or third attempt but the 100th approach that\nleads to success. As such, keeping a team motivated (or a funding source\nengaged), with a refusal to give up, is fundamental to success.\n6. Youth: One of the most critical mixes in a team make-up is the addition of youth\nwho are unconstrained in their thinking. In some circumstances, age and\nexperience can be a significant detriment. In 1961 when NASA was given the\nimpossible task of putting an American on the surface of the Moon, the average\nage of the engineers who developed the propulsion systems, the navigation and\nguidance, the docking and the structures was in their mid-late twenties. Three\ndecades later, the average age of the engineers who created the dot-com\nrevolution was once again in the mid-twenties. It's critical that innovators don't\nknow what can't be done.\n\nPeter H. Diamandis, MD / X PRIZE Foundation (c) X PRIZE Foundation, 2009 Pg 7\n\n-\nTeam Attitudes: The following four team attitudes promote the maximum creative\nthinking.\n1. Learn to question and not defend: This was the motto of Burt Rutan's team at\nScaled Composites. As soon as people begin to defend their thinking, they begin\nto back themselves into a corner and shut out the option of discovery.\n2. Non-judgmental attitude that doesn't punish failure, but instead celebrates\nsuccess: It is critical that individuals who fail not be punished, but instead are\nallowed to express what was learned from the failed experiment and given the\nsupport to try again. In the same manner, success at any level must be\ncelebrated in a strong fashion within the entire team.\n3. Allowing for crazy \"nonsensical\" ideas: Perhaps most difficult, is how to allow\nteams to try out crazy ideas in a Darwinian approach that allows those which are\nvaluable to rise to the top.\n4. Persistence: Building a culture that refused to give up on a good idea is critical.\nThe notion that there is \"persistence of vision\"... or \"persistence to the point of\nsuccess\" is best demonstrated by Edison and his light bulb filament experiments.\n\nAccess to Capital & Resources\nOne of the most difficult ingredients for creativity and innovation is access to capital. Frequently\nthe leading thinker or innovator of the group is forced to spend 80% of their time raising capital\nto cover salaries and access to resources rather than thinking and/or leading. Worse yet, those\nideas which have the highest probability of producing true breakthroughs are the most novel\nand therefore the most difficult to prove and therefore fund.\n\nIncentive prizes provide an environment which attracts a new \"flavor\" of money that has different\nobjectives. Again the Ansari X PRIZE offers an excellent example. Before announcing the\n$10M purse, any team wishing to fund a private sub-orbital spaceship would need to approach\nan angel investor or venture fund for capital. Any sophisticated investor would immediately say\n\"no\" given the inherent risks, specifically: no proven market, regulatory risks (the laws to allow\nprivate human spaceflight did not exist), technology risk and risk of very visible public failure. As\nsuch, few investment funds flowed towards this technology development arena, and those who\ndid invest lost significant amounts. It was space community expressed this thought with the\nfollowing joke: \"what is the best way to become a millionaire in the space business? Start as a\nbillionaire!\"\n\nAfter the Ansari X PRIZE was announced, teams found it much easier to raise the capital and\nsupport. Rather than seek investment funds, these same teams were able to viably pursue to\nalternative sources of capital: sponsorship and private benefactor money.\n\n-\nSponsorship funding which typically is in the $20 billion - $30 billion per year in the U.S.\nis looking for highly visible, unique opportunities. As the sporting work continues to be\ncluttered, incentive prizes offer a unique alternative. As Sergey Brin, co-Founder and\nPresident of Google said in a video address at the announcement of the Google Lunar X\nPRIZE, \"I knew we never wanted to do something so conventional at Google, I thought if\nwe were ever to sponsor something it should be something ambitious. Having seen the\nsuccess of the Ansari X PRIZE, the fact of having many different entrepreneurs all\ncompeting to accomplish a goal is first more exciting, second more likely to actually\nachieve the goal and third probably less expensive overall.\"\n\nPeter H. Diamandis, MD / X PRIZE Foundation (c) X PRIZE Foundation, 2009 Pg 8\n\n-\nPrivate Benefactor money, which is sometimes called \"ego money\" is the same pot of\nfunds that an individual uses to put their name on the side of a building, or to personally\nfund an America's Cup team. It is money that gives them personal gratification or helps\nbuild a family legacy. A large audacious prize can help wealthy individuals transition\nfrom \"Success to Significance. These levels of funding can run in the tens to hundreds of\nmillions of dollars. The properly constructed prize can entice and attract funds to back a\nteam. As Paul Allen, the vision backer of SpaceShipOne said at the Ansari X PRIZE\npost-flight press conference in October 2004, \"A few years ago I was just browsing the\ninternet and I came across this thing on the X PRIZE and I thought this is kind of\ninteresting, who are the crazy guys trying to do this kind of thing...\"\n\nDesigning Incentive Prizes\nX PRIZEs have been designed to offer significant economic and psychological levers for\naccelerating and enabling innovation in areas that might otherwise be stuck for a number of\nreasons. Following are the most important guiding principles in the design of these incentive\nprizes:\n\n1. Simple, Clear and Objective Rules: When creating an X PRIZE we strive to create simple,\nclear and objective rules that can be easily understood by the public. An objective and clear\nfinish line makes the winning of the prize obvious to the observing public. In the case of the\nOrteig Prize the rules were \"fly non-stop between New York and Paris.\" In the case of the\nAnsari X PRIZE the simple rules could be expressed as \"Fly the same 3-person spaceship,\ntwice to 100 kilometers altitude, twice in two weeks.\"\n\n2. Defining the Problem and Not the Solution: The prize rules should define a problem to\nbe solved, not a specific solution to be implemented. For example, the Ansari X PRIZE did\nnot speak about the type of propulsion or the mechanism of launch or even the location of\nthe launch, only the objective of getting 3 people to 100 km twice in two weeks. As such the\ncompetition saw the design of over a dozen uniquely different approaches.\n\n3. Addressing Market Failures: X PRIZEs are needed to jumpstart a stuck industry and\ndemonstrate a market as well as drive distribution to get critical mass. Prizes should\naddress problems where a market failure prevents solutions due to a blockage such as:\n-\nIndustry or other societal constraints that prevent change\n-\nPeople believe a problem is not solvable\n-\nIndustry, institutional and public misperception or perceptions\n-\nCapital is not available to an important problem\n\n4. The Proper Balance of Audacity and Achievability: The prize needs to be audacious\nenough that it is inspirational and heroic in its pursuit, but not so difficult that it can't be\nachieved. While many thought that the Ansari X PRIZE should be focused on orbital human\nflight, this is 50-fold harder from an energy standpoint than sub-orbital flight. Had this been\nthe objective, the Ansari X PRIZE might never have been won. We recognized that we\ndidn't need to go to orbit in order to stimulate the type of paradigm change we desired to\naffect.\n\n5. Purse Size: We define X PRIZEs as purses that are $10 million or more in size. The $10\nmillion figure is used to break through the media clutter, raise the visibility of a problem and\nattract non-traditional players. The size of the purse is a function of many things including\n\nPeter H. Diamandis, MD / X PRIZE Foundation (c) X PRIZE Foundation, 2009 Pg 9\n\nan understanding of the incentive needed, the value of the back-end marketplace, the\nminimum amount needed to attempt the feat (i.e. degree of difficulty, a purse might be sized\nto be the minimum expected that a team might spend), the perceived importance of the\nproblem, and the sponsors' desire for branding (e.g. the \"biggest ever\"). Teams are typically\nwilling to invest more than the amount of the purse when the properly designed X PRIZE\nhas a back-end business model that allows teams and their backers to capture a return on\ninvestment. While the largest X PRIZE at this moment is $30 million (Google Lunar), in the\nfuture we may see prizes rise to a $100 million or more.\n\n6. Persistent Media Exposure over Time for Prize Competition: A properly designed X\nPRIZE will have a competition structure that allows teams to have repeated exposure in the\nmedia. The persistence of exposure to the public helps drive the paradigm change. In the\ncase of the Ansari X PRIZE, the competition required two flights over two weeks which\nprolonged all media exposure compared to if it had been just for one day.\n\n7. Captivating, Telegenic and Clearly Measureable Demonstrations: X PRIZEs must\nengage the general public in a fashion which gives everyone the opportunity to root for their\nfavorite team and celebrate the victory. X PRIZEs should be designed to generate popular\ninterest throughout the prize lifecycle, from initial competitor enrollment, to the start of the\ncompetition, to the many telegenic attempts at the purse (both successful and unsuccessful)\nand following the completion of a competition. The winning of the prize should be objective\nand clearly measureable to ensure that there is no question or debate. In addition, it is\nimportant people clearly understand why the prize is being conducted, namely, what is the\nradical benefit to humanity being created when the prize is successfully won.\n\n8. Multiple Purses and Bonuses: Using a second place purse and \"Bonus\" purses can\nincrease the number of teams competing and the variety of approaches that they pursue.\nSecond place purses keep teams competing after 1st place is awarded. It can keep teams\nengaged if there is a strong front runner. It can also lengthen the amount of time that the\ncompetition is in the public mind, thereby increasing its ability to achieve the desired\nparadigm change.\n\n9. Launching Above the Line of \"Super Credibility\": The initial announcement of an X\nPRIZE should be done in a very visible fashion with the maximum amount of media\nexposure. The prize launch should publicize the prize, its sponsors and the challenge to the\nworld's press. This is to ensure that the competition is taken seriously from the start.\nProperly done, the prize launch changes the perception of the public from, \"Can it be done?\"\nto, \"When will it happen and who will win?\" At the launch event, it is important to have the\nparticipation of gold-plated endorsers (who share their reputational equity) and even a\nnumber of teams ready to compete.\n\n10. Global Participation/Open to All: X PRIZEs are global in nature, allowing teams from\naround the world to register to compete. We seek the broadest range of qualified teams.\nAny team from any nation is able to register, and the results from the competition are to\nbenefit all of humanity. X PRIZEs are open to all participants independent of age,\neducation, and experience.\n\n11. Targeting a 3 - 8 Year Prize Timeframe: The \"Degree of Difficulty\" of X PRIZEs are\ndesigned so that they are nominally won in a 3 to 8 year time period. If a prize is won in less\nthan 3 years, it was probably too easy; if it takes longer than 8 years to win, most people will\nlose their interest.\n\nPeter H. Diamandis, MD / X PRIZE Foundation (c) X PRIZE Foundation, 2009 Pg 10\n\n12. Using Deadlines to Drive Intelligent Risk-taking: X PRIZEs may utilize a posted\ndeadline, or a stepped down reduction in prize purse to drive teams to make attempts earlier\nin the competition. Such deadlines can always be extended by the prize purse benefactor.\n\n13. Ownership of Intellectual Property & Media Rights: In a typical X PRIZE, the teams\nretain IP and the XPF retains media rights. However prizes can vary and in some cases\nthey may require that the IP is made available to the public, or in some cases that a portion\nof the IP is owned by, or licensed to the prize sponsor.\n\n14. Designed with a Backend Business Model: The ideal X PRIZE is designed so that there\nis a backend business opportunity for the teams to exploit, and enter into revenue business\nonce the prize is won. It was for this reason, for example, that the Ansari X PRIZE required\na 3-person spaceship rather than a one-person ship. The back-end business model makes\nit easier for teams to raise funding for their teams. It is also the case that the publicity\nresulting from the winning of the prize will drive capital investment, innovation deployment\nand market acceptance.\n\nBenefits of an Incentive Prize\nUltimately, these are a dozen key benefits that derive from an X PRIZE Competition worth\nnoting for competing teams and prize benefactors.\n\n1. Attracting New Capital to a Problem: X PRIZEs drive non-traditional financial\nresources toward funding innovation. These funds include a portion of the $20 billion\nsponsorship market that typically funds sporting, arts and entertainment platforms, and\nevents and a portion of the $300 billion dollar philanthropic market.\n\n2. Attracting and Motivating Doers: X PRIZEs attract and motivate non-traditional\nplayers to attack a problem as well as the world's best and brightest minds to work\nharder, faster or in entirely new ways. It is the objective of an X PRIZE to turn these\nteams and their leaders into heroes by shining the media spotlight on them and their\nstories. Prizes give individuals \"permission to turn their dreams into reality\" as well as\nhelp them raise further capital investment because of the increased visibility.\n\n3. Crowd-sourcing Genius: Properly structured X PRIZEs attract genius from around the\nworld independent of age, race and gender. They allow brilliant individuals who do not\nnecessarily function well in traditional \"programs\". High visibility incentive prizes capture\npeople's imagination and discretionary cycles.\n\n4. Increasing Public Awareness/Raising the Visibility of a Problem: Publicity around\nan X PRIZE educates the public and focuses them on the importance of the problem.\nThis publicity motivates teams to work harder and increases leverage of the prize purse.\nThis global media attention motivates innovators seeking to tackle a challenge of\nsignificance to humanity.\n\n5. Overcoming Existing Constraints: X PRIZEs reconfigure what is possible by\ntranscending path-dependent limitations such as societal constraints, legal/regulatory\nhurdles and policy regimes. Prizes overcome resignation and cynicism because they\ndrive the elimination of the excuse that \"everyone\" believes that the problem is not\nsolvable.\n\nPeter H. Diamandis, MD / X PRIZE Foundation (c) X PRIZE Foundation, 2009 Pg 11\n\n6. Changing the Paradigm: A principal focus of an X PRIZE is to challenge and then\n\"change the paradigm\" of what the public believes is now possible. This takes place by\nhaving the prize won in a dramatic fashion, with extended media exposure that allows\nthe message to break through the clutter. In ideal circumstances, prizes can also drive\nbehavioral changes.\n\n7. Launching an Industry, with Lasting Benefit and Impact: An X PRIZE should be\ndesigned so that after the purse is awarded, it is not the end, but the beginning of a new\nindustry. Innovation alone is not sufficient. To drive true breakthroughs and benefits to\nhumanity, these innovations need to be marketable and deployed. Ultimately the goal is\nto solve the problem and create commercial companies through an entrepreneurial\nprocess.\n\n8. Providing Financial Leverage: An X PRIZE must generate outside investment in\ncompetitors at an order of magnitude greater than the purse size. A prize needs to\nmotivate donors, sponsors and investors, such that teams receive greater access to\nfunding. Prizes work because they generate much greater interest and investment than\nthe net value of the purse offered. Innovators and investors are typically willing to invest\nmore than the amount of the purse for two reasons. First, many are typically optimists,\nand initially believe that they can solve it for less than the purse amount, and then\nincrementally rationalize larger investments over time; and second, the properly\ndesigned X PRIZE has a back-end business model that allows teams to capture a return\non investment.\n\n9. Innovation and Real-world Deployment: X PRIZEs ideally create both technological\ninnovation as well as successful \"real world\" deployment. A properly constructed X\nPRIZE either demonstrates a capability in such a fashion that market demand and\ncapital step in to finance the continued development and deployment (e.g. Virgin\nGalactic) or reward a real world deployment through advanced market commitments.\n\n10. Attracting Cross-disciplinary Solutions: True breakthroughs often come from outside\nthe normal field of experts (e.g. when a physicist looks at a biological problem). X\nPRIZEs should raise a problem to a level of visibility that attracts multidisciplinary\ninnovators that would otherwise be unlikely to tackle the problems that the prize is\ndesigned to address. Prizes drive interdisciplinary collaboration amongst unlikely\npartners.\n\n11. Driving Regulatory Reform: A properly designed X PRIZE will help to clarify the\nregulatory issues relevant to the competition. Sufficient publicity surrounding the prize\ncoupled with a large number of teams can provide sufficient pressure to allow\nregulations to be created and/or modified allowing for the competition to be won.\n\n12. Inspiration, Hope and Intelligent Risk-taking: X PRIZEs are about creating\ninspiration and hope in a field which has been stuck for a number of reasons. These\nprizes encourage non-traditional teams to take intelligent levels of risk that can allow for\nbreakthroughs in a sector that is otherwise stuck or dominated by risk-adverse\nincumbents.\n\nPeter H. Diamandis, MD / X PRIZE Foundation (c) X PRIZE Foundation, 2009 Pg 12\n\nAPPENDIX-1\n(Notes from Wikipedia)\n\nThe Longitude Prize: The Longitude Prize was a reward offered by the British government\nthrough an Act of Parliament in 1714 for a simple and practical method for the precise\ndetermination of a ship's longitude. The prize was administered by the Board of Longitude.The\nmeasurement of longitude was a problem that came into sharp focus as people began making\ntransoceanic voyages. Determining latitude was relatively easy in that it could be found from the\naltitude of the sun at noon with the aid of a table giving the sun's declination for the day. For\nlongitude, early ocean navigators had to rely on dead reckoning. This was inaccurate on long\nvoyages out of sight of land and these voyages sometimes ended in tragedy.\nMany persons benefited from the awards offered by the Board. In total, over ₤100,000 was\ngiven in the form of encouragements and awards. Significant among these are John Harrison\nwho won ₤14,315in several payments. ₤4,315 was awarded during his work on his\nchronometers from 1737 to 1764 with the remaining ₤10,000 provided in 1765.\nThe Orteig Prize: The Orteig Prize was a $25,000 reward offered on May 19, 1919, by New\nYork hotel owner Raymond Orteig to the first allied aviator(s) to fly non-stop from New York City\nto Paris or vice-versa. Several famous aviators made unsuccessful attempts at transatlantic\nflights before relatively-unknown Charles Lindbergh won the prize in 1927 in his aircraft Spirit of\nSt. Louis. His flight was followed by the \"Lindbergh boom\", as public interest in air travel\nbloomed and aviation stocks skyrocketed.\nAlthough advancing public interest and aviation technology, the Prize occasioned expenses\nmany times the value of the prize and cost 6 men their lives in three separate crashes. Another\nthree men were injured in a fourth crash. During the spring and summer of 1927, 40 pilots would\nattempt various long-distance over-ocean flights, leading to 21 deaths. In August 1927 alone,\nthe Orteig Prize-inspired $25,000 Dole Air Race to fly from San Francisco to Hawaii would cost\nten lives before it was over.\n\nThe Kremer prizes: The Kremer prizes were a series of monetary awards, established in 1959\nby Henry Kremer, that were given to pioneers of human-powered flight. The first Kremer prize of\n£50,000 was won on August 23, 1977 by Dr. Paul MacCready when his Gossamer Condor was\nthe first human-powered aircraft to fly a figure eight around two markers one half mile apart.\nThe second Kremer prize of £100,000 was won on June 12, 1979, again by Paul MacCready,\nwhen Bryan Allen flew MacCready's Gossamer Albatross from England to France.\nA Kremer prize of £20,000 for speed was won in 1983 by a design team of the Massachusetts\nInstitute of Technology for flying their MIT Monarch B craft on a triangular 1.5 km (0.93 mi)\ncourse in under three minutes (for an average speed of 32 km/h (20 mph)).\n\nDARPA Grand Challenge/Urban Challenge: The DARPA Grand Challenge is a prize\ncompetition for driverless cars, sponsored by the Defense Advanced Research Projects Agency\n(DARPA), the most prominent research organization of the United States Department of\n\nDefense. Congress has authorized DARPA to award cash prizes to further DARPA's mission to\nsponsor revolutionary, high-payoff research that bridges the gap between fundamental\ndiscoveries and their use for national security. DARPA has technologies needed to create the\nfirst fully autonomous ground vehicles capable of completing a substantial off-road course within\na limited time. The third event, The DARPA Urban Challenge, which took place on November 3,\n2007 and was broadcast via webcast,[1] further advanced vehicle requirements to include\nautonomous operation in a mock urban environment.\nThe Grand Challenge was the first long distance competition for driverless cars in the world;\nother research efforts in the field of driverless cars take a more traditional commercial or\nacademic approach. The U.S. Congress authorized DARPA to offer prize money ($1 million) for\nthe first Grand Challenge to facilitate robotic development, with the ultimate goal of making one-\nthird of ground military forces autonomous by 2015. Following the 2004 event, Dr. Tony Tether,\nthe director of DARPA, announced that the prize money had been increased to $2 million for the\nnext event, which was claimed on October 9, 2005. The first, second and third places in the\n2007 Urban Challenge received $2 million, $1 million, and $500,000, respectively.\nThe competition was open to teams and organizations from around the world, as long as there\nwere at least one U.S. citizen on the roster. Teams have participated from high schools,\nuniversities, businesses and other organizations. More than 100 teams registered in the first\nyear, bringing a wide variety of technological skills to the race. In the second year, 195 teams\nfrom 36 US states and 4 foreign countries entered the race.\n\nThe Ansari X PRIZE: The Ansari X PRIZE was a space competition in which the X PRIZE\nFoundation offered a US$10,000,000 prize for the first non-government organization to launch a\nreusable manned spacecraft into space twice within two weeks. It was modeled after early 20th-\ncentury aviation prizes, and aimed to spur development of low-cost spaceflight. The prize was\nwon on October 4, 2004, the 47th anniversary of the Sputnik 1 launch, by the Tier One project\ndesigned by Burt Rutan and financed by Microsoft co-founder Paul Allen, using the\nexperimental spaceplane SpaceShipOne. $10 million was awarded to the winner, but more than\n$100 million was invested in new technologies in pursuit of the prize.\n\nIn total 26 teams from 7 nations registered to compete. The competition generated a wide\nvariety of approaches including solid, hybrid and liquid-engines and vertical and horizontal\nlaunch approaches.\n\nPeter H. Diamandis, MD / X PRIZE Foundation (c) X PRIZE Foundation, 2009 Pg 13\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nESD.172J / EC.421J X PRIZE Workshop: Grand Challenges in Energy\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}